[
  {
    "subreddit": "science",
    "post_id": "hxv4xh",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/science/comments/hxv4xh/in_cell_studies_seaweed_extract_outperforms/",
    "score": 29499,
    "num_comments": 586,
    "created": "2020-07-25T22:01:44+00:00",
    "body": "",
    "flair_text": "Medicine",
    "flair_template_id": "c98d9ae6-6805-11e5-93c4-125ee764bc01",
    "comments": [
      {
        "author": "discodropper",
        "body": "Great, I’d love to see the 1:1 comparison in human trials using remdesevir as the benchmark. Tons of treatments show promise in cell cultures but fail for various reasons in the clinic (e.g. chloroquine). So until you’ve put it through human trials this is all just hype and hypothesis.\n\nEdit: Wow, this comment is on fire!",
        "score": 4871,
        "is_top_level": true
      },
      {
        "author": "Haberd",
        "body": "In the article they say that some of the seaweed proteins bind to Coronavirus much better than remdesivir, but remdesivir’s mode of action isn’t through binding Coronavirus, it’s a nucleotide analog that blocks the viral RNA polymerase. Seems sketchy for them to be making hay about an irrelevant fact. If it bound to the Coronavirus spike protein better than human ACE2, that would be interesting.",
        "score": 801,
        "is_top_level": true
      },
      {
        "author": "workr_b",
        "body": "They did a study with coagulant and anti coagulant drugs, derived from seaweed to act as decoys to the virus so it would attach itself to those instead of our cells and instead of replicating and infecting us, they'd just wither away and die off. And it performed as well as the anti viral currently being used against covid. It says these types of decoy drugs are our best defense in pandemics with novel viruses because it takes a long time to develop new vaccines and these could be used as nasal sprays for respiratory viruses.\n\nEdit: yo! My first reddit award! Thank you!",
        "score": 540,
        "is_top_level": false
      },
      {
        "author": "bejank",
        "body": "Calling heparin a seaweed extract is kind of... odd. Heparin is a super common blood thinner used to treat acute blood clots, heart attacks, etc. It's not some new miracle drug. The study itself is interesting I just wish the title didn't make it seem like some new homeopathic remedy was found for Covid.\n\nEdit: I'm dumb. They tested seaweed extracts alongside heparin.",
        "score": 352,
        "is_top_level": true
      },
      {
        "author": "23skiddsy",
        "body": "Don't blame [the study](https://www.nature.com/articles/s41421-020-00192-8) authors, it's the reporters spinning it. Science reporters love to expand upon the actual studies with wild nonsense.\n\nThe study isn't even nearly as interested in the seaweed part as it is in heparin.",
        "score": 280,
        "is_top_level": false
      },
      {
        "author": "Nessie",
        "body": "\"Birch bark extract treats heart disease\"",
        "score": 238,
        "is_top_level": false
      },
      {
        "author": "sebaz1223",
        "body": "Can someone summarize pls",
        "score": 146,
        "is_top_level": true
      },
      {
        "author": "xevtosu",
        "body": "Just your aids, and it’s an extremely extreme procedure. But worth it if you’re dying",
        "score": 143,
        "is_top_level": false
      },
      {
        "author": "xevtosu",
        "body": "From what I’ve read the only times it’s actually happened is when people with AIDS were dying of leukemia, and so they had basically all of their bone marrow replaced with bone marrow from a healthy person, this cures leukemia and someone smarter than I am can get into how it cures aids",
        "score": 132,
        "is_top_level": false
      },
      {
        "author": "exipheas",
        "body": "If i recall correctly the donor marrow has to come from someone who genetically has the abilty to fight off hiv which is a small percentage of the descendants from nordic populations.",
        "score": 126,
        "is_top_level": false
      },
      {
        "author": "SadPegasus",
        "body": "It feels to me the article is trying to push the Natural Health Product agenda; a much more appropriate title in my opinion is \"An extract from seaweed outperforms ......\" or even \"a family of compounds found in seaweed extratct outperforms ......\". \n\nTo me personally the difference is saying acetaminophen aids in relieving pain versus Tylenol aids in relieving pain. The other stuffs in a tylenol tablet are binder, fillers and other NMI. You do not need to buy Tylenol; anything with acetaminophen (and caffeine) works. \n\nBy saying seaweed extract outperforms an actual drug, it seems to me the article is just saying synthetic wouldn't work/less effective than those extract from seaweed (natural source), while of course it is not true. \n\nI have seen enough natural health product garbage in throughout my career; that being said, i am not sure if I am reading too much into it or whomever wrote the article is just trying to push NHP as an actual medical thing.",
        "score": 121,
        "is_top_level": true
      },
      {
        "author": "aguafiestas",
        "body": "The comparison value is EC50, which is the concentration at which is leads to half-maximal effect of inhibition of viral replication. So it's a functional inhibition measure, not a binding measure.",
        "score": 112,
        "is_top_level": false
      },
      {
        "author": "JimiDarkMoon",
        "body": "Like **all** AIDS *everywhere*, or just your AIDS?",
        "score": 106,
        "is_top_level": false
      },
      {
        "author": "-Tom-",
        "body": "\"sandwich mold extract cures infection\"",
        "score": 83,
        "is_top_level": false
      },
      {
        "author": "lennybird",
        "body": "As a layperson reading this, my impression (which may be the intention of the wording) is that \"seaweed snacks contain amounts of heparin, and if you eat these you can maybe ward off COVID.\" I'm sure this is far from reality.",
        "score": 83,
        "is_top_level": false
      },
      {
        "author": "marrooh",
        "body": "japan and korea have been having sporadic explosions of covid in relatively small local clusters, past 3 days japan had ~200 cases each time. korea had a mini explosion of 100 cases. \n\nno, seaweed diet does not help prevent covid like how you think it would. their low incidences of covid can be attributed to their culture that respects the collective good as well as placing trust in masks, not many people there dont wear masks",
        "score": 76,
        "is_top_level": false
      },
      {
        "author": "gourdi",
        "body": "I dont think we can lean on this yet.\n\nPenicillin cures syphilis but eating mold wouldn't. Permethrin kills lice and is a chrysanthemum extract, but eating chrysanthemums wouldn't kill lice. This article is a bit pick-and-choosy, and I dont think we can draw conclusions like \"we should just eat seaweed.\" Cell studies are extremely limited and results dont often mean anything for actual humans.",
        "score": 66,
        "is_top_level": true
      },
      {
        "author": "Haberd",
        "body": "Maybe I’m missing something but comparing the binding efficiency of these candidate decoys with remdesivir doesn’t seem relevant. Remdesivir is a nucleotide elongation which interferes with the ability of one of the Coronavirus proteins to work in the cell - it wouldn’t bind especially well to the Coronavirus envelope. Maybe someone here can educate me.",
        "score": 57,
        "is_top_level": false
      },
      {
        "author": "Distitan",
        "body": "Like dying...of aids?",
        "score": 52,
        "is_top_level": false
      },
      {
        "author": "alias007",
        "body": "as anticipated, it's far from reality. you would probably overdose on iodine before you'd get any meaningful amount of heparin.",
        "score": 46,
        "is_top_level": false
      },
      {
        "author": "pavlovs__dawg",
        "body": "They compared binding affinity of multiple different compounds to the spike protein. then they compared antiviral activity of these compounds in cell assays (focus formation assay). They never compared these compounds to remdesivir using their focus formation assay, but instead just compared their inhibition concentration value to a value previously reported in the literature. The title of this post is a conclusion that cannot really be made since they did not do a direct comparison.",
        "score": 46,
        "is_top_level": false
      },
      {
        "author": "Morthra",
        "body": "No one is immune to all HIV. Some people of Nordic descent are naturally immune to one strain of it (due to a mutation that causes them to lack the transport protein that the virus co-opts) but some strains of HIV don't interact with that protein at all.\n\nWhich is a large part of the reason why that the procedure has only actually succeeded twice.",
        "score": 35,
        "is_top_level": false
      },
      {
        "author": "pIagiarism",
        "body": "I can picture a new wave of antivaxxers eating seaweed on this news. The headline is enough for some to go ham on eating kelp and declaring victory over Covid.",
        "score": 35,
        "is_top_level": false
      },
      {
        "author": "DarkTreader",
        "body": "Also, in places like South Korea especially, they jumped on top of the outbreak early, with constant testing and monitoring.  South Korea is one of those places that’s on a constant alert footing due to the threat from North Korea.  Their government is prepared for disasters and their people are mental prepared for them and have constant reminders as to why they need to be prepared.  They were ready for this when it blew up and had the processes and resources in place and trusted the science.",
        "score": 34,
        "is_top_level": false
      },
      {
        "author": "xevtosu",
        "body": "That’s extremely fascinating. As someone descended from almost exclusively Nordic populations, is there any safe way to find out if you’re hiv immune?",
        "score": 33,
        "is_top_level": false
      },
      {
        "author": "anahedonicc",
        "body": "Source on that? Not necessarily arguing with you, pharmaceutical companies/companies in general manipulating data to benefit their bottom line is nothing new, but I just haven’t heard anything about that.",
        "score": 33,
        "is_top_level": false
      },
      {
        "author": "dalmn99",
        "body": "YeS. The hiv needs a specific protein or two to get into cells (it is a bit complex, but this is a decent approximation). Some people who lack one or two of these (due to mutations)seem highly resistant, or even immune to it, since it cannot actually infect their cells (their immune system is nothing special otherwise, maybe even a bit weaker than normal).\n   Well, an HIV patient (google the Berlin patient)  got leukemia as well. One treatment is a bone marrow transplant. Since the mAtch has this mutation, it was effectively a cure. This could be reproduced, but would not be practical for most cases.",
        "score": 32,
        "is_top_level": false
      },
      {
        "author": "happyscrappy",
        "body": "It doesn't actually say what you say it says. It certainly says it is overhyped. But it doesn't have a study saying it doesn't work, just states the impact it is reported to have (moderate shortening of time sick for those severely sick) and then says the study used should be bolstered by more studies.",
        "score": 26,
        "is_top_level": false
      },
      {
        "author": "kenspi",
        "body": "The article doesn't equate heparin to seaweed extract, though I can see why a layperson (such as myself) might get that without deeper analysis.  Instead, the article compares both against Remdesivir. From the first paragraph,\n> ...an extract from edible seaweeds *substantially outperformed remdesivir*...\n\nAnd in the next sentence,\n>Heparin, a common blood thinner, and a heparin variant stripped of its anticoagulant properties, *performed on par with remdesivir*...\n\n(Emphasis added)\n\nLater in the article they compare the EC50 values of both against Remdesivir.",
        "score": 25,
        "is_top_level": false
      },
      {
        "author": "PyoterGrease",
        "body": "Not sure if serious, but oral sprays or lozenges could work.",
        "score": 22,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 6,
      "nested_replies": 24
    }
  },
  {
    "subreddit": "COVID19",
    "post_id": "hxlvr0",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/COVID19/comments/hxlvr0/in_cell_studies_seaweed_extract_outperforms/",
    "score": 1751,
    "num_comments": 91,
    "created": "2020-07-25T12:24:51+00:00",
    "body": "",
    "flair_text": "Antivirals",
    "flair_template_id": "b93e9b84-4dd1-11ea-8c7c-0ec8513ec997",
    "comments": [
      {
        "author": "Joewithay",
        "body": "I read the actually research letter, and the researchers really should of had remdesivir in their experiment as a control. Citing others' results is not a good way to compare since they did their assays differently. I noticed that the multiplicity of infection (MOI) they used was 0.0025 while the papers they cited used either 0.05 or 0.0125 meaning they used less virus per cell than the others. In addition, they used different readouts to calculated the EC50s. They used WST-1 assay (like a viability dye), while the cited works used RT-PCR or immunofluorescence. I hope they will add remdesivir in future experiments, so we can better compare.",
        "score": 631,
        "is_top_level": true
      },
      {
        "author": "southtexasmama",
        "body": "In vitro studies mean nothing. Almost anything can destroy a virus in vitro but it's the actual human studies that matter more.",
        "score": 160,
        "is_top_level": true
      },
      {
        "author": "thaw4188",
        "body": "seaweed per gram can contain thousands of times the RDA of iodine (and heavy metals)\n\nyes there's a study for that\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6551690/",
        "score": 88,
        "is_top_level": true
      },
      {
        "author": "thaw4188",
        "body": "yes and awareness of that \"can\" before people start blindly megadosing seaweed might save a thyroid or two",
        "score": 84,
        "is_top_level": false
      },
      {
        "author": "Bluest_waters",
        "body": "You are completely negating that fact that we already have a long long history of  fucoidan (seaweed extract) usage in humans and already know its largely safe to use even at high dosages. \n\nAnd now we know it disables the virus in vivo, which is great info to have. You can buy fucoidan extract quite easily. Using it as a prophuylactic isn't a bad idea given its quite safe. \n\nAnd if it doens't work against covid, you might just lower your cancer risk \n\n> This review discusses the mechanisms by which fucoidan retards tumor development, eradicates tumor cells and synergizes with anti-cancer chemotherapeutic agents. Challenges to the development of fucoidan as an anti-cancer agent will also be discussed.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4413214/",
        "score": 52,
        "is_top_level": false
      },
      {
        "author": "SeaDots",
        "body": "I would also add that cellular studies like this rarely can be applicable clinically. The metabolism of a drug is really complicated. You have to ensure that the effect you see would actually occur in the body after ingestion. If you swallow \"seaweed extract\" where do those chemicals go? Through and out your stomach and digestive system? Broken down into other things? Into your bloodstream? Honey can kill bacteria topically or in a petri dish, but obviously eating it doesn't make it an antibiotic because in your stomach it's just diluted sugar water now.",
        "score": 42,
        "is_top_level": false
      },
      {
        "author": "Joewithay",
        "body": "Yes, I will try my best to break it down.\n\nWith any experiment, you need good controls. Ideally a positive control and a negative control. Good controls can give you stronger conclusions. The researchers make the following statement in their letter:\n\n>This is substantially more potent than remdesivir having a reported in vitro EC50 value of 770 nM in Vero-E6 cells9 and 11.4 µM in Vero-CCL81 cells10, currently approved for emergency use for severe COVID-19 infections.\n\nI believe that conclusion is not supported from the data they showed since they didn't have remdesivir as a positive control in their assays especially the \"substantially more potent\" part. Remdesivir is currently the benchmark for SARS-CoV-2 anti-vials thus should be always be used for any anti-vial assay. While they do cite past remedesivir work, their methods they used to test these compounds are different which may affect their data one way or the other.\n\nI brought up how the MOI and assay read outs are different. Upon looking at methods for this letter and one of the cited works, I also noticed they used different SARS-CoV-2 isolates. One is from a Korean patient the other is a isolate from a Wuhan patient. While I am sure these two isolates are pretty similar, we really can't say that until we compare them. In addition, they used slightly different cell lines to grow the virus up. Whenever you grow up a virus, it has the potential to slightly change which may also affect the data. So the best way to deal with these differences in their methods is to have remedesivir as a positive control. If they would of, their conclusion would be back by better data. I still think these compounds from seaweed should be further investigated. Just for next time, add remedesivir so we can actually see how these seaweed compounds compare.\n\nIn addition, research grade remdesivir is available to purchase. A reputable vendor, which I have used to buy research compounds, currently has it in stock. Thus these researchers could of easily obtained it.\n\nFinally, here is the research letter if you haven't read it yet:\nhttps://www.nature.com/articles/s41421-020-00192-8\n\nAlso here are the papers they cited for remedesivir:\nhttps://www.nature.com/articles/s41422-020-0282-0\nhttps://aac.asm.org/content/64/7/e00819-20.abstract",
        "score": 36,
        "is_top_level": false
      },
      {
        "author": "PalpableEnnui",
        "body": "The issue is a matter of processing. We’re so dysfunctional we can’t even manage a regulatory middle ground where we can at least ensure a bottle contains what it claims to contain.",
        "score": 32,
        "is_top_level": false
      },
      {
        "author": "Bluest_waters",
        "body": ">Among the various bioactive constituents, seaweed polysaccharides have been proven to possess various beneficial properties including anticoagulant, anti‐inflammatory, antioxidant, anticarcinogenic, and antiviral activities. The diversity and composition of seaweed polysaccharides play vital roles in these biological activities. Seaweeds are a rich source of sulfated polysaccharides, which are responsible for much of the bioactivity, as they can interact with various textures and cellular proteins. A number of toxicological assays and clinical trials suggest that the **ingestion of seaweeds as functional foods should be considered worldwide to improve immune responses**. \n\nand \n\n>A sulfated polysaccharide of Caulerpa cupressoides var. lycopodium has been reported to be safe for immunomodulation and thrombosis, with no toxicity observed in terms of mortality and hepatic or renal function after histopathological analysis of spleen (Rodrigues et al., 2013).\n\nand \n\n>The safety of Carraguard was demonstrated, although protective action against HIV was not confirmed (Turville et al., 2008).\n\nand \n\n>The safety of carrageenans in food has been confirmed in the 57th meeting of the JECFA—Joint Food and Agriculture Organization of the United Nations/World Health Organization Expert Committee on Food Additives (FAO, 2001).\n\nand \n\n>In contrast, κ‐ and ι‐carrageenans have shown to be safe in human nasal epithelial cells, causing no damage to the mucosal barrier structure or function, or actuation of the pro‐inflammatory response (Ramezanpour, Murphy, Smith, Vreugde, & Psaltis, 2017).\n\nand \n\n>Carrageenan has also been considered safe for infant formulas through studies with infant baboons and epidemiological studies (Weiner, 2014).\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/1541-4337.12441\n\nand there is more in that study re:safety \n\nSo yes, I would say seaweed consumption has been shown to be quite safe.",
        "score": 31,
        "is_top_level": false
      },
      {
        "author": "PalpableEnnui",
        "body": "*Can* contain.",
        "score": 27,
        "is_top_level": false
      },
      {
        "author": "kropkiide",
        "body": "It could but is it worty to fry your thyroid over it?",
        "score": 23,
        "is_top_level": false
      },
      {
        "author": "Partha4us",
        "body": "Doesn’t iodine have strong antiviral properties?\n\n\nhttps://link.springer.com/article/10.1007/s40121-019-00260-x",
        "score": 19,
        "is_top_level": false
      },
      {
        "author": "peach_dragon",
        "body": "If in vitro studies “mean nothing,” why are they done?",
        "score": 18,
        "is_top_level": false
      },
      {
        "author": "Partha4us",
        "body": "I guess that all depends on the dosage. Isn’t iodine an important precursor to many essential nutrients, enzymes and hormones? \n\nFor a healthy individual (without a thyroid condition) 1.100 mcgr. seems the max.",
        "score": 17,
        "is_top_level": false
      },
      {
        "author": "darkerside",
        "body": "I think what she's getting at is, whole a necessary step, this doesn't really qualify as news",
        "score": 17,
        "is_top_level": false
      },
      {
        "author": "Bluest_waters",
        "body": "aCtually quite the opposite. The seaweed extract was effective at a lower concentration than Rem. \n\n>RPI-27 yielded an EC50 value of approximately 83 nanomolar, while a similar previously published and independent in vitro test of remdesivir on the same mammalian cells yielded an EC50 of 770 nanomolar. Heparin yielded an EC50 of 2.1 micromolar, or about one-third as active as remdesivir, and a non-anticoagulant analog of heparin yielded an EC50 of 5.0 micromolar, about one-fifth as active as remdesivir.\n\nRPI27 = seaweed extract",
        "score": 17,
        "is_top_level": false
      },
      {
        "author": "Nowhere_Man_Forever",
        "body": "They are the first step in a long process. They \"mean nothing\" in the sense that the vast majority of treatment candidates that work in vitro do not work in vivo and that reporting on them is not particularly useful. For example, I could easily deactivate SARS-CoV-2 by blasting it with radiation in a lab, but this is obviously not an effective treatment candidate because radiation is not particularly selective and is difficult to administer. Treatment development needs in vitro studies as the first step, but many articles (even proper scientific research papers) tend to overstate what it truly means for something to work in vitro.",
        "score": 16,
        "is_top_level": false
      },
      {
        "author": "loving_cat",
        "body": "Can you break this down a little more? What are the conclusions do you draw from the points you are making?  I don’t know enough about all of this to know.",
        "score": 14,
        "is_top_level": false
      },
      {
        "author": "slusho55",
        "body": "When I first saw this post was, “Oh great! More options... Wait, oh shit... people are going to eat shit tons of seaweed without any concern for the kainate in it.” So it’s not even just their thyroids, it’s seizures too.",
        "score": 11,
        "is_top_level": false
      },
      {
        "author": "tonybot4",
        "body": "I am one of the authors in this study. First, I would like to thank everyone for their interest and critiques. I wanted to share what prompted us to pursue this study and address some of the comments. \n\nSARS-CoV-2 infects through the viral spike protein. We found that heparin (long sugar molecule) bound to the viral spike with a Kd (dissociation constant) in the picomolar range (for comparison, antibodies bind to their targets in the micro- to nanomolar range).  The binding was extremely tight and repeated experiments gave the same results. When the binding occurred, heparin did not easily come off. 0.25% SDS (which denatures proteins) was required to make heparin \"let go\" of the viral spike.\n\nWe looked at other sugar molecules that could maybe competitively \"out-bind\" heparin for the viral spike (which depends on both affinity and concentration). Out of these, we found that TriS (a synthetic, non-anticoagulant heparin precursor) and a *saccharina japonica* seaweed extract (RPI-27) could compete with heparin for the viral spike binding. To clarify some confusion, this is not whole seaweed- only a polysaccharide (polysaccharide=sugar) extract. As an analogy, it is like vegetable oil (and not the whole vegetable), so we are not extracting heavy metals, iodine, kainate, etc. We found that these sugars contained a high density of negatively charged sulfate groups (which interact with positively charged amino acids of the viral spike).\n\nLess sulfated sugars, like chondroitan sulfate, could not \"out-bind\" heparin. We are also NOT sure if other seaweed extracts can bind to the virus as we have only tested the extract from one species of seaweed.\n\nI do agree that remedesivir would have been a good positive control. However, we were only asked to cite past references on remedesivir during peer review. We were also trying to get our findings out there quickly as possible during the pandemic. One of the references we cite for remedesivir uses the same cells and a virus isolate from a Korean patient.\n\nAs for our assays, the virus was allowed to replicate and re-infect the culture in the presence of our sugar inhibitors. We used a different MOI since a high MOI made it impossible to count focus forming units (areas where the virus is replicating) as they would merge in the no-inhibitor added control. The cell type Vero CCL81 was also used since it was the fastest at viral replication with the cells that we tested. A CDC reference I found later on also shows that this cell type produced the highest viral titer among the cells tested ([https://wwwnc.cdc.gov/eid/article/26/6/20-0516-f3](https://wwwnc.cdc.gov/eid/article/26/6/20-0516-f3)).\n\nSince antiviral potency correlates with binding affinity for the viral spike, this suggests the sugar inhibitors act mechanistically as viral entry inhibitors. We think this virus uses cell surface heparan sulfates (a similar sugar to heparin) as receptors along with ACE2, but this still needs to be experimentally published. Other viruses, like dengue, are known to use heparan sulfates as receptors ([https://www.nature.com/articles/nm0897-866](https://www.nature.com/articles/nm0897-866)). And heparin/heparan sulfates and similar sugars can act as inhibitors by targeting these sites.\n\nWe do believe RPI-27 could be delivered orally (such as a pill) and in small dosages as it strongly binds to the viral spike. This is relevant as the human gut is susceptible to infection ([https://science.sciencemag.org/content/369/6499/50](https://science.sciencemag.org/content/369/6499/50)). Comparing the anti-bacterial activity of honey to SARS-CoV-2 antiviral activity of RPI-27 is not a fair comparison as honey functions through osmolarity and enzymes (and the sugars involved are small and unsulfated unlike the polysaccharides we tested). Moreover, much like certain dietary fibers, humans and human gut microbes probably cannot digest fucoidans like RPI-27 ([https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3210604/#b14-marinedrugs-09-01731](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3210604/#b14-marinedrugs-09-01731)).\n\nAlthough our specific seaweed extract showed the highest antiviral activity, we plan on pursuing heparin for future in vivo and structural studies as it is already an FDA approved drug. Since heparin is known to cause systemic anticoagulation intravenously, we are thinking of administration through inhalation to protect the lungs and airways. This method has been performed without causing systemic anticoagulation ([https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5959399/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5959399/)).",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "Blewedup",
        "body": "They do mean something. \n\nBut they are a very very basic clue that should not be extrapolated from in every case. \n\nSetting a Petri dish on fire kills the virus too. That doesn’t mean it’s a good treatment for sick people.",
        "score": 10,
        "is_top_level": false
      },
      {
        "author": "loving_cat",
        "body": "This is fantastic! Thanks so much for taking the time to explain this! ❤️",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "HighGrounder",
        "body": "I'm not exactly sure how the different assay methods might affect the results, but the important thing is simply that it's different from the original experiment. That, along with the different MOI, introduces two unknown variables into the experiment. That's (at least) two additional sources of error and two alternative explanations for the difference in outcomes. The MOI is especially problematic because viral load appears to be an important indicator of outcome and is also poorly understood. Basically they're jumping to conclusions.",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "TheFuture2001",
        "body": "What if “your” (hypothetical person) missing a thyroid?\n\nCould be an interesting micro target approach to people (hypothetical) with thyroid cancer and thyroid removed.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "Dilborg",
        "body": "More in vivo studies lacking clinical trials. \n\nThe problem with seaweed (or any supplement) is individual genetics and metabolism will affect the results. \n\n>long long history of fucoidan (seaweed extract) usage in humans and already know its largely safe to use even at high dosages\n\nThere is no support for this statement in this study.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "deirdresm",
        "body": "Also, with diarrhea and vomiting as possible covid symptoms, that also complicates seaweed extract.\n\nThough…is remdesivir given in pill form in humans? (The precursor is injected in cats with FIP.)",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Wisdom-Bot",
        "body": "They probably couldn't get hold of Remdesivir--I wonder if Gilead is giving it out to researchers at this point? \n\nMOI can be tricky to get right--it might have been calculated after the fact.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Joewithay",
        "body": "They don't need need to get remdesivir from Gilead. There a companies that will make and sell research grade Remdesivir. The works that these researchers sited actually mentions the companies that the compounds were bought from in their methods sections. So they had the information of where to get remdesivir.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Grilledcheesedr",
        "body": "Its seems like if we found out tomorrow that 100 percent of people who were taking some random completely safe vitamin were immune to the virus it would still take ten years for them to study it.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "stereomatch",
        "body": "Remdesivir is intravenous, not a pill.",
        "score": 5,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 4,
      "nested_replies": 26
    }
  },
  {
    "subreddit": "Coronavirus",
    "post_id": "hxqvcv",
    "title": "In cell studies, seaweed extract outperforms remdesivir in blocking COVID-19 virus",
    "url": "https://www.reddit.com/r/Coronavirus/comments/hxqvcv/in_cell_studies_seaweed_extract_outperforms/",
    "score": 259,
    "num_comments": 31,
    "created": "2020-07-25T17:47:43+00:00",
    "body": "",
    "flair_text": "Academic Report",
    "flair_template_id": "394b6910-5e49-11ea-843b-0ebc196d18f7",
    "comments": [
      {
        "author": "40PcMcNuggWSowce",
        "body": "Welp, so much for finding out this piece of information when we are destroying our oceans with tons of pollution and even disposable masks.",
        "score": 33,
        "is_top_level": false
      },
      {
        "author": "DoctorCaptainPlanet",
        "body": "Heparin is [not absorbed by the gut](https://en.m.wikipedia.org/wiki/Heparin#Administration) and is administered by injection. The headline is misleading - heparin is not a new drug (it’s discovery as an anticoagulant was announced in 1916).",
        "score": 24,
        "is_top_level": false
      },
      {
        "author": "BafangFan",
        "body": "And kimchee: https://www.medrxiv.org/content/10.1101/2020.07.06.20147025v1\n\nHot sauna.\n\nMega dosing vitamin D.\n\nCordyceps mushroom supplements.",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "NerveConductionPuppy",
        "body": "Joe Rogan must be hyped.",
        "score": 19,
        "is_top_level": false
      },
      {
        "author": "BafangFan",
        "body": ":D even a broken clock is right twice a day.",
        "score": 14,
        "is_top_level": false
      },
      {
        "author": "New-Atlantis",
        "body": "Trump will be sore for having spent so much money on Remdesivir.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "TheBitingCat",
        "body": "The article is not well written to emphasize the compounds tested - RPI-27 and RPI-28 - which have structures that mimic the ACE2's receptor's glycan binding structure that Sars-CoV-2 uses to enter the cell. The virus encounters and binds to the molecule instead, rendering it unable to bind to a cell.\n\nYou're right about the gut though - it would either not be absorbed, or be broken down into sugars before absorption. Despite this, the stuff is still delicious.",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "Viewfromthe31stfloor",
        "body": "[link to the paper they discuss](https://www.nature.com/articles/s41421-020-00192-8)",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "ToRagnarok",
        "body": "I’m on a seaweed diet, I see weed, I smoke it brother.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "oapster79",
        "body": "Seaweed ... it's what's for dinner!",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Ogg149",
        "body": "As a supplement bozo, I am thoroughly prepared.",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "plasticvalue",
        "body": "Ducks go into a lake and get covered in seaweed extract and they go quackquackquack",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "HotpocketFocker",
        "body": "IV drip bags with seaweed growing inside",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "LaChuteQuiMarche",
        "body": "Seaweed...the OTHER green meat. \n\nWait shit.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "oapster79",
        "body": "I think the capsules come in six different colors.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "LaChuteQuiMarche",
        "body": "One could potentially taste a rainbow it seems.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "oapster79",
        "body": "Oh hell, the kids will love it!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "LaChuteQuiMarche",
        "body": "[crunches hesitatingly]",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "tamamotenko",
        "body": "I guess we know why Japan has such low numbers",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Hyperion1144",
        "body": "It's probably tastier, too.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Dotard007",
        "body": "Where do you think most of the chemicals for modern medicine come from",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "TeddyBearToes",
        "body": "Haha",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "uselessbynature",
        "body": "In cell culture... bleach more effective than remdesivir!\n\n*in vivo* and *in vitro* are vastly different.  *in vitro* work is critically important but probably shouldn’t be given headlines during a crisis due to misinterpretation of data.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sunnydshine1203",
        "body": "Does sea moss help too?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lumpix69",
        "body": "I'm being sarcastic",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AlienApricot",
        "body": "Your post or comment has been removed because\n\n* **Incivility isn’t allowed on this sub.** We want to encourage a respectful discussion. ([More Information](https://www.reddit.com/r/Coronavirus/wiki/rules#wiki_rule_1.3A_be_civil))\n\n*If you believe we made a mistake, please [message the moderators](/message/compose?to=/r/Coronavirus).*",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 26,
      "top_level": 9,
      "nested_replies": 17
    }
  },
  {
    "subreddit": "orchids",
    "post_id": "fbh9z6",
    "title": "3 Phals Monster Rebloom - 50+ Buds. secret weapon: diluted, concentrated liquid seaweed extract...",
    "url": "https://www.reddit.com/r/orchids/comments/fbh9z6/3_phals_monster_rebloom_50_buds_secret_weapon/",
    "score": 200,
    "num_comments": 13,
    "created": "2020-02-29T19:03:21+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Katya2089",
        "body": "Can u tell me what ratio u diluted it and how much u used this mixture??",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "H20FOSHO",
        "body": "I always have two of these around, [liquid gold ](https://www.amazon.com/dp/B000COBUQC/ref=cm_sw_r_sms_c_api_i_jiVwEbJCJ8W95) . I put about 5 to 6 oz in a bucket of water. I feed it to everything in my yard. I will do that about every third watering. Hose the rest of the time.",
        "score": 10,
        "is_top_level": false
      },
      {
        "author": "Skinnyspaghetti",
        "body": "NEED TO KNOW!",
        "score": 9,
        "is_top_level": false
      },
      {
        "author": "DwideShrewd",
        "body": "I think you can buy it from Amazon.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Sphingidae14",
        "body": "How do you acquire such extract? Besides the obvious living near the ocean?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "H20FOSHO",
        "body": "It’s really not a scientific measure - a good pour into bottom of bucket. Fill said bucket. Feed. You can’t go wrong. I even have a water bottle of it at the ready to spray the inners of the plants.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "c_schilleriana",
        "body": "Kelpmax is best, next best maxicrop. They definitely help orchids grow",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "DwideShrewd",
        "body": "Thanks for sharing!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "BouncingPrawn",
        "body": "I am going to try it. Thank you for sharing the tip.\n\nEdit: Oops! They don’t deliver out of USA.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "aj676",
        "body": "Holy smokes",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "PISTA_KING",
        "body": "Wowsas",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ultrahello",
        "body": "Maxsea?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 12,
      "top_level": 9,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "Coronavirus",
    "post_id": "hz8zsq",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus in Cell Studies",
    "url": "https://www.reddit.com/r/Coronavirus/comments/hz8zsq/seaweed_extract_outperforms_remdesivir_in/",
    "score": 111,
    "num_comments": 34,
    "created": "2020-07-28T05:42:02+00:00",
    "body": "",
    "flair_text": "Academic Report",
    "flair_template_id": "394b6910-5e49-11ea-843b-0ebc196d18f7",
    "comments": [
      {
        "author": "TheBitingCat",
        "body": "Probably not, since the compounds would likely be broken down during digestion.",
        "score": 18,
        "is_top_level": false
      },
      {
        "author": "SpicyBagholder",
        "body": "Oh wow I can't wait for big pharma to buy out seaweed!",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "hillsfar",
        "body": "Scientist: This cheap seaweed extract blocks the virus.\n\nCEO: But Remdesivir can sell **for** $3,000 per dose!",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "jsneophyte",
        "body": "Could this be one reason for low mortality rate in Asia? Seaweed is widely consumed in Asia and Korea in particular.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "TVpresspass",
        "body": "> 24 hours in a hospital costs 4 times as much if not more\n\nOnly in that nightmare-world you call America.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "musicobsession",
        "body": "No, this is Patrick",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "thenexttimebandit",
        "body": "Don’t worry the orally bioavailable analogue of this seaweed extract will be patented and marketed by pharma if it works in humans.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "v3ritas1989",
        "body": "lol",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Ellisque83",
        "body": "What’s wrong with Cosmos?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "supermlhk",
        "body": "Cosmos, not Cosmo. I doubt they have ten tricks to blow your man’s mind in quarantine.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Twyerverse",
        "body": "Gotta start somewhere...",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "KetchupKakes",
        "body": "Healthcare should not focus on profits",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "KetchupKakes",
        "body": "It's not, it's the exact argument to make. The first comment was a joke about CEOs losing money on a lifesaving drug and your response is that hospitals are losing money because it is too effective. Fuck that.  It doesn't have to be this way. Kill the fucking genie. Let's fund healthcare so everyone can have an equal chance for a healthy and debt free life.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "KetchupKakes",
        "body": ">to accomplish what you're proposing would require a fundamental change in the capitalistic attitudes that have driven our country to the forefront of almost every industry in the world.\n\nHearts and minds, one at a time. That's how you change the attitude of a population. Never been a better time to start than right now.\n\nI wouldn't say our country is necessarily at the forefront, but US based companies are. Our country allowed the growth and development of these companies, but nearly none of the benefits are returned to the people who made it possible. \n\nWe seem to agree. There are a lot of problems that are a tangled mess but they can be traced back to one idea: Profits above all else is what is killing us. I understand what got us here and it is time to do something different. That is my point.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "I hear you loud and clear. What you are proposing is an ideology I don't personally agree with as I came from pretty modest beginnings and worked hard, saved and took the risk in starting a business and have now accomplished that multiple times over. \n\nI believe in support as a means to advance. Not as a means to live. The Healthcare system should not function with a fear of crippling debt as a barrier of people seeking treatment. That we can agree on. \n\nAs long as long term retirement vehicles (401k's, pensions, etc.) are tied to a marketplace whose value is dictated by profit what you categorize as evil will never change. Times have certainly changed. There was a time when I would say the rising tide raises all ships. Presently, it only raises some ships. \n\nFrom a small/medium business perspective, you will never get much sympathy from founders in regards to putting profits above all else because failure to create profit is the risk of losing everything they have worked for. I have always been an extremely considerate \"boss\". But the truth of the matter is, everyday we go to work there is a transaction taking place. What we feel we are owed vs what is being paid may not always align perfectly. As an employer, we are buying an employee's time at an agreed upon rate. \n\nWhile socialistic or marxist ideologies may suit those who are working their way up because it presents them with an opportunity to share in the gained value of the enterprise. What should the person who risked everything to start that enterprise get for their risk, leadership and dedication? What I have learned in my time in this world is this, some value their free time and view work as a means to do as they please. Others, view their time spent working as justification for future freedoms. Some strive for more (some might call it greed but who is right to judge another persons aspirations?) others are content with less.\n\nIt's a very complex set of questions and problems that have yet to be successfully answered.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "KetchupKakes",
        "body": "I love you, dear stranger. I agree with just about everything you say and want to talk about one paragraph in particular because I find it an interesting divide between us.\n\n>While socialistic or marxist ideologies may suit those who are working their way up because it presents them with an opportunity to share in the gained value of the enterprise. What should the person who risked everything to start that enterprise get for their risk, leadership and dedication? What I have learned in my time in this world is this, some value their free time and view work as a means to do as they please. Others, view their time spent working as justification for future freedoms. Some strive for more (some might call it greed but who is right to judge another persons aspirations?) others are content with less.\n\nI too come from humble means and have worked hard to get where I am today. I enlisted and served in the military and later used my GI Bill to get through college. I have never been motivated by profits or gains, but my motivation is my own curiosity or thirst for adventure. My motivation is just what you described, work is a means to do as I please. I assume you would classify yourself as one who views work as a justification for future freedoms. I do not think either motivation is inherently greedy on its face, though, both can turn to evil. Some may strive for more \\[money\\] and others are content with less \\[money\\]. I think we are all searching for the same happiness, seeking to fill the same void inside.\n\nWhat should founders get for their risk, leadership, and dedication? Is a successful business not enough? Small businesses are not the problem. There comes a point in wealth accumulation where people end up in almost entirely different worlds. Multibillion dollar corporations paying little to no taxes, yet receiving multibillion dollar bailouts are the problem. Billionaire CEOs are lining their pockets while the government gives them even more money and breaks while cutting education and community funding to the poorest communities. Spending billions of dollars on military hardware that never sees the light of day is the problem. The fact that our taxes pay for bombing of poor people in foreign countries and not elevating the poor in our own country is the problem. We have the resources but we are throwing them away.\n\nWe are not entirely made up of business owners and employees. Artists and scientists take risks and build things from scratch, where is their reward? What about the people who are disabled and can't work? They don't deserve to be thrown to the wolves. Capitalism forgets about anyone who doesn't earn money and it disgusts me. I understand radical change is radical and not likely to happen. We at least need better safety nets. More businesses and ideas can flourish if the cost of failure is not so devastating.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "jsneophyte",
        "body": "I'm Spartacus!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "iPon3",
        "body": "\"cell studies\"\n\nThe cure for cancer is explosives. The Illuminati is hiding it from you. Eat a grenade and you won't have covid anymore.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "Your comment has been removed because\n\n* **Incivility isn’t allowed on this sub.** We want to encourage a respectful discussion. ([More Information](https://www.reddit.com/r/Coronavirus/wiki/rules#wiki_rule_1.3A_be_civil))\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Coronavirus) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "I am not defending the system. The system's foundation was based on a time when the vast majority of employers provided some form of medical coverage. That time is loonnnnggggg gone. The cost of this drug is a consequence of our system. The pricing of the drug is based on the cost savings an individual would see relative to hospital stay.   \n\n\nMaybe you're right. It doesn't have to be that way. But to accomplish what you're proposing would require a fundamental change in the capitalistic attitudes that have driven our country to the forefront of almost every industry in the world. While it shouldn't provide any solace that we are, in fact, exceptional in many regards (contrary to current sentiment) it has come at the cost of the suffering of many individuals.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "glutenfree123",
        "body": "I think it’s more because the article is saying hey look we found these compounds we didn’t know about before that seem to work better than other known compounds on cell cultures. Maybe we should test this further on humans or mammals. We don’t really have the best antiviral medication to begin with.\n\nIt’s not really saying this is a total game changer against COVID-19. It did say it seemed larger molecules fit better on the spike proteins. This could maybe help further narrow down other medications like you said. I just don’t know why you are getting angry at an article or other people for reading it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Michael_Trismegistus",
        "body": "You realize there's more than one lab working on the COVID problem, right?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "That's a completely different argument. Our altruistic desires are moot considering that genie is already out of the bottle.",
        "score": -1,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "Im so tired of hearing this ignorance about Remdesivir's expense. The drug has literally cut hospital stay time in half. 24 hours in a hospital costs 4 times as much if not more. If anyone should be angry it should be the hospitals about the amount of money they are losing by Remdesivir's effectiveness..",
        "score": -4,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "No, I am telling people to have perspective. Which is extremely lacking in the echo chamber that is reddit. We try to dictate what is expensive or cheap based on our relative terms of value. Again, I am not disagreeing that that healthcare costs in America are ridiculous. But, given that set of circumstances, the cost of the drug when applied to it's cost savings makes it's relative value quite good.\n\nBut, you know, I'm just a stupid person who refuses to participate in the blind idealistic attitudes that people apply to the reality of the world we live in.",
        "score": -4,
        "is_top_level": false
      },
      {
        "author": "nycgarbage",
        "body": "Ok. But, how does that change what I said? How many times do people have to post these ridiculous statements with absolutely no perspective on reality. My comments aren't based on my opinion. Remdesivir literally lowers the overall cost of covid recovery. That is not opinion, it's a fact. I have 0 skin in this game.  \n\n\nShould hospital costs be so ridiculously expensive? No, they really shouldn't. The bills for each of my children's birth before insurance took care of it were almost 6 figures each. But, insurance covered it and likely only paid them a fractional portion of what they billed. Is the system broken/flawed, sure. But that's not the argument here.",
        "score": -5,
        "is_top_level": false
      },
      {
        "author": "-MBison--hah",
        "body": "No that’s dumb.",
        "score": -11,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 27,
      "top_level": 4,
      "nested_replies": 23
    }
  },
  {
    "subreddit": "China_Flu",
    "post_id": "hy88z0",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19",
    "url": "https://www.reddit.com/r/China_Flu/comments/hy88z0/seaweed_extract_outperforms_remdesivir_in/",
    "score": 80,
    "num_comments": 13,
    "created": "2020-07-26T14:54:05+00:00",
    "body": "",
    "flair_text": "General",
    "flair_template_id": "796885fc-3bb0-11ea-982a-0ea6f2bebc11",
    "comments": [
      {
        "author": "bcccl",
        "body": "CNN: here's why seaweed is dangerous",
        "score": 30,
        "is_top_level": true
      },
      {
        "author": "CosmicBioHazard",
        "body": "Chicken soup for a cold, Miso soup for Covid-19\n\nsounds good",
        "score": 29,
        "is_top_level": true
      },
      {
        "author": "hoyeto",
        "body": "In a tube...",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "Trippn21",
        "body": "But we're supposed to pay dearly for Remdsivir.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "Kitakitakita",
        "body": "Its a series of tubes!",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "MrHorse666",
        "body": "You ever see the back of a 20 dollar bill...\nYou ever see the back of a 20 dollar bill on see weed?????",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "the_fabled_bard",
        "body": "That's what hybrids are for :P",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "epSos-DE",
        "body": "**Taiwan** eats a lot of **seaweed stew.**\n\nCould anyone from Taiwan confirm ?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Racooncorona",
        "body": "Can it be patented? Is there profit to be made?\n\n\n\nSame answer for \"Will it be adequately studied?\".",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "useless_talent",
        "body": "Trump already bought all the seaweed.",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "soarin_tech",
        "body": "Fauci needs our money though.",
        "score": -5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 9,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "Futurology",
    "post_id": "hy76nc",
    "title": "In cell studies, seaweed extract outperforms remdesivir in blocking COVID-19 virus",
    "url": "https://www.reddit.com/r/Futurology/comments/hy76nc/in_cell_studies_seaweed_extract_outperforms/",
    "score": 53,
    "num_comments": 6,
    "created": "2020-07-26T13:46:27+00:00",
    "body": "",
    "flair_text": "Biotech",
    "flair_template_id": "dc868cc6-e558-11e6-892d-0ee5464b8f94",
    "comments": [
      {
        "author": "hiddenkitten954",
        "body": "It’s a typo.... suppose to be...  See, weed extract outperforms in blocking COVID :}",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Teth_1963",
        "body": ">seaweed extract outperforms remdesivir\n\nIf you've actually read up on remdesivir, outperforming it isn't hard to do.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MesterenR",
        "body": "Well, you can't make a proper profit on seaweed, so it won't catch on. There will be people ridiculing this to ensure no one will dare use it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "jojomurderjunky",
        "body": "Or you could have people destroy the worlds see weed...",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Xex_ut",
        "body": "A decoy method using large enough molecules for the virus to bind and attempt to infect. They theorize seaweed extract in a nasal spray can minimize infection. \n\nNot even sure why they brought up remdesivir in the article.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 4,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "EverythingScience",
    "post_id": "hzhttw",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19",
    "url": "https://www.reddit.com/r/EverythingScience/comments/hzhttw/seaweed_extract_outperforms_remdesivir_in/",
    "score": 28,
    "num_comments": 0,
    "created": "2020-07-28T16:31:59+00:00",
    "body": "",
    "flair_text": "Medicine",
    "flair_template_id": "ff5c7c48-7a48-11e3-8068-12313d1661cc",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "2uu9e1",
    "title": "Algae Extract: 5 on the comeodogenic scale",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/2uu9e1/algae_extract_5_on_the_comeodogenic_scale/",
    "score": 31,
    "num_comments": 23,
    "created": "2015-02-05T04:53:22+00:00",
    "body": "PSA, algae extract is a 5 on the comeodogenic scale.  It shows up on COSDNA and etc.  \n\nWhat I want to make clear thought, is unfortunately its in almost everything \"moisturizing\", especially if the product doesnt contain other comeodogenic ingredients like Stearic Acid or Cetyl Alcohol.\n\nMost unfortunately, it hides under several different names, which you can find the handy list to here (thanks to this blog I had found while researching this horror: http://powdered-peach.blogspot.tw/2011/08/comedogenic-ingredients-to-avoid-algae.html)\n\n* Ulva lactuca (sea lettuce)\n* Ascophyllum\n* Ahnfeltia concinna extract\n* Laminaria longicruris\n* Laminaria saccharine\n* Laminaria digitata\n* Alaria esculenta\n* Porphyridium Cruentum (or other forms of the Porphyra species)\n* Chondrus crispus\n* Mastocarpus stellatus\n* Kelp\n* Red Algae\n* Blue Algae\n* Haslea ostrearia extract\n* Sea Whip Extract\n* Irish moss\n* Spirulina\n* Microcystis aeruginosa\n* Sargassum fillpendula extract\n* Palmaria palmarta extract (Dulse)\n* Padina pavonica extract\n* Himanthalia elongate extract\n\n\nHG products that I have found this ingredient hidden inside of:  \n* MBD masks, laminaria digitata extract\n* Benton products, laminaria digitata extract\n* My Scheming masks, chrondus crispus\n\n\n\nI hope this helps people who have been experiencing adverse reactions but cant (understandably) pinpoint the reason.",
    "flair_text": "PSA",
    "flair_template_id": null,
    "comments": [
      {
        "author": "nahlaboo",
        "body": "Even though it's scoring a 5 on the comedogenic scale, it does not necessarily mean it *will* break you out. The info from CosDNA ratings are severely outdated (think, 60s-80s) and was gathered by applying the ingredient in high concentrations to rabbit ears (which are much more sensitive than human skin) an upwards of 8 times a day. \n\nCosDNA is great as a guide to a product's ingredient lists and what they may do. Don't use it as your skincare bible. In the end, your skin may still not like a product that has no acne triggers, and may love another that's got some. It all depends on how well-formulated the product is.",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "_whimsicality",
        "body": "Laminaria Digitata could actually be good for acne prone skin! It's brown algae :) \n\nStudy is here, hope I'm linking right as I'm on my phone: http://www.researchgate.net/profile/Carrie_Ruxton/publication/237096624_A_novel_topical_ingredient_derived_from_seaweed_significantly_reduces_symptoms_of_acne_vulgaris_A_general_literature_review/links/53d01cbd0cf2f7e53cfb6dd1.pdf\n\nChrondus Chrispus breaks me out in cysts though, so no idea what differs between types of algae and seaweed!",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Firefox7275",
        "body": "Calling it a horror is a tad strong, Cosdna is not the oracle, and algae extract =/= algae extract. Depending on the source and the extraction method, these ingredients can have different chemical compositions - if they were the same they would have the same INCI name!\n\nA lot of the research was on rabbit ear which is known to be much more sensitive than human skin (two weeks as opposed to multiple weeks, which makes demonising sheet masks even more ridiculous). Also amount present can be highly relevant. I cannot even find a study on comedogenicity and algae extract, it's not in the most cited research\n\nhttp://journal.scconline.org/pdf/cc1989/cc040n06/p00321-p00333.pdf\n\nhttp://journal.scconline.org/pdf/cc1996/cc047n01/p00041-p00048.pdf\n\n*\"Algae extract in skincare is fine, but it’s not a must-have or any sort of miracle, and it’s also not the least bit comedogenic. The biological and molecular structure of algae, whether in pure or extract form, is incapable of clogging pores because it’s completely water-soluble and thus easily removed from the skin. It cannot get “stuck” in the pore lining; it would be an issue only if you were allergic to it and used a product that contained it. Otherwise, although there’s no compelling reason to seek out products with algae extract, there’s no reason to avoid them, either.*\n\n*Be wary of any rating system of the pore-clogging potential of cosmetic ingredients; they’re unreliable at best and misleading at worst. That’s because they typically rate ingredients based on the effects of 100% concentrations, which doesn’t apply to how ingredients like algae (or countless others) are used in skincare. Another issue that makes such lists of potentially comedogenic ingredients more useless than useful is that they do not account for the ingredient combinations in a given product or when multiple products are used, which pretty much describes an average skincare routine!\"*\n\nhttp://www.paulaschoice.com/community/dear-paula/_/dear-paula-blemishes",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "ecologista",
        "body": "I want to note that I can't even find a rating for \"algae extract\" on CosDNA and that anywhere I search for the comeodogenic rating of it, I find source-less information and can't even find out where that info came from. :(",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Firefox7275",
        "body": "Everything that might be comedogenic is not comedogenic in every product, at any percentage and for every person.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "nowirehangers_ever",
        "body": "a commonly used \"algae extract\" is carrageenan, which is \"known\" to be highly comedogenic.\n\nperhaps this is what you're looking for?",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "ecologista",
        "body": "> carrageenan\n\nThat does have a [cosDNA record](http://www.cosdna.com/eng/609e0f881.html)! Again though, the source is listed as \"sage advice\". looooooool.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Firefox7275",
        "body": "You could\n\n- get your head around the basics of how the skin barrier works\n\n- learn the 'families' of ingredients so you can track which your skin seems to like or dislike (eg. fatty alcohols, silicones, preservatives)\n\n- research individual ingredients on reputable sites or blogs that refer to published research\n\n- double check the underlying 'science' of claims made on blogs and alternative health websites\n\n- post links to full ingredients lists and questions on the daily threads\n\n- avoid or limit ingredients that are known irritants and/ or totally unnecessary like fragrance or the glycols\n\n- do not presensitise your skin by over cleansing or over exfoliating, respect the skin's barrier function\n\n- buy samples and patch test for a full week.\n\nMany skincare/ haircare/ healthcare/ diet/ natural lifestyle blogs and articles just blindly copy and paste and are simply too lazy to check their facts. For example I have seen many times that emu oil or jojoba oil is similar to sebum/ human skin lipids.\n\nNeither are, I tracked back to the original 'research' mentioned and Googled for the composition of sebum. One claim comes from the American Emu Association, the other from a well written article on jojoba that was erroneously quoted (they are both similar to *minor components of* sebum). Probably the closest to human sebum is lanolin, which makes total sense since a sheep is a mammal like humans are.\n\nHTH!",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "thetrufflesiveseen",
        "body": "Yeah - not all algae is created equal!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "smskin",
        "body": "Good to know. This features in my A24 Aloe Vera gel but for some reason it doesn't break me out. My skin is a strange, strange beast.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Wrong-Mirror-6507",
        "body": "Ooo thank you for this,every time i take spirulina powder my face gets acne",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LadyPink28",
        "body": "Well I guess I am just unlucky its in the new reformulated mac studio fix fluid foundation and I'm breaking out all over on one of my cheeks.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Own_Abies_8660",
        "body": "Studio fix always had algae in it. It's why I stopped using it years ago. Maybe it's a different type of algae this time?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LadyPink28",
        "body": "There's two kinds of it now one of which is sugar kelp (laminaria saccharina?)I dont remember the former formulation breaking me out much so I think any marine-based ingredients recently started breaking me out",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Own_Abies_8660",
        "body": "Thanks, I'll stay away from it. Hearing that the way it wears isn't the same either.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LadyPink28",
        "body": "It feels like a greasy mud mask that won't dry that I can easily scrape off my face it's super weird I don't like it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Own_Abies_8660",
        "body": "Eww. So many \"new and improved\" formulas are way worse and then people stop buying lol.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LadyPink28",
        "body": "If a foundation won't dry down on my skin I dont like it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "jell0fiend",
        "body": "I love a foundation that dries down also, what are your favs?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "jell0fiend",
        "body": "I’m literally here reading this thread because I want to try the new MAC studio fix fluid reformulation lol",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Inevitable-Topic1719",
        "body": "Why is it added anyway",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lisaz1000",
        "body": "From what I understand algae contains iodine and iodine irritates pores.  Irritation of pores can then cause breakouts.I don't know scientifically so please do your own research.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lili_misstaipei",
        "body": "Wow thats super interesting\nThen what can we do to avoid sensitivities without buying everything first :(",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 23,
      "top_level": 8,
      "nested_replies": 15
    }
  },
  {
    "subreddit": "videos",
    "post_id": "3rvf7b",
    "title": "Seaweed vs Obesity: Scientists are adding seaweed extract to bread to reduce fat absorption [1m40]",
    "url": "https://www.reddit.com/r/videos/comments/3rvf7b/seaweed_vs_obesity_scientists_are_adding_seaweed/",
    "score": 33,
    "num_comments": 14,
    "created": "2015-11-07T09:21:25+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "weazelhall",
        "body": "Because practicing self control is too hard.",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "magroc",
        "body": "http://i.imgur.com/hUrdViP.jpg",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Guysmiley777",
        "body": "Consumed fat that isn't absorbed has to go somewhere, see also: Olestra and \"anal leakage\".",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "weazelhall",
        "body": "If you aren't absorbing the fat you eat then shitting becomes a messy business, why not try and eat less?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "FCWanon",
        "body": "Some people have difficulty trying to \"just reduce carb intake\" or just don't care, and I would love to eat more bread because it is delicious. Don't get me wrong, eating less carbs does solve the problem, but having multiple solutions to a problem really helps more people.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "FCWanon",
        "body": "I know that eating less carbs is a better solution but for the kind of people that are getting obese that would be more difficult for them to start doing as they would have to resist strong habits and urges. While sodium alginate requires minimal effort on their part to help them start losing weight, which can show them how losing weight can make their lives so much easier and motivate them to begin and follow through with a low carb diet. I guess what I'm trying to say is that everyone being on a low carb diet would be amazing, but it is an impractical goal, and sodium alginate can help to reach a broader audience.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Northumberlo",
        "body": "1 seaweed please... better make that 10...",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FCWanon",
        "body": "I'd say that's an unfair comparison. Insulin does not get rid of diabetes, it tries to stop things from getting worse, while sodium alginate can in fact make someone who is obese relatively healthy again.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "TimoK123",
        "body": "Instead of adding shit to bread, I got a better idea. Stop eating the fucking thing if that's an issue for you.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 5,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "airplants",
    "post_id": "ezuuay",
    "title": "Does anyone use kelp additive or seaweed extract with their tillies? If so please share your experiences with them, thank you",
    "url": "https://www.reddit.com/r/airplants/comments/ezuuay/does_anyone_use_kelp_additive_or_seaweed_extract/",
    "score": 27,
    "num_comments": 18,
    "created": "2020-02-06T16:34:13+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SpeedyZapper",
        "body": "I'm in Australia so I expect brands will vary. The one I use is called Eco Seaweed. The thing to watch out for is the sodium/salt content. I would choose the brand that had the lowest possible sodium as too much will harm the plants.",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "666ATAN",
        "body": "What about rooting hormone? Anyone tried this on Tillandsia?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "SpeedyZapper",
        "body": "I've been using a powdered seaweed extract mixed in to the regular water every three weeks during summer. I'm in a hot climate and it's claimed that the seaweed extract can reduce the effects of heat stress on plants. Anecdotally it seems to promote root growth in my Tillandsia. I also fertilize every three weeks during summer with an orchid mix (NPK+Trace). I only started about 6 months ago but they seem to responding well. They are much greener and appear to be more vigorous and healthy. They also flowered well and produced a lot of pups over the summer",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "SpeedyZapper",
        "body": "I suspect they wash the seaweed before drying and grinding but given that it grows in salt water some will be left in the seaweed itself. It hasn't been an issue for me when applied every three weeks. Some of the recommendations I've seen suggest using it at half the recommended strength and that's what I have been doing.\n\nEdit: I also use rainwater. I would proceed with more caution if you are using water that already has some salt content.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "The_Aardvark",
        "body": "Wow!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "affirmativeYes",
        "body": "Happy Cake Day!",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "That's all I needed to hear : )\n\nAny brands you would suggest?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "Gotcha. I wonder why they wouldnt remove the sodium altogether?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "Sounds good.  Thanks for sharing your experience",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "I'm gonna he using it at a much lower rate probably a fourth to an eighth since I use tap and it's fairly hard.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "affirmativeYes",
        "body": "I personally have not used kelp/seaweed extract, although it might be a source of the plant fertilizer granules I have used which I do not know how they were made.\n\nKelp is a very fast growing plant in the ocean, so would this transfer to plants that soak in its extract?  Working at the coast a few years ago, I spoke to a few people who asked me where they could harvest kelp/seaweed as they were asked by their neighbor to collect some from the beach for their garden.  I asked them how it was going to be used in the garden and they said \"fertilizer\" ... so I guess kelp/seaweed does have a reputation as plant food :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "affirmativeYes",
        "body": "Love the article!  Thank you for sharing.  \n\nI would surmise that it would be a boon because of the growth factor.  Worth a try!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "When I get some I'll take good pics for APA",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "Seaweed extract/kelp has a 1-0-0 nutrient make up but has growth hormones, cytokines, auxins and other wr biological chemicals that do some awesome stuff for crops. Based on that I think it would work well for tillandsia bc it can be used as a foliar feed.\n\n[heres the pdf I read](http://scholar.google.com/scholar_url?url=https://www.researchgate.net/profile/Wajahatullah_Khan/publication/225338767_Seaweed_Extracts_as_Biostimulants_of_Plant_Growth_and_Development/links/0912f50c0ea222a6af000000/Seaweed-Extracts-as-Biostimulants-of-Plant-Growth-and-Development.pdf&hl=en&sa=X&scisig=AAGBfm3ma85vy1dXbi0gV-gYypzTLAB_tw&nossl=1&oi=scholarr)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "richie560",
        "body": "I'll get some once I read a bit more and I'll post about it when I do",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Pragmatic_Scavenger",
        "body": "Has anyone ever tried Spirulina? I know it has been used as a supliment to seaweed in gardening or aquariums.  I wonder if it would provide similar results in this case?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "affirmativeYes",
        "body": "isn't that micro-algae?  I wonder how it would absorb through the trichomes.  Are you referring to spirulina *extract* or just dried spirulina?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Pragmatic_Scavenger",
        "body": "It's Cyanobacteria, but commonly called blue-green algae (not actually algae)\nImp \nI know there are a lot of nutrients in it and it can be relatively inexpensive. \n\nNot sure about the the specific science in regards to the Trichomes though. \n\nI was under the impression that it was very similar to Seaweed but this could be more on a macro scale.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 18,
      "top_level": 5,
      "nested_replies": 13
    }
  },
  {
    "subreddit": "COVIDGoodNews",
    "post_id": "hxznnp",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/COVIDGoodNews/comments/hxznnp/in_cell_studies_seaweed_extract_outperforms/",
    "score": 24,
    "num_comments": 1,
    "created": "2020-07-26T03:14:21+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CoronavirusSouth",
    "post_id": "hxznen",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/CoronavirusSouth/comments/hxznen/in_cell_studies_seaweed_extract_outperforms/",
    "score": 17,
    "num_comments": 1,
    "created": "2020-07-26T03:13:51+00:00",
    "body": "",
    "flair_text": "MAJOR US News",
    "flair_template_id": "e3174448-5cd5-11ea-a640-0e1aef81430d",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CoronavirusGA",
    "post_id": "hxznut",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/CoronavirusGA/comments/hxznut/in_cell_studies_seaweed_extract_outperforms/",
    "score": 15,
    "num_comments": 4,
    "created": "2020-07-26T03:14:48+00:00",
    "body": "",
    "flair_text": "Academic Information",
    "flair_template_id": "299a3348-5d04-11ea-b9d5-0e663bf45d7b",
    "comments": [
      {
        "author": "onlyuselessfactoids",
        "body": "I’m just going to take this as an excuse to eat more sushi. Because science.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "FourScoreDigital",
        "body": "Encouraging. BUT. Many things do \"in vivo,\" that then don't in much later human testing post LD50 data. Otherwise the computer docking studies would have born more fruit against the bug. The interferon beta work is arguably the lab thing I am watching most as well as the outpatient use of budesinide, which is common among asthmatics.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Welcome to r/CoronavirusGA! We have some basic rules here. Here are the highlights:\n\n- Be civil. Personal attacks and accusations are not allowed. \n\n- Please attempt to use reliable sources. \n\n- No giving or soliciting medical advice. This includes verified health/medical professionals.\n\nHere are some useful links and/or projects for information/pass the time indoors:\n\n- ATL CoronaVirus Reddit @ /r/CoronavirusAtlanta\n\n- DISCORD @ https://discord.gg/Pgu9uAf - Learn Linux/Media Servers @ https://plexguide.com\n\n- TIPJAR for /u/N4BFR - Provides the Daily Maps for the GA-CV Reddit! Donate via - https://n4bfr.com/n4bfr-tip-jar/\n\n- Useful Coronavirus App via PC & Browser @ https://coronavirus.app \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CoronavirusGA) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Variable_Outcome",
        "body": "So should I eat seaweed salad?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "lawncare",
    "post_id": "id4w8x",
    "title": "Granular vs Liquid BioStimulants (Humic Acid, Seaweed Extract)",
    "url": "https://www.reddit.com/r/lawncare/comments/id4w8x/granular_vs_liquid_biostimulants_humic_acid/",
    "score": 14,
    "num_comments": 3,
    "created": "2020-08-20T06:06:36+00:00",
    "body": "Like many of you, I have been researching Biostimulants for my lawn and wanted to share my findings. First a disclaimer - I am a complete noob to lawncare and have less than 1 year of experience. But I have some more experience in reading academic papers and googling :)\n\nThe question I struggled with the most is why is there such a large variance in application rates between granular and liquid Humic Acid (HA) products. For example, a 70% granular HA is applied at a rate of 1-2 lbs/1000 whereas something like N-Ext Humic12 is supposed to be applied at 6oz/1000 i.e. minuscule compared to granular HA. Some believe that it is a purely marketing ploy from N-Ext and other liquid HA manufacturers and such a low application rate will not have any effect.\n\nBut after reading a few different papers, it looks like HA has different role when applied as a granular soil amendment vs as a foliar spray. As a soil amendment, it is used similarly to compost and among other things it makes it easy for plants to uptake nutrients (increases Cation Exchange Capacity - CEC). It is a rather expensive way to do that according to \\[1\\]. But the granular application rate fits this bill.\n\nOn the other hand, foliar spray works almost like a hormone/enzyme and the studies that show this effect applies it at the low rates that match the app rate of RGS and Humic 12 like products. For example, the most detailed paper I could find was this PhD dissertation \\[2\\] from Virginia Tech (not sure if this is the study that everyone keeps referring to). This study found significant effect at an app rate of 2.9% HA at 20-50 Liters/Hectare. A Hectare is roughly 100k sq. ft. So the app rate is 0.5 L/1k. 0.5L@2.9% is roughly equivalent to 15g or 0.52 oz of Humic Acid. RGS is 9% Humic+Fulvic. So 6oz of that contains 0.54oz of Humic Acid - pretty dead on match for the app rate in the study. The Seaweed extract app rate also checks out.\n\nThis makes me believe that at least the application rates are completely reasonable. As for the price, you should not compare it to granular HA/Kelp prices unless you know of a way to apply those as a foliar spray. I found water soluble HA and Kelp powder for cheaper but I have also read reports about those not dissolving properly and settling/clogging the sprayer. I have a smaller lawn and even at the high prices of RGS, it'll only cost me $5/app. If I see results with that, I might consider experimenting with something cheaper. Hopefully, someone will report back about the solubility of powdered HA/Kelp.\n\nHope this helps.\n\n&#x200B;\n\n\\[1\\] [https://aggie-horticulture.tamu.edu/newsletters/hortupdate/hortupdate\\_archives/2002/jun02/art4jun.html](https://aggie-horticulture.tamu.edu/newsletters/hortupdate/hortupdate_archives/2002/jun02/art4jun.html)\n\n\\[2\\] [https://vtechworks.lib.vt.edu/handle/10919/30739](https://vtechworks.lib.vt.edu/handle/10919/30739)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "double_e5",
        "body": "I run powdered HA/kelp through a hose end sprayer without clogging issues. If you were going use a pump or battery sprayer, I’d for sure use a tip strainer to catch any solids and help prevent a tip from clogging.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Gods_wrath_",
        "body": "Not sure if you’ve read any of his posts (and I’m not sure how to find them or link them), but u/Unabomber007\nhas fantastic insight into the difference between the different types of humic and sea kelp available",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "italophile",
        "body": "Yes, I did. That's what prompted me to research this. He is of the opinion that products like RGS are too diluted to have any effect. See[this comment thread](https://www.reddit.com/r/lawncare/comments/hvhnmi/help_with_overseeding_prep_timeline/fyu1dxx?utm_medium=android_app&utm_source=share&context=3)",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 2,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "cvnews",
    "post_id": "hxqslf",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/cvnews/comments/hxqslf/in_cell_studies_seaweed_extract_outperforms/",
    "score": 13,
    "num_comments": 1,
    "created": "2020-07-25T17:43:23+00:00",
    "body": "",
    "flair_text": "Medical News ",
    "flair_template_id": "52f0f9ac-454e-11ea-9939-0e0f47a2bd7b",
    "comments": [
      {
        "author": "Kujo17",
        "body": ">Published online today in Cell Discovery, the research is the latest example of a decoy strategy researchers from the Center for Biotechnology and Interdisciplinary Studies(CBIS) at Rensselear Polytechnic Institute are developing against viruses like the novel coronavirus that spawned the current global health crisis.\n\n>The spike protein on the surface of SARS-CoV-2 latches onto the ACE-2 receptor, a molecule on the surface of human cells. Once secured, the virus inserts its own genetic material into the cell, hijacking the cellular machinery to produce replica viruses. But the virus could just as easily be persuaded to lock onto a decoy molecule that offers a similar fit. The neutralized virus would be trapped and eventually degrade naturally.\n\n>Previous research has shown this decoy technique works in trapping other viruses, including dengue, Zika, and influenza A.\nThe Cell Discovery paper tests antiviral activity in three variants of heparin (heparin, trisulfated heparin, and a non-anticoagulant low molecular weight heparin) and two fucoidans (RPI-27 and RPI-28) extracted from seaweed. All five compounds are long chains of sugar molecules known as sulfated polysaccharides, a structural conformation that the results of a binding study published earlier this month in Antiviral Research suggested as an effective decoy.\n\n\nSo, as with most sensational sounding headlines it's not just seaweed in general but a speciric compound that us derived from seaweed. Granted \"seaweed extract\" does imply that to some degree imo but felt it relevant to kinda spell out so everyone doesnt make a run on health food stores for seaweed specifically lol",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "lawncare",
    "post_id": "8juigp",
    "title": "Seaweed Extract on your Lawn?",
    "url": "https://www.reddit.com/r/lawncare/comments/8juigp/seaweed_extract_on_your_lawn/",
    "score": 12,
    "num_comments": 18,
    "created": "2018-05-16T12:28:12+00:00",
    "body": "I'll be honest, my front lawn is crap. Patchy, shaded out, weak in general. I'm trying to bring it back without nuking the entire thing first. Trimming the trees that are shading it, overseeded etc, etc. \n\nI work at an agricultural fertilizer dealership, and one of the things some farmers use on their crops is seaweed extract. Anyone ever played around with it on their lawn? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Banzai51",
        "body": "Sort of. Sea Kelp is common in bio-stimulants. I'm trying out some N-Ext products this year, and their RGS product contains:\n\n* Humic Acid \n* Fulvic Acid\n* Sea Kelp extract \n\nI started in April, so really too early to tell how much is the N-ext products and how much is my normal prep/Spring green up.\n\n[Start of Spring](https://imgur.com/5wRim9w)  \n[Now](https://i.imgur.com/BgstH1a.jpg)  \n\nJust mowing, letting nature water, letting the plants to their thing in Spring, half Milo app, and an app of Humic12 and RGS ~20 days ago.\n\nI searched around a bit on the N-Ext stuff before I bought it and Humic Acid and Sea Kelp extract came up as a positive quite a bit from many different sources. That is one of the reasons I decided to take a chance on it.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "AllOfMyDisappoint",
        "body": "The only info I've been able to find about the N-Ext stuff is from the people who have distribution deals with the company. The whole things is too snake oily for me to want to try it just yet.\n\nThanks for being a guinea pig and taking as chance on it. I'll be interested to see your results throughout the summer.",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "1Bravo",
        "body": "I'm about to try the **N-Ext RGS and Humic12** combo I bought from the Lawn Care Nut. I have lot of clay I want to break.\nMilorganite is doing its job but I want to take it to the next level.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Banzai51",
        "body": "Try some of the Grass Factor videos. He isn't distributing it, but talks about how he uses it on his clients' lawns.\n\nhttps://www.youtube.com/results?search_query=The+Grass+Factor+N-Ext",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "veggiefarmer89",
        "body": "That's great. Keep me updated on your experience?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Banzai51",
        "body": ">So, you're spraying it down by hand?\n\nYes. Sure, it takes longer than spreading granules, but I haven't found these types of bio-stimulants in granular form yet.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "MadeWithHands",
        "body": "Pretty common in hydroponics for root development. Don't see why it wouldn't help in grass.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Banzai51",
        "body": "I've been posting ~weekly after my mows and treatments so everyone can see my progress. Decided to do that since I know everyone is curious about the N-Ext products. \n\nGo to the search bar, check \"Limit my search to r/lawncare\", and put in: Author:Banzai51 in the search.  That should find my posts here.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Banzai51",
        "body": "I have 7700 sqft, so I bought a 2 gallon sprayer and use that. Wanted an extra sprayer anyway so I could dedicate my 1 gal sprayer to herbicides just to be extra sure of keeping things clean. I just have the cheap, plastic Chapins.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "veggiefarmer89",
        "body": "I'm Canadian, we don't get to use Milorganite lol. However I do have ample access to mushroom compost, gypsum, etc.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "PeterThomson",
        "body": "There will be a Milo equivalent in Canada. Just find out which of these biosolids fertiliser suppliers sells in small enough quantities for your usage.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "veggiefarmer89",
        "body": "I am the fertilizer supplier haha. We're extremely restricted on what we can do with biosolids, and I'm not aware of any that are sold by the bag at all. \n\nBeing the fertilizer supplier, I can back my pickup up to a pile in a clients field, and take a few wheelbarrows for my purposes. But to the general public its extremely unavailable.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "thisisyourbestoption",
        "body": "I used the formulae listed here for both a kelp-based nutrient and sodium laureth sulfate conditioner: https://aroundtheyard.com/index.php?option=com_content&view=article&id=154:soil-conditioner-and-kelp-help-plus-humates&catid=9&Itemid=117\n\nI had a new construction lawn with very compacted backfill. This made a noticeable (but purely anecdotal) improvement in the soil. I applied per the instructions on the site for about 2 years before moving to a more standard LCN regimen. I might re-introduce it this year to see if it can help the yard rebound from my new dog a bit quicker.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "veggiefarmer89",
        "body": "Thanks! I've read good things about what it can do to help the crop tolerate drought. I'm wondering if an early summer application would be the best timing.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 4,
      "nested_replies": 10
    }
  },
  {
    "subreddit": "orchids",
    "post_id": "t5tiln",
    "title": "Can using seaweed extract cause basil keikis to develop? It looks like my orchid is producing 2 basil keikis (also root growth and a new leaf). Does this seem excessive and should I maybe cut down on the amount of seaweed extract? Or is this a sign of a thriving and happy orchid?",
    "url": "https://www.reddit.com/r/orchids/comments/t5tiln/can_using_seaweed_extract_cause_basil_keikis_to/",
    "score": 12,
    "num_comments": 8,
    "created": "2022-03-03T15:02:46+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "HOG_8541",
        "body": "To me if its actively growing! No signs of I'll health.  Why would you stop it!  It like stopping a child from developing.  Just let it go until it is a problem.  You will probably end up with a lott more blooms if you continued the seaweed.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "neomateo",
        "body": "Seaweed or Kelp extracts are high in Cytokinins, they are growth regulators responsible for cell division.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "skemsley15",
        "body": "Ok nice!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Original-Dragon",
        "body": "Seaweed extract is a biostimulant, containing beneficial microbes and micro nutrients. It certainly doesn’t hurt your plants, but the only way to really tell is to do a side by side comparison. Mix with your fertilizer. Water with this mixture every other, or every third watering.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "HaIfhearted",
        "body": "More growth = more better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "It seems like you are looking for orchid help today. This group is full of beginners and experts who are happy to help but please do check out [this link for quick Phalaenopsis care](http://www.aos.org/orchids/culture-sheets/novice-phalaenopsis.aspx) in the meanwhile. We also have an /r/orchids WIKI the admins and other volunteers are updating behind the scenes with care information and will soon make it available to the group. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/orchids) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "stevek216",
        "body": "Just to be devil's advocate here, depending on the seaweed species/processing, I've read that too much (growth hormone) MAY cause deformed blooms. So while I'm not suggesting you're using too much, you might want to be cautious if you're experimenting with higher doses.\n\nIt seems pretty complicated though. Some seaweed is higher in auxins which seem to stimulate root growth, some in cytokinins which stimulate more vegetative growth. I think the cytokinins are the ones you have to be a bit more careful with.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 6,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "conservatives",
    "post_id": "rz3ixu",
    "title": "Israeli Researchers Say Seaweed Extract Can Prevent COVID-19 Infection",
    "url": "https://www.reddit.com/r/conservatives/comments/rz3ixu/israeli_researchers_say_seaweed_extract_can/",
    "score": 12,
    "num_comments": 3,
    "created": "2022-01-08T16:23:09+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "joey2fists",
        "body": "We are 2years in, where are all\nOf the USA researchers?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Sindawe",
        "body": "Here is the paper that the OPs linked article is based on.\n\nhttps://peerj.com/articles/12398/",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "bigbubbuzbrew",
        "body": "Fucking USA in asshoe.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 2,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "theworldnews",
    "post_id": "hxzja2",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/theworldnews/comments/hxzja2/in_cell_studies_seaweed_extract_outperforms/",
    "score": 12,
    "num_comments": 0,
    "created": "2020-07-26T03:05:20+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ForUnitedStates",
    "post_id": "hxzme3",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/ForUnitedStates/comments/hxzme3/in_cell_studies_seaweed_extract_outperforms/",
    "score": 9,
    "num_comments": 1,
    "created": "2020-07-26T03:11:53+00:00",
    "body": "",
    "flair_text": "COVID-19",
    "flair_template_id": "23d511fe-6c5d-11ea-a4a6-0eaf1fcb1607",
    "comments": [
      {
        "author": "gfpgfpgfp",
        "body": "This is a stupid comparison given that it was heparin vs remdesivir in cells in culture. As if this disproves remdesivir (which is effficacious in humans) is adquate for SARS-CoV-2 treatment. Until heparin sulfate goes back to back in clinical trials with remdesivir, this study is super inadequate and questionable.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Permaculture",
    "post_id": "vwz97",
    "title": "how to make seaweed extract at home",
    "url": "https://www.reddit.com/r/Permaculture/comments/vwz97/how_to_make_seaweed_extract_at_home/",
    "score": 10,
    "num_comments": 0,
    "created": "2012-07-02T07:44:21+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "3jlqht",
    "title": "Epsom salt, dissolved in seaweed extract, mix with water, is honestly to God the best thing I've ever used",
    "url": "https://www.reddit.com/r/gardening/comments/3jlqht/epsom_salt_dissolved_in_seaweed_extract_mix_with/",
    "score": 11,
    "num_comments": 6,
    "created": "2015-09-04T10:48:39+00:00",
    "body": "My garden has never exploded more then it has with this mixture, my god it's unreal. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "hell_ianthus",
        "body": "Now I'm curious and slightly apprehensive.\n\n\nBy exploded, do you mean garden of Eden or mayhem and destruction. OK, reread the title again, now I'm very, very curious.\n\n\nCould you post the recipe and tell us how you use it. please :)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "drakorio",
        "body": "Pics or didn't happen. :P",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "roketgirl",
        "body": "Watch out with Epsom salt.  Most soil can benefit from some magnesium, but it's still a salt and going overboard will trash your soil.  Once per year only.  The seaweed extract you can use with abandon.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Luzer606",
        "body": "Depends how much he's using. A teaspoon per gallon when he fertilizes isn't a huge deal, an 1/8 of a cup per gallon and its time for caution and restraint.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "muscari",
        "body": "I swear by epsom salts too - in this case for Rhododendrons with an apparent magnesium deficiency - they greened up in no time. Wish I could use seaweed extract but its too expensive for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Luzer606",
        "body": "Epsom salts, Seaweed Extract, Fish Emulsion, Worm Castings, Kelp meal, green sand, Fruit bat guano,  Composted horse manure, Aspirin that uses Calcium carbonate as a buffer(Bayer), Coir.  All have been incredible additions to amend my soil or used in a fertilizing regimen.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 5,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "seaweed",
    "post_id": "hxzmw7",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/seaweed/comments/hxzmw7/in_cell_studies_seaweed_extract_outperforms/",
    "score": 10,
    "num_comments": 1,
    "created": "2020-07-26T03:12:58+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "metalliska",
        "body": ">“It’s a very complicated mechanism that we quite frankly don’t know all the details about, but we’re getting more information,” said Dordick. “One thing that’s become clear with this study is that the larger the molecule, the better the fit. The more successful compounds are the larger sulfated polysaccharides that offer a greater number of sites on the molecules to trap the virus.”\n\n.\n\n>The Cell Discovery paper tests antiviral activity in three variants of heparin (heparin, trisulfated heparin, and a non-anticoagulant low molecular weight heparin) and two fucoidans (RPI-27 and RPI-28) extracted from seaweed. All five compounds are long chains of sugar molecules known as sulfated polysaccharides, a structural conformation that the results of a binding study published earlier this month in Antiviral Research suggested as an effective decoy.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6070894/\n\nhttps://en.wikipedia.org/wiki/Monostroma",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CoronavirusFL",
    "post_id": "hxznhw",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/CoronavirusFL/comments/hxznhw/in_cell_studies_seaweed_extract_outperforms/",
    "score": 8,
    "num_comments": 0,
    "created": "2020-07-26T03:14:00+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "The_Coronavirus",
    "post_id": "ryr3ll",
    "title": "Seaweed extract shows ability to prevent COVID-19 infection",
    "url": "https://www.reddit.com/r/The_Coronavirus/comments/ryr3ll/seaweed_extract_shows_ability_to_prevent_covid19/",
    "score": 7,
    "num_comments": 0,
    "created": "2022-01-08T04:16:27+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Horticulture",
    "post_id": "1hy7gv6",
    "title": "Humic acid, seaweed extract, fish emulsion and others. Are they worth it? Or just \"snake oil\"?",
    "url": "https://www.reddit.com/r/Horticulture/comments/1hy7gv6/humic_acid_seaweed_extract_fish_emulsion_and/",
    "score": 7,
    "num_comments": 28,
    "created": "2025-01-10T15:52:41+00:00",
    "body": "I'm diving into a little backyard nursery setup growing potted native flowers (and some non-natives I enjoy) in my backyard (FL). I don't have much of a horticultural background, but I've been trying to learn as much as I can online in the past few months. I understand the 4 keys to growing successful potted plants are: healthy soil, proper watering, proper sunlight, a balanced fertilizer. That seems simple enough, right?  \n  \nBut then there are hundreds of other amendments and additives like:  \n \\- Humic acid  \n \\- Fulvic acid  \n \\- Mono-silicic acid  \n \\- Seaweed (kelp) extract  \n \\- Fish emulsion  \n \\- Worm castings  \n \\- Mycorrhizae  \n \\- and others\n\nIs there anything here you would add to a bi-weekly or monthly routine IN ADDITION to simply using a balanced fertilizer? (I use Jack's 20-20-20) I understand if I wasn't fertilizing, a combination of these might help make up for that deficit. But do any of them really offer something truly worth it's cost outside of a decent fertilizer and proper care?\n\nPlease help!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "PropertyRealistic284",
        "body": "A balanced soil will already contain many of the amendments you’ve listed. These extra bottles are for when your plants are heavy feeders on something in particular, or are showing signs of deficiency.  Keep up with the jacks and you should be just fine. It’s all a learning process and your plants will let you know if they need anything.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "FunAttorney53",
        "body": "100% the best things you can do to build healthy soil structure is to use what you have and add leaf litter, worm casting, inoculate with myko, and layer up compost and wood chips from soft wood trees that do not release growth inhibitors. Dont till, if you must aerate use a broadfork.\n\n\nEverything else is generally used for heavy feeding plants in containers or raised beds.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "AdigaCreek25",
        "body": "Kinda disagree here a bit. I have seen growers use beneficial fungi to great advantage growing plants in containers. Many mycorrhizal additives do much more than facilitate breakdown of organic matter in soils. Many commercial nursery soils can be ordered with beneficial fungi and bacteria. Not sure what state you’re in but talk with some local professional folks. They should be able to steer you in a good direction",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Beginning-Tailor1532",
        "body": "An excellent text to study is Growing Media for Ornamental Plants and Turf\nBy: Kevin Handreck, Neil Black",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Puzzleheaded_Cost421",
        "body": "You can get by with just the basics. All the things you listed are typically organic additives that do wonders when used correctly. Research research research. You don’t need all of this to be successful and companies want you to buy their products. It will help when used correctly but how much will it actually benefit the crop vs how much does it cost to apply. All things you have to consider when implementing new products in a cultivation system. Honestly you can find nice bags of organic “living” soil from your local hydroponics store which will have a lot of these additives included in the recipe. Nice soil combined with some high quality compost will be more than enough to grow some beautiful flowers. If you really want to get into it, buy the raw components yourself (peat, compost, amendments, etc.) and mix your own soil blend! Can be a lot cheaper depending on the volume you need.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Jolly-Brilliant-8959",
        "body": "Feeding the microbes feeds the plant.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Parchkee",
        "body": "Always beneficial to add organic matter, this stuff will help the microbiome create fertility. But you’re already adding synthetic fertility so it’s redundant.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "m3gatoke",
        "body": "Also mycorrhizae. You won’t regret these 2 additives",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "parrotia78",
        "body": "Unfortunately, most locations in the world don't have balanced soils and not all plants want the same ratios  of nutrients. More human dwellings are built on disturbed possibly deficient soils for the most common US residential and commercial real estate plants..for example azaleas.  When I ask most owners about their soil quality they take on a puzzled look or know very little about plant nutrition. That's why with an AA or  BS Hort a core requirement is Soil Science. Soil quality below the surface is often ignored in US contrived landscapes ...maybe because we're so visually oriented focused on what's occurring above.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "jecapobianco",
        "body": "I make my own peat based soilless mix and for me it is all about the amendments.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "adeadcrab",
        "body": "sandy soil like in FL will benefit from these additives even as just a one time or once a year additive to boost the quality of your soil",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "m3gatoke",
        "body": "FISH EMULSION. From personal experience with an industrial scale operation, fish emulsion makes a huge difference. It’s going to smell terrible, and whatever you do don’t get it on you, but it will be worth it in the end",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "BiteInsight",
        "body": "Is there anything particular I need to look for when shopping for mycorrhizae?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ThatOldAH",
        "body": "Almost all are designed to separate you from your money.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "somedumbkid1",
        "body": "The only thing I think is worth a damn there for container growing is the silica additive. \n\n\nThe fish, seaweed, and worm castings are just organic ferts. No reason to use them if you're already using a synthetic. Plus I don't like to use organic ferts in container growing. Too boom-and bust-ish. In ground growing I just use compost. Same (or better) benefits and importantly - free. Most myco products are snake oil in my opinion. Same with humic and fulvic acid products.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "esensofz",
        "body": "Yes; everything you don't understand is snake oil.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "jecapobianco",
        "body": "How does one define balanced soil?  And OP is looking at potted nat (as I understand that means container grown), aren't most potted plants grown in a soilless media?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "ReZeroForDays",
        "body": "If you want to build better soil, make your plants more nutritious, and gain an additional edible \"crop,\" i would recommend wine cap mushroom spawn. Mushrooms contain a rare amino acid for us called ergothioneine. It's also believed that mushrooms help plants absorb more ergothioneine. Wine caps are very great at breaking down wood chips and other decaying material fairly quickly, resulting in great soil.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "somedumbkid1",
        "body": "I've seen *some* myco products that produce actual mycorrhizae, many are junk and just inert material off the shelf. I've also yet to see any convincing literature that show that the myco is actually improving the production of the crop. \n\n\nTo be clear, I've got nothing against encouraging a thriving microbiological community, but I think there's a lot of smoke and a lot of pseudocience out there that people are very eager to believe is true without proof. And my ire is directed at the grifters who make and sell these products when growers and producers have no way to verify or guarantee they work beyond vague claims of, \"well this year our production did really well,\" and, \"I can see the myco in the soil.\"",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AdigaCreek25",
        "body": "Agree on the grifter front however I have seen dramatic results using some of these products and had many greenhouse growers that wouldn’t think of growing without using these tools. I worked for a company that had an evaluation team and 90+% have no benefit. However the few efficacious ones are well worth the costs",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "madeat1am",
        "body": "Honestly in Australia it's just recommended for seasol - a kelp fertiliser and thats really enough \n\n\nThe other stuff DOES add good stuff to help but it's definitely for more professional settings. Casual gardener you don't need jt",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "jecapobianco",
        "body": "The joke I was told by a bonsai artist (Mary Miller since retired)is that in Florida you can take a broomstick, put it in the ground and it will grow roots.  I have a greenhouse on Long Island where I keep everything from Chili Peppers to Japanese white pine, I have a base mix that I tailor for each species needs and my ability to provide adequate moisture throughout the year. Some plants want more water on the roots than others, some have different pH requirements. I would say that you should have a mix, and then tailor it according to the needs of the species. All those amendments you mentioned bring something different to the table, you have to decide if you want to tailor the mix with different amendments.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "alkemical",
        "body": "all the additives have some merit and some of it is: \"is it worth it to you\". Some companies sell more watered down supplements.  \n\nI use most of those in my organic & hydroponic setups. \n\nAs an example: Kelps can help promote lateral branching in roots when used in the medium or soil. It also feeds microbes. Using it as a foliar provides different benefits.\n\nHumic & Fulvic acids: They work at different molecular weights. Using a fulvic acid as a foliar as  transition happens for flowering it may provide some better responses for flowering.  That said,  you may not \"need\" a seperate fulvic acid if you are using a high quality humic acid. (Again, i could be wrong on this).\n\nJust some things to think about.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Material_Example5335",
        "body": "Fish emulsion is king",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "shohin_branches",
        "body": "The important piece to understand is what is in your current soil and what you need it to do. If your plants are healthy with strong growth there is no reason to change anything. If your plants are failing to thrive then do a soil test and ammend accordingly. Adding amendments to your soil with no goal or understanding of where you're starting will cause more issues. You have different growing conditions than the YouTube blogger or the KNF acolyte. Grow your own garden and watch out for trendy gimmicks that are just trying to sell a product. Everything is advertising now",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "good_oleboi",
        "body": "I use \\[this\\](https://www.walmart.com/ip/Alaska-Fish-Emulsion-Fertilizer-Natural-Organic-Concentrate-5-1-1-1qt/17757316?wmlspartner=wlpa&selectedSellerId=0&wl13=356&gclsrc=aw.ds&adid=2222222227717757316\\_117755028669\\_12420145346&wl0=&wl1=g&wl2=c&wl3=501107745824&wl4=pla-394283752452&wl5=1012947&wl6=&wl7=&wl8=&wl9=pla&wl10=8175035&wl11=local&wl12=17757316&veh=sem\\_LIA&gclsrc=aw.ds&gad\\_source=1&gclid=Cj0KCQiAyoi8BhDvARIsAO\\_CDsD5OsJcG8G-E1dYB0562bCNr9JSEuE7t928DTatx7ePCznffPGaXmMaAtGCEALw\\_wcB) fertilizer and get my best results with tomatoes, peppers, and cucumbers. I use it as a stand alone fertilizer in combination with worm castings. Watermelons, berries, squash, and zucchini it doesn't do as well as some other options.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Green-Reality7430",
        "body": "Do these products have some merit or benefit.... probably yes\n\n\nAre these products necessary to grow high quality plants... almost certainly not.\n\nWatch your plants, they will tell you if you need to add something else to your soil.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "PropertyRealistic284",
        "body": "A balanced soil will contain compost, aeration, peat/coco and amendments.  I’m a huge fan of BuildASoil products, with their lite being the most well rounded.  With that being said, I don’t know much about native flowers so you may be correct about preferred media.  I’m just a soil guy",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 28,
      "top_level": 18,
      "nested_replies": 10
    }
  },
  {
    "subreddit": "mushroomID",
    "post_id": "dy49h7",
    "title": "so about 60+ of these bois sprung up in my organic bed, its filled with spinach, white spring onions & tomatos, has plenty of water retension in the soil & lots of seaweed extract been used through summer, any idea what they are? Mucho thanks",
    "url": "https://www.reddit.com/r/mushroomID/comments/dy49h7/so_about_60_of_these_bois_sprung_up_in_my_organic/",
    "score": 7,
    "num_comments": 1,
    "created": "2019-11-18T15:00:14+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Rahloh",
        "body": "Located on the north west UK",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "remdesivir",
    "post_id": "hxzluv",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/remdesivir/comments/hxzluv/in_cell_studies_seaweed_extract_outperforms/",
    "score": 6,
    "num_comments": 0,
    "created": "2020-07-26T03:10:42+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "algae",
    "post_id": "r7q7e3",
    "title": "Green seaweed extract exhibits anti-SARS-CoV-2 activity in vitro",
    "url": "https://www.reddit.com/r/algae/comments/r7q7e3/green_seaweed_extract_exhibits_antisarscov2/",
    "score": 6,
    "num_comments": 0,
    "created": "2021-12-03T04:17:35+00:00",
    "body": "Macroalgae, or seaweed, which are marine multicellular organisms encompassing several thousand species, are previously known to exhibit antiviral properties... \n\nhttps://preview.redd.it/2eyb205879381.jpg?width=950&format=pjpg&auto=webp&s=6a46630f48337fc88986cd55a2169ca93d22d613\n\n[https://www.news-medical.net/news/20211202/Green-seaweed-extract-exhibits-anti-SARS-CoV-2-activity-in-vitro.aspx](https://www.news-medical.net/news/20211202/Green-seaweed-extract-exhibits-anti-SARS-CoV-2-activity-in-vitro.aspx)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "todayilearned",
    "post_id": "lg1lf",
    "title": "TIL Carrageenan, a seaweed extract, most commonly used to thicken milkshakes is believed to be the first substance to actively fight the common cold, not just the symptoms. ",
    "url": "https://www.reddit.com/r/todayilearned/comments/lg1lf/til_carrageenan_a_seaweed_extract_most_commonly/",
    "score": 7,
    "num_comments": 1,
    "created": "2011-10-18T06:26:21+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "surfing",
    "post_id": "hxytge",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/surfing/comments/hxytge/in_cell_studies_seaweed_extract_outperforms/",
    "score": 5,
    "num_comments": 3,
    "created": "2020-07-26T02:12:00+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "JimboBassMan",
        "body": "I wee in the sea when I surf so there's that",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "williemach",
        "body": "Snack anyone?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "seaweed",
    "post_id": "r7q6qn",
    "title": "Green seaweed extract exhibits anti-SARS-CoV-2 activity in vitro",
    "url": "https://www.reddit.com/r/seaweed/comments/r7q6qn/green_seaweed_extract_exhibits_antisarscov2/",
    "score": 4,
    "num_comments": 0,
    "created": "2021-12-03T04:16:36+00:00",
    "body": "Macroalgae, or seaweed, which are marine multicellular organisms encompassing several thousand species, are previously known to exhibit antiviral properties... \n\nhttps://preview.redd.it/xlwvfep179381.jpg?width=950&format=pjpg&auto=webp&s=0912f1ee93a6e65b583ff4467464e14bd55dccc3\n\n[https://www.news-medical.net/news/20211202/Green-seaweed-extract-exhibits-anti-SARS-CoV-2-activity-in-vitro.aspx](https://www.news-medical.net/news/20211202/Green-seaweed-extract-exhibits-anti-SARS-CoV-2-activity-in-vitro.aspx)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "aquaponics",
    "post_id": "1qhzgg",
    "title": "Seaweed extract for fishless cycling.",
    "url": "https://www.reddit.com/r/aquaponics/comments/1qhzgg/seaweed_extract_for_fishless_cycling/",
    "score": 6,
    "num_comments": 15,
    "created": "2013-11-13T00:48:01+00:00",
    "body": "I just built my first setup and have been cycling without fish for two days. I had bought some Growmore seaweed extract from a local grow shop to help keep the plants happy but today I noticed a warning on the back that says, \"Contains chemicals known in California to cause cancer, birth defects, and reproductive harm. Not for organic food crops in California.\" Did I just buy the wrong stuff or are my state's organic laws overbearing?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ilikeagedgruyere",
        "body": "That works great.  My father in-law swear by pissing in it.  I would avoid that technique. just my opinion.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Pllatinum",
        "body": "You can start a cycle just by throwing food in the water.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ilikeagedgruyere",
        "body": "Some people are squeamish about it.  APers in Oz complain that they can't find pure ammonia for cycle their systems when they flush a few ounces every week.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Prof_Mortimer_Petit",
        "body": "This is a great method that I used with my class.  I did use sponge filters which had been in my home tanks for about a month for seed, but I was able to get ammonia down to zero in 2 weeks, and it was off the chart when I started.\n[humane ammonia cycling](http://www.csupomona.edu/~jskoga/Aquariums/Ammonia.html)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ilikeagedgruyere",
        "body": "Peta makes it seems terrible.  but they never show how when the farmer walks out to the barn to start the process that the geese clamor over each other to get fed first.  it's instinct for them to stuff themselves and fatten up before migrating.  There are some operations that do it differently that may be considered cruel though.  http://www.youtube.com/watch?v=lh6ZDusOGwU",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "erichoney07",
        "body": "i've used that technique, works fine for me.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "schellsan",
        "body": "Thanks, all.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "mangletron",
        "body": "I used baker's ammonia.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ilikeagedgruyere",
        "body": "never thought about that...and I'm a baker.\n\nit's just hard to find sometimes, I just bought some pure ammonia from Ace Hardware.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "roachwarren",
        "body": "Yes there definitely are. it is not uncommon for the them to be tied down for weeks with tubes shoved down their throats. A farmer recently won a top French culinary prize for making foie gras by feeding ducks greens that give them flavor (like mustard), thus being one of the first to help end the process of unfair torture without trying to just straight up end the production of the food.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "ilikeagedgruyere",
        "body": "That's really strange.  I wouldn't doubt that it's just a California thing.  They outlawed foie gras because they think force feeding geese is cruel(they must have never seen the geese line up voluntarily to be fed from a beer bong).",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 5,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "aquaponics",
    "post_id": "1b0vqj",
    "title": "Water colored by seaweed extract?",
    "url": "https://www.reddit.com/r/aquaponics/comments/1b0vqj/water_colored_by_seaweed_extract/",
    "score": 5,
    "num_comments": 9,
    "created": "2013-03-26T04:39:37+00:00",
    "body": "So, to have some plants in the growbed I added seaweed extract. Now when I start cycling I am concerned if the water doesn't clear up. Anyone have any experience with this scenario? What clears up the water and how long did it take for you?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "pixeled601",
        "body": "I would wait until you know your system has cycled. My water is finally starting to clear a little and it has been three weeks. It feels like forever; I know. I might give it some more time. My plants were loving it before it started to clear and now not so much. My ph isn't were I need it to be to add fish though. Good luck. I am there with you.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Sleepy_nomad",
        "body": "Yeah, I just ordered my test kit and ammonium chloride. My fingers are crossed.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "joshr45",
        "body": "what color is the water? what kind of media? and how much sea weed extract did you put in?\n\nmy system had a few issues with dirty looking water but not from seaweed extract, i could never even really see the seaweed extract after it went in when the water was clear, my dirty water came from the rocks i was using and that cleared up in about 1-2 weeks.\n\nAt the moment my water is brown in hue but clear, i had just added some peat moss in a media bag which made it essentially more brown then it was.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Sleepy_nomad",
        "body": "It's expanded clay for the medium and the dose was one ounce per gallon like the box said. It's super dark and hasn't cleared at all. I'm really hoping that I don't have to replace the water and let it air out all of the chlorine again. Here's the water.\n\n\n\nhttp://i.imgur.com/fIYRzww.jpg",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "joshr45",
        "body": "holy cow so... i'm guessing its a 1 ounce treats 1 gallon sort of thing but that's normally for when your doing like a spray,  so as an additive to give the plants feed you probably over did it a bit...,  in large systems(300gallons) I've never heard anyone going even over a cup of it.\n\nyou might need to change out some water... but since it looks fairly pure in concentrate i'd jar it back up",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Sleepy_nomad",
        "body": "Ok, so then I could probably do it a gallon at a time or maybe two? How many times do you think I would need to do that?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "joshr45",
        "body": "i mean if your not putting fish in right away i would say it can wait till it cycles but it could cause problems depending on what type of seaweed extract, the stuff i have is pretty much a sludge so dumping that in would potentially clog my system but i don't really need to anymore\n\ni would at least change a few out to save some of it in-case you need to start another system or use it to grow some seedlings.\n\nIf and when it clears(cant really say for sure) it would probably have a heavy green tinge for a while and you might have to scrub your tank occasionally which should be done anyways",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Sleepy_nomad",
        "body": "Nahh I don't think I will have to worry about sludge. This was very watery. I guess I'll just wait for it to cycle and then do partial water changes if need be. Thanks for your advice everybody!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "iambecomederpth",
        "body": "Took my water a couple of weeks.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 3,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "CoronavirusSupport",
    "post_id": "hxzlhk",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/CoronavirusSupport/comments/hxzlhk/in_cell_studies_seaweed_extract_outperforms/",
    "score": 4,
    "num_comments": 0,
    "created": "2020-07-26T03:09:56+00:00",
    "body": "",
    "flair_text": "Cure/Vaccine",
    "flair_template_id": "0fac7d9a-6017-11ea-8694-0ef162e40495",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "e4vhp",
    "title": "Does anyone know where to get a good organic seaweed extract around philly?",
    "url": "https://www.reddit.com/r/gardening/comments/e4vhp/does_anyone_know_where_to_get_a_good_organic/",
    "score": 3,
    "num_comments": 2,
    "created": "2010-11-12T00:36:55+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Nurgle",
        "body": "How close to Philly do you need and have you tried /r/philadelphia?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FernR",
        "body": "I second the suggestion of a hydroponics store. That's where I get all of my liquid fertilizers, including seaweed extract.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "benshapiro",
    "post_id": "rz3iem",
    "title": "Israeli Researchers Say Seaweed Extract Can Prevent COVID-19 Infection",
    "url": "https://www.reddit.com/r/benshapiro/comments/rz3iem/israeli_researchers_say_seaweed_extract_can/",
    "score": 5,
    "num_comments": 5,
    "created": "2022-01-08T16:22:31+00:00",
    "body": "",
    "flair_text": "News",
    "flair_template_id": "3526466a-4780-11e9-8a5c-0e91f2e49780",
    "comments": [
      {
        "author": "NadeMagnet69",
        "body": "Soon to be followed by media saying Jews are taking fish medicine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MrBeer4me",
        "body": "*Big Pharma would like to ‘Epstei....’ ahhh chat with you...*",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "MrBeer4me",
        "body": "Have you gotten Covid yet?",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "theworldnews",
    "post_id": "hykg5s",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19",
    "url": "https://www.reddit.com/r/theworldnews/comments/hykg5s/seaweed_extract_outperforms_remdesivir_in/",
    "score": 7,
    "num_comments": 0,
    "created": "2020-07-27T03:07:07+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CurcuminSupplements",
    "post_id": "17r8a6h",
    "title": "Anticancer potential of blue-green algae extract (Spirulina plantesis) and Curcumin nanoparticles on Ehrlich ascites carcinoma–bearing mice",
    "url": "https://www.reddit.com/r/CurcuminSupplements/comments/17r8a6h/anticancer_potential_of_bluegreen_algae_extract/",
    "score": 4,
    "num_comments": 0,
    "created": "2023-11-09T08:13:05+00:00",
    "body": "",
    "flair_text": "New study",
    "flair_template_id": "f9b6acb6-7711-11ee-9320-ce70c163b240",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AnythingGoesNews",
    "post_id": "hxzhum",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus | Heparin, a common anitcoagulent, could also form basis of a viral trap for SARS-CoV-2",
    "url": "https://www.reddit.com/r/AnythingGoesNews/comments/hxzhum/in_cell_studies_seaweed_extract_outperforms/",
    "score": 3,
    "num_comments": 0,
    "created": "2020-07-26T03:02:33+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "seaweed",
    "post_id": "rymxsy",
    "title": "Seaweed extract shows ability to prevent COVID-19 infection",
    "url": "https://www.reddit.com/r/seaweed/comments/rymxsy/seaweed_extract_shows_ability_to_prevent_covid19/",
    "score": 3,
    "num_comments": 0,
    "created": "2022-01-08T00:47:25+00:00",
    "body": " TEL AVIV, Israel - A substance in edible marine algae - or seaweed - is capable of blocking COVID-19 from infecting the cells, a new study reveals... \n\nhttps://preview.redd.it/glnp5vsj2da81.jpg?width=800&format=pjpg&auto=webp&s=1c4013e15342b77368d3629baa755dcbcfa9c2b2\n\n[https://www.studyfinds.org/seaweed-extract-prevent-covid/](https://www.studyfinds.org/seaweed-extract-prevent-covid/)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "treyandharrison",
    "post_id": "hy2e9v",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/treyandharrison/comments/hy2e9v/in_cell_studies_seaweed_extract_outperforms/",
    "score": 3,
    "num_comments": 0,
    "created": "2020-07-26T06:55:25+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Seaweeds",
    "post_id": "hxzmy4",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/Seaweeds/comments/hxzmy4/in_cell_studies_seaweed_extract_outperforms/",
    "score": 3,
    "num_comments": 0,
    "created": "2020-07-26T03:13:06+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "agriscience",
    "post_id": "rhfur3",
    "title": "USDA and Fertilizer Institute (TFI) announce winners for Next Gen Fertilizer Challenge including 'nano-smart fertilizers, “Urea 2.0”, nitrapyrin, microbial inoculants, seaweed extract, smart-fertilizers, mixtures and Phosphate Liberation Boosters'",
    "url": "https://www.reddit.com/r/agriscience/comments/rhfur3/usda_and_fertilizer_institute_tfi_announce/",
    "score": 3,
    "num_comments": 0,
    "created": "2021-12-16T02:13:23+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "aquaponics",
    "post_id": "asd7ky",
    "title": "Cycling system using seaweed extract.",
    "url": "https://www.reddit.com/r/aquaponics/comments/asd7ky/cycling_system_using_seaweed_extract/",
    "score": 3,
    "num_comments": 2,
    "created": "2019-02-19T17:55:02+00:00",
    "body": "I've decided to cycle my system using seaweed extract. How much should I add the water is looking quite dark but the ammonia levels dont seem to be rising.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "BFSaltedEgg",
        "body": "Because you are using the wrong product. You are better getting some ammonium or urea if you dont have it in your area. Those will cycle better.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "choosetango",
        "body": "Agreed. I tried seaweed cycling and it did shit for me.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "PepperLovers",
    "post_id": "jlyoy5",
    "title": "Can I spray my pepper plant leaves with this seaweed extract? Specifications in post",
    "url": "https://www.reddit.com/r/PepperLovers/comments/jlyoy5/can_i_spray_my_pepper_plant_leaves_with_this/",
    "score": 3,
    "num_comments": 2,
    "created": "2020-11-01T07:49:30+00:00",
    "body": "Hi. I purchased seaweed extract and just began using it to feed my young plants. I have many types of hot peppers. The below description is a translation from Thai packaging. Based on the makeup of the extract, is this safe to spray onto the leaves? Is there any benefit to doing that? Of so, what strength would you recommend? 1/2 of what's on the package? Less? \n\nI recently moved all my plants into a combination of potting soil, super soil, compost, vermiculite and perlite. How often would that require the seaweed to be included in watering? Every week?\n\nI'm new to the nutrition game, so any advice would be appreciated. Thanks. Here is the description of the seaweed extract:\n\nUsage rate per 20 liters of water\n 3-5 grams to aid food accumulation  Accelerate growth\n 10-15 grams stimulate flowering and thrust the shoots.\n ingredient\n Amino acid: found as a constituent in seaweed is Cysteine, Lysine, Aspartic, Glutamic, Proline, Methionine, Tryptophane, Arginine, and Ornithine.Vitamins: Contains A, C, B1, B2, B12, E, D.  Repairing Mineral salts Plant nutrients: Especially Magnesium, Potassium, Calcium and Silicon, which have properties on cell tonic potentiai, prevent cell wilting and help balance the moisture of cell 4.Trace Elements  Plant supplements: Contains Iodine, Iron, Manganese, Boron, Cobalt, Copper, Zinc, Bromium, Nickel, Strontium, Aluminum, Barium, Titanium, Silver, Gold, Chromium, Fluorine, Tin.\n Specifications\n Specifications\n 1) Seaweed fertilizer 100% soluble, 100% water soluble.\n 2) Organic matter, 52% organic ingredients\n 3) Alginic Acid 18%\n 4) Amino Acid 1-2% amino acid\n 5) pH: 9\n 6) Total Nitrogen: 2% Phosphorus (P2O5): 1.6% Potassium (K2O): 18%.",
    "flair_text": "Plant Help",
    "flair_template_id": "2acf874c-6203-11e9-8523-0ec8dca3169e",
    "comments": [
      {
        "author": "macnmotion",
        "body": "Thanks for the detailed reply. The reason I didn't post the name of the product is because it's all in Thai - I'm in Bangkok and ordering from Shopee, a Thai language online shopping site. But if you want to give Google Translate a go, here is a link to the product page:\n\nhttps://shopee.co.th/product/118613030/7717241403",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "macnmotion",
        "body": "That's what I'll do. I think add to my midweek topsoil spray and hit the leaves too. I so a full soil watering on the weekend.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 0,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "aquaponics",
    "post_id": "fwj9ot",
    "title": "Less of a question but more of an update. After a month of just dosing with Ammonium Chloride, seaweed extract and FE-DTPA. Tanks arrive tomorrow but temperatures still in the 40-50. Eagerly waiting for bacteria",
    "url": "https://www.reddit.com/r/aquaponics/comments/fwj9ot/less_of_a_question_but_more_of_an_update_after_a/",
    "score": 3,
    "num_comments": 4,
    "created": "2020-04-07T11:58:28+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Ichthius",
        "body": "If you don’t support the pH/alkalinity it won’t cycle very quickly. To convert ammonia to nitrate, it takes as much carbonate as free oxygen. The ammonia is their nitrogen source, the carbonates/alkalinity is their carbon source. Life doesn’t happen very well when either is abundant and the other is absent.\n\nAnd your temperatures aren’t helping either. Your nitrite step will take for ever at those temps.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Drasticparadigms",
        "body": "My PH is at 7.2 currently",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Ichthius",
        "body": "Ah at first glance I thought it was 6.6.  Many things even ammonia can increase the pH, it's really the carbonate hardness that you need.  Do you have a Kh test kit?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Drasticparadigms",
        "body": "I do not. Just the API test kit.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 1,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "Sino",
    "post_id": "64kja6",
    "title": "Seaweed: From superfood to superconductor. Yang, currently at Qingdao University, worked with colleagues at Qingdao University and at Los Alamos National Laboratory in the U.S. to make porous carbon nanofibers from seaweed extract",
    "url": "https://www.reddit.com/r/Sino/comments/64kja6/seaweed_from_superfood_to_superconductor_yang/",
    "score": 3,
    "num_comments": 1,
    "created": "2017-04-10T16:15:08+00:00",
    "body": "",
    "flair_text": "news-scitech",
    "flair_template_id": null,
    "comments": [
      {
        "author": "poster5439",
        "body": "Seaweed: From superfood to superconductor\n\nPosted: Apr 05, 2017\n\n(Nanowerk News) Seaweed, the edible algae with a long history in some Asian cuisines, and which has also become part of the Western foodie culture, could turn out to be an essential ingredient in another trend: the development of more sustainable ways to power our devices. Researchers have made a seaweed-derived material to help boost the performance of superconductors, lithium-ion batteries and fuel cells.\n\nThe team will present the work today at the 253rd National Meeting & Exposition of the American Chemical Society (ACS). ACS, the world's largest scientific society, is holding the meeting here through Thursday. It features more than 14,000 presentations on a wide range of science topics. \n\n \"Carbon-based materials are the most versatile materials used in the field of energy storage and conversion,\" Dongjiang Yang, Ph.D., says. \"We wanted to produce carbon-based materials via a really 'green' pathway. Given the renewability of seaweed, we chose seaweed extract as a precursor and template to synthesize hierarchical porous carbon materials.\" He explains that the project opens a new way to use earth-abundant materials to develop future high-performance, multifunctional carbon nanomaterials for energy storage and catalysis on a large scale.\n\nTraditional carbon materials, such as graphite, have been essential to creating the current energy landscape. But to make the leap to the next generation of lithium-ion batteries and other storage devices, an even better material is needed, preferably one that can be sustainably sourced, Yang says.\n\nWith these factors in mind, Yang, who is currently at Qingdao University (China), turned to the ocean. Seaweed is an abundant algae that grows easily in salt water. While Yang was at Griffith University in Australia, he worked with colleagues at Qingdao University and at Los Alamos National Laboratory in the U.S. to make porous carbon nanofibers from seaweed extract. Chelating, or binding, metal ions such as cobalt to the alginate molecules resulted in nanofibers with an \"egg-box\" structure, with alginate units enveloping the metal ions. This architecture is key to the material's stability and controllable synthesis, Yang says.\n\nTesting showed that the seaweed-derived material had a large reversible capacity of 625 milliampere hours per gram (mAhg-1), which is considerably more than the 372 mAhg-1 capacity of traditional graphite anodes for lithium-ion batteries. This could help double the range of electric cars if the cathode material is of equal quality.\n\nThe egg-box fibers also performed as well as commercial platinum-based catalysts used in fuel-cell technologies and with much better long-term stability. They also showed high capacitance as a superconductor material at 197 Farads per gram, which could be applied in zinc-air batteries and supercapacitors. The researchers published their initial results in ACS Central Science in 2015 and have since developed the materials further.\n\nFor example, building on the same egg-box structure, the researchers say they have suppressed defects in seaweed-based, lithium-ion battery cathodes that can block the movement of lithium ions and hinder battery performance. And recently, they have developed an approach using red algae-derived carrageenan and iron to make a porous sulfur-doped carbon aerogel with an ultra-high surface area. The structure could be a good candidate to use in lithium-sulfur batteries and supercapacitors.\n\nMore work is needed to commercialize the seaweed-based materials, however. Yang says currently more than 20,000 tons of alginate precursor can be extracted from seaweed per year for industrial use. But much more will be required to scale up production.\n\nSource: American Chemical Society\n\nhttp://www.nanowerk.com/nanotechnology-news/newsid=46330.php\n\nMore Scitech news https://chinarecentdevelopments.wordpress.com/2017/03/15/sciencetechnology-part-3/",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "fuctuv",
    "title": "[houston] tips on getting little black ants off grapefruit tree flowers? I spray insect killing soap with seaweed extract like every other day but it doesn’t help.",
    "url": "https://www.reddit.com/r/gardening/comments/fuctuv/houston_tips_on_getting_little_black_ants_off/",
    "score": 3,
    "num_comments": 4,
    "created": "2020-04-03T17:43:11+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "cft_731",
        "body": "they won't hurt the plant, but if you (like me) hate ants, i've had really really good luck with terro's ant bait sticks.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Guygan",
        "body": "They won’t hurt the plant. Just leave them.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "CitrusBelt",
        "body": "You'll have to kill the nest to get rid of them; terro (or other boric acid type baits) works well. \n\nHowever, they're only a problem if they're farming aphids/etc., and even if they are, it's usually not a problem on citrus trees (their aphid farms will destroy lots of annuals, but citrus can handle it, at least in my area).\n\nI wouldn't worry too much as long as the tree looks ok & is still putting out new growth.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "fishwish78777",
        "body": "Oh good, I will leave them alone then! Carry on ants",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 3,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "algae",
    "post_id": "rymykk",
    "title": "Seaweed extract shows ability to prevent COVID-19 infection",
    "url": "https://www.reddit.com/r/algae/comments/rymykk/seaweed_extract_shows_ability_to_prevent_covid19/",
    "score": 3,
    "num_comments": 0,
    "created": "2022-01-08T00:48:26+00:00",
    "body": " TEL AVIV, Israel - A substance in edible marine algae - or seaweed - is capable of blocking COVID-19 from infecting the cells, a new study reveals... \n\nhttps://preview.redd.it/mjts2roo2da81.jpg?width=800&format=pjpg&auto=webp&s=1f187c559f8f604d19eca546638a15b856b1b26a\n\n[https://www.studyfinds.org/seaweed-extract-prevent-covid/](https://www.studyfinds.org/seaweed-extract-prevent-covid/)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "f7rrc",
    "title": "Seaweed Extract – Facts for Hydroponic Growers",
    "url": "https://www.reddit.com/r/gardening/comments/f7rrc/seaweed_extract_facts_for_hydroponic_growers/",
    "score": 2,
    "num_comments": 0,
    "created": "2011-01-24T00:58:55+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "PresidentBiden",
    "post_id": "rhffs6",
    "title": "Winners announced for Next Gen Fertilizer Challenge by USDA, EPA and Fertilizer Institute (TFI) including nano-smart fertilizers, “Urea 2.0”, nitrapyrin, microbial inoculants, seaweed extract, smart-fertilizers, mixtures and Phosphate Liberation Boosters",
    "url": "https://www.reddit.com/r/PresidentBiden/comments/rhffs6/winners_announced_for_next_gen_fertilizer/",
    "score": 2,
    "num_comments": 0,
    "created": "2021-12-16T01:52:01+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "usa",
    "post_id": "hxzlm8",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/usa/comments/hxzlm8/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-26T03:10:11+00:00",
    "body": "",
    "flair_text": "Fluff",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Captain_Usage",
    "post_id": "hy68an",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/u_Captain_Usage/comments/hy68an/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-26T12:37:54+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "International",
    "post_id": "hxznyy",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/International/comments/hxznyy/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-26T03:15:03+00:00",
    "body": "",
    "flair_text": "News",
    "flair_template_id": "beb2e480-28b5-11e5-aeb7-0e3f27028b2f",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HotPeppers",
    "post_id": "16t9uk9",
    "title": "Expired Seaweed extract still usable?",
    "url": "https://www.reddit.com/r/HotPeppers/comments/16t9uk9/expired_seaweed_extract_still_usable/",
    "score": 2,
    "num_comments": 6,
    "created": "2023-09-27T03:45:15+00:00",
    "body": "I have a 250ml bottle of seaweed extract with manufactured date: July - 2020 and 'use within' period of 2 years from manufacturing. I plan on using it on my hot pepper plants. I noticed that the odor it used to have is absent now. There used to be a strong smell to it before but now it's completely devoid of any odour, still has the same pitch black colour though. Question is is it still going to be effective? Is it safe to use? Suggestions are appreciated.",
    "flair_text": "Growing",
    "flair_template_id": "1c58d81e-0701-11ea-86fd-0e0ca503cd4b",
    "comments": [
      {
        "author": "Next-Incident-6376",
        "body": "Should be fine, just might not be as strong but still use the recommended dosage and monitor how the plant is. Most of these products are fine they just lose microbial content but they don’t really go bad from my experience",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "vishal_pvk",
        "body": "Thanks. Much appreciated.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "RetracingTheRoots",
        "body": "I am in the same spot. What was your experience? Did it work fine?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "vishal_pvk",
        "body": "Yes it worked fine",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "RetracingTheRoots",
        "body": "Thank you for letting me know. I shall use it now.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "818fiendy",
        "body": "Nice thank u ! If the extract works then dry kelp should last an eternity",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 1,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "TheAbditory",
    "post_id": "hy0o97",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/TheAbditory/comments/hy0o97/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-26T04:31:06+00:00",
    "body": "",
    "flair_text": "Sources",
    "flair_template_id": "a5ea2990-ce56-11e9-96e5-0e969723880c",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "orchids",
    "post_id": "a937rb",
    "title": "Anyone use seaweed extract based fertilisers like Seasol?",
    "url": "https://www.reddit.com/r/orchids/comments/a937rb/anyone_use_seaweed_extract_based_fertilisers_like/",
    "score": 2,
    "num_comments": 3,
    "created": "2018-12-24T08:16:24+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Msniko",
        "body": "I was gunna say yes but this isn't r/gardening. So i'm of no help. And wasted your time by commenting",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "WalkingHorse",
        "body": "I'm a big fan of regular kelp feeding. I like GS Plant Foods Liquid Kelp Organic.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "plantclinic",
    "post_id": "a8gk4b",
    "title": "Spider mites won’t die. I’ve been using Safer Insect Killer with Seaweed Extract since the early fall. I can get rid of them. They’re not terrible, but I see the webs. What can I do?",
    "url": "https://www.reddit.com/r/plantclinic/comments/a8gk4b/spider_mites_wont_die_ive_been_using_safer_insect/",
    "score": 2,
    "num_comments": 7,
    "created": "2018-12-22T01:29:10+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "panama_reddit7235",
        "body": "Get an insecticide that contains pyrethrum.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "chef71",
        "body": "real neem oil or insecticidal soap. spray every three days for three weeks.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "akoumout",
        "body": "Never heard of this- researching now",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "nebraskacorncorncorn",
        "body": "Safer soap hardly kills all of any infestation in my experience. Especially spider mites.\n\nGet something better. You could try showering it with Azamax (and by shower I mean monsoon and just commit and wear gloves).\nAzamax is basically a concentrated form of the active ingredient in neem oil). Clean off the webs. \n\nI haven't found any spider mites in over a month after using Azamax just once (very very heavily).\nYou may have to do it three times in one month like the instructions say. I only did it once just saying. \n\nThat or like the other person said something with Pyrethrins or also Bifenthrin, or TempoSC. \n\nIf you do predatory mites please share how it went.\n\n\nI hope you can get rid of them quickly :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "neverTooManyPlants",
        "body": "If you can lift it up, wash it thoroughly every day.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "akoumout",
        "body": "Would it get root rot? Or just be careful not to get in the dirt?",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 4,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "Fungalacne",
    "post_id": "wbtwvr",
    "title": "is seaweed extract fa safe",
    "url": "https://www.reddit.com/r/Fungalacne/comments/wbtwvr/is_seaweed_extract_fa_safe/",
    "score": 2,
    "num_comments": 2,
    "created": "2022-07-30T09:55:18+00:00",
    "body": "I found a good niacinamide serum but the seaweed extract is throwing me off because seaweed is a fermented ingredient.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Feeling_Wait_673",
        "body": "Is not fermented seaweed, is seaweed extract, therefore is FA safe.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Egglingg",
        "body": "Thank you very much!!",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "GoodRisingTweets",
    "post_id": "hxmihx",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/GoodRisingTweets/comments/hxmihx/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-25T13:13:57+00:00",
    "body": "",
    "flair_text": "COVID19",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HotPepperGrowing",
    "post_id": "h0gg6a",
    "title": "Today I received an F1 Loco chilli plant from a nursery and it already has about 10 flowers on it despite only being 5 inches tall. Should I leave them or cut them off? When should I start feeding the plant fertiliser - I have some tomorite with seaweed extract. Thanks!",
    "url": "https://www.reddit.com/r/HotPepperGrowing/comments/h0gg6a/today_i_received_an_f1_loco_chilli_plant_from_a/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-06-10T18:08:39+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "aeroponics",
    "post_id": "lgoxyv",
    "title": "Is seaweed extract fertiliser any good?",
    "url": "https://www.reddit.com/r/aeroponics/comments/lgoxyv/is_seaweed_extract_fertiliser_any_good/",
    "score": 2,
    "num_comments": 1,
    "created": "2021-02-10T07:59:46+00:00",
    "body": "Seaweed extract fertiliser seems to be a very cheap option for an NPK and can be bought on Alibaba.com for heater cheap. \nI’m wondering if it’s any good, has anyone had any experience with it? And if not what would you recommend? Thanks",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jyf",
        "body": "i dont think that's cheap compared to wooden powder",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ForUnitedStates",
    "post_id": "rhfdas",
    "title": "Winners announced for Next Gen Fertilizer Challenge by USDA, EPA and Fertilizer Institute (TFI) including nano-smart fertilizers, “Urea 2.0”, nitrapyrin, microbial inoculants, seaweed extract, smart-fertilizers, mixtures and Phosphate Liberation Boosters",
    "url": "https://www.reddit.com/r/ForUnitedStates/comments/rhfdas/winners_announced_for_next_gen_fertilizer/",
    "score": 2,
    "num_comments": 0,
    "created": "2021-12-16T01:48:14+00:00",
    "body": "",
    "flair_text": "Science & Engineering",
    "flair_template_id": "b1b140ca-6c5c-11ea-a37b-0ed4566fafd3",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "northamerica",
    "post_id": "hxzmgj",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus. 'In a test of antiviral effectiveness against the virus that causes COVID-19, an extract from edible seaweeds substantially outperformed remdesivir, the current standard antiviral used to combat the disease.'",
    "url": "https://www.reddit.com/r/northamerica/comments/hxzmgj/in_cell_studies_seaweed_extract_outperforms/",
    "score": 2,
    "num_comments": 0,
    "created": "2020-07-26T03:12:03+00:00",
    "body": "",
    "flair_text": "USA",
    "flair_template_id": "cc651f5e-493d-11e6-9789-0ef7737f0273",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_PeptechBioscience",
    "post_id": "15sieo7",
    "title": "Seaweed Extract (Ascophyllun Nodosum) Bio-Stimulant",
    "url": "https://www.reddit.com/r/u_PeptechBioscience/comments/15sieo7/seaweed_extract_ascophyllun_nodosum_biostimulant/",
    "score": 2,
    "num_comments": 0,
    "created": "2023-08-16T07:08:46+00:00",
    "body": "[Seaweed extracts](https://www.peptechbio.com/product/seaweed-extract-ascophyllum-nodosum/) (*Ascophyllum Nodosum*) contain a wealth of essential nutrients, both major and minor, along with amino acids, vitamins, cytokinins, auxins, and abscisic acid compounds. These components collectively contribute to promoting exceptional plant growth. They are recognized for their capacity to significantly enhance plant growth and yield, often multiplying them manifold. Additionally, these extracts aid in fortifying plants to better withstand environmental stressors, bolstering their resilience. [Read more](https://www.peptechbio.com/product/seaweed-extract-ascophyllum-nodosum/)  \n\\#Liquid\\_Seaweed\\_Concentrate #Liquid\\_seaweed\\_extract #Liquid\\_seaweed\\_fertilizer #Seaweed\\_fertilizer\\_benefits\n\nhttps://preview.redd.it/kl3042d49fib1.png?width=800&format=png&auto=webp&s=2e2184a63224979758c30f7908317ecb6a8e4345",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "vegan",
    "post_id": "o8a3wn",
    "title": "Has anyone found algae omega 3 without carageenan/seaweed extract?",
    "url": "https://www.reddit.com/r/vegan/comments/o8a3wn/has_anyone_found_algae_omega_3_without/",
    "score": 1,
    "num_comments": 3,
    "created": "2021-06-26T12:45:19+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "tardigradesRverycool",
        "body": "I'd recommend looking for liquid supplements instead of the soft gel capsules if you're concerned about that ingredient.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "skellener",
        "body": "Deva Vegan Omega-3 DHA - EPA 500 mg Potency Carrageenan Free https://www.amazon.com/Deva-Vegan-Omega-3-DHA-Manufactured/dp/B08F8K36RP\n\nFood Sensitivity\nFree of yeast, wheat, gluten, sugar, salt, hexane, dairy, egg, fish, shellfish; animal products, byproducts or derivatives.\n\nIngredients\nNon-GMO Tapioca starch, Vegetable Glycerin, Purified Water, High Oleic Sunflower Oil, Mixed Tocopherols, Orange Oil (Organic), Annatto color, Rosemary Extract, Ascorbyl Palmitate. (All of the ingredients are from non-animal sources\n\nOn the Amazon page it does mention microalgae oil extract.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Caffeineandsesame",
        "body": "Sesame seed, hemp seeds, coconuts, olive, and their respective oils contain ample omega 3.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_richie560",
    "post_id": "g7kvoq",
    "title": "Full strength seaweed extract",
    "url": "https://www.reddit.com/r/u_richie560/comments/g7kvoq/full_strength_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-04-25T01:24:35+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_chietxuat",
    "post_id": "fcs3k9",
    "title": "Seaweed extract",
    "url": "https://www.reddit.com/r/u_chietxuat/comments/fcs3k9/seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-03-03T09:21:45+00:00",
    "body": " \n\nSeaweed extract\n\nSeaweed extract is a natural, very safe and non-irritant natural source for skin and hair care products and applications.\n\n\\#chiet\\_xuat\\_tao\\_bien\n\n\\#chiet\\_xuat\\_my\\_pham\n\n\\#chiet\\_xuat\\_tu\\_thien\\_nhien\n\n\\#cong\\_dung\\_cua\\_chiet\\_xuat\\_tao\\_bien\n\n\\#tac\\_dung\\_cua\\_tao\\_bien\n\n[https://chietxuat.com/san-pham/chiet-xuat-tao-bien/](https://chietxuat.com/san-pham/chiet-xuat-tao-bien/)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "1ip6vra",
    "title": "Can I use liquid seaweed extract on my allamanda plant?",
    "url": "https://www.reddit.com/r/gardening/comments/1ip6vra/can_i_use_liquid_seaweed_extract_on_my_allamanda/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-02-14T09:27:58+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "usa",
    "post_id": "rhff4u",
    "title": "USDA, EPA and Fertilizer Institute (TFI) announces Winners for Next Gen Fertilizer Challenge including nano-smart fertilizers, “Urea 2.0”, nitrapyrin, microbial inoculants, seaweed extract, smart-fertilizers, mixtures and Phosphate Liberation Boosters",
    "url": "https://www.reddit.com/r/usa/comments/rhff4u/usda_epa_and_fertilizer_institute_tfi_announces/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-12-16T01:51:03+00:00",
    "body": "",
    "flair_text": "Fluff",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_etopedia",
    "post_id": "h81qta",
    "title": "Organic Seaweed Extract Powder For Cosmetic And Skin Care",
    "url": "https://www.reddit.com/r/u_etopedia/comments/h81qta/organic_seaweed_extract_powder_for_cosmetic_and/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-06-13T05:58:14+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Beautytouch",
    "post_id": "j3tce9",
    "title": "SCARLETT PARIS Purifying Cream Mask, Clay Based Skincare Treatment Containing Seaweed Extract, Removes Oil and Impurities To Restore Radiant Skin, All Natural Skincare Product (3.38 Fl Oz)",
    "url": "https://www.reddit.com/r/Beautytouch/comments/j3tce9/scarlett_paris_purifying_cream_mask_clay_based/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-10-02T12:13:06+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dipak123",
    "post_id": "bog9bo",
    "title": "Global Seaweed Extract Market 2019 by Manufacturers, Regions, Type and Application, Forecast to 2024",
    "url": "https://www.reddit.com/r/Dipak123/comments/bog9bo/global_seaweed_extract_market_2019_by/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-05-14T08:42:38+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_etopedia",
    "post_id": "h8402x",
    "title": "Organic Seaweed Extract Powder For Cosmetic & Skin Care",
    "url": "https://www.reddit.com/r/u_etopedia/comments/h8402x/organic_seaweed_extract_powder_for_cosmetic_skin/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-06-13T09:01:26+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "12rsl16",
    "title": "Humid Acid Soil Conditioner and Seaweed Extract Water Soluble Fertilizer",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/12rsl16/humid_acid_soil_conditioner_and_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-04-19T13:03:05+00:00",
    "body": "They are finally here! You asked, we listened. 😍\n\n[ECOgardener Humic Acid Soil Conditioner and Seaweed Extract Fertilizer](https://preview.redd.it/tfjamiagauua1.jpg?width=1200&format=pjpg&auto=webp&s=165c974ba51e54452df70ccda3e903dd4a746e76)\n\nWe're excited to share that our newest products have just launched - Humid Acid Soil Conditioner and Seaweed Extract Water Soluble Fertilizer. Check them out here: [https://ecogardener.com/](https://ecogardener.com/).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "USGovernment",
    "post_id": "rhfdox",
    "title": "Winners announced for Next Gen Fertilizer Challenge by USDA, EPA and Fertilizer Institute (TFI) including nano-smart fertilizers, “Urea 2.0”, nitrapyrin, microbial inoculants, seaweed extract, smart-fertilizers, mixtures and Phosphate Liberation Boosters",
    "url": "https://www.reddit.com/r/USGovernment/comments/rhfdox/winners_announced_for_next_gen_fertilizer/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-12-16T01:48:53+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "carnivorousplants",
    "post_id": "ywamth",
    "title": "Seaweed extract \"fertilizers\" and carnivores?",
    "url": "https://www.reddit.com/r/carnivorousplants/comments/ywamth/seaweed_extract_fertilizers_and_carnivores/",
    "score": 1,
    "num_comments": 5,
    "created": "2022-11-15T21:48:38+00:00",
    "body": "I recently become proprietor of a batch of bare *Sarracenia* root divisions gotten from the grab-bag sale at California Carnivores. I find myself wondering if it would be a good idea, come spring, to splash some seaweed extract on them. I have some of [this stuff](https://www.amazon.com/Maxicrop-Liquid-Seaweed-Kelp-Extract/dp/B000COBUQC) which was sold to me by an orchid supply house as a root-growth promoter, and I kind of believe that it works for that. At least with orchids.\n\nI could have sworn I saw mention of this kind of thing recently but when I search the sub for \"kelp,\" \"seaweed\", etc. I don't get any hits.\n\nAnyway the extract is ugly black stuff that you're supposed to dilute an ounce with a gallon of water, for watering houseplants. I wonder if anybody has experience with similar products and *Sarracenia* in pots in trays of water. Any insight into dilution, application, etc. \n\nThanks in advance.\n\nEdit: I suppose I should have anticipated that some people would unthinkingly say \"no fertilizers!\" without realizing that this stuff I'm talking about is not fertilizer, in the sense of having plant macronutrients in it. It's supposed to be basically like a growth hormone for roots. In particular I do not think it would be a good idea to put it into the pitchers.",
    "flair_text": "Help",
    "flair_template_id": "db8677e6-b7d5-11ec-b9fe-92f1c5f6b393",
    "comments": [
      {
        "author": "Global-Chemical-6570",
        "body": "Idk about that brand. I use Maxsea 16-16-16 @ 1/4 teaspoon per gallon of water and mist the foliage with a sprayer once a month. Don't add it to the soil or water the plant is sitting in.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Bloorajah",
        "body": "Generally it’s not advisable to add any sort of organic or inorganic nutrient to the soil of bog dwelling carnivorous plants. The reason for this is their habitats don’t have any available nutrients similar to those found in commercial fertilizers, and their metabolism/biology isn’t really equipped to deal with them. Soil nutrients act almost like a poison to many carnivorous plants because evolutionarily, that’s just not how they get their nutrients. \n\nI buy a batch of the bare root sarracenia from California carnivores yearly, and my technique is to just drop them right into a pot of soil (I grow them outside so their dormancy is regulated by my climate, your mileage may vary in this regard) every spring they come right up like clockwork and I never have issues with them. \n\nAll that being said, the short answer is no you should not give them any root based nutrient. \n\nI will suggest though that you dribble some of the diluted seaweed juice into the open pitchers once the time comes. Not a huge amount, but a few drops every week or so. I do this with a solution of maxsea and it makes my plants go crazy.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FakespotAnalysisBot",
        "body": "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Maxicrop Liquid Seaweed (Kelp Extract, 32 Oz \n\n>**Company**: Maxicrop\n\n>**Amazon Product Rating**: 4.7 \n\n>**Fakespot Reviews Grade**: B\n\n>**Adjusted Fakespot Rating**: 4.7\n\n>**Analysis Performed at**: 05-03-2022 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/maxicrop-liquid-seaweed-kelp-extract-32-oz) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "defeater33",
        "body": "I use one with a leaf growth booster with seaweed fertilizer.  Not sure if it works but doesn't harm my Nepenthes.  I spray it on the leafes , ground around the stem and occasionally in a pitcher.  They catch bugs outside for main nutrition though.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rinkarj",
    "post_id": "1iqt16a",
    "title": "सागरिका: फसल बढ़ाने का प्राकृतिक फार्मूला! | Seaweed Extract Benefits",
    "url": "https://www.reddit.com/r/Rinkarj/comments/1iqt16a/सगरक_फसल_बढन_क_परकतक_फरमल_seaweed_extract_benefits/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-02-16T14:13:07+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "newslive",
    "post_id": "ragwhe",
    "title": "Seaweed Extract Stops COVID in Early Testing",
    "url": "https://www.reddit.com/r/newslive/comments/ragwhe/seaweed_extract_stops_covid_in_early_testing/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-12-06T20:30:20+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Advanced_Internet_99",
    "post_id": "z2hdik",
    "title": "Seaweed Extract Market Report (COVID-19 Analysis) by Worldwide Market Trends & Opportunities and Forecast to 2028",
    "url": "https://www.reddit.com/r/u_Advanced_Internet_99/comments/z2hdik/seaweed_extract_market_report_covid19_analysis_by/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-11-23T06:17:32+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Glam_Skincare",
    "post_id": "14laeur",
    "title": "Dry, dehydrated, or aging skin? Seaweed extract provides deep hydration to the skin, improves elasticity, and nourishes with its rich vitamins and minerals, resulting in a plumper and more nourished complexion. Look for products formulated with seaweed extracts to address your skin concerns. My bio.",
    "url": "https://www.reddit.com/r/u_Glam_Skincare/comments/14laeur/dry_dehydrated_or_aging_skin_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-28T14:04:06+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Vedantaorganoworld",
    "post_id": "s7ihwp",
    "title": "Seaweed Extract Fertilizer Supplier in India",
    "url": "https://www.reddit.com/r/u_Vedantaorganoworld/comments/s7ihwp/seaweed_extract_fertilizer_supplier_in_india/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-01-19T05:23:33+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "15n8z83",
    "title": "Feeding Seedlings with Seaweed Extract",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/15n8z83/feeding_seedlings_with_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-08-10T10:46:41+00:00",
    "body": "Seedlings are young, delicate plants that have recently sprouted from seeds. They require proper care to ensure their health and development for several reasons:\n\nTransplanting young plants is often tricky, and sometimes the survival rate isn't 100%. But by nourishing young plants with the right products, you can prepare them better and ensure a higher chance of survival.\n\n***Read:*** [***Seed Starting 101 : A Complete Guide to Seed Starting***](https://ecogardener.com/blogs/news/seed-starting-101-a-complete-guide-to-seed-starting)\n\nFeeding seedlings with seaweed extract can be beneficial for their growth and development. [Seaweed extract is a natural soil conditioner](https://ecogardener.com/products/seaweed-extract-fertilizer-powdered-organic-soil-conditioner) that is derived from seaweed or algae. It contains various essential nutrients and growth-promoting substances that can support the early stages of plant growth.\n\n&#x200B;\n\n[Why Seedlings Require More Care](https://preview.redd.it/nn6y9jzji9hb1.jpg?width=540&format=pjpg&auto=webp&s=953485e0d1c83f7e06ebaf3c1212e300248592ba)\n\n#### Contents \n\n1. [Why Seedlings Require More Care](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1)\n\n* [Nutrient requirements](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-1)\n* [Watering](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-2)\n* [Light exposure](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-3)\n* [Temperature and humidity](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-4)\n* [Protection from pests and diseases](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-5)\n* [Transplanting readiness](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-1-6)\n\n2. [Why Seaweed Extract is Best for Growing Seedlings](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2)\n\n* [Efficient nutrient uptake](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-1)\n* [Teeming with growth hormones](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-2)\n* [Boosts stress tolerance](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-3)\n* [Supports microbial activity](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-4)\n* [Improves root development](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-5)\n* [Organic and environmentally friendly](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-2-6)\n\n3. [Ways to Apply Seaweed Extract to Grow Seedlings](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3)\n\n* [Foliar spray](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3-1)\n* [Soil drench](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3-2)\n* [Seed soaking](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3-3)\n* [Root dips (hydroponic gardens)](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3-4)\n* [Transplant solution](https://ecogardener.com/blogs/news/feeding-seedlings-with-seaweed-extract#content-3-5)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_pprajakta",
    "post_id": "jn9jof",
    "title": "Global Algae Extract Market 2020 Size, Share, Manufacturers, Types, Applications, Supply Chain, Sales Channel and Forecast to 2026 | Absolute Reports",
    "url": "https://www.reddit.com/r/u_pprajakta/comments/jn9jof/global_algae_extract_market_2020_size_share/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-11-03T12:38:47+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14frzoe",
    "title": "Seaweed Extract for Vegetable Gardens",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14frzoe/seaweed_extract_for_vegetable_gardens/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-22T03:22:25+00:00",
    "body": "Vegetables and fruit-bearing crops require more nutrients to achieve higher yields. That’s why it’s vital to grow crops in nutrient-rich soils. That said, not all garden soils are created equally – some lack the basic nutrients plants need to grow healthy. On top of that, nutrients absorbed by previous crops must be replenished to support next season’s crops.\n\n&#x200B;\n\n[Vegetable Garden](https://preview.redd.it/dfs8c0stmh7b1.jpg?width=540&format=pjpg&auto=webp&s=ca9ada0ae899cbab675a0275bf5fa77eca6bb4e1)\n\n[Amending the soil](https://ecogardener.com/blogs/news/garden-soil-amendment-vs-fertilizer) with nutrient-rich, natural additives is crucial in supporting healthy plant growth and ensuring more harvests. There are many products you can use as soil conditioners; one of the most popular is seaweed extract.\n\n[Seaweed extract](https://ecogardener.com/blogs/news/everything-you-need-to-know-about-seaweed-extract) is packed with essential nutrients that support healthy plant growth. It’s also loaded with trace minerals and antioxidants that strengthen plants’ resistance to diseases and pests. As a soil conditioner, seaweed extract brings nutrients back into the soil, ensuring that the next growing cycle will be as successful as the last.\n\n&#x200B;\n\n1. [Is seaweed extract good for a vegetable garden?](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1)\n\n* [How do you use seaweed extract for vegetables?](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1-2)\n   * [As a fertilizer](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1-3)\n   * [Liquid fertilizer](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1-4)\n   * [Foliar Spray](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1-5)\n* [When to fertilize your vegetable garden?](https://ecogardener.com/blogs/news/seaweed-extract-for-vegetable-gardens#content-1-6)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndustrialPharmacy",
    "post_id": "belbjw",
    "title": "Seaweed extract may help design new drugs",
    "url": "https://www.reddit.com/r/IndustrialPharmacy/comments/belbjw/seaweed_extract_may_help_design_new_drugs/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-04-18T13:05:09+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "OrganicGardening",
    "post_id": "16t9w9a",
    "title": "Expired Seaweed extract still usable?",
    "url": "https://www.reddit.com/r/OrganicGardening/comments/16t9w9a/expired_seaweed_extract_still_usable/",
    "score": 1,
    "num_comments": 6,
    "created": "2023-09-27T03:47:24+00:00",
    "body": "I have a 250ml bottle of seaweed extract with manufactured date: July - 2020 and 'use within' period of 2 years from manufacturing. I plan on using it on my hot pepper plants. I noticed that the odor it used to have is absent now. There used to be a strong smell to it before but now it's completely devoid of any odour, still has the same pitch black colour though. Question is is it still going to be effective? Is it safe to use? Suggestions are appreciated.",
    "flair_text": "question",
    "flair_template_id": "0f900e98-3cdb-11eb-bf22-0e1e1362d92d",
    "comments": [
      {
        "author": "AdditionalAd9794",
        "body": "Bacteria and biology might have died off expired. Is it even that kind of product?\n\nIt should be fine, wouldn't be surprised if it isn't better old",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "TheRipeTomatoFarms",
        "body": "If there's microbes and bacteria, the benefit of those will be gone. As for elements and nutrients, likely unchanged and still usable.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AdditionalAd9794",
        "body": "Usually they do, example this product \n\nhttps://sdmicrobeworks.com/products/kelp-fermented-plant-extract-fpe?variant=43723275698407\n\nThough you never stated which product your using so, I have no idea",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "vishal_pvk",
        "body": "I there inherently even any bacteria and microbiology in it with all the acids and preservatives they use in making?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "vishal_pvk",
        "body": "It's a brand called \"Organic Dews\" sold here in India. Just because you asked. They have good reviews.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 2,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "u_Vedantaorganoworld",
    "post_id": "rxa08j",
    "title": "Seaweed Extract Fertilizer Supplier in India",
    "url": "https://www.reddit.com/r/u_Vedantaorganoworld/comments/rxa08j/seaweed_extract_fertilizer_supplier_in_india/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-01-06T08:55:00+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "RunandBuy",
    "post_id": "16zbesc",
    "title": "$9.99 (Reg. $19.99) Kimtrue Seaweed Extract Hair Conditioner for Damaged and Frizzy Dry Hair, 16.9 fl oz",
    "url": "https://www.reddit.com/r/RunandBuy/comments/16zbesc/999_reg_1999_kimtrue_seaweed_extract_hair/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-10-04T02:36:14+00:00",
    "body": "",
    "flair_text": "Amazon",
    "flair_template_id": "d74862fe-6445-11ec-84ab-8e44f694ec91",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Humicchina",
    "post_id": "x9repa",
    "title": "Soluble Seaweed Extract",
    "url": "https://www.reddit.com/r/u_Humicchina/comments/x9repa/soluble_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-09-09T09:59:33+00:00",
    "body": "There are numerous benefits when comparing soluble fertilizers to solid or semi-solid fertilizers. Liquid fertilizers may be easily dissolved by the soil and then dispersed to all of the stems, roots, leaves, and other portions of plants and trees. A greater grade of [soluble seaweed extract](https://www.humicchina.com/seaweed-extract) is available in humicchina. It improves the composition of the soil. It strengthens the root system and promotes the germination of new seeds.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Leely1668",
    "post_id": "13krqzw",
    "title": "Haematococcus Pluvialis Algae Extract",
    "url": "https://www.reddit.com/r/u_Leely1668/comments/13krqzw/haematococcus_pluvialis_algae_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-05-18T07:34:38+00:00",
    "body": " Haematococcus pluvialis is a freshwater species with high content of the strong antioxidant astaxanthin, Haematococcus Pluvialis Algae Extract Astaxanthin is important both in nutritional supplements and cosmetics. \n\n[https://www.kingherbs.cn/plant-extracts-for-human-health/natural-health-suppletments/haematococcus-pluvialis-algae-extract.html](https://www.kingherbs.cn/plant-extracts-for-human-health/natural-health-suppletments/haematococcus-pluvialis-algae-extract.html)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "dapsCA",
    "post_id": "eurmfv",
    "title": "L'Oreal Paris Pure-Clay Cleansing Mask with 3 Mineral Clays + Seaweed Extract, Comforts and Unifies Sensitive Skin, 50 ml - $7 CAD (lowest)",
    "url": "https://www.reddit.com/r/dapsCA/comments/eurmfv/loreal_paris_pureclay_cleansing_mask_with_3/",
    "score": 1,
    "num_comments": 1,
    "created": "2020-01-27T18:02:02+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "flipzone",
        "body": "[price history](https://charts.camelcamelcamel.com/ca/B06XDLLLB6/amazon.png?force=1&desired=true&legend=0&ilt=1&tp=all&zero=0&fo=1&h=286&w=588&lang=en)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "THEHINDUauto",
    "post_id": "dtvsdi",
    "title": "[Tech] - Seaweed extract shows anti-retroviral activity",
    "url": "https://www.reddit.com/r/THEHINDUauto/comments/dtvsdi/tech_seaweed_extract_shows_antiretroviral_activity/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-09T13:17:15+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14j6jkd",
    "title": "Seaweed Extract Soil Conditioner To Improve Your Lawn",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14j6jkd/seaweed_extract_soil_conditioner_to_improve_your/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-26T04:01:16+00:00",
    "body": "Looking for a [**natural soil conditioner**](https://ecogardener.com/collections/ecogardener-fertilizers) that will nourish your lawn and make the grass greener and healthier? Try seaweed extract as a soil conditioner.\n\n[Seaweed Extract Soil Conditioner for Lawn](https://preview.redd.it/71ghytjcda8b1.jpg?width=540&format=pjpg&auto=webp&s=cfaa94a3871fce833872ff25e6ea3fc9d0d74e7e)\n\nAs a soil amendment, seaweed extract is a potent [natural fertilizer](https://ecogardener.com/blogs/news/all-you-need-to-know-about-organic-fertilizer) to help decorative grass grow stronger, healthier, and greener. If you’re new to seaweed extract and would like to know how to apply it properly and how it will benefit your lawn, this guide is for you:\n\n*Looking for raised bed planters?* [***Check out our Raised Bed Planters here***](https://ecogardener.com/collections/raised-bed-planters)*!*\n\n&#x200B;\n\n1. [What is Seaweed Extract Fertilizer?](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-01)\n2. [Why is Seaweed Great for Lawns?](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-2)\n\n* [Benefits of Seaweed Extract as Lawn Food](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-3)\n   * [Supports Microbial Activity](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-4)\n   * [Rich in Essential Nutrients](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-5)\n   * [Slow Release of Nutrients](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-6)\n   * [Boosts Immunity](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-7)\n* [How To Apply Seaweed To Your Lawn?](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-8)\n   * [Step 1: Choose for high-quality seaweed soil conditioner](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-9)\n   * [Step 2: Create the seaweed extract solution](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-10)\n   * [Step 3: Repeat the application](https://ecogardener.com/blogs/news/seaweed-extract-soil-conditioner-to-improve-your-lawn#content-1-11)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "unremovable",
    "post_id": "hy7o4x",
    "title": "In cell studies, seaweed extract outperforms remdesivir in blocking COVID-19 virus",
    "url": "https://www.reddit.com/r/unremovable/comments/hy7o4x/in_cell_studies_seaweed_extract_outperforms/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-26T14:18:02+00:00",
    "body": "",
    "flair_text": "[ futurology ]",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_priyakadam137",
    "post_id": "bizyh2",
    "title": "Global Algae Extract Market: Sales, Consumption, Demand and Forecast 2019-2025): Making Cosmetics(US), EWG's Skin Deep(US), Paula's Choice(US), Ingredients To die For(US), SpecialChem(US), etc.",
    "url": "https://www.reddit.com/r/u_priyakadam137/comments/bizyh2/global_algae_extract_market_sales_consumption/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-04-30T06:10:54+00:00",
    "body": " \n\nhttps://preview.redd.it/x30m35nafcv21.jpg?width=700&format=pjpg&auto=webp&s=d4203fcf65999be90634f4c0bf2fef6a72fdd886\n\n&#x200B;\n\nThe research study, titled “Global [**Algae Extract market**](https://www.acquiremarketresearch.com/industry-reports/algae-extract-market/34637/) Research Report 2019,” evaluates the historical performance and the current status of this market for a detailed understanding, emphasizing especially on the dynamics of the demand and supply of Algae Extract in 2025.  \n\n\nThis report presents a detailed study of the global market for Algae Extract by evaluating the growth drivers, restraining factors, and opportunities at length. The examination of the prominent trends, driving forces, and the challenges assist the market participants and stakeholders to understand the issues they will have to face while operating in the worldwide market for Algae Extract in the long run.  \n\n\n**Request for Sample Report Here @** [**https://www.acquiremarketresearch.com/sample-request/34637/**](https://www.acquiremarketresearch.com/sample-request/34637/)  \n\n\nThe research study further offers a study of the existing status of the key regional markets for Algae Extract, namely, China, North America, Eastern Europe, Western Europe, Japan, the Middle East and Africa, and the Rest of Asia, on the basis of a number of significant Algae Extract market parameters, such as, the production volume, pricing of the product, production capacity, sales, demand and supply dynamics, revenue, and the rate of growth of this Algae Extract market in each of the regions.  \n\n\nSeveral segments of the worldwide Algae Extract market have also been discussed in this research report with thorough information, considering their historical and existing performance in the global arena.  \n\n\nIt further maps the competitive landscape of this Algae Extract market by evaluating the company profiles of the leading market players, such as  **Making Cosmetics(US), EWG's Skin Deep(US), Paula's Choice(US), Ingredients To die For(US), SpecialChem(US), Essentials by CatalinaInc.(US), Aromantic Ltd(UK), dfi(SWFL Inc)(CN), True Natural Group Inc(US), Formulator Sample Shop(US), Thalion(France), SourceVital(US)**  \n\n\n**On the basis of the product, the market has been classified into:** Seaweed, Microalgae  \n\n\n**Based on the application, the market has been categorized into:**  Fertilizer, Cosmetics, Food  \n\n\n**For More Information On This Report, Please Visit @** [**https://www.acquiremarketresearch.com/industry-reports/algae-extract-market/34637/**](https://www.acquiremarketresearch.com/industry-reports/algae-extract-market/34637/)   \n\n\nThe growth trajectory of each of the segments has been provided in this study, in global terms and in each of the regional markets, creating a descriptive analysis of the overall Algae Extract market.  \n\n\nThis research study has also discussed the current and the upcoming ventures in the worldwide market for Algae Extract at length, making it of special value for companies, consultants, and other stakeholders functioning in this Algae Extract market.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_psci_mediamarketing",
    "post_id": "aqxvug",
    "title": "Natural Seaweed Extract Toner - Perfect Skin Care, Inc.",
    "url": "https://www.reddit.com/r/u_psci_mediamarketing/comments/aqxvug/natural_seaweed_extract_toner_perfect_skin_care/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-02-15T15:50:16+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_weightlossstories",
    "post_id": "thbogm",
    "title": "Healthy Weight Loss Diet Superstar - Brown Seaweed Extract ID-alG (TM)",
    "url": "https://www.reddit.com/r/u_weightlossstories/comments/thbogm/healthy_weight_loss_diet_superstar_brown_seaweed/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-03-18T18:25:22+00:00",
    "body": "&#x200B;\n\nhttps://www.weightlossstories.net/healthy-weight-loss-diet-superstar-brown-seaweed-extract-id-alg-tm/",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_foreverbloomskincare",
    "post_id": "g3k1n6",
    "title": "AQUA MARINE CLEANSER - A gentle facial cleansing gelée containing algae extract and sucrose cocoate. It is non-drying and recommended for all skin types.",
    "url": "https://www.reddit.com/r/u_foreverbloomskincare/comments/g3k1n6/aqua_marine_cleanser_a_gentle_facial_cleansing/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-04-18T08:12:52+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Beautytouch",
    "post_id": "iyd5lc",
    "title": "Neutrogena Prep + Correct Primer for Tone Correcting, Peach-Toned Makeup Primer with Seaweed Extract to Help Even Skin Tone & Reduce Dark Spots, 1.0 oz",
    "url": "https://www.reddit.com/r/Beautytouch/comments/iyd5lc/neutrogena_prep_correct_primer_for_tone/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-09-23T16:13:24+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14hgg7d",
    "title": "Seaweed Extract for Flower Beds",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14hgg7d/seaweed_extract_for_flower_beds/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-24T02:02:28+00:00",
    "body": "Seaweed extract is one of the [**most popular soil conditioners**](https://ecogardener.com/collections/ecogardener-fertilizers/products/seaweed-extract-fertilizer-flake-organic-soil-conditioner) because it’s a rich source of essential nutrients for plant growth. It’s also packed with antioxidants that strengthen plant immunity against pests and diseases while supporting the development of more vigorous roots.\n\n&#x200B;\n\n[Using Seaweed extract for Flower Beds](https://preview.redd.it/72hivebbiv7b1.jpg?width=540&format=pjpg&auto=webp&s=2e3cb6c1becc9e140caca07b1e74c609b25caa3d)\n\nSeaweed extract is made from fermented brown algae, or kelp. The marine plants are rinsed and dried to remove pathogens and impurities before being soaked in water for 2 to 4 weeks to create a slurry. The slurry is collected and processed into flake or powder form. It is used by diluting the seaweed extract and spraying it on plants.\n\nSeaweed extract is versatile; it can be applied to any garden part – including flower beds. In this guide, let’s get to know more about the [benefits of seaweed extract](https://ecogardener.com/blogs/news/everything-you-need-to-know-about-seaweed-extract) for flowering plants and [garden beds](https://ecogardener.com/blogs/news/top-10-reasons-to-use-raised-beds-in-the-garden).\n\n*Looking for raised bed planters?* [***Check out our Raised Bed Planters here***](https://ecogardener.com/collections/raised-bed-planters)*!*\n\n1. [Is seaweed good for flower beds?](https://ecogardener.com/blogs/news/seaweed-extract-for-flower-beds#content-01)\n2. [Is seaweed extract suitable for flowering plants?](https://ecogardener.com/blogs/news/seaweed-extract-for-flower-beds#content-1-2)\n\n* [Flowering Plants that Benefit from Seaweed Fertilizer](https://ecogardener.com/blogs/news/seaweed-extract-for-flower-beds#content-1-3)\n* [How To Apply Seaweed Fertilizer In Your Garden?](https://ecogardener.com/blogs/news/seaweed-extract-for-flower-beds#content-1-4)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SDauto",
    "post_id": "hx3zc1",
    "title": "[Environment] - In cell studies, seaweed extract outperforms remdesivir in blocking COVID-19 virus",
    "url": "https://www.reddit.com/r/SDauto/comments/hx3zc1/environment_in_cell_studies_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-24T15:39:18+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "usanews",
    "post_id": "hxzlk0",
    "title": "In Cell Studies, Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus",
    "url": "https://www.reddit.com/r/usanews/comments/hxzlk0/in_cell_studies_seaweed_extract_outperforms/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-26T03:10:04+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AutoNewspaper",
    "post_id": "hx4fic",
    "title": "[Environment] - In cell studies, seaweed extract outperforms remdesivir in blocking COVID-19 virus | ScienceDaily",
    "url": "https://www.reddit.com/r/AutoNewspaper/comments/hx4fic/environment_in_cell_studies_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-24T16:04:10+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "1auejrr",
    "title": "GrowMore Seaweed Extract - usage suggestions",
    "url": "https://www.reddit.com/r/gardening/comments/1auejrr/growmore_seaweed_extract_usage_suggestions/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-02-19T04:30:43+00:00",
    "body": "Howdie gardeners, got this stuff on a recommendation from a landscaper to use for transplants but can’t find actual guidelines how to use it. \n\nDoes anyone have any experience using this for any indoor/outdoor gardening projects in ANY capacity?\n\nAll suggestions are useful, thanks in advance!\n\nLocation:  Zone 10b",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14axjgp",
    "title": "Seaweed Extract for Foliar Spray",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14axjgp/seaweed_extract_for_foliar_spray/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-16T13:56:37+00:00",
    "body": "Marine plants have been used in agriculture for decades because they are rich in nutrients and antioxidants that promote better plant health. Because seaweed extract dilutes in water completely, it’s often applied as a foliar spray. In this guide, let’s learn more about the [benefits of seaweed extract](https://ecogardener.com/blogs/news/everything-you-need-to-know-about-seaweed-extract) as a foliar spray and how to apply foliar spray properly to your crops.\n\n&#x200B;\n\n[ How do you use seaweed extract as a foliar spray?](https://preview.redd.it/jx5glgmeyd6b1.jpg?width=540&format=pjpg&auto=webp&s=a843b38740832fdc42d5e82dd0426a4ec697b565)\n\n1. [Benefits of Seaweed Extract to Plants](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1)\n2. [Important Plant Hormones in Seaweed](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1)\n\n* [What is a foliar application?](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1-3)\n* [Is seaweed good for foliar spray?](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1-4)\n* [How do you make seaweed foliar spray?](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1-5)\n* [How do you use seaweed extract as a foliar spray?](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1-6)\n* [How often do you use seaweed foliar spray?](https://ecogardener.com/blogs/news/seaweed-extract-for-foliar-spray#content-1-7)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Humicchina",
    "post_id": "vzixlz",
    "title": "Use seaweed extract fertilizer in your garden",
    "url": "https://www.reddit.com/r/u_Humicchina/comments/vzixlz/use_seaweed_extract_fertilizer_in_your_garden/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-07-15T07:48:03+00:00",
    "body": " There are many people who are not aware of the fact that seaweed extract fertilizer promotes plant growth.  In today’s age, [**seaweed extract fertilizers**](https://www.humicchina.com/14-16-seaweed-extract) are available in commercial stores as well. You can find it on the online platform.  For more info visit: [https://theomnibuzz.com/use-seaweed-extract-fertilizer-in-your-garden/](https://theomnibuzz.com/use-seaweed-extract-fertilizer-in-your-garden/)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "bprogramming",
    "post_id": "hyckp9",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking Covid-19",
    "url": "https://www.reddit.com/r/bprogramming/comments/hyckp9/seaweed_extract_outperforms_remdesivir_in/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-26T19:02:06+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "15w37h5",
    "title": "Which Plants Benefit from Seaweed Extract?",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/15w37h5/which_plants_benefit_from_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-08-20T06:05:13+00:00",
    "body": "Seaweed is renowned for its high concentration of essential nutrients, including nitrogen, phosphorus, potassium, and trace elements such as iron, zinc, and magnesium. These nutrients are crucial for plant growth, development, and overall vigor.\n\n&#x200B;\n\n[ Seaweed extract contains a rich array of nutrients, including micronutrients, minerals, vitamins, and plant growth hormones. As a result, it can benefit a wide range of plants, both in gardens and agricultural settings. Check out this blog to see the list of plants that can benefit from seaweed extract. ](https://preview.redd.it/llzzki8ih7jb1.jpg?width=540&format=pjpg&auto=webp&s=2d94758636e6643d3869cf818ea1e384798fe197)\n\nAdditionally, seaweed contains natural growth hormones like auxins, cytokinins, and gibberellins, which regulate plant growth processes and enhance root development. That's why seaweed is collected and extracted as a [soil amendment.](https://ecogardener.com/collections/ecogardener-fertilizers)\n\nWhat plants will benefit the most from seaweed extract? Continue reading below to find out.\n\n[What is Seaweed Extract?](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-1)\n\n* [Improved soil structure and microbial activity](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-1-1)\n* [Stimulated root growth](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-1-2)\n* [Enhanced plant health and vitality](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-1-3)\n* [Organic and eco-friendly](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-1-4)\n\n[Is Seaweed Extract Good for All Plants?](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-2)\n\n[How to Apply Seaweed Extract](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-3)\n\n* [Soil drenching](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-3-1)\n* [Foliar spraying](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-3-2)\n* [Root dip](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-3-3)\n\n[Factors To Consider Before Applying Seaweed Extract](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4)\n\n* [Dilution](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4-1)\n* [Timing](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4-2)\n* [Frequency](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4-3)\n* [Avoid over-application](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4-4)\n* [Complementary use](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-4-5)\n\n[Buy Seaweed Extract at ECOgardener](https://ecogardener.com/blogs/news/which-plants-benefit-from-seaweed-extract#content-5)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "BiocharToday",
    "post_id": "1hs4cft",
    "title": "Enhancing Copper Tolerance in Hemp Using Biochar, Fungi, and Seaweed Extract",
    "url": "https://www.reddit.com/r/BiocharToday/comments/1hs4cft/enhancing_copper_tolerance_in_hemp_using_biochar/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-01-02T21:01:33+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "news_release",
    "post_id": "1hklmbi",
    "title": "Seaweed Extract Market Report: A Comprehensive Overview of Key Developments -- The Seaweed Extract Market Report offers... ...",
    "url": "https://www.reddit.com/r/news_release/comments/1hklmbi/seaweed_extract_market_report_a_comprehensive/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-12-23T11:13:51+00:00",
    "body": "",
    "flair_text": "Business",
    "flair_template_id": "5ae84dfc-8ca1-11ed-ab18-0a0be23dd343",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Vedantaorganoworld",
    "post_id": "rndsvn",
    "title": "Seaweed Extract Fertilizer Supplier in India",
    "url": "https://www.reddit.com/r/u_Vedantaorganoworld/comments/rndsvn/seaweed_extract_fertilizer_supplier_in_india/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-12-24T04:18:49+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "BiologyPreprints",
    "post_id": "9a8tpj",
    "title": "Effects of green seaweed extract on Arabidopsis early development suggest roles for hormone signalling in plant responses to algal fertilisers",
    "url": "https://www.reddit.com/r/BiologyPreprints/comments/9a8tpj/effects_of_green_seaweed_extract_on_arabidopsis/",
    "score": 1,
    "num_comments": 0,
    "created": "2018-08-25T18:10:38+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "PepperLovers",
    "post_id": "jfrh64",
    "title": "Is it smart to use water soluble seaweed extract as a fertilizer for young plants?",
    "url": "https://www.reddit.com/r/PepperLovers/comments/jfrh64/is_it_smart_to_use_water_soluble_seaweed_extract/",
    "score": 1,
    "num_comments": 2,
    "created": "2020-10-22T02:49:31+00:00",
    "body": "Hi. I'm growing a variety of hot peppers including scotch bonnets, jalapenos, reapers, ghosts, scorpions, etc. Most are very young. My question is about whether to use seaweed extract (solution with water) as a once-in-a-while fertilizer? Is this safe? Should the fertilizer be diluted more than the recommended solution on the package?\n\nFor reference, here is one that I'm considering (I'm in Thailand, I have to buy what's available here). I don't know if the NPK values are appropriate, and if the PH is too high (listed as PH of 8). It also seems to have quite a high level of potassium, not sure if that's appropriate at this early stage.\n\n[https://www.lazada.co.th/products/seaweed-extract-1-kg-i468434592-s857246582.html](https://www.lazada.co.th/products/seaweed-extract-1-kg-i468434592-s857246582.html)\n\nFor further information, my plants are grown outdoors in cups and pots, and given sun through plant shading when the sun is available. But now during rainy season I have just begun using LED lights.\n\nThanks for any input",
    "flair_text": "Plant Maintenance",
    "flair_template_id": "76e1492a-62d2-11e9-b43c-0ec92f570086",
    "comments": [
      {
        "author": "RepentReddit",
        "body": "Look at the label at the back of the product if it indicates what dilution to use on every stage of the plant. If you are sure it is organic then you may just follow the recommended dilution on the back",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "macnmotion",
        "body": "I've sent a message to the seller to ask if they will send a photo of the instructions/label.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "SemiHydro",
    "post_id": "1c9eu2d",
    "title": "Can i transfer to leca if i used seaweed extract in rooting",
    "url": "https://www.reddit.com/r/SemiHydro/comments/1c9eu2d/can_i_transfer_to_leca_if_i_used_seaweed_extract/",
    "score": 1,
    "num_comments": 2,
    "created": "2024-04-21T10:39:49+00:00",
    "body": "I rooted a monstera albo cutting in perlite and used some seaweed extract and fertilizer with it. I noticed that it started growing some algae because i was dumb and kept it in a clear container. I am ready to transfer it to leca but now i'm wondering whether the fact that i used seaweed + fertilizer and that it might have some algae could cause any issues? Should i keep it in just water (no fertilizer etc.) for a while or something? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "aidaoly",
        "body": "https://preview.redd.it/976q8xcdctvc1.png?width=3024&format=png&auto=webp&s=013446af207a73ecf29378a290c69190c30bb67c\n\nHere are the roots, i tried to remove the perlite bits as well as i could yesterday but there are still some left. Some of the tips are a tiny bit brownish, i'm not sure if this is normal or if i just managed to damage them or if they had enough time to dry out a bit when i was picking the perlite bits off. I'm keeping it in this random pot in water for now/until i know what to do next.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "takeachancymf",
        "body": "I also think it’s good to go in leca after another easy rinse. I’d use just water in the leca for the first week or two so it can acclimate easily. This is what I did.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_PeteBosman",
    "post_id": "1kk0fd6",
    "title": "How to fertilize orchids with seaweed extract #orchidcare #orchids #orchid #seaweedfertilizer #kelpfertilizer #orchidfertilizers #seaweedfororchids #keplextract #auxins #planthormones #orchidworld #orchidlovers #orchidgrowers #growingorchids #orchidfood #feedingorchids",
    "url": "https://www.reddit.com/r/u_PeteBosman/comments/1kk0fd6/how_to_fertilize_orchids_with_seaweed_extract/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-05-11T12:57:30+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "containergardening",
    "post_id": "1ksp5ky",
    "title": "Should one ‘wash off’ seaweed extract?",
    "url": "https://www.reddit.com/r/containergardening/comments/1ksp5ky/should_one_wash_off_seaweed_extract/",
    "score": 1,
    "num_comments": 3,
    "created": "2025-05-22T12:14:08+00:00",
    "body": "I recently bought seaweed extract to fertilize my plants. The instructions said I should mix it with water and spray the mixture on the plants on either a cloudy day or at the end of the day when the sun sets. The instructions also said I should wash it off the plants a day after application, preferably during full sun. \n\nDoes anyone have experience with this last step? It’s the first time I heard about it. \n\nAlso: am I correct in thinking that  seaweed extract is okay to use on all plants? Might be a little late to ask as I already used it on lettuce, arugula, a strawberry plant, potato plants, a small apple tree, edible flowers, swiss chard, tomato plants, a red chili plant,  pak choy, all my kitchen herbs and all decorative plants (fargesia, forsythia, clematis, etc) on my deck. I would still like to know if I wasn’t supposed to, so I don’t repeat something that could potentially harm my plants. \n\n(My city deck now smells amazing, btw. Almost coastal. 🥰) \n\n\n\n",
    "flair_text": "Question",
    "flair_template_id": "891563d6-d32e-11ec-8a9a-9afd685e9cde",
    "comments": [
      {
        "author": "Swimming-Tension-703",
        "body": "I think you should stay away from any foliar spray.  put that in a soil drench instead",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Swimming-Tension-703",
        "body": "Yes.....I think that getting your leaves wet just opens the door to disease.  You know that real farmers who grow in greenhouses, constantly feed their plants with liquid food in drip irrigation, so you could fertilize more often with less fertilizer, including this seaweed extract.  Call it micro dosing , to borrow a term used in silicon valley.  Your plants need food all the time",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Morenapsforall",
        "body": "According to the instructions on the bottle it can also be diluted in water and given in the soil, but the absorption might be less than ideal. I was a little skeptical about that last part. \n\nDo you care to elaborate why you prefer to stay away from any foliar spray? (Only if you feel like it. I’m a very curious person.)",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "news_release",
    "post_id": "1j4upm4",
    "title": "U.S. Seaweed Extract Market Outlook: Transformational Growth is Predicted Through 2035 -- \\ U.S. Seaweed Extract Market Outlook\\ Bas... ...",
    "url": "https://www.reddit.com/r/news_release/comments/1j4upm4/us_seaweed_extract_market_outlook/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-03-06T12:49:23+00:00",
    "body": "",
    "flair_text": "Business",
    "flair_template_id": "5ae84dfc-8ca1-11ed-ab18-0a0be23dd343",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Vedantaorganoworld",
    "post_id": "sv9d69",
    "title": "Best-One of the Seaweed Extract Fertilizer Supplier in India",
    "url": "https://www.reddit.com/r/u_Vedantaorganoworld/comments/sv9d69/bestone_of_the_seaweed_extract_fertilizer/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-02-18T04:54:42+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AutoNewspaper",
    "post_id": "dtvtz9",
    "title": "[Tech] - Seaweed extract shows anti-retroviral activity | The Hindu",
    "url": "https://www.reddit.com/r/AutoNewspaper/comments/dtvtz9/tech_seaweed_extract_shows_antiretroviral/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-09T13:21:26+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Scholar",
    "post_id": "15tj88k",
    "title": "[Article] Inhibitory Effects of Marine Algae Extract on Adipocyte Differentiation and Pancreatic Lipase Activity",
    "url": "https://www.reddit.com/r/Scholar/comments/15tj88k/article_inhibitory_effects_of_marine_algae/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-08-17T10:14:16+00:00",
    "body": "URL: [https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11129679](https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11129679)\n\nArticle behind Korean paywall. Thank you ahead.\n\n&#x200B;",
    "flair_text": "Requesting",
    "flair_template_id": "4cc58e3c-df50-11e7-8fd6-0e0b96410e6a",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "citral",
    "post_id": "4n9o1x",
    "title": "Seaweed extract to reduce chemicals in gas and oil production",
    "url": "https://www.reddit.com/r/citral/comments/4n9o1x/seaweed_extract_to_reduce_chemicals_in_gas_and/",
    "score": 1,
    "num_comments": 0,
    "created": "2016-06-09T06:53:17+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "removalbot",
    "post_id": "hykp48",
    "title": "07-27 03:25 - 'Seaweed Extract Outperforms Remdesivir in Blocking COVID-19' (labroots.com) by /u/tahutahut removed from /r/worldnews within 739-749min",
    "url": "https://www.reddit.com/r/removalbot/comments/hykp48/0727_0325_seaweed_extract_outperforms_remdesivir/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-07-27T03:25:04+00:00",
    "body": "[Seaweed Extract Outperforms Remdesivir in Blocking COVID-19](https://reddit.com//r/worldnews/comments/hy89sf)\n\n[Go1dfish undelete link](http://r.go1dfish.me/r/worldnews/comments/hy89sf)\n\n[unreddit undelete link](https://unreddit.com/r/worldnews/comments/hy89sf)\n\nAuthor: /u/tahutahut",
    "flair_text": "submission-worldnews",
    "flair_template_id": "903c2b84-b044-11e7-bbc8-0e1c3d37f7f6",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_pmrfood",
    "post_id": "g1s9ph",
    "title": "Seaweed Extract Market Shares, Growth Analysis, Trends, Industry Size, Demand And Forecast Research To 2026",
    "url": "https://www.reddit.com/r/u_pmrfood/comments/g1s9ph/seaweed_extract_market_shares_growth_analysis/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-04-15T13:50:03+00:00",
    "body": "Seaweed is a macroalga that grows in the cold oceans globally. It has been used for millennium all over the world; however, it has most particularly been a prominent part of Asian food diets mainly in Japan, China, and Korea. The seaweed is good for mulch in the home garden, but owing to lack of nutrients and various other components found on the algae, the extract is more beneficial to fertility. Dried seaweed used mainly as an animal feed supplement and also as a fertilizer and soil conditioner. Seaweed extract is rich in minerals and vitamins that help to soften, soothe, reduce sensitivity along with maintaining skin’s natural stability. It is extracted by various production methods namely water extraction, alkaline extraction, ruptured cell suspensions, and cryo-micro-crushing. Seaweed extract performs as a plant growth stimulants and their efficiency could be influenced by the species and production technique. Seaweed extract has a soothing marine botanical feature that releases skin irritation affected by the environment.\n\n**To Get Free Sample Request Visit @** [**https://www.persistencemarketresearch.com/samples/21631**](https://www.persistencemarketresearch.com/samples/21631)\n\n**Seaweed Extract Market: Drivers and Restraints**\n\nExpanding demand for organic products, rise in growth of the marine industry, increasing innovative technology, and growing research and development activities are some of the primary factors driving the growth of the global seaweed extract market. Moreover, it is considered to be an inexhaustible source of health, and extensive use of seaweed extract in various thalassotherapy centers worldwide are another significant factors growing the seaweed extract market over the forecast period. However, the high cost of production, and government regulations which may limit the growth of the Seaweed Extract market during the forecast the period.\n\n**Seaweed Extract Market: Segmentation**\n\nThe seaweed extract market has been classified by form type and end-use industries.\n\nBased on the form type, the seaweed extract market is segmented into the following:\n\n* Liquid\n* Powder\n* Flakes\n* Others\n\nBased on the end-use industries, the seaweed extract market is segmented into the following:\n\n* Food and Beverages\n* Cosmetics and Personal Care\n* Healthcare\n* Agriculture & Horticulture\n* Others\n\n**Seaweed Extract Market: Overview**\n\nSeaweed extract market revenue is expected to grow at a rapid growth rate, over the forecast period. The market is projected to perform well in the near future owing to its favorable effects on crops growth and quality such as higher marketable yield, improve shelf life, strong, healthy growth, and enhance resistance to pest and disease. Various researchers have proved benefits such as enhanced root development, more dynamic growth, improved resistance to environmental stress, and minimize frost damage. Additionally, the presence of natural active components in seaweed extract that helps in regeneration of skin along with effective hydration is the main factor that can propel the market revenue growth of seaweed extract in the near future. Based on end-use industries, cosmetics and personal care segment are projected have a significant growth in the global seaweed extract market over the forecast period attributed to its anti-inflammatory and anti-aging properties coupled with improving agriculture system globally.\n\n**Request For TOC @** [**https://www.persistencemarketresearch.com/toc/21631**](https://www.persistencemarketresearch.com/toc/21631)\n\n**Seaweed Extract Market: Region-wise Outlook**\n\nDepending on the geographic region, the seaweed extract market is classified into seven key regions: North America, Eastern Europe, Latin America, Western Europe, Japan, Asia-Pacific excluding Japan, and the Middle East & Africa. Asia-Pacific excluding Japan is expected to be the leading markets in the global seaweed extract market followed by Europe owing to rise in agricultural and horticulture industry, expanding trade activities, and growing consumer awareness regarding the benefits of seaweed. Japan seaweed extract market is expected to account healthy CAGR during the forecast period owing to expanding demand for natural non-toxic products, and increasing use of seaweed extract for cosmetic purposes in the region. Moreover, the market in North America is projected to have the substantial growth in the global seaweed extract market over the forecast period due to expanding cosmetic industry, research and development activities, and growing demand for organic products. MEA is expected to witness the significant growth rate in the global seaweed extract market due to increasing presence of prominent players along with growing use of seaweed in the region.\n\n**Seaweed Extract Market: Key Players**\n\nSome of the prominent players in the seaweed extract market are Grow More Inc., Kelpak, Algea the Arctic Company, Shigawake Organics Ltd., Unilever, Ocean organics, Mycsa AG, North American Kelp, Yash Chemicals Ltd., Technaflora Plant Products Ltd., and others.\n\n**For More Details and Order Copy of this Report Visit @** [**https://www.persistencemarketresearch.com/checkout/21631**](https://www.persistencemarketresearch.com/checkout/21631)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "146ezvs",
    "title": "Seaweed Extract for Plants and Hydroponics",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/146ezvs/seaweed_extract_for_plants_and_hydroponics/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-10T23:54:46+00:00",
    "body": "Hydroponic garden enables growers to produce various crops all year round without soil. This gardening method promotes faster growth and higher yields than the traditional in-ground growing system. It also uses less water compared to conventional soil-based gardens. That said, [hydroponics](https://ecogardener.com/blogs/news/hydroponic-gardening) depends on an efficient system to grow plants.\n\n&#x200B;\n\n[Seaweed Extract for Hydrophonic](https://preview.redd.it/549b29so3a5b1.jpg?width=540&format=pjpg&auto=webp&s=8e61fd1b9207a2dced889971089e658f51dd0f32)\n\n#### Contents [hide]\n\n1. [What is Seaweed Extract?](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-01)\n\n* [How to Use Seaweed Extract in Hydroponic Gardens](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-2)\n   * [Spray it on plant leaves](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-3)\n   * [Use as a root dip](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-4)\n   * [Combined with other additives](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-5)\n* [Benefits of Seaweed Extract in Hydroponic Garden](https://ecogardener.com/blogs/news/seaweed-extract-for-plants-and-hydrophonics#content-1-6)\n\nThere are six different types of hydroponics systems. These are:\n\n**Wick System:** Nylon wicks are set up around the plants to deliver nutrients. This system does not use electricity, pumps, or aerators.\n\n**Water Culture:** The roots of the plants are submerged directly into a nutrient solution. Just like the Wick system, the water culture system does not require pumps and aerators to set up.\n\n**Ebb and Flow:** AKA flood and drain, ebb and flow has a timer that switches the pump off at a scheduled time. When the timer goes off and the pump is switched off, the water is drained from the grow beds and flows back into the pump.\n\n**Drip:** This system sends the solution into the plant base by being pumped into a tube. The tube has a drip emitter at the end that controls how much solution is released to every plant. The flow of solution can be customized for every plant.\n\n**N.F.T. (Nutrient Film Technology):** The solution is stored in a reservoir and pumped into sloped channels and the roots of every plant. The excess solution goes back into the reservoir.\n\n**Aeroponic systems:** One of the more complex hydroponic setups, the plants are suspended in the air, and the solution is misted below the plants. The misting components are connected to the water pump.\n\n**Read:** [The Future of Gardening: Hydroponics Revolutionizing Agriculture](https://ecogardener.com/blogs/news/the-future-of-gardening-hydroponics-revolutionizing-agriculture)\n\nBecause water is primarily used as a growing medium in hydroponic gardens, different fertilizers support plant growth. One of the most popular fertilizers for hydroponic gardens is seaweed extract.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Beautytouch",
    "post_id": "iy3aya",
    "title": "ClarityRx Sleep It Off Mask , Skin Transforming Anti-Aging Overnight Face Mask with Natural Retinol Alternative Green Algae Extract, 3.4 oz",
    "url": "https://www.reddit.com/r/Beautytouch/comments/iy3aya/clarityrx_sleep_it_off_mask_skin_transforming/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-09-23T04:13:32+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14nlv84",
    "title": "How To Use Seaweed Extract in Hydroponics?",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14nlv84/how_to_use_seaweed_extract_in_hydroponics/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-07-01T04:46:57+00:00",
    "body": "Thinking of going soilless for the garden? A [hydroponic garden](https://ecogardener.com/blogs/news/hydroponic-gardening) is easy to maintain and space efficient. Building this kind of garden seems intimidating, but it’s easy to assemble a simple setup.\n\n&#x200B;\n\n[The Potential of Seaweed Used in Hydroponics](https://preview.redd.it/r7kha5hy9a9b1.jpg?width=540&format=pjpg&auto=webp&s=e6e1cc21037d7633d66c0316f24d887aea039029)\n\nThe health of plants grown in a soil-less environment will depend primarily on the growing medium. Usually, you’ll use a nutrient-rich solution as an alternative to garden soil. You’ll also use [**liquid fertilizers**](https://ecogardener.com/collections/ecogardener-fertilizers) like seaweed extract to boost nutrients, promote faster growth, and increase yields.\n\nWhat is seaweed extract, and how can it improve the health of your garden? More importantly, is it suitable to use in a hydroponic garden?\n\n1. [The Potential of Seaweed Used as a Hydroponic Solution](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-01)\n2. [Seaweed Nutrients for Hydroponics](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-2)\n3. [What is the effect of seaweed extract in hydroponics?](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-3)\n4. [How do you use seaweed extract in hydroponics?](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-4)\n\n* [Step 1: Dilute as a solution](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-5)\n* [Step 2: Apply the seaweed extract](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-6)\n* [Step 3: Continue monitoring the crops](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-7)\n* [Step 4: Adjust the application as needed](https://ecogardener.com/blogs/news/how-to-use-seaweed-extract-in-hydrophonics#content-1-8)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "plants",
    "post_id": "h7rvfb",
    "title": "Seaweed extract or Fish emulsion",
    "url": "https://www.reddit.com/r/plants/comments/h7rvfb/seaweed_extract_or_fish_emulsion/",
    "score": 1,
    "num_comments": 6,
    "created": "2020-06-12T19:55:53+00:00",
    "body": "Which is better to use when grow plants and trees? Which speeds growth and is better over all?",
    "flair_text": "Help",
    "flair_template_id": "d8055cda-5bf9-11e9-9c2a-0e2abe1982b0",
    "comments": [
      {
        "author": "danapher",
        "body": "Do both",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sirauron14",
        "body": "I can mix them in the same mixture?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "danapher",
        "body": "sure! nothing bad will happen.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "sirauron14",
        "body": "How much should I mix?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "danapher",
        "body": "Read the labels, not sure which exact products you’re working with",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "sirauron14",
        "body": "Ok I'll try that",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 1,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "u_ecogardener",
    "post_id": "14pdjxh",
    "title": "Seaweed Extract for Herbs",
    "url": "https://www.reddit.com/r/u_ecogardener/comments/14pdjxh/seaweed_extract_for_herbs/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-07-03T08:54:04+00:00",
    "body": "Seaweed extract is a rich source of essential nutrients plants need to grow healthy. It’s effective, sustainable, and eco-friendly – unlike chemical fertilizers. That’s why many growers prefer using [**seaweed extract for gardening**](https://ecogardener.com/products/seaweed-extract-fertilizer-flake-organic-soil-conditioner) and organic farming.\n\n&#x200B;\n\n[Seaweed Extract for Herb Gardening](https://preview.redd.it/v5if5l21sp9b1.jpg?width=540&format=pjpg&auto=webp&s=5d4bfb5068ebf879b01da2da242de8beb1d5aaf8)\n\nHerbs, in particular, will [benefit from seaweed extract](https://ecogardener.com/blogs/news/everything-you-need-to-know-about-seaweed-extract) because these plants require specific nutrients to grow healthy. Just like any plants, herbs need nutrient-rich soils and lots of sunlight to produce healthy leaves and deep, strong roots.\n\nIf you are [growing different herbs](https://ecogardener.com/blogs/news/growing-herbs-tips-and-ideas-for-your-garden) and would like to know how seaweed extract will benefit your garden, we have some tips.\n\n*Planning to grow herbs in your kitchen?* [***Buy our ECOgardener Herb Garden Kit today***](https://ecogardener.com/products/herb-garden-starter-kit)*!*\n\n1. [Seaweed Extract: Enhancing Growth](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-01)\n\n* [Benefits of Seaweed on Plants and Herbs](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-2)\n* [How To Use Seaweed To Feed Your Herbs](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-3)\n   * [Unique Nutrients](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-4)\n   * [Slow Release of Nutrients](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-5)\n   * [Boost Resilience](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-6)\n   * [Better Soil Health](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-7)\n* [How often do you use seaweed extract on plants?](https://ecogardener.com/blogs/news/seaweed-extract-for-herbs#content-1-8)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "The_Watch_Towers",
    "post_id": "isqhzw",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus in Cell Studies – SciTechDaily – ViralVUU - TheWatchTowers.org",
    "url": "https://www.reddit.com/r/The_Watch_Towers/comments/isqhzw/seaweed_extract_outperforms_remdesivir_in/",
    "score": 0,
    "num_comments": 0,
    "created": "2020-09-14T18:13:26+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "The_Watch_Towers",
    "post_id": "isqivt",
    "title": "Seaweed Extract Outperforms Remdesivir in Blocking COVID-19 Virus in Cell Studies – SciTechDaily – ViralVUU - TheWatchTowers.org",
    "url": "https://www.reddit.com/r/The_Watch_Towers/comments/isqivt/seaweed_extract_outperforms_remdesivir_in/",
    "score": 0,
    "num_comments": 0,
    "created": "2020-09-14T18:14:34+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "todayilearned",
    "post_id": "1i88fh",
    "title": "TIL one of McDonald's biggest flops - the McLean Deluxe - used a seaweed extract to help hold it together",
    "url": "https://www.reddit.com/r/todayilearned/comments/1i88fh/til_one_of_mcdonalds_biggest_flops_the_mclean/",
    "score": 0,
    "num_comments": 4,
    "created": "2013-07-13T18:08:15+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SutekhRising",
        "body": "22 years ago is too recent?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "wjlaw100",
        "body": "As one who ate one. I was unimpressed. Too recent for a TIL",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "wjlaw100",
        "body": "I guess its all in perspective...",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  }
]