[
  {
    "subreddit": "plantpathology",
    "post_id": "oundpg",
    "title": "Waxy-ish, milky white dots appearing on Bird of Paradise. What is is? A few weeks ago I wiped them with a damp cloth and sprayed with neem seed oil but they're back. Going to keep wiping them off and hoping for the best but knowing the culprit would be helpful. See pic #2 for close up.",
    "url": "https://www.reddit.com/r/plantpathology/comments/oundpg/waxyish_milky_white_dots_appearing_on_bird_of/",
    "score": 76,
    "num_comments": 6,
    "created": "2021-07-30T15:59:25+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AccurateBrush6556",
        "body": "Scale insect...use horticultural oil and like a drop of dawn soap spray the whole plant avoiding the soil a bit..a little is ok but to much in the soil isn't great",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "melblank_",
        "body": "Scale insects for sure",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "DDD-Daisy",
        "body": "Cell mites",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "LemonWaluigi",
        "body": "Someone's jizzing on your plants",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "OnlyFirePlugCoyote",
        "body": "look like moth poop",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "3lqxtr",
    "title": "[Product Question] This Neem seed oil is lumpy and gluggy, is it okay?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/3lqxtr/product_question_this_neem_seed_oil_is_lumpy_and/",
    "score": 26,
    "num_comments": 13,
    "created": "2015-09-21T01:24:52+00:00",
    "body": "",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "mastiii",
        "body": "I don't know the exact melting point of neem oil, but it seems to be similar to coconut oil.  When it's cold, it's a solid and when it's warm, it's a liquid.  When the temperature is right around the melting point, it's kind of a liquidy semi-solid.  If you warm a little in your hand, you should see that it turns liquidy again.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Gelbehose",
        "body": "I use neem oil a lot. It is usually mostly solid at room temperature, similar to your picture. Just put it in a warm water bath, or in your pocket prior to using. It will melt to a translucent yellow-brown oil.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "SneakyVonSneakyPants",
        "body": "Was it someplace cold?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "whenifeellikeit",
        "body": "Partially saturated= partially solidifies in cooler temperatures.  It's fine.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "dioxazine_violet",
        "body": "Yup, totally normal. It will liquefy as soon as it touches your skin, or gets any warmer than room temperature.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "positive_rate",
        "body": "TIL about being gluggy",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "applesangria",
        "body": "Oh, ick. Glad it's just the temperature issue- I just ordered a bottle.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2ef335",
    "title": "I wish I had a camera good enough to show a before and after, because Neem Seed Oil made my closed comedones its bitch.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2ef335/i_wish_i_had_a_camera_good_enough_to_show_a/",
    "score": 23,
    "num_comments": 24,
    "created": "2014-08-24T03:46:52+00:00",
    "body": "I put it on my problem areas (lots of congestion on my chin, some in my naso labial folds, and my forehead between my eyebrows) and lay down for a nap. When I woke up four hours later, my closed comedones were noticeably smaller and the smallest ones were gone. \n\nTonight I blended some oils (three droppers full of argan oil, a bit of calendula oil, several drops of pecan nut oil, one dropper full each of neem seed oil and sea buckthorn). I used it as an oil cleanse, massaging my skin for about 30 seconds before double cleansing with Mario Badescu glycolic cleanser. After that I used a Clearasil salicylic acid pad before mixing another drop off neem seed oil into my retinol night cream and spot treating with a bit more neem seed oil on a cotton swab. \n\nI really wish this stuff didn't smell so weird, but I'd it keeps giving me visible results each day, it might be worth it.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "salty-lemons",
        "body": "Man. I tried Neem oil once, gagged at the smell, attempted to sleep for about five hours and finally got up and washed my face. I have a crazy sensitive sense if smell. Even if neem gave me dewy perfect skin I can't take that rancid chicken ramen smell. \n\nI am glad it works for you!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "optogirl",
        "body": "i take neem pills!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2sw3dw",
    "title": "Can anyone else simply NOT use OCM?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2sw3dw/can_anyone_else_simply_not_use_ocm/",
    "score": 19,
    "num_comments": 22,
    "created": "2015-01-19T02:16:15+00:00",
    "body": "I have tried coconut oil, hemp oil, neem seed oil, mineral oil, and eucalyptus oil.  *Every* one makes me break out also, the 'grits' seem to be quite elusive.  I'm just wondering if I'm not alone.  And I'm jealous of those of you that get such amazing results from it.\n\nEDIT:  Yes, I have read through the OCM basics and other info in the sidebar.  ",
    "flair_text": "OCM",
    "flair_template_id": null,
    "comments": [
      {
        "author": "thewidowaustero",
        "body": "Traditional oil cleansing (apply oil, rub it around, wipe off) doesn't work for me. I do like using an oil cleanser, which is oil with an emulsifier so it rinses clean.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "Purple-Leopard",
        "body": "Something i wish i knew when I first found SCA was that popular products and methods don't work for everyone. There is no one size fits all skincare routine. Now I know, because 99% of the popular products don't work for me. Cerave, neem oil (ugh, even neem in a shampoo I used fucked my scalp up), etc etc. Hemp works for me, but I don't get my hopes up anymore. It took me nearly 2 years to come up with a steady routine from reading SCA and testing too many products out. Hope you find something! The worst part about OCM is finding the oil that works, I sifted through a lot before I settled on hemp. (Garden of Wisdom sells oil samples btw, cuts back on cost)",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "morrisisthebestrat",
        "body": "OCM did not work for me. I tried a few oils and none worked for me, including mineral oil. I did get grits, but also horrible acne. Foolishly, I didn't patch test the mineral oil because at the time it was being praised here as being truly noncomedogenic. It lead to my work break out ever and I only did like four times. Closed comedones everywhere, about fifty inflamed pustules on each cheek, plus my chin. I had to get Tretinion  to clear it up. \n\nOCM works for a lot of people, but I'm not one of them. I dislike how some people on SCA act like it's the only way to remove sunscreen and makeup, too.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "shwaycool",
        "body": "I can't, because every time I use an oil/a product with oil in it, my perioral dermatitis flares up. It's infuriating because I loved what mineral, hemp, and argan oil did for my skin otherwise, but within a week of using any of them the PD would rear its ugly head. Finding products is a nightmare, and I wish I could use OCM, but I think it's a pipe dream for me at this point. \n\nSorry you haven't been able to find an oil that works for you! I know this sub is crazy about OCM, but I believe there are definitely other methods to have great, glowing skin.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "toxik0n",
        "body": "I don't use straight-up oils, I use Asian cleansing oils. A lot of them are designed to emulsify with water, so they're very easy to remove with just a splash of water on your face. My favourites are Holika Holika Deep BB Cleansing Oil and Innisfree Juicy Apple.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "sara775741",
        "body": "Oh gosh, you used eucalyptus oil for OCM?! That's terrifying!\n\nSadly, some things just *don't work* for certain people, which is completely normal. Everyone's skin is different. Very disappointing, but normal. If you're still wanting to try and make it work, you might try sunflower or safflower oil. I personally use argan and it works wonderfully for me, regardless of the 2/5 rating of comedogenicity.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "DawnaBard",
        "body": "Using a straight oil for OCM never worked for me, but I've found I really like using oil cleansers that have emulsifiers which allow them to be rinsed off. I've never gotten grits, either, I'm really just using it to remove my makeup. \n\nBottom line though - if it isn't working for you, you don't need to do it.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "JenXer",
        "body": "OCM is completely hit-or-miss for me. I only use it when my skin is so irritated that using Cerave Hydrating Cleanser makes my face burn. Otherwise it makes the acne flare up like whoa. :P",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "dontyoumindme",
        "body": "Ditto. Oil cleansing with oils did NOTHING for me. Granted, even oil cleansers don't really do that much, but I use it anyway so I can thoroughly wash off my sunscreen. Everyone talks about these \"grits\" coming off, and while I suffer from oil skin and blackheads, I can't seem to get any \"grits\" to come off. (Why, have you forsaken me, OCM?!)\n\nAnyway, like I said, I have oily skin and I tend to get blackheads around my nose area and forehead. I recently started doing clay masks everyday and I find that it really, really helps with it. I never would've thought! I recommend this if you have the same problem. \n\nI first use an oil cleanser to clean off my sunscreen. Then, I use only a tiny bit of clay mask by dotting small bits of it across my face. I use water to dilute and spread the mask around. I massage the mask around my face for a full minute (use more water if necessary). Let sit for 5-10 minutes and rinse. Then, I do a foam cleanser (or you can do cream cleanser if you'd like). I've been doing this religiously for 2 weeks and my pores look so much cleaner.\n\nFYI, I use the Innisfree Super Volcanic Pore Clay Mask. I got it as a set from some christmas special and it is now my HG. I haven't try any other clay masks, but I think the same principles can apply.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "tammykitty",
        "body": "I've used OCM and it has worked for me after trial and error, but I genuinely prefer cleansers since it is just so much easier to deal with. It is like 10 less minutes of my life I have to deal with. OCM, cleanse afterwards, hand wash the microfiber cloth I used... All that time adds up and it just bothered me. Seems minimal to others, maybe, but that ultimately got me.\r\rAlso, I never got grits. I don't even know why people freak out and get excited over them. Way overhyped, like honestly. Sorry, to those of you who do get excited and continue to. I just think the overall fascination to the point of absolute ludicrosity with it is just that - ludicrous. It makes others unjustly believe that they are doing \"something wrong\" in OCM if they don't get grits, or do something like massage their face for waaaaay longer than necessary to get these grits. Blah.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Please take a look at these links if you have questions concerning the oil cleansing method (OCM):\n\n* [OCM basics](http://www.reddit.com/r/SkincareAddiction/comments/1a1cj3/everything_you_wanted_to_know_about_ocm_the_oil/)\n* [Choosing the right oil\\(s\\)](http://www.reddit.com/r/SkincareAddiction/comments/1siu7c/protips_for_choosing_oils_for_ocm/)\n* [The benefits of mineral oil](http://www.reddit.com/r/SkincareAddiction/comments/1356nj/mineral_oil_and_its_benefits_for_skin_dont_be/)\n* [Mineral oil cleansing](http://www.reddit.com/r/SkincareAddiction/comments/1kqvdv/how_to_mineral_oil_massage/) \n\n\n*[I am a bot](/r/AutoModerator/comments/q11pu/what_is_automoderator/), and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose?to=%2Fr%2FSkincareAddiction) if you have any questions or concerns.*",
        "score": -8,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 11,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rhizosphere",
    "post_id": "628do0",
    "title": "Feeding your microbes",
    "url": "https://www.reddit.com/r/Rhizosphere/comments/628do0/feeding_your_microbes/",
    "score": 18,
    "num_comments": 6,
    "created": "2017-03-29T18:14:19+00:00",
    "body": "A Growing Dilemma\n\nSo you’ve finally decided to grow your own marijuana, but 10 steps into your local grow store, you’re already overwhelmed by what seem like hundreds of choices. The worst part is, you have no idea what’s in these bottles. Sure, the labels have numbers for nitrogen, phosphorus and potassium, but there’s no way to tell what makes one brand of nutes better than another, aside from the brand name and price.\n \nIf this story seems familiar, it’s high time to save yourself a lot of money and frustration and start producing more fragrant, potent, better-tasting buds by collaborating with Mother Nature instead of the nutrient companies. It’s time to try recycled organic living soil!\n \nWhat Is ROLS?\nRecycled organic living soil (ROLS for short) is an indoor growing method that draws on a fact-based understanding of horticulture, botany and plant physiology coupled with the principles of soil science, organic farming, traditional agriculture and permaculture. In a ROLS garden, you’re nurturing a setup that creates a fertile living soil, full of microscopic organ- isms that “digest” food for your plants. You accomplish this by mixing a soil that has everything your microbial life needs to flourish: plant and mineral sources to break down into things your plants’ roots can take up; humic substances that act as a storage and delivery system for your nutrients; and aeration amendments to make sure your roots (and their micro- scopic friends) have plenty of fresh air. Once the soil is mixed, you fortify it with compost tea to kick off the microbial life and then give it some time for the soil to become fully populated. After a few weeks, you’re ready to grow some world-class organic plants!\n \nWhy ROLS?\nA lot of marijuana growers get interested in organics because they want cleaner smoke, better flavors and more beautiful buds — but the advantages to growing organically don’t stop there. When you go ROLS, you’ll find that you spend less time and money on your garden, because once it gets started, your soil just keeps get- ting better with time. As an added bonus, some of the most time-consuming tasks involved in growing — like pH-balancing your nutrient solution and flushing your medium before harvest — become completely unnecessary when you work alongside Mother Nature.\n \nLife Under a Microscope\nA lot of different terms get thrown around to describe the microscopic organisms that inhabit your soil. You’ll hear or see words like microherd, microbeasties, soil life and plenty of others. For the purposes of this article, we’ll use the term microlife to describe the whole universe of creatures living, eating, reproducing and dying in your soil. You don’t have to understand or identify the exact types of microlife to be an amazing organic grower, but it can be an awe-inspiring research project to observe\na drop of compost tea or a soil sample under a 300x microscope. At that magnification, everything looks pretty much like a 1980s video game: You’ve got weird creatures swirling around in different patterns — some of them floating aimlessly, others using little jets or tentacles to scoot from one big gooey mass to another. With a little patience, you’ll see a bigger critter make a snack of a smaller one, or watch an organism divide itself into a pair of identical copies. It’s everything your high-school biology teacher promised it would be, though he probably never informed you that these tiny life forms are one of the secrets to growing dank herb.\n \nSoil: It’s More Than Dirt\nWhen we think of soil, we tend to imagine a pile of dirt — a brownish-black mass of broken-down rocks and plants. But soil is more than just dirt: It’s the combination of that organic matter plus billions upon billions of microscopic organisms. When the planet was still new, these bacteria, fungi and other forms of microlife evolved, living on the atoms and molecules in their physical environment.\n \nThe next life forms to show up were plants. Evolving into a world rich with microlife, plants flourished by working in harmony with their environment. When the microlife “eat” and “digest” chemical compounds to create energy for them- selves and “poop out” the waste from this process, they create the compounds that plants need to grow. The plants then use those compounds, along with water and light, to make food. It’s an elegant system in which the waste from one organism becomes food for the next, creating a cycle that can sustain itself without any outside help.\n\nFeeding and caring for this cycle of life is what organic growers are focused on. We feed the soil, and the soil feeds our plants.\n \nBattling the Bottles\nPlants have grown the same way naturally for over 450 million years. Then, sometime in the past 100 or so years, chemists working in corporate laboratories discovered how to mix and match the constituents of various chemical com- pounds in order to make others. They realized it would be big business if they could just synthesize the finished product that soil feeds the plants, then concentrate it, bottle it and sell it at a profit.\n \nOf course, they were right, as anyone who’s ever harvested a crop fed from plastic bottles can tell you. But think about it for a minute: Have you ever had a glass of fresh-squeezed orange juice and compared it to OJ made from concentrate? They may taste somewhat similar, but they’re definitely not the same.\n \nWhen your soil is alive, it acts as your plant’s digestive system: It breaks things down and makes them available for the roots to uptake. It’s just like taking a bite of food: When you chew it, your teeth are making it smaller, enzymes are breaking it down, and once the food hits your stomach, bacteria split it up chemically, and the nutrients and vitamins get directed through your bloodstream to where they need to go. In living soil, worms and other small creatures make chunks of things in the soil smaller, enzymes break them down, bacteria split up the nutrients, and the roots take what they need and put the good stuff through the plant’s circulatory system.\n \nBottled nutrients take a different approach by skipping the breakdown process altogether. Instead, these nutrients are already chelated (pronounced key-lated), meaning the digestion your soil would be doing is already done. Feeding your plant chelated nutes is like hooking yourself up to an IV bag with a solution of protein, carbs and fats: You skip the whole digestion process, and as a result, the soil’s microlife doesn’t get fed. While that IV might have enough nutrition to keep you alive, it’s nothing like the healthy, balanced diet that your body needs to thrive.\n \nBeyond Veganic\nWith organic growing gaining popularity over the past few years, a lot of nutrient companies have come out with their own “organic” or even “veganic” lines.\n\n\nIn a sense, these bottled nutes are better than the old synthetic kind, since they were extracted from real plants. But remember that orange juice from concentrate was extracted from real plants once upon a time, too — but to make it practical to store, transport and sell, it’s been heated to remove the water and then mixed with preservatives to keep it from being a good environment for bacteria to develop. Bottled “organic” nutrients are a lot like OJ from concentrate: To make them practical to warehouse, ship and retail, they need to be concentrated and preserved through chelation. Since the object of organic living soil is to cultivate as many types of life as possible, bottled “organic” nutes are a more expensive and less productive alternative to our methods.\n \nAlso, while the idea of growing with good karma by keeping it vegan may be initially appealing, it’s worth taking some time to consider the bigger picture before you ditch the animal products. The major differences between an organic and a veganic approach are the inclusion of earthworms (or their castings), animal manures and amendments made from sea life (fish hydrolysate, crab meal, ground oyster shells, etc.). To state the obvious, worms and soil go together like fish and water — worms evolved to specialize in the soil environment, playing a major role in beginning the digestion process and adding structure, aeration and, of course, their very fertile castings. Animal manures can be almost completely replaced with plant-based “green” manures — but since the heart of the organic method is a sustainable approach to growing plants, any time we can take what would be a pile of useless waste\nand turn it into high-grade fertilizer, it’s a win-win situation. Amendments created from sea life are also typically made from the waste products of other indus- trial processes and offer some very unique compounds (such as forms of calcium, silica and other minerals) that are rare and exotic treats for your soil.\n \nHome Kitchen Bug Killers\nFor pest prevention, we use neem seed oil (usually found in the health and beauty aisle), as well as a spray made from fresh organic cilantro, mint, lemon rinds and hot peppers, combined in a food processor with a little water, organic rosemary and lavender essential oils, plus a drop or two of Dr. Bronner’s soap. The oil and soap work as a spreading agent to cover your plants evenly with the water-based mixture (which would otherwise bead up), and they also help the active ingredients in the herbs penetrate the exoskeletons of pests. A lot of the high-priced pesticides you find in grow stores use the exact same com- pounds found in these and other common herbs, seeds, barks and so on.\n \nA “Protein Drink” for Your Plants\nRaw, organic aloe vera juice is an amazing addition to your regular waterings or foliar feedings at 1⁄4 cup per gallon of water. Think of aloe vera doing for your plants what a protein shake does for an elite athlete: providing the body what it needs to grow bigger and stronger by giving it more raw material. Just like a human body will use amino acids to make proteins and proteins to make muscles, plants will use simple sugars to make starches, and starches to make their structures. Aloe vera juice is chock-full of simple sugars and starches, giving your plants the nutrition they need for serious performance.\n \nFor Plants That Grow Like Coconut Palms\nRaw, organic coconut water can replace an armload of top-secret grow formulas. Added to feedings at 15 milliliters per liter of H2O, coconut water will cause your plants to grow faster, more vigorously, and with more buds sites and shorter internodal distances. Keep in mind that a coconut is the biggest seed on Earth — and like any other seed, it contains enough nutrition for the plant to grow until it develops sufficient leaves to make its own food. Coconut trees get taller by growing huge palm leaves that die off, leaving a trunk — which means that unlike cannabis, which grows stem space between each set of branches, coconut water has cytokinins (sigh-toe-kine-ens), hormones that signal the plant to divide cells in the roots and growing shoots, equaling explosive growth. Coconut water is also a great source of cal- cium, magnesium, and other minerals and elements your plants need.\n \nReduce, Reuse, Recycle\nRecycling your soil after harvest is one of the main principles of ROLS. As the soil lives, it breaks down the minerals mixed into it over long periods of time; certain elements will become available over a few weeks or months, but others won’t go through enough digestion for years. By recycling, we let nature work through some of these longer processes, resulting in complex compounds that nourish and protect your plants and microlife.\n \nRecycling also makes the most efficient use of your microlife: Instead of tossing used soil into the trash or backyard gar- den and losing all the microlife we’ve cultivated over the growing cycle, we help it to replenish the soil by adding more food and giving the little guys time to re-establish themselves.\n \nMany ROLS growers empty their containers into a pile, bin, tub or trashcan, mix it with soil amendments, add water or compost tea, and give it six weeks or longer for the microlife to find its rhythm. Some ROLS growers (including MicrobeMan, BlueJayWay and SilverSurfer_OG) are pioneering a no-till method, in which they transplant a new plant directly into the same container they just harvested from. This allows them to take full advantage of the thriving microlife without any delays or hiccups in a busy production schedule. In a no-till system, rather than mixing amendments into the soil, the amendments are sprinkled on top and watered in with teas, allowing the soil to digest them and replenish itself. The no-till method takes advantage of the relationship between the plant’s root system and the microlife that develops in the rhizosphere (rye-zoe-sphere) or root zone.\n \nHumus Be Kidding\nOne of the key ingredients in ROLS is humus (hue-muss), a black, spongy, rich- smelling material that is produced by thriving microlife. Humus is made up of the parts of plants that are hard for the soil to digest (like waxes and woody lignins), along with the gums and starches that the microlife excretes as waste products. Humus is loaded with organic humic and fulvic acids, which do their part to feed the microlife that, in turn, feeds your plants.\n \nBut that’s just the beginning when it comes to humus: Humus holds moisture and provides room for the air that your roots and microlife need.\n \nHumus holds and releases nutrients in ways that make them available to plants but also prevents them from washing away, acting like a nutrient “savings account” for the roots.\n \nHumus creates food for your microlife, along with the vitamins, hormones, anti- biotics and other substances that protect and support your plants’ health.\n \nHumus balances the pH in your soil so you don’t have to.\n \nCompost Modern\nIf you do a little research, you’ll find that there are almost as many ways of making compost as there are of growing pot. From composting in heaps or sheets, to composting in bins or tumblers, to using worms or black soldier flies, each method has its advantages in certain situations — for example, a compost heap isn’t very practical if you live in an apartment, but an earthworm farm might be perfect.\n \nNo matter how you compost, the goal is always the same: to create an environment in which organic substances can be efficiently turned into humus. The key to creating this environment is providing the right balance of green organic material like stems and grass clippings (which are packed with nitrogen) and brown or yellow organic material like dead leaves (which only have carbon left), along with enough moisture and air for the micro- life in the compost to thrive.\n \nLook online for simple plans to make your own compost tumbler or stackable vermi-compost (worm-compost) bin, and start by feeding it your kitchen scraps and shredded paper. Before you know it, you’ll have more compost than you really need — and as you feed it your fan leaves, stems, trunks, root-balls, cardboard boxes and electricity bills, you may find great satisfaction in turning potential security risks into top-notch fertilizer.\n \nBy Plants, for Plants\nAnother key element of ROLS is the use of dynamic accumulators (DAs). DAs are cer- tain plants—usually fast-growing weeds — that take up nutrients and micronutrients from the soil and store them in their leaves. Some commonly used DAs are:\nAlfalfa\nKelp\nYarrow\nComfrey\nStinging nettle\nWatercress\nDandelion\nShavegrass (a.k.a. horsetail)\n \nTips From a Master, Plus a Winning Recipe\nNestor Garrido is a ROLS grower who took home a first-place Best Sativa for his Snowdawg at the 2011 HIGH TIMES Medical Cannabis Cup in Denver, and a second-place Best Sativa for his Durban Poison at the first US Cannabis Cup in 2013. Com- ing from a background in organic-food production, Nestor combined his family tradition of Earth-friendly sustainable gardening and his love of cannabis to grow some of the tastiest, most gorgeous buds on the planet.\n \nFor starters, it should be noted that with this mix (and all true organics), the objective is to “feed the soil,” getting away from the notion that we need to (force-)feed our plants a “fast-food diet,” as is the case with synthetic nutrients. This is done by adding organic amendments and allowing the microbial activity that ensues to balance out over time. The resulting byproduct creates a perfect environment for root growth, which translates into robust overall plant growth and stronger immunity (i.e., disease resistance).\n \nAdditional benefits from using this method include increased potency in the final product, coupled with the full spectrum of flavor expression and aromatic qualities in a particular strain. Buds grown in living soil have higher trichome density and terpene content, which will be noticeable to the smoker not only in the aromatic qualities and flavor, but also in the non-irritating smooth smoke that results when inhaled.\n \nA few other advantages that one might take into account: less labor and cost; no pH meter; no guesswork trying to decide which fertilizers to use; no more changing and scrubbing nutrient reservoirs; and no contaminating wastewater going down our drains and into our rivers. Plus, as mentioned, the soil can be amended and reused over and over, leading to less waste disposal (and therefore less security risk).\n \nBelow are some recommended amend- ments that will benefit your soil mix — however, it’s always good to experiment with different mixes to discover what works best for you. An important thing to remember is that there is not some top-secret “proprietary formula” out there: Any mix focused on feeding the soil will result in a healthy biodynamic medium full of microbial activity that will ultimately grow the best nugs you’ve ever smoked.\n \nHelpful Amendments\n(Quantities listed are per 9 to 12 cubic feet of soil)\nFish bone meal, 5 lbs.\nBlood meal, 5 lbs.\nAlfalfa meal, 3 lbs.\nNeem seed meal, 2 lbs.\nFeather meal, 3 lbs.\nGreen sand, 2 to 3 lbs.\nFish meal (for veg), 1 to 2 lbs.\nSoybean meal (for veg), 3 lbs.\nKelp meal, 3 lbs.\nRock phosphate, 3 lbs.\nBark mulch, 2 lbs.\nIndonesian bat guano (for bloom), 5 lbs. Mexican bat guano (for veg), 5 lbs. Earthworm castings, 15 to 20 lbs. Epsom salt, 1/2 cup\nPowdered mycorrhizae, 1/2 cup Granular humic acids, 1/8 cup\nDolomite lime, 1/2 cup\nAzomite, 3/4 cup\n \nIt’s not necessary to use all of these amendments in a mix (though you can if you choose). If you’re just starting out, I recommend using a base mix and then experimenting with other amendments. A good base mix might include fish bone meal, blood meal, earthworm castings, powdered mycorrhizae, Epsom salt, dolomite lime, granular humic acid and azomite.\n \nWhen it comes to mixing and using the soil, I like to spread it out about 6 to 12 inches in depth and then sprinkle the amendments evenly over the soil. Next, mix it all up thoroughly and then mix it again … and again. I store the mixture in large trash bins and moisten it with a gallon or so of non-chlorinated water and a tablespoon of unsulfured molasses to catalyze the microbial activity (the molasses is optional). \n \nThe final step is to let the mixture sit and “cook” for at least 30 days before using (preferably as many as 60-plus days). Once this time has passed, the soil is now balanced and ready to use. Simply fill the bottom half or third of your grow container with the mix and back-fill the rest with a less concentrated organic soil (either bagged or home-cooked). For the remainder of the grow cycle, all that’s left is to add water as needed.\n \nHappy gardening!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fxpro888",
        "body": "Great read.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "29t4yt",
    "title": "Neem oil vs Neem Seed Oil",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/29t4yt/neem_oil_vs_neem_seed_oil/",
    "score": 13,
    "num_comments": 4,
    "created": "2014-07-04T06:45:22+00:00",
    "body": "I was looking to add some neem oil to my regimen, but see that there are two different types and was wondering which is best for clearing acne.\n\nThanks",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "StormThestral",
        "body": "I'm about 99% sure they're the same thing. You *do* want a cold pressed one though... I think most neem oil is cold pressed. It should look kinda gross, like [this](http://imgsrv.gardening.ktsa.com/image/ktsag/UserFiles/Image/N_Images/neem-oil.jpg) when cold, or like [this](http://4.bp.blogspot.com/-IKasLnAMK38/UokIsegGEzI/AAAAAAAACjY/Mg-UKEh-J3Y/s1600/Neem+soap-2.jpg) when warm.",
        "score": 10,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "houseplants",
    "post_id": "137tlqs",
    "title": "Am I the only one who likes the smell of neem oil?",
    "url": "https://www.reddit.com/r/houseplants/comments/137tlqs/am_i_the_only_one_who_likes_the_smell_of_neem_oil/",
    "score": 12,
    "num_comments": 20,
    "created": "2023-05-04T17:13:44+00:00",
    "body": "So, I've only ever had this one bottle of neem oil. It's 100% pure cold pressed neem seed oil. Every time I mix up a bottle to use on my plants, I intentionally take a big sniff, to dissect the aroma. Everyone always talks about how bad it smells, but to me it smells like a peanut curry of sorts? And I actually find it pleasant! Is my nose just weird?",
    "flair_text": "Discussion",
    "flair_template_id": "7841c8b8-451b-11ea-9939-0e0f47a2bd7b",
    "comments": [
      {
        "author": "pubicgarden",
        "body": "Yes.",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "esjustme",
        "body": "It smells like a Chinese restaurant to me.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Baejax_the_Great",
        "body": "I have pure neem oil, and I recently bought an already mixed spray. The mix I bought smells absolutely foul. The pure neem oil I mix up myself has a pungent smell, but not a bad one at all.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Etianen7",
        "body": "No one ever believes me, but to me neem smells kind of like green pea stew, with tomatoes and carrots. Yummy.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ha485",
        "body": "it smells like miso or soy sauce to me",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Prestigious-Aide-424",
        "body": "I like the smell of neem oil too. It smells like peanuts with garlic. Garlic smells good to me too.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "putitinapot",
        "body": "Yes you are the only one! Just kidding. I don't a lot of people that like the smell. But scent is definitely a personal thing. I had a cousin who loved the smell of gasoline. Everytime we went to the gas station, he was in heaven!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MagicUnicornLove",
        "body": "So long fish thanks",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MotherofaPickle",
        "body": "I think it smells piney and exotic. Kind of reminiscent of argan oil. \n\nI LOVE it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1ucw9q",
    "title": "Refrigerating Oils",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1ucw9q/refrigerating_oils/",
    "score": 7,
    "num_comments": 4,
    "created": "2014-01-04T01:36:07+00:00",
    "body": "Hey, all, I know that some oils need to be refrigerated and that some people keep all their oils in the fridge all the time. I've kept my routine fairly simple, but I just got some oils that are a little more...shall we say exotic? and I don't know if any of them need to be refrigerated. How can I find out? I bought them all on GoW, but the product page doesn't seem to say anything about how it should be stored for any of them.\n\nThe oils I'm wondering about are:\n\n- Karanja Oil\n- Safflower Seed Oil\n- Hypericum (St. John's Wort) Oil\n- Jojoba (Gold)\n- Neem Seed Oil\n\nAlso getting soon:\n\n- Hemp Seed Oil\n- Almond (Sweet) Oil\n- Castor Seed Oil\n\nThe neem and jojoba I've had before and not refrigerated, but I figured I'd include them in case I've been wrong not to refrigerate them all this time.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "poofkin",
        "body": "Hemp seed oil *must* be refrigerated. It will go rancid otherwise.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "jewishvampire",
        "body": "be careful with the st. john's wort. some studies ([here's one](http://www.ncbi.nlm.nih.gov/pubmed/10885442) that popped up first; there are other more conclusive ones out there though) have suggested that it increases sun sensitivity. and st. johns wort can significantly effect the way your body metabolizes certain drugs (especially oral contraceptives) so if you are on any meds, you should check with your doctor/pharmacist.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Wheeeuu",
        "body": "Jojoba is quite stable and doesnt need to be refigerated! Neem will be solid if you put it in the fridge (or if your house is kept cooler, like mine!) so I don't think it would be the most ideal to keep it in the fridge either.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2ml2m7",
    "title": "Garden of Wisdom Cleansing Oil (Blemish Prone)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2ml2m7/garden_of_wisdom_cleansing_oil_blemish_prone/",
    "score": 11,
    "num_comments": 7,
    "created": "2014-11-17T19:05:47+00:00",
    "body": "**Link to Product:** [Garden of Wisdom Cleansing Oil (Blemish Prone)](http://www.gardenofwisdom.com/catalog/item/7471648/10116864.htm)\n\n**Ingredients:** High Linoleic Safflower Seed Oil, Grape Seed Oil, Perilla Seed Oil, Neem Seed Oil, [Cromollient SCE (Di-PPG-2 Myreth-10 Adipate)](http://www.gardenofwisdom.com/catalog/item/4032845/7039318.htm), Thyme Essential Oil \n\n**Type of Product:** GoW Cleansing Oil (Blemish Prone) is a cleanser. \n\n**Skin Type:** My skin is oily, acne-prone, hyperpigmentation-prone and [Fitzpatrick Type V](http://www.justaboutskin.com/fitzpatrick-skin-type-scale/).\n\n**Packaging and Product Description:** GoW Cleansing Oil (Blemish Prone) is stored in a 4 ounce black PET plastic bottle with a flip-top. It’s also sold in 1 ounce and 8 ounce sizes. The cleansing oil is gold in color, has a luxurious texture and smells like neem oil (though not as  overwhelmingly strong as pure neem oil). \n\n**Application:** I use GoW Cleaning Oil (Blemish Prone) nightly as the first part of [double cleansing](http://www.justaboutskin.com/2014/05/double-cleanse/). First, I apply a quarter-sized amount of cleansing oil to dry skin and massage using circular motions. Next, I wet my hands, massage using circular motions to emulsify the oil/makeup/sunscreen and rinse. Finally, I follow with foaming cleanser via a microfiber cloth. \n\nGoW Cleansing Oil (Blemish Prone) glides across my skin smoothly and rinses away easily. Immediately after rinsing, my skin feels soft and clean. After using foaming cleanser, my skin feels softer and more “moisturized” than it does when I remove my makeup with baby wipes.\n\n**Results:** I’ve used GoW Cleansing Oil (Blemish Prone) for two weeks. It removes physical sunscreen and makeup effectively while leaving my skin in good condition. I really like it.\n\n**Adverse Reactions:** I don’t know of any adverse reactions to GoW Cleansing Oil (Blemish Prone) or a combination of the product with another. I haven’t experienced any adverse reactions while using the cleansing oil. ",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Friskyseal",
        "body": "If the oil cleanser is rinsing clean, why are you also following with a foaming cleanser?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Mario_hoene",
        "body": "I've used this oil twice now, and was suprised at the smell. It's kiiinda-sorta gasoline-like for a small second?  I haven't smelled neem oil, so I don't know how it compares...",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "wicked_edge",
    "post_id": "f8pmio",
    "title": "Gillette Guard shaving cream introduction & review.",
    "url": "https://www.reddit.com/r/wicked_edge/comments/f8pmio/gillette_guard_shaving_cream_introduction_review/",
    "score": 8,
    "num_comments": 9,
    "created": "2020-02-24T10:59:16+00:00",
    "body": " \n\nGillette Guard shaving cream introduction & review.\n\nA couple of days ago, I went to the local pharmacy at work after lunch. As I often do, I quickly glanced over the shaving products rack, & I saw something new. Gillette has launched a new shaving cream in India, - Gillette Guard shaving cream. I assume that it is intended to be paired with Gillette Guard razors. I’ve used those super cheap Guard razors & found them extremely good for very quick shaves as they shave like a safety razor while still being in a pivoting cartridge format. I feel that if Gillette can make an equally good shaving cream, it ought to be worth trying. So I picked up a tube. The tube has 125 grams of product (4 oz) & is priced at the low, low price of 49 Indian rupees, or 68 US cents. That’s an amazing price, which is weight for weight, probably about half that of most normal shaving creams in the region.  Most other shaving products here contain about 3oz, & cost just over $1.\n\nThe tube specifies on the packing that it can be applied by hand or a brush. Since I normally shave with a brush that is how I plan to apply it to test it.\n\nThe ingredients are, Water, Stearic acid,  Glycerin, Potassium Hydroxide, Coconut oil, Acrylates/Beheneth-25 Methacrylate/HEMA Crosspolymer – 2, Sodium Hydroxide, PEG-12 Dimethicone, Cocamide MEA, Sodium Silicate, Azadirachta Indica seed oil, Fragrance, Benzyl Salicylate, Linalool, Limonene.\n\nThe ingredients seem fairly standard, except for the acrylates & crosspolymer. On looking them up, I found that they are gelling agents.\n\nI applied cream today morning with a brush & lathered up after a shower. My Omega 10029 came up in the rotation. The product in the tube was white & looked more like toothpaste than shaving cream. I applied more than usual, since I wanted to test the performance, & I was a little afraid that the gelling agents might affect the performance. The product applied more like hair gel than shaving cream, while there was lather, & the bubbles were tiny, which is a good indication of higher potassium/sodium ratio, but the lather felt funny. On shaving the first pass WTG, I found that while the lather felt slick enough when rubbed between my fingers, the lather had very, very little lubrication indeed while shaving & I could really feel the blade in the Tech type razor. After the first pass, I felt that I could not continue to shave this way, & perhaps the lather would do better with a cartridge razor, so I did my next pass with a cartridge. If I’d wanted to continue with the DE, I’d have had to change the lather. Since it was the lather that was being tested, not the razor, I switched to a Sensor Excel razor for XTG. At that point, I had no trouble with the second pass, but the lubricity was still lacking. \n\nI’m beginning to suspect the gelling agents are being used as fillers in this formulation. If the gelling agents were not there, this product would be  thin soapy water.\n\nI’m going to experiment with using the cream again tomorrow, this time used brushless before coming to any conclusions or making any statements. There is no way I’m going to use this product with a brush again.\n\nUPDATE Day 2 :- I used that cream again today without a brush. I can confirm that it works well & was most probably designed primarily as a brushless cream. In fact, it's a fairly good cream when applied that way. No nicks or cuts & a pretty smooth face. A good, close shave.\n\n\nWhile looking at the package, I re-checked the how-to blurb about applying it. It reads 'Using your hand or a brush, lather the cream & then apply the cream to your beard'\n\nWhile that's not proof , the fact that using it by hand has been mentioned first before the brush does make me think that it was designed to be used primarily without a brush.\n\nI'm a little concerned about the gelling agents in this formulation. (Carbopol Smart 3000 or equivalent). I have never seen them in any similar product before & I know nothing about their safety. They've been around for less than five years, which is not enough time for issues to come to light.",
    "flair_text": "Review",
    "flair_template_id": "36bd174a-7556-11e7-9f7b-0e07ae72dc06",
    "comments": [
      {
        "author": "SomeRandomIGN",
        "body": "If you’ve used the Pure, could you draw comparisons to that?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "OneMorePartyInLA",
        "body": "This is awesome I love picking up shaving creams from India what is the scent like on this? Thanks",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Tryemall",
        "body": "Does anyone know why the picture of the cream that I posted didn't post?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "sefu1x",
    "title": "[Acne] Better skin going off of Spiro?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/sefu1x/acne_better_skin_going_off_of_spiro/",
    "score": 6,
    "num_comments": 1,
    "created": "2022-01-28T02:30:29+00:00",
    "body": "Hello, everyone! I was hoping to read experiences of others who have decided to go off of Spiro for one reason or another, and how that decision has impacted their skin.\n\nPersonal history rundown: I was on hormonal BC for approx 15 years - did 1 round of Accutane in high school due to deep painful, cystic hormonal acne - went off BC for copper IUD + started Spiro to regulate hormonal acne after college - had IUD removed 3 years later during endo excision surgery because it punctured my uterine wall - have not used any BC methods over the last 4 years by this point - stopped taking Spiro 2.5 months ago to try to conceive.\n\nSince stopping Spiro, I’ve noticed my skin has become softer, more even-toned, and so much smoother. It feels and looks so much better than the years I’ve used Spiro, so I’m a bit perplexed.\n\nAM routine: cleanse with cool water and SiBu (seabuckthorn facial bar), apply non-fragranced plain moisturizer from Target + a dot of evening primrose oil. Apply primer and makeup.\n\nPM routine: oil cleanse with neem seed oil + evening primrose oil, double cleanse with SiBu facial bar, apply non-fragranced plain moisturizer from Target + a dot of evening primrose oil, and layer Vaseline on top.\n\nI hope to read about some similar experiences!",
    "flair_text": "Acne",
    "flair_template_id": "635ca28e-d0cc-11e3-a662-12313b08b431",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "15r1nl",
    "title": "Just did a litle GoW Haul!  With shipping the total was $51 (USD)!++",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/15r1nl/just_did_a_litle_gow_haul_with_shipping_the_total/",
    "score": 6,
    "num_comments": 20,
    "created": "2013-01-01T00:44:34+00:00",
    "body": "My awesome SO footed the bill.  \n\n\n\nNeem Seed Oil / 1 oz\n\n\n\n\nCoconut Cream / 1 oz\n\n\n\n\nChardonnay Grape Seed Oil / 1 oz\n\n\n\n\t\nPumpkin Seed Oil / 1 oz\n\n\n\n\nFrench Green Clay / 4 oz\n\n\n\n\t\nMatcha Ceremonial Tea / 15 grams\n\n\n\n\t\nCoffee Bean Co2 Ext / .25 oz\n\n\n\n\t\nYellow Kaolin Clay / 2 oz\n\n\n\t\nRhassoul Clay / 4 oz\n\n\n\nGoW PreEmptive Strike Skin Protectant\n\n\nGoW Calming Creamy Cleanser w/Matcha Green Tea / 1 oz",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "valentinedoux",
        "body": "Awesome! Please update us on your experience with pumpkin seed oil and chardonnay grape seed oil. I'm super curious about them.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "spunky-omelette",
        "body": "I'm also really interested in the pumpkin seed oil, so report back to us with an update!\n\nI think you'll really like the matcha cleanser.  I got a small size a while back and it's very nice.  My favorite is the pumpkin cleanser though--I feel like I'm coating my face in pumpkin pie every morning!\n\nThe preemptive strike protectant is pretty nice.  I mix one drop with a drop of hydrosol gel.  I'm not sure if I'll buy it when it's a full-size and not a sample, since I am still getting a teeny pimple here and there.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ericammkay",
        "body": "curious about the different clays, keep me updated on those! anddd neem oil. heard its awesome.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "mamemi",
        "body": "After I saw your post yesterday I ordered some things from them too. So thanks for spreading the GoW bug! I got:\n\n*  Microfiber Cloth (I thought it would be special and different from the kitchen ones, we shall see...)\n*  GoW Cherry Healing Serum (my face is currently irritated and I hope this will help)\n*  GoW Oh NO!!  What Did I Do to My Skin?!?! (this too)\n*  GoW Fruity Meow Meow! Facial Lotion (I've been looking for a new cream moisturizer, this is cheap and I love the name, meow!)\n* GoW Matcha Green Tea HA Serum (I've been wanting to try a HA serum)\n* GoW PreEmptive Strike Skin Protectant (from their sample program)\n\nI wanted to try a sample of hemp oil, but I'm pretty happy with the oils I'm using. I'm also content with my cleanser and acv toner so I didn't get samples of their stuff in those categories. When my skin heals I would like to try their salicylic acid serum. I'm curious if it would work with my skin.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "makeupexchange",
    "post_id": "4bz3eo",
    "title": "[SELL/SWAP][US/INTL] UPDATED MID-HIGH END DESTASH! Burberry, Chanel, Givenchy, LE MAC, Urban Decay, Becca, Lorac, ABH, Bite, and more!",
    "url": "https://www.reddit.com/r/makeupexchange/comments/4bz3eo/sellswapusintl_updated_midhigh_end_destash/",
    "score": 5,
    "num_comments": 26,
    "created": "2016-03-26T00:10:13+00:00",
    "body": "Hi everyone! \n\n[Flair thread 1](http://www.reddit.com/r/mueflair/comments/2oejec/midnightunicorn_flair_thread/) [Flair thread 2](https://www.reddit.com/r/mueflair/comments/3g7m0l/midnightunicorn_flair_thread_part_2/)\n\nNo minimum!\n\nPayPal Gift is strongly preferred but if you want an invoice it will cost an additional $0.30 + 2.9% of the total.\n\nShipping is from Massachusetts and will be calculated based on weight. It starts at $3 and is not usually over $5 in the US.\n\nPlease see pictures for usage. If its pictured but not listed, its gone.\n\nI can only hold items for 1 hour until it goes to the next person!\n\nNO PMs until we've finalized in the comments!\n\n**WISHLIST** *SWAP ONLY*\n\n*ONLY INTERESTED IN THESE ITEMS*\n\n**ABH Eyeshadow in Metal, Belize, Chocolate Crumble** WILLING TO BUY\n\n**Burberry Eyeshadow in Nude**\n\n**MAC Lipstick in Taupe**\n\n**MAC Blacktrack Fluidline**\n\n**MUFE Step 1 Green Primer**\n\n**Fan brush**\n\nKiehl's Clearly Corrective Serum\n\nMAC Fix+\n\nChanel Le Volume Mascara\n\nCharlotte Tilbury Lipstick in Walk of Shame\n\nColourPop Ultra Mattes in Bad Habit, Scrooge, More Better, Bumble, Tulle\n\nColourPop Cream Gel Eyeliner in Overboard, Show Me\n\nMAC empties for B2M\n\n**SALE STARTS HERE**\n\n[VERIFICATION](http://imgur.com/a/fRn9m) [VERIFICATION 2](http://imgur.com/a/4HyHD) [VERIFICATION 3](http://imgur.com/a/HTgea)\n\n**FACE**\n\n* Burberry Sheer Luminous Foundation - Trench #1 **$28** about 70% remaining (retail $52) \n\n* MAC LE Guo Pei Blush - Red Water Lily **$25** used 3x (retail $40)\n\n* Becca Beach Tint Shimmer Souffle - Watermelon/Moonstone **$10** 90% remaining, small dip, slightly pulling away from edge (retail $27)\n\n* Becca Beach Tint - Guava **$10** used 3x (retail $25)\n\n* Model Co Bronze Shimmer **$2** swatched (retail $24) **or free with purchase of $10**\n\n* Giorgio Armani Fluid Sheer DS - #2 **$2** swatched (0.16oz) **or free with purchase of $10**\n\n**EYES**\n\n* Chanel Illusion D'Ombre - Emerveille **$16** about 85% remaining, dip (retail $36) \n\n* Urban Decay Naked Palette **$16** heavy use - pan on Naked and Buck, dips in Virgin, Sin, Half Baked, Smog, Toasted, Hustle, no brush (retail $54) **packaging is beat up - paper is coming off from felt above mirror, some discoloration on paper** \n\n* Inglot Pigment - 80 **$6** swatched (retail $16)\n\n* ABH Dipbrow - Auburn **$9** 95% remaining, slightly cracked/pulling away but still creamy (retail $20)\n\n* MAC Eyeshadow pot - Quarry **$8** 95% remaining, no dip (retail $16)\n\n**LIPS** \n\n* Givenchy Le Rouge - Beige Plume **$16** RIS, used 1x by, looks swatched by other (retail $36)\n\n* Bite Matte Lip Crayon - Blood Orange (Discontinued) **$8** used 4-5x (retail $24)\n\n* MAC LE Toledo Collection - Barbecue **$15** about 80% remaining \n\n* Fresh Sugar Lip Balm DS - Rose **$6** BN (0.08oz)\n\n**SKIN/SCENT/HAIR**\n\n* Bliss Fuzz Off **$8** RIS, unsure of usage, unused by me (retail $24) **there are numbers carved into the packaging, this was most likely received as gratis by the person I got it from**\n\n* Mario Badescu Drying Lotion **$9** used 3x (retail $17)\n\n* Mario Badescu Drying Cream **$9** opened, used maybe 1x (retail $17)\n\n* Living Proof Perfect Hair Day Treatment **$5** BN (1oz)\n\n* Shu Uemura Skin Purifier Cleansing Oil **$4** used 1x (1.6oz)\n\n* Mario Badescu Special Healing Powder **$5** used 1x (retail $12)\n\n* GlamGlow YouthCleanse DS **$4** BN (0.5oz)\n\n* Freedman's Peel Off Cucumber Mask **$2** used 3x (retail $5) **or free with purchase of $10**\n\n* Aveda Foot Relief Foot Cream **$2** BN (retail $9.50) **or free with purchase of $10**\n\n* Garden of Wisdom - Sunflower Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Neem Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Hemp Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Passion Fruit Seed Oil **$1** BN (0.25oz) **or free with purchase of $10**\n\n* Burberry Body DS **$1** BN **or free with purchase of $10**\n\n**OTHER**\n\n* White floral metal palette rack **$4** 3 sections **will cost more to ship**",
    "flair_text": "Offer: Sell/Swap",
    "flair_template_id": null,
    "comments": [
      {
        "author": "yinda007",
        "body": "Would you do $20 shipped for Steam Heat? :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "blueyellowgrey",
        "body": "Paula's Choice Nude Matte Palette please :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "browbegone",
        "body": "Interested in the two MAC matte lipsticks. Could you do 18$?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "tknee22",
        "body": "Would you do $30 shipped for the too faced juicy melon and Mac palette? Going to bed but interested and can pay in the morning. I understand if you go to the next person!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ohai_megan",
        "body": "Interested in the lorac unzipped!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ruhruhrose",
        "body": "Would you do $19 shipped for the Burberry eyeshadow?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Peaberry20",
        "body": "Would you do $25 for Lorac Unzipped to 97220?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "greeneyes826",
        "body": "Is the urban decay primer potion still available?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "glamour_bear",
        "body": "I have MAC Faux used 7x, would you be willing to swap for the PC AHA gel? I can get pictures/verification in a bit.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "herbalcraftgroup",
    "post_id": "c2hi90",
    "title": "Herbs for glowing and beautiful skin!",
    "url": "https://www.reddit.com/r/herbalcraftgroup/comments/c2hi90/herbs_for_glowing_and_beautiful_skin/",
    "score": 7,
    "num_comments": 0,
    "created": "2019-06-19T14:06:13+00:00",
    "body": " \n\nHerbs for glowing and beautiful skin\n\n[Dandelion](https://preview.redd.it/gv8i3fnmlb531.jpg?width=736&format=pjpg&auto=webp&s=dc03601130a92c118da95955d6521d8e2e1b9056)\n\nNettle-Nettle is a nutritive and an alterative.   \n It’s high in vitamins A, C, E, and K, as well as magnesium, calcium, silica, iron,   \n and chlorophyll. While it’s providing your skin with the nutrients it needs, it’s   \n also detoxifying through the urinary tract, and is highly anti-inflammatory!\n\nDandelion Root-It’s another a supreme liver tonic that clears stagnation and   \n supports detoxification. It also is anti-inflammatory, helping to calm red and angry skin.   \n The root, especially harvested in fall, is an amazing pre-biotic. It provides healthy   \n microorganisms to the gut and improves digestion. A healthy gut is a must for healthy skin.\n\nTurmeric-Long revered in Ayurveda, the Sanskrit name for turmeric means “Golden Goddess”.   \n It’s not only an antioxidant, but also an alterative, an anti-inflammatory, an antimicrobial, and a liver protectant.   \n Side effects may include actually looking like a goddess yourself. It’s just that good.   \n Indian women have used it in topical applications for skin and hair for centuries.\n\nNeem -A natural cleansing agent, neem can promote skin   \n health by flushing out the toxins from your body and purifying your blood. Topical application   \n of neem can significantly reduce the formation of acne and promote clear skin, thanks to the   \n antibacterial and antifungal activities of Gedunin, a component of neem seed oil.\n\nRose - Rose can effectively reduce the roughness and puffiness of the skin, making you feel   \n softer and look brighter. Its vitamin C content also helps fight the aging process, smoothens   \n your skin, and prevents the formation of wrinkles.\n\nThese herbal powders are available at our online stores.\n\n[www.ebay.com/str/herbalcraftgroup](https://l.facebook.com/l.php?u=http%3A%2F%2Fwww.ebay.com%2Fstr%2Fherbalcraftgroup%3Ffbclid%3DIwAR2N52goGkBmToZO-cGM4CrUbKBWx1UH48vy56ijuf1oWjyji5CtDt0TM2c&h=AT0eczNtYsfX2Oc2cGBt4MfRnr7lKVDTR3RbQQeVH7dq-gJsyFEPNs2Hu7lzQwOxYj9Ikfokup6rm6zCH5D4NASKPGNo04YBrAdUa0-ADE_Rc4ZmnakTSoHsprVxeI346fnbnLQ-GbIrnUAVj5iSD8-6OI1nin6K17yQRjy83KzFCceQhODedom1kP4swsCLVPKT1K4WguGDJfzA1QkESehRI47UX93zJiddTRvYqKy1CpJI4_MhXJRD8XbZ8iefYnJtGqLLcgIwItfkQGGX1MoVGjDbJHt-c0o6OluE12-C57DUcbFFPQ3sS_lzUhen9yCeDG8Pya7pYrChsSoaq5UiyKPAewSsH6k80RRJ1NqsxH4dYMSM0r1sEqiuPJUgVOK139SiyfHKljcE314uqmH0AKBTId9LqHwb8OTEY7CZ9CYTz-UC8PLsMiB2N9DB4L4SRBvm-SASkRtQ7aaXJBKfiR6rz-aymgC-LYW9veD4S3k6nLztZdjYumrkXyZ1e_lORpZPVdvQEWEWdLNcrkcQMbHdbPrt2rJo6wU1HTrBQIFhlRyJjprnxW-sPA2N7AbOB0zSg_gNpmF_8P5ZSlhGgskGCKwJ-fzTZ-RMSA9di51XZFvPXj4Qbx5D7pDVvQ)\n\n[https://amzn.to/2ISOHGa](https://l.facebook.com/l.php?u=https%3A%2F%2Famzn.to%2F2ISOHGa%3Ffbclid%3DIwAR29RKkeGwx85RhrpYJ13GDKLEHaXjQR3bnMGVFIRS_ExQC8IUglKZxadU4&h=AT2bPKbWDEUNNJQU4Uwhn1brMGwYut4e4_9-sAqzXh_IDi9JnLl00_Oiv0Xfawy5EfWHS8OKrdlNwRB-U2URCchNdDzO3c1LTZxA_VBxuaVL76P6unI2NG0OSMqrdIIsZFrj-s962EJXbIOHVw-PHDmPtdH7tM48h3mk4MJ9w_M_sXypbctx9w4pwke4zjXsFD_FhETDHq1iqMZb9AmGjWJmZ9zLdlHL4ywjd7vcUDc8eAMGyxogNxNhFGlvfmz6UNVRwjVQMVi-BbqtOKIlGYVvm3kPhn7IG5VApdwb2nSJmtzsidcE4DLtbl8vZUSMaRJAgbwD7put8LQR7txSu-Livfc0jzLEDS-nAXn-Z_MtqwMhsFa-RzOsMVXAHg3iVqPcfZ878qJi6zi7WwpPg268N7SznkoN7NTmupQ5iUHze4DLU7qSVPjiwpBUvCfgqbOKdQiPVgHYfmXyUemhEfBk9MnmYHWfvatGV7nWc82NK6smR6Ynvk9JewW714BISVrffjn4JwdiZ9Q9H2amH-jnYoKlua2UeL83b4fGjYL2FORMErCo1Y_jncUljJ1CYMlgMctYhVkWuyzzxE1Rgd-EsVmnEDGVh6_V-PDuw9cjxa5ZH6bxJU4gBTCzNxoqPg)  \n [https://amzn.to/2MKFF3A](https://l.facebook.com/l.php?u=https%3A%2F%2Famzn.to%2F2MKFF3A%3Ffbclid%3DIwAR0lmblp1ca6TDMb8fl1EzZfTW-5LMFgPXJCDNKs6-mqMe-NcdYzvB-GZS8&h=AT0M15bu_APVGdZBGUdgxmcDOM0PoU-u6RnX1uCFRtzQpr9gymLATCnbWGwugP5SnICC9sYF8cqHRfNd6saaAao8Ow9xGsxOxi_6SfZBHmJoROfbmbau953aMROg99G2rm2mtgmON72Y5ytRLOgwmEdc7s-AR7QHqQrpIaw9jZlezo9JxKHvA4gJzliTX_PS6m6tqGxsj_xKjzTVBYx8K6VybpSv5CGuxk9RJX6mb8JqiQvFWI7apHGy2Eqln6Nhh1jzpVVrjMO0pznANOzXcWNzH_rIRYQ16X9F-vk2pQMtjU094Aj28WwkIGAhLbJLeLFi0D2BMAWU4EIyVGSn3kWKZV6jP9lHxzlzCX4U2b33uFUn79HaPA0m17pjXWf3eGoUMY2f_GB4PZSP839jY-9CqT1qw10yMYyCW5XtPx9dVuwplSWP-rc8RBQ_NeLXBi_7F3qzBfKakJTavNdIVa2WbXyDAvckJFswOWK459JhlhqgysxkpCQfxY5dhIjPOnC6kmzXJ_90X3ab1MXl2ATx7BKpxn_92ZBtX6i_ngMVW9VVVe9HgVY92Qd2JqFlTbl6VnocSdp1HIifnZM_b4ZizQd_WYYCCgd04iIqqCp4sFdwL7lA4hFMYfLACGxb0g)\n\nYou can get these plants from us by contacting us on facebook and email : info@herbalcraftgroup.com\n\nVisit our website: [herbalcraftgroup.com](https://l.facebook.com/l.php?u=http%3A%2F%2Fherbalcraftgroup.com%2F%3Ffbclid%3DIwAR3Lo5_Uq9ltMJ0r0nCVwYvVMQZ9vwCv1DNGFHg4e9_Jpjyv0hHddLaL82Y&h=AT13ONAUjdmgZFmsRfndF-lOsphTb2cNPCYZyDFCgT0y10PZ4wrtcmfFrQ8LhLl0JllU_PC_9JJ8CprvDyKXKyB4JOpTsZmuIjycQUrJJXyoEUYKtEnGS0EoqFGa2qzycePSJWbV2ss-wg68RXsvaljOan_G2XW3bQodaYrVdOEb51gBpFsRyAiVfhMqfm0xPqzu4iCjOi0c99x4yc_p41MiuuxLnBsDF_S4-LXTomTP2_8zIrBYLFj84DGUeIIY1J-UOIO3VuPU14zCS7gvr9cTjDUQrKzH7OCILncmdSWKT3g6-l2UTZfnNodCrkGSc9KS0x0TDf4ZGAq-nFuazs_UpPcnyLzp0XkeSyGJuC8HZgFWBgVf06JK2nYAKHoi0SvKFj0Ggz1WsfRPiCDTwupWnHpieS5DFZht_FbQppsmwFZaN3G_6368p8Mr3ZjlUh3Kco1QGVQfBe0domdn-KwPbSBwNWjfUEOCW1oHhgAA1dDmmRIegXz8b37d7G5GVyNvvNdNgScFmE41V44nUdfcdQsMCPCRx5_rcd8-KxzhniDLq3lQepiUHahKAJVFOw1aHxQ58DOrRKmUmyYsbaLng3zStZapRYx62RE6X41FxleJjyeBzXTdwbuL_25mvg) for more info.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1s00q8",
    "title": "Bumps on my forehead",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1s00q8/bumps_on_my_forehead/",
    "score": 6,
    "num_comments": 4,
    "created": "2013-12-03T16:17:52+00:00",
    "body": "Hey, guys, thought I'd go out on a limb and post this because I have no idea what to do about it. Lately I've been super stressed out and it caused a ton of acne to appear on my face. I've since gotten less stressed out, and it seems like my skin has benefitted some (fewer white heads and...I guess it's called cystic acne(?) along my jawline where I usually break out), but I've got tons of itty bitty bumps on my forehead where I usually don't have any acne. None of them have developed into white heads, but they're not blackheads either. I'm not really sure what to call them. Anyway, they don't seem to have gotten better since I got them (maybe 1.5 weeks ago or so).\n\nI haven't really changed anything lately, so I don't think it's that. I used cerave in the tub twice a little while ago, around the time this all started (didn't patch test, should have), but I wouldn't think that would cause this to last this long, and I haven't used it since. Same deal with using mineral oil in my OCM, but I started that earlier and it seemed to be going okay, until this happened, and thinking perhaps it was another possible culprit, I went back to my usual combination of neem seed oil and grapeseed oil.\n\nGot some more neem seed oil lately from GoW and it smells more pungent, more bitter than the last batch, and sometimes has a few little grits in it as it comes out of the bottle. Is this a sign that it's bad? Even if so, is this likely to be my problem?\n\nHere's my routine:\n\nAM: Cleanse with Cerave Foaming. Moisturize with a couple drops of argan oil. Make up. (I know, I'm missing a sunscreen. Working on this, but have put it on hold since I'm trying to get my break-out under control and don't want to ADD things that are likely to be problematic, like SPF.)\n\nPM: Remove makeup (with grapeseed oil). OCM with Neem and grapeseed oils. Cleanse with Cerave Foaming. Stridex red box. Rest 15 minutes. Moisturize with a bit of argan oil. sometimes neem seed oil as a spot treatment.\n\nAny advice, anecdotes, whatever, is welcome. I'm at my wits end. Halp.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "cotw2012",
        "body": "I integrated 2.5% BP very slowly as a spot-treatment for these bad boys -- it made the bumps die down, but they still get relatively inflamed if I pick at them/rub the skin. They're not gone yet but it's been a great improvement!!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1xgugx",
    "title": "Need some advice on a new sunscreen!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1xgugx/need_some_advice_on_a_new_sunscreen/",
    "score": 4,
    "num_comments": 0,
    "created": "2014-02-09T22:33:31+00:00",
    "body": "Over the weekend I had an allergic reaction all over my neck and broke out in hives! I went to the doctor and it's getting better, but we could not figure out exactly what caused it. The only thing I had been applying to my neck was my sunscreen, which I also use on my face with no problems (but it is over moisturizer on my face). I wasn't especially happy with my sunscreen anyway and was just waiting to decide what new product to get, so I'm going to switch now. I looked into Shiseido Urban Environment sunscreen, but $30 for 1 oz. of product is a bit expensive for a college student. My second choice was Elta MD UV Clear, even though $30 for 1.7 oz. is still quite expensive. I think I'm going to go for it but I wanted to double check here and see if it sounds good for me.\n\nMy skin is combination dry, dehydrated, acne-prone, and I am currently dealing with a lot of PIH/PIE, big pores on my cheeks and forehead especially, and mild to moderate atrophic scarring . Here is my current routine:\n\nPM:\n\n1. OCM to remove makeup with mineral oil\n\n2. Once skin is free of makeup, OCM again on clean skin\n3. Remove oil with Cerave Hydrating Cleanser\n4. Wait 20 minutes\n5. Use either Atralin (tretinoin gel 0.05%)\n**OR** Paula's Choice Skin Perfecting 8% AHA Gel (Glycolic Acid)\n6. Wait another 20 minutes or so\n7. Cerave Moisturizing Cream in the tub with a little drop of neem seed oil mixed in\n8. Extra neem seed oil massaged into active breakouts \n9. Top dry areas off with Aquaphor Healing Ointment\n\nAM:\n\n1. Rinse well with cool water\n\n2. Cerave Moisturizing Cream\n3. Neutrogena Clear Face Break-out Free sunscreen Broad Spectrum SPF 30 with Helioplex\n4. Primer and Makeup\n\nMy skin has been improving since discovering this sub and following the advice I've found here while slowly phasing in the products in the beginner's routine. I was still using my old sunscreen and I know how important of a step that is so I wanted to double check that Elta MD UV Clear would be good for me! Thank you!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "soapmaking",
    "post_id": "f7xa5j",
    "title": "Soap turns out too soft",
    "url": "https://www.reddit.com/r/soapmaking/comments/f7xa5j/soap_turns_out_too_soft/",
    "score": 5,
    "num_comments": 10,
    "created": "2020-02-22T19:20:16+00:00",
    "body": "So I usually use recipes from  a book I have but lately I tried to change some of them or change proportions based on what amount of ingredients I have. \nI did this receipe: \n\nBeef tallow 35% - 368.55 g\nCoconut oil 35% - 368.55 g\nOlive oil 25%- 263.25 g\nNeem seed oil 5% - 52.65 g\n\nLye concentration 27.901 %\nWater : lye ratio 2.5841:1\nWater as percent of oil weight: 38%\nSuper fat 5%\nFragrance weight: 32.64g \n\nTotal oil weight: 1053g\n\nThis soap turned out super soft. It's been in form for 3 days and I still had trouble to take it out. It's been a week and I still can't cut it. I noticed this happened to three of recipes that I ran through this particular calculator. I wonder if lye concentration or amount of water etc is too high? What proportions is good to use? This particular calculator let's me choose all the proportions but I think my chemical skills are not as good yet to make decisions like that so I just keep it as it is suggested (default amounts). What is causing my soap to be soft? Will it still be usable for my own use or should I throw it away?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "yavanna12",
        "body": "Leave it in the mold longer. My beef tallow soap took much longer to cure and was super soft for a week in the mold. Then I put it in the freezer to pop out but was still very soft for weeks. I’ve let it cure for 3 months and they are now hardening up. Some soaps just take longer especially when you have softer oils as the majority.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "lushy_soaps",
        "body": "I ran your recipe through the calculator and everything seems about right! The hardness quality is at 54 which is the max stated in the range shown, so you should have been able to unmold after 24h. I make soap recipes with 35% coconut or even less sometimes and it's the only hard oil I use and I can still unmold after 24h (sometimes 30h or so). Maybe you reached false trace? Next time do a water discount of 5 or 10%. I personally use specifically the Lye Concentration/strength at 33% which allows me to have a harder soap quicker. I ran your recipe with 33% lye strength and it's showing water at 314.39gr instead of your recipe that has shown 400gr.  You can also add some salt to your water before you add the lye 1/2 tsp PPO or sodium lactate (I don't use this so I can't advise on it, but I heard only good things about it and lots of people use it). \nI hope it helps.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "soapbuddy",
        "body": "I find if the soap didn't gel, it can take longer to get hard.  Give it time.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "IrradiatedSlime",
        "body": "As a fellow soaper, I would recommend adding salt to your lye solution, About a teaspoon per pound of oils should do the trick",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "technosdoll",
        "body": "Please YouTube  some vids on how to use a lye calc, this is vital. \nAnd the way you typed out your recipe  i had trouble reading and figuring out  what you mean.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FragranceFreeBeauty",
    "post_id": "1g2y9qf",
    "title": "Fragfre detangler plus spray",
    "url": "https://www.reddit.com/r/FragranceFreeBeauty/comments/1g2y9qf/fragfre_detangler_plus_spray/",
    "score": 4,
    "num_comments": 13,
    "created": "2024-10-13T19:55:12+00:00",
    "body": "These are the ingredients listed on the website. Organic Aloe Leaf Juice), Cetearyl Alcohol, PEG-40 Castor Oil, Stearalkonium Chloride, Vitamin E, Sunflower Seed Oil, (Organic Neem Seed Oil), (Organic Rosemary Leaf Extract), (Organic Sunflower Seed Oil), Phenoxyethanol, Hydrolyzed Wheat Protein, Provitamin B5, Glycerin, Meadowfoam Seed Oil, (Organic White Willow Bark Extract), (Organic Alcohol), Tetrasodium Glutamate Diacetate. Does anyone know what type of alcohol the \"organic alcohol\" is? I need to know if it is likely to be drying. Thank you! ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Obubblegumpink",
        "body": "Also, It’s a 10 has a leave on spray that works well as a detangler and heat protection.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "SnapCrackleMom",
        "body": "Ask the manufacturer. What product is this?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "secretlycurly",
        "body": "Doesn't rosemary leaf extract add a scent?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Terrible-Pay-3965",
        "body": "I personally did not like this product. It was weird and greasy. But I might be biased because I was under the impression that it was gluten-free when it contained wheat. I have a wheat allergy, so that was fun...",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ok_Banana_5958",
        "body": "Philip Adams has a spray detangler I like so much more. The fragfre one was sticky and clumpy in a bad way",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AussieMakeupTrade",
    "post_id": "fbr3rx",
    "title": "[SELL] Massive skincare and makeup destash, most barely used- Western and Asian Beauty Brands - A’kin, The Ordinary, Innisfree, Round Lab, Innisfree, Isntree, Klairs, Missha, Laneige, Bourjois, Dior, Nude by Nature, Tarte, LA Girl, Iope, Peripera",
    "url": "https://www.reddit.com/r/AussieMakeupTrade/comments/fbr3rx/sell_massive_skincare_and_makeup_destash_most/",
    "score": 5,
    "num_comments": 11,
    "created": "2020-03-01T08:14:34+00:00",
    "body": "I’ve bought lots of things I’ll never get around to using. Please help by taking them off my hands… \n\nMeet up in Sydney CBD weekdays. Can also post using Australia Post bags - $9.20 for small postage bag (35.5 x 22cm) or $12.45 for medium postage bag (38.5 x 26.5cm). Some smaller/flatter items that are less than 20mm wide can fit in letter post ($3.30) but won’t have tracking.  \n\nOpen to offers. Prices are for Paypal F&F, or add 3% for Paypal G&S. \n\nA few items are free with any other item. \n\n**Skincare - Western Brands:**\n\nCleanser \n\n* A'KIN Nourishing Cream Cleanser & Toner - NEW - $10 ([Link](https://imgur.com/dYELZfO))\n* GARNIER Pure Active 3 in 1 (Travel Size) - NEW - Free with any other item ([Link](https://imgur.com/ydXVMs0))\n\nTreatments - Serums, Exfoliants \n\n* THE ORDINARY Buffet - NEW - $18 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Lactic Acid 10% + HA - NEW - $6 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Lactic Acid 10% + HA - 70% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n* THE ORDINARY Mandelic Acid 10% + HA - 80% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n\nMoisturiser \n\n* A'KIN Calming Facial Moisturiser - NEW - $10 ([Link](https://imgur.com/dYELZfO))\n* SIMPLE Kind to Skin Replenishing Rich Moisturiser - NEW - $5 ([Link](https://imgur.com/dYELZfO))\n* THE ORDINARY Natural Moisturizing Factors + HA - NEW - $7 ([Link](https://imgur.com/ydXVMs0))\n\nOils\n\n* Neem Seed Oil - Used 1x - $5 ([Link](https://imgur.com/5qDQK78))\n* HAB SHIFA Black Cumin Seed Oil (Nigella Sative Oil) - 60% remaining - $5 ([Link](https://imgur.com/5qDQK78))\n\n**Skincare - Asian Beauty Brands:**\n\nCleanser \n\n* ROUND LAB 1025 Dokdo Cleanser - 60% left - $10 ([Link](https://imgur.com/VVhTEKD))\n\nTreatment - Toner, Essence \n\n* I’M FROM Mugwort Essence (mini) - NEW - $5 ([Link](https://imgur.com/cj6ucDU))\n\nMasks  \n\n* INNISFREE Jeju Volcanic Melting Clay Mask - used 3-4 times - $5 ([Link](https://imgur.com/uAoB83a))\n* INNISFREE Jeju Volcanic Blackhead Out Balm - NEW - $8 ([Link](https://imgur.com/uAoB83a))\n\nMoisturiser \n\n* ISNTREE C-Niacin Toning Cream - 50% left - $6 ([Link](https://imgur.com/VVhTEKD))\n\nSunscreen \n\nKLAIRS Soft Airy UV Essence SPF50+ PA++++ - NEW - $30 ([Link](https://imgur.com/J9yf3td))\n\n* A'PIEU Power Block Daily Sun Cream SPF50+ PA++++ - NEW - $15 ([Link](https://imgur.com/J9yf3td))\n* DR G Airy Skin Up Sun Spf 50+ Pa++++ - NEW - $15 ([Link](https://imgur.com/J9yf3td))\n* MISSHA Cicadin Centella Rescue Sun Lotion SPF50+ PA++++ - NEW - $14 ([Link](https://imgur.com/J9yf3td)) - 2 available\n\n**Makeup - Western Brands:**\n\nFace - foundation, primers, concealers, setting sprays \n\n* BOURJOIS Healthy Mix Serum Foundation - 51 - Used 5x - $10 ([Link](https://imgur.com/pmtZLhd))\n* MAYBELLINE Fit Me Matte & Poreless Foundation - 128 Warm Nude - Swatched - $12 ([Link](https://imgur.com/pmtZLhd))\n* MAYBELLINE Face Studio Prime Anti-Redness Primer - Used 2x - $5 ([Link](https://imgur.com/pmtZLhd))\n* NUDE BY NATURE Natural Mineral Cover Foundation - Beige - Used 2x - $25 ([Link](https://imgur.com/pmtZLhd))\n* WET N WILD - Photo Focus Natural Finish Setting Spray - New - $5 ([Link](https://imgur.com/pmtZLhd))\n* ULTA3 Darkening Drops - NEW - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Green corrector - Used 2x - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Yellow corrector - Used 2x - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Creamy Beige - New - $4 ([Link](https://imgur.com/pmtZLhd))\n\nCheeks \n\n* TARTE Amazonian clay 12-hour blush - Paaarty (mini) - swatched - $10 ([Link](https://imgur.com/E6BJBPh))\n\nEyes \n\n* BOURJOIS Smoky Stories Quad Eyeshadow Palette - Sau Mondaine - Minimal use - $10 ([Link](https://imgur.com/E6BJBPh))\n* INNOXA Eyeshadow Palette - Daytime Neutrals - Minimal use - $10 ([Link](https://imgur.com/E6BJBPh))\n\nLips \n\n* BOURJOIS Rouge Fabuleux Lipstick - Perlimpinpink - swatched only - $10 ([Link](https://imgur.com/ecOZTb9))\n* DIOR Rouge - Victoire - barely used, see remaining - $30 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Ultra HD Lipstick - Rose - see remaining - $3 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Ultra HD Lipstick - Tulip - see remaining - $3 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Super Lustrous Lipstick - Fuchsia Shock - - barely used - $3 ([Link](https://imgur.com/und6Cvc))\n\nTools\n\nTARTE Picture Perfect Eyelash Curler - tested only, mini mascara not included - $20 ([Link](https://imgur.com/vLK5Y5K)) \n\n**Makeup - Asian Beauty Brands:**\n\nFace - foundation, primers, concealers, setting sprays \n\n* IOPE Air Cushion Natural Glow w/ Refill SPF 50+ PA+++ - #23 - New - $50 ([Link](https://imgur.com/YlVWoSR))\n* PERIPERA Ink Skin Tint - #3 Sand Cover - Used 1x - $10 ([Link](https://imgur.com/pmtZLhd))\n* MISSHA Magic Cushion Moist Up SPF50+ PA+++ - #23 - New - $20 ([Link](https://imgur.com/YlVWoSR))\n* LANIEGE BB Cushion Anti Aging - #23 Refill Only - New - $25 ([Link](https://imgur.com/YlVWoSR))\n\nLips \n\n* CLIO Mad Matte - 13 Salmon Rose - Used 1x - $10 ([Link](https://imgur.com/ZwpwFay))",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Evergreen-Symphony",
        "body": "Is the mini Tarte blush still available?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "vegetablegardening",
    "post_id": "13f99jl",
    "title": "Help! What's going on with my garden? 😭",
    "url": "https://www.reddit.com/r/vegetablegardening/comments/13f99jl/help_whats_going_on_with_my_garden/",
    "score": 3,
    "num_comments": 3,
    "created": "2023-05-12T03:24:09+00:00",
    "body": "It looks like this spreading to everything in my garden from tomatoes to herbs and possibly other plants. Unless I'm going crazy over thinking it. I sprayed neem seed oil on my plants 2 days before and Fertilize them as well. (3 TableSpoons neem seed oil per 16oz bottle) But I don't know if that's what caused it as i didnt know about it. My wife water's the garden everyday and the plants get full sun all day long. I did notice a problem as my wife was overwatering everything so we didn't water them today in hopes if it was rotting or something. We bought some disease control and sprayed the entire garden (only listed plants and vegetables on label) with bonnie white bottle. What is this? What can we do? Is the entire garden gonna die?😭\n\n\n\nWe use\n -Kellogg Organic Pink Bag Soil -Mushroom Compost on vegetables\n -organic worm casting\n -Espoma Fertilizer\n -Miracle Grow Fertilizer\n -For Mulch we use cedar wood chips\n\n\nPest we notice this month Whiteflys and Gnats",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "trebuchetguy",
        "body": "That's a fairly classic presentation of septoria leaf spot, which is a fungal disease.\n\nHere's a [link](https://extension.wvu.edu/lawn-gardening-pests/plant-disease/fruit-vegetable-diseases/septoria-leaf-spot) to the WVU extension office web page on the topic. I think they do a good job of going through what it is and what you can do to mitigate it.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "CitrusBelt",
        "body": "Well, on the tomatoes at least....diseases are often hard to differentiate (there's often different strains of the same disease, and in any case the same disease can give symptoms that look wildly different depending on weather/temps/etc.), but I'd suggest you do some googling for \"bacterial speck tomato\"",
        "score": 5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "3nzyj1",
    "title": "[Product Question] Neem Seed Oil Properties?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/3nzyj1/product_question_neem_seed_oil_properties/",
    "score": 2,
    "num_comments": 2,
    "created": "2015-10-08T17:50:59+00:00",
    "body": "I see claims about the benefits of neem seed oil (antibacterial, antiseptic), but what about the oil gives it these properties? Is there any research to support these claims ?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Reverserer",
        "body": "many oils have different properties - if you ar e looking for a specific scientific study go to pubmed - neem seed oil is also a powerful anti-fungal (so is tea tree oil) and a bug repellent- there are tons of studies on that as neem is actually used in commercial grade repellents.\n\na few interesting articles:\nhttp://www.ncbi.nlm.nih.gov/pubmed/26195902\nhttp://www.ncbi.nlm.nih.gov/pubmed/25563612\nhttp://www.ncbi.nlm.nih.gov/pubmed/24502533\nhttp://www.ncbi.nlm.nih.gov/pubmed/20362038\n\ni know it's all so....scientific ...but these studies show the antibacterial and antimicrobial properties of neem have been tested and proven effective.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "bebemona",
        "body": "directly from Paula's Choice\n> Extract from leaves of the neem tree, it has potential toxic effects, although it also has been shown to have antimicrobial properties, too. A component of neem known as nimbidin contains sulfur and is likely responsible for neem oil's unpleasant odor (Source: Food and Chemical Toxicology, April 1993, pages 297-301). Neem oil is approved as a pesticide in the United States, and, surprisingly, there's no reliable research proving neem extract or oil has any benefit for skin in terms of common skin types and concerns, though you can find a fair number of studies on neem's insecticidal properties for conditions like head lice and scabies (Sources: Parasitology Research, September 2006, pages 353-356; and Lancet, May 2006, pages 1,767-1,774).\n\n> There's one study showing the seed extract from neem contains compounds that can reduce melanin (skin pigment) formation on isolated animal cells, but as this research was not done on intact human skin presenting with pigment irregularities, we don't know if the same lightening effect would be seen (Source: Journal of Oleo Science, November 2009, pages 581-594).",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SIBO",
    "post_id": "1c3rr65",
    "title": "What other herbal antimicrobials should I try",
    "url": "https://www.reddit.com/r/SIBO/comments/1c3rr65/what_other_herbal_antimicrobials_should_i_try/",
    "score": 2,
    "num_comments": 4,
    "created": "2024-04-14T11:50:43+00:00",
    "body": "Hey!\n\nI've been taking berberine and oregano oil together for around 2.5 weeks now and while some symptoms have improved a bit, the most annoying one is still there: diarrhea.\n\nI mostly have methane but it can be a mix of methane and hydrogen on some days. I also have my first ever vacation coming up in just 2.5 weeks and I would REALLLLLY love to get rid of diarrhea by then or else it's just going to be a complete nightmare/I'd have to miss the trip. I want to try allicin, but I cannot find ANY allicin supplements in Estonia. There are some garlic capsules and stuff like that, but they seem to have very little allicin in them and I'm afriad they could cause more problems instead.\n\nNeem seems to be hard to find too. I've heard that it's recommended to use neem seed oil, but all we have here is some kind of powder from the neem tree and that's pretty much it. I've also heard of some possible bad side effects.\n\nI don't have a lot of money to spend on a lot of supplements. Doctors can't really be bothered to help (and it takes way too long anyway). I'm not sure what else I should try to use. Maybe someone knows any good herbal antimicrobials that could aid with my symptoms and methane levels.\n\nThanks!",
    "flair_text": "Questions",
    "flair_template_id": "813a77b6-c787-11ed-b628-5254516f73f3",
    "comments": [
      {
        "author": "tbythesea1234",
        "body": "I hope you can get things sorted out before your vacation, but it might be good to start thinking about symptom management plans. Vacations can still be fun, but you just need to prepare (I've been dealing with this for 15 years and I've managed to have enjoyable vacations)\n\nHave you tried a prokinetic? That's what has really made a difference for me. There are cheap-ish supplements",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "redbull_coffee",
        "body": "Try cutting down on carbs, like, all the way down to less than 50g per day or as little as possible. Also reduce you fiber intake.\n\nYou can also try taking NAC, ateounf 500mg per day or more, as a biofilm disruptor",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "zallydidit",
        "body": "Digestive enzymes can help relieve symptoms temporarily and get you much needed nutrients to prevent malnutrition, as you wait to find a permanent solution.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Cold_Age_5787",
        "body": "Digestive enzymes really helped me as well as Saccharomyces boulardii.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "gardening",
    "post_id": "13f947k",
    "title": "Help? I don't know what going to my garden😭",
    "url": "https://www.reddit.com/r/gardening/comments/13f947k/help_i_dont_know_what_going_to_my_garden/",
    "score": 2,
    "num_comments": 2,
    "created": "2023-05-12T03:17:30+00:00",
    "body": "It looks like this spreading to everything in my garden from tomatoes to herbs and possibly other plants. Unless I'm going crazy over thinking it. I sprayed neem seed oil on my plants 2 days before and Fertilize them as well. (3 TableSpoons neem seed oil per 16oz bottle). But I don't know if that's what caused it as i didnt know about it. My wife water's the garden everyday and the plants get full sun all day long. I did notice a problem as my wife was overwatering everything so we didn't water them today in hopes if it was rotting or something. We bought some disease control and sprayed the entire garden (only listed plants and vegetables on label) with bonnie white bottle. What is this? What can we do? Is the entire garden gonna die? 😭\n\nWe use \n-Kellogg Organic Pink Bag Soil\n-Mushroom Compost on vegetables \n-organic worm casting\n-Espoma Fertilizer \n-Miracle Grow Fertilizer\n-For Mulch we use cedar wood chips\n\nPest we notice this month Whiteflys and Gnats",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Temporary_Olive1043",
        "body": "Hey I dm you, but I think it’s overwatering and this could be tomato leaf spot. A fungicide should stop any spores or spreading.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FeelingDesigner",
        "body": "The blueberries are fine.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "8bvrf9",
    "title": "[Acne] Using Retinol for Acne?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/8bvrf9/acne_using_retinol_for_acne/",
    "score": 2,
    "num_comments": 2,
    "created": "2018-04-13T02:12:58+00:00",
    "body": "For the past month my skin has been super angry at me for some reason lol, enormous breakouts and I’m not sure if it’s from hormones or from stress or whatever. So about a week ago I decided to try this product called help me by philosophy which is a retinol cream. I’ve been wanting to try retinol for a long time because I’ve heard such great things about it for acne and wrinkles etc. I’m not like super worried about wrinkles, I’m only 23. But I’ve noticed that my skin has not changed, if anything it’s gotten worse. I’m thinking it might be purging because of the retinol but can’t be sure. If anyone has an idea if the retinol will even be worth continuing please let me know!!\n\nRoutine:\nAM-\nRinse with water\nChanel le jour day serum \nREN daily Mineral supplement moisturizing cream\nBosia eye cream\n\nPM-\nLancôme honey makeup remover\nAlternating cleanser, one night Fresh Soy face cleanser, one night dr. Bronners liquid Castile soap\nEvery other night MAC charcoal face mask\nLately I’ve been using neem seed oil as well as a mask and washing it off\nPhilosophy Help Me retinol night cream\nChanel la nuit night serum\nOrigins niteamins night cream\nBoscia eye cream\n",
    "flair_text": "Acne",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Kirke910",
        "body": "My skin purges when I first start a new retinol (been working my way up to stronger formulations). Every time I switch to a stronger one I purge again. My skin always gets worse before it gets better. You have to stick with it for a couple of months. It’s annoying but I’ve  had amazing results using a retinol to clear my adult acne. For me it’s been worth it, and I think if you can stick with it until everything clears you will agree.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "86btfg",
    "title": "Is Doggy Dental Gel Safe? - Liver Problem",
    "url": "https://www.reddit.com/r/AskVet/comments/86btfg/is_doggy_dental_gel_safe_liver_problem/",
    "score": 2,
    "num_comments": 1,
    "created": "2018-03-22T14:17:33+00:00",
    "body": "Species:Dog\n\nAge:4\n\nSex/Neuter status:neutered\n\nBreed:Cavalier King Charles Spaniel\n\nBody weight:37\n\nHistory:My 4 year old male Cavalier has had problems with elevated liver enzymes.  X-Ray and Ultrasound images looked normal.  Our vet advised us to discontinue his Trader Joe's dried chicken filet treats because they have been associated with problems.  \nWe wanted to ask your opinion about the safety of the product below.\nGel Me: Doggy Dental Gel (4oz) Ingredients: Grape seed extract, grapefruit seed extract, peppermint oil, rosemary oil, neem seed oil, and thyme oil\n\nClinical signs:after almost two weeks he is still showing low appetite.  \n\nDuration:2 weeks\n\nYour general location:Dallas, TX\n\nLinks to test results, X-rays, vet reports etc:X-Ray and Ultrasound looker normal.  He took an antibiotic and is still taking Denamarin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "DrDead88",
        "body": "Wouldn't mess with it. Essential oils can be variably toxic, and the last time I looked into neem seed oil it didn't look so nice. \n\nIf you need something for his teeth, find something with the [VOHC](http://www.vohc.org/VOHCAcceptedProductsTable_Dogs.pdf) seal, and brush his teeth. If he has dental disease right now, all that will help is a dental- brushing and those other approved products are preventative only.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "makeupexchange",
    "post_id": "4b0ite",
    "title": "[SELL/SWAP][US/INTL] UPDATED HIGH END DESTASH! Burberry, Chanel, Guerlain, Giorgio Armani, Becca, MUFE, LE MAC, ABH, Bite, MUG, and more!!!",
    "url": "https://www.reddit.com/r/makeupexchange/comments/4b0ite/sellswapusintl_updated_high_end_destash_burberry/",
    "score": 2,
    "num_comments": 15,
    "created": "2016-03-18T22:19:02+00:00",
    "body": "Hi everyone! \n\n[Flair thread 1](http://www.reddit.com/r/mueflair/comments/2oejec/midnightunicorn_flair_thread/) [Flair thread 2](https://www.reddit.com/r/mueflair/comments/3g7m0l/midnightunicorn_flair_thread_part_2/)\n\nNo minimum!\n\nPayPal Gift is strongly preferred but if you want an invoice it will cost an additional $0.30 + 2.9% of the total.\n\nShipping is from Massachusetts and will be calculated based on weight. It starts at $3 and is not usually over $5 in the US.\n\nPlease see pictures for usage. If its pictured but not listed, its gone.\n\nI can only hold items for 1 hour until it goes to the next person!\n\nNO PMs until we've finalized in the comments!\n\n**WISHLIST** *SWAP ONLY*\n\n*ONLY INTERESTED IN THESE ITEMS*\n\n**ABH Eyeshadow in Metal, Belize, Chocolate Crumble** WILLING TO BUY\n\n**Burberry Eyeshadow in Nude**\n\n**MAC Lipsticks in Faux, Taupe**\n\n**MAC Blacktrack Fluidline**\n\n**Kiehl's Clearly Corrective Serum**\n\nMAC Fix+\n\nChanel Le Volume Mascara\n\nCharlotte Tilbury Lipstick in Walk of Shame\n\nColourPop Ultra Mattes in Bad Habit, Scrooge, More Better, Bumble, Tulle\n\nColourPop Cream Gel Eyeliner in Overboard, Show Me\n\nMAC empties for B2M\n\n**SALE STARTS HERE**\n\n[VERIFICATION](http://imgur.com/a/fRn9m) [VERIFICATION 2](http://imgur.com/a/4HyHD) [VERIFICATION 3](http://imgur.com/a/HTgea)\n\n**FACE**\n\n* Burberry LE Fragranced Luminizing Powder - Gold Glow **$45** about 85% remaining, pattern somewhat visible (retail $68) PENDING\n\n* Burberry Sheer Luminous Foundation - Trench #1 **$30** about 70% remaining (retail $52) \n\n* MAC LE Guo Pei Blush - Red Water Lily **$28** used 3x (retail $40)\n\n* Becca Beach Tint Shimmer Souffle - Watermelon/Moonstone **$13** 90% remaining, small dip, slightly pulling away from edge (retail $27)\n\n* Becca Beach Tint - Guava **$13** used 3x (retail $25)\n\n* Model Co Bronze Shimmer **$4** swatched (retail $24)\n\n* Giorgio Armani Fluid Sheer DS - #2 **$2** swatched (0.16oz) **or free with purchase of $10**\n\n**EYES**\n\n* LORAC Unzipped Palette **$25** RIS swatched 1x by me, looks swatched at most (retail $42)\n\n* MAC MACnificent Me! Palette **$20** used 5x (retail $32)\n\n* Chanel Illusion D'Ombre - Emerveille **$18** about 85% remaining, dip (retail $36) \n\n* Urban Decay Naked Palette **$18** heavy use - pan on Naked and Buck, dips in Virgin, Sin, Half Baked, Smog, Toasted, Hustle, no brush (retail $54) **packaging is beat up - paper is coming off from felt above mirror, some discoloration on paper** \n\n* Burberry Sheer Eyeshadow - Almond **$15** about 90% remaining, pattern still mostly visible (old formula) (retail $29)\n\n* Paula's Choice Nude Matte Palette **$12** RIS 2 shades hit pan, one with small dip, rest barely touched, **mirror is cracked but covered with tape - it came to me this way but I've had no problems with it** (retail $40)\n\n* Inglot Pigment - 80 **$8** swatched (retail $16)\n\n* ABH Dipbrow - Auburn **$10** 95% remaining, slightly cracked/pulling away but still creamy (retail $20)\n\n* MAC Eyeshadow pot - Quarry **$9** 95% remaining, no dip (retail $16)\n\n* Urban Decay Primer Potion DS **$4** BN (0.13oz)\n\n**LIPS** \n\n* Givenchy Le Rouge - Beige Plume **$18** RIS, used 1x by, looks swatched by other (retail $36)\n\n* Bite Matte Lip Crayon - Blood Orange (Discontinued) **$10** used 4-5x (retail $24)\n\n* MAC LE Toledo Collection - Barbecue **$15** about 80% remaining \n\n* MAC LE Wash and Dry Collection - Steam Heat **$18** used 2x \n\n* MAC Matte Lipstick - Fashion Revival **$10** used 2x (retail $17) \n\n* MAC Matte Lipstick - All Fired Up **$10** used 2x (retail $17)\n\n* Too Faced La Creme - Juicy Melons **$10** used about 3-4x (retail $22) \n\n* Fresh Sugar Lip Balm DS - Rose **$6** BN (0.08oz)\n\n**SKIN/SCENT/HAIR**\n\n* Paula's Choice Skin Perfecting 8% AHA Gel **$12** about 80% remaining (retail $28)\n\n* Bliss Fuzz Off **$8** RIS, unsure of usage, unused by me (retail $24) **there are numbers carved into the packaging, this was most likely received as gratis by the person I got it from**\n\n* Mario Badescu Drying Lotion **$9** used 3x (retail $17)\n\n* Mario Badescu Drying Cream **$9** opened, used maybe 1x (retail $17)\n\n* Living Proof Perfect Hair Day Treatment **$5** BN (1oz)\n\n* Shu Uemura Skin Purifier Cleansing Oil **$4** used 1x (1.6oz)\n\n* Mario Badescu Special Healing Powder **$5** used 1x (retail $12)\n\n* GlamGlow YouthCleanse DS **$4** BN (0.5oz)\n\n* Freedman's Peel Off Cucumber Mask **$2** used 3x (retail $5) **or free with purchase of $10**\n\n* Aveda Foot Relief Foot Cream **$2** BN (retail $9.50) **or free with purchase of $10**\n\n* Garden of Wisdom - Sunflower Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Neem Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Hemp Seed Oil **$2** BN (0.5oz) **or free with purchase of $10**\n\n* Garden of Wisdom - Passion Fruit Seed Oil **$1** BN (0.25oz) **or free with purchase of $10**\n\n* MAC Eye Makeup Remover DS **$1** BN (0.2oz) **or free with purchase of $10**\n\n* Burberry Body DS **$1** BN **or free with purchase of $10**\n\n**OTHER**\n\n* White floral metal palette rack **$4** 3 sections **will cost more to ship**",
    "flair_text": "Offer: Sell/Swap",
    "flair_template_id": null,
    "comments": [
      {
        "author": "risingsun70",
        "body": "Mufe eye palette please! Would you do $28 shipped to 90292?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "epikhighhh",
        "body": "MUFE Nudes you Need please!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "missmanutd",
        "body": "Mufe pallete please! :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "browbegone",
        "body": "Interested in the two MAC matte lipsticks if they're still available! Would you be able to do 18$ shipped to 02169 (MA)?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1j8lfz",
    "title": "Advice on some GoW oils",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1j8lfz/advice_on_some_gow_oils/",
    "score": 1,
    "num_comments": 3,
    "created": "2013-07-28T22:14:39+00:00",
    "body": "I recently got a few samples from GoW because I read about it a lot here. I habe eczema so red/dry parts on my face and also some nodules, right now about 4. I got almond oil, avocado oil,neem seed oil amd black seed oil. Anyone have any experience with any of these and how/when/where to use?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "naturaldrpepper",
        "body": "I use GoW oils every day - mostly argan and perilla oils (although I have neem and black seed in my cart right now!). What kind of information specifically are you looking for? [Just because I say that *I* would do something, does not make it the right thing to do, or that my choice of application will work for you/anyone else. Just my own opinion about how to use them.]\n\nGoW has great info on all their oils - you just apply to the various areas. :) Almond oil is supposed to be very nourishing and hydrating, so that would be good on the dry spots. Neem is great for acne, so I would apply that on active acne spots. Black seed is supposed to be healing and nourishing to damaged or irritated skin, so I would use that on healing acne spots and maybe any PIH you have, as well as red/dry areas. Avocado seems more of the same, so I would apply similarly - seems like you could layer that on top as a light, all over facial oil (since it's supposed to be anti-wrinkle as well).",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2ikql8",
    "title": "Requesting Neem Oil Advice",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2ikql8/requesting_neem_oil_advice/",
    "score": 1,
    "num_comments": 2,
    "created": "2014-10-07T17:05:45+00:00",
    "body": "So I'm reading tons of great things about Neem Oil as a spot treatment.  I don't get much acne, and when I do it usually heals well and relatively quickly.\n\nHowever, I have a stubborn forehead spot that is swollen, red, somewhat painful to the touch (although less painful as of the past 24 hours) that has been around for about 5 days.  It is showing no sign of coming to a head.\n\nMy first question would be:  does neem oil sound like a potential solution to this issue?\n\nSecond:  what should I look for when purchasing it?  Are there over the counter brands that are legit?  Am I looking for pure neem oil, neem seed oil, some sort of dilution or mixture?  Since it is only an isolated incident, I don't see any point in ordering something online.  I live in Canada if that helps.  \n\nThanks !  Warnings/ suggestions are welcome and appreciated.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "mastiii",
        "body": "Neem might help, but you won't know until you try it. Lots of people love it as a spot treatment but it doesn't do much for me. You can get neem or neem seed oil (should be the same thing). It should have no other ingredients.  I found mine at Whole Foods, so if you have one nearby you can check there. Other health food stores might have it too.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "houseplants",
    "post_id": "1bthu6o",
    "title": "infestation on my plants :(",
    "url": "https://www.reddit.com/r/houseplants/comments/1bthu6o/infestation_on_my_plants/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-04-01T22:27:24+00:00",
    "body": "i’m relatively new to the plant mom life, and am having an ongoing issue with what i think is mealy bugs, however i’ve tried alcohol, neem seed oil, essential oils and nothing seems to be helping. i would appreciate any advice on what i might be dealing with and how to prevent the spread to all of my plants, TYIA",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "oblivious_fireball",
        "body": "Picture 1 and 2 are definitely powdery mildew, an infectious fungus.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tretinoin",
    "post_id": "ecvi95",
    "title": "Neem seed oil as a spot treatment while on tret?",
    "url": "https://www.reddit.com/r/tretinoin/comments/ecvi95/neem_seed_oil_as_a_spot_treatment_while_on_tret/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-12-19T16:27:19+00:00",
    "body": "Has anyone tried this? Thoughts?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AussieMakeupTrade",
    "post_id": "f86clq",
    "title": "[SELL] Skincare destash - Round Lab, Isntree, Hada Labo, The Ordinary, Missha, Klairs, Asian Sunscreens",
    "url": "https://www.reddit.com/r/AussieMakeupTrade/comments/f86clq/sell_skincare_destash_round_lab_isntree_hada_labo/",
    "score": 1,
    "num_comments": 9,
    "created": "2020-02-23T07:29:10+00:00",
    "body": "Lots of new or barely used skin care. Meet up in Sydney CBD weekdays, or add $9.20 for postage. Open to offers.\n\n**Skincare & Sunscreens - Western Brands:**\n\n* A'KIN Calming Facial Moisturiser - New - $10 ([Link](https://imgur.com/dYELZfO))\n* A'KIN Nourishing Cream Cleanser & Toner - New - $10 ([Link](https://imgur.com/dYELZfO))\n* GARNIER Pure Active 3 in 1 (Travel Size) - New - Free with any other item ([Link](https://imgur.com/ydXVMs0))\n* ~~LA ROCHE-POSAY Effaclar Duo Plus - Used 5x - $10 (~~[~~Link~~](https://imgur.com/4m7acWz)~~)~~\n* SIMPLE Kind to Skin Replenishing Rich Moisturiser - New - $5 ([Link](https://imgur.com/dYELZfO))\n* THE ORDINARY Lactic Acid 10% + HA - New - $6 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Lactic Acid 10% + HA - 70% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n* THE ORDINARY Mandelic Acid 10% + HA - 80% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n* THE ORDINARY Buffet - New - $18 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Natural Moisturizing Factors + HA - New - $7 ([Link](https://imgur.com/ydXVMs0))\n\n**Skincare & Sunscreens - Asian Beauty Brands:**\n\n* INNISFREE Jeju Volcanic Melting Clay Mask - used 3-4 times - $5 ([Link](https://imgur.com/uAoB83a))\n* INNISFREE Jeju Volcanic Blackhead Out Balm - New - $8  ([Link](https://imgur.com/uAoB83a))\n* ISNTREE C-Niacin Toning Cream - 50% left - $6 ([Link](https://imgur.com/VVhTEKD))\n* KLAIRS Soft Airy UV Essence SPF50+ PA++++ - New - $30 ([Link](https://imgur.com/J9yf3td))\n* A'PIEU Power Block Daily Sun Cream SPF50+ PA++++ - New - $15 ([Link](https://imgur.com/J9yf3td))\n* DR G Airy Skin Up Sun Spf 50+ Pa++++ - New - $15 ([Link](https://imgur.com/J9yf3td))\n* MISSHA Cicadin Centella Rescue Sun Lotion SPF50+ PA++++ - New - $14 ([Link](https://imgur.com/J9yf3td)) - 2 available\n* ROUND LAB 1025 Dokdo Cleanser - 60% left - $10 ([Link](https://imgur.com/VVhTEKD))\n* ROUND LAB 1025 Dokdo Cream - 50% left - $10 ([Link](https://imgur.com/VVhTEKD))\n\n**Oils**\n\n* Neem Seed Oil - practically new $5 ([Link](https://imgur.com/5qDQK78))\n* HAB SHIFA Black Cumin Seed Oil (Nigella Sative Oil) - 60% remaining - $5 ([Link](https://imgur.com/5qDQK78))",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "onigiri815",
        "body": "Hi there and thanks for your post\n\nUnfortunately, I have had to temp remove this post due to **Rule 5**\n\nWe ask that subscribers only post once every 3 days, including ISO or sale posts. Please let me know if you would prefer this one or your ISO post to stay live and I will rectify accordingly.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "girlwithonlyoneface",
        "body": "Oh sorry. I misread. Could I keep this one please. Thanks!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "theskeptical",
        "body": "Hi there!  Would you do the LA ROCHE-POSAY Effaclar Duo Plus, the 2 x The Ordinary lactic acids, the mandelic acid and the Klairs and A'Pieu sun blocks for $50 + postage?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "plantclinic",
    "post_id": "waosnz",
    "title": "Black Lace Elderberry disease?",
    "url": "https://www.reddit.com/r/plantclinic/comments/waosnz/black_lace_elderberry_disease/",
    "score": 1,
    "num_comments": 2,
    "created": "2022-07-28T23:30:10+00:00",
    "body": "Does anyone know what these white spots are?  It started on the north facing side (northern hemisphere)  and seems to be spreading, but the plant is popping out new growth still. Some leaves with the white spots have turned brown and wilted. I don't see any evidence that it is a bug or pest.  I'm wondering if it is a type of fungi.  Or maybe disease.  The mowers cut part of the plant at one point.\n\nI've sprayed with a neem seed oil mixture, but it doesn't seem to have helped.   Any advice?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Xedryc",
        "body": "I'm having this same issue and came looking for advice. What ended up happening to yours and did you find any solution or information?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "14zqnqk",
    "title": "[routine help] aha mask stinging",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/14zqnqk/routine_help_aha_mask_stinging/",
    "score": 1,
    "num_comments": 5,
    "created": "2023-07-14T20:07:47+00:00",
    "body": "My 15% aha mask stings, is this normal? And if not could I still use it or would that be dangerous? Ingredients-  Organic Pumpkin, Vegetable Glycerin, Vitamin E, Organic Sunflower Seed Oil, Citric Acid, Organic Meadowfoam Seed Oil, Glycolic Acid, Vitamin C, Organic Sugar Cane Extract, Organic Bilberry Fruit Extract, Organic Sugar Maple Extract, Organic Orange Peel Extract, Organic Lemon Peel Extract, Organic Cranberry Fruit Extract, Organic Neem Seed Oil, Organic Rosemary Leaf Extract, Organic Cinnamon Powder, Organic Ginger Root Extract, Organic Nutmeg Powder, Organic Allspice Powder, Clove Powder, Cardamom Powder, Tetrasodium EDTA, Xanthan Gum, Radish Root Ferment Filtrate",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "UltraLuminescence",
        "body": "How often are you using it and for how long? Where in your routine is it and are you applying it on dry or damp skin? What does the rest of your routine look like?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_pesthama",
    "post_id": "nm70gh",
    "title": "Anti Rayap Bubuk Kayu",
    "url": "https://www.reddit.com/r/u_pesthama/comments/nm70gh/anti_rayap_bubuk_kayu/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-27T13:05:34+00:00",
    "body": "[***Anti Rayap Bubuk Kayu***](https://www.google.com/url?q=https%3A%2F%2Fwww.pesthama.com%2Ffreemite&sa=D&sntz=1&usg=AFQjCNFWL4J5nxSgCNAxzj0adcPFhWMkGg)\n\nHigh quality, Non-Toxic Neem Oil-based Anti-Termite\n\n• Highly concentrated x 200, stable emulsion.\n\n• Proven efficient according to International Standards.\n\n• Protects houses, foundations, constructions, wood, bamboo, rattan.\n\n• Against termites, subterranean termites, powder post beetles, wood worm. Works on ants and other insects.\n\nWhy is Freemite200+ efficient?\n\n• Freemite200+ is highly CONCENTRATED: x 200.\n\n• Freemite200+ contains a plant-based nano-extender for better penetration and a high binding rate with the soil or material such as wood or bamboo.\n\n• Made with 87% of NEEMO, a Pure NEEM SEED OIL which is:\n\n. Certified organic by ECOCERT, attestation ref. N° 717N1900n2e.\n\n . Approved by ECOCERT for use in organic agriculture:\n\n  – USA: National Organic Program standard.\n\n  – European Community Regulations n°. 834/2007 & 889/2008.\n\n . Cold Pressed extracted and double filtered.\n\n . 100% pure: No solvents or chemicals (free from Aflatoxin B1, G1, B2, G2).\n\n . Active compounds: Triterpenoids: Azadirachtin A & B, Nimbin, Nimbidin, Salannin, Salannol, Triglycerides, Sterols, Saponins.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "plantclinic",
    "post_id": "12s3rnu",
    "title": "White/translucent zucchini leaves",
    "url": "https://www.reddit.com/r/plantclinic/comments/12s3rnu/whitetranslucent_zucchini_leaves/",
    "score": 1,
    "num_comments": 2,
    "created": "2023-04-19T17:30:04+00:00",
    "body": "A few days ago I noticed my zucchini leaves developed white and transparent spots on some of the leaves, including new growth. We did have a storm a couple days before they appeared. I had a couple powdery mildew spots but removed them immediately and sprayed neem seed oil and haven’t seen them reappear. I wondered if they got too much water from the rain? I go out there every day to check for bugs and spray regularly (in evenings). I have some fruit but did have 2 that had end blossom rot. I live in louisiana and we had a cool front for a couple weeks but now it’s warm and sunny. Last year squash vine borers took out my zucchini and straightneck squash, these are in a new bed. I use tomato tone granular fertilizer and fox farms liquid. Some older leaves look dry. The bottom of the leaves look normal. Is this normal or disease? As I was taking these photos an adult squash vine borer flew on it but flew away before I could kill it, also sometimes see cucumber beetles and lady beetles but kill them anytime they’re present.",
    "flair_text": "Fruit/vegetable",
    "flair_template_id": "4cc7bee0-b6b5-11ed-bfc3-22cd8a587452",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for posting to r/plantclinic!\n\nThe subreddit moderation team has implemented a number of new tools to help users both give and receive the best help possible. \nPlease refer to the pinned post [here](https://www.reddit.com/r/plantclinic/comments/11dfcek/subreddit_moderation_adjustments/)\n\nAll posters receive an automod message requesting they supplement their post with basic care details.\n\nThis sub is being actively moderated. Please utilize the report functions to call attention to posts and comments that are counter to the mission of the sub.\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/plantclinic) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ecstatic_Objective_3",
        "body": "That is powdery mildew, and it spreads quickly. Take off the leaves that have it, and this video has different method for getting rid of it. \nhttps://youtu.be/A_xsjZ139g4",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "skincareexchange",
    "post_id": "1oebpk",
    "title": "[Offer] Garden of Wisdom, Shiseido, and Elta MD Samples",
    "url": "https://www.reddit.com/r/skincareexchange/comments/1oebpk/offer_garden_of_wisdom_shiseido_and_elta_md/",
    "score": 1,
    "num_comments": 7,
    "created": "2013-10-14T02:24:34+00:00",
    "body": "I have a bunch of samples and small items. Feel free to make me an offer; I'm willing to sell or trade and am located in the US.\n\n\nGoW GoW CoCo-Lemongrass Clarifying Tonic (1 oz)\n\nGoW Pomegranate Seed Oil (Sample) \n\nGoW Sunflower Seed Oil (Sample)\n\nGoW Neem Seed Oil (1 oz)\n\nGoW Seacode Age Defying Serum (Sample)\n\nGoW CoQ-10 Enriched AntiAging Serum (Sample)\n\nGoW Majik Azulene Cleanser #2 (Samples, 2)\n\nShiseido Urban Environment SPF 42 (Samples, 4)\nElta MD Intense Moisturizer (Samples, 14)\n\n\n[Photo 1](http://i.imgur.com/lYmmyyr.jpg)\n\n[Photo 2](http://i.imgur.com/GkMh0tY)\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "cielodividido",
        "body": "Hey, i know I'm late to this, but would be very interested if you have any/all of it still up for sale?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lionpants",
        "body": "Interested in neem seed oil. Wanna swap? http://www.reddit.com/r/makeupexchange/comments/20l0t4/sellswap_offer_napoleon_perdis_stila_tarte_laura/",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "UAE",
    "post_id": "1gx16f4",
    "title": "Do you where to find date seed oil, neem seed oil in UAE?",
    "url": "https://www.reddit.com/r/UAE/comments/1gx16f4/do_you_where_to_find_date_seed_oil_neem_seed_oil/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-11-22T06:02:29+00:00",
    "body": "For research activity, I wish to have minimum 2 liters of date seed oil and neem seed oil. \n\nAppreciate if anyone help me find in UAE. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "One_Travel_7939",
        "body": "Seeking updates",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "cactus",
    "post_id": "pkjjkq",
    "title": "How Should I Use Neem Seed Soil?",
    "url": "https://www.reddit.com/r/cactus/comments/pkjjkq/how_should_i_use_neem_seed_soil/",
    "score": 1,
    "num_comments": 1,
    "created": "2021-09-08T21:24:55+00:00",
    "body": "I have written before about this issue and told to buy neem seed oil.  I need to find out where to spray the neem seed oil since I don't want to kill the cactus.  They are three very small mini cactus in a porcelain pot with glued stones on top.  I am spraying neem seed oil to keep the tiny insects from crawling through the stones to get into the soil.  Should I spray on the stones?  If so, how often?  Should I spray on the cactus?  Also, how long should I keep spraying?  Thanks for answering my questions.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1i9cjf",
    "title": "Just got my neem seed oil!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1i9cjf/just_got_my_neem_seed_oil/",
    "score": 1,
    "num_comments": 9,
    "created": "2013-07-14T04:32:00+00:00",
    "body": "So excited! I have loved me tea tree oil and have heard all the praises about neem here, so I added it to my most recent GoW haul! Do I only use it for spot treatment? I haven't broken out in awhile (hopefully I didn't just jinx myself) thanks to you lovely ladies. Started this skincare journey in January and finally clearing up and healing! Anyways, not sure if I can spread a thin layer of oil on my whole face, or if thats unnecessary and I should just use it on my hyper pigmentation to heal it. Thanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AppleButterToast",
        "body": "You CAN spread a thin layer on your face, but I don't think you'll WANT to. Have you opened it yet? The smell is quite strong and unpleasant. Just dabbing a little on a pimple smells bad enough - I can't imagine covering my whole face with it.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "mellowrae",
        "body": "I've been spreading a thin layer over troublesome areas for about a week and a half now and it's been fantastic.  My acne healed faster and became less red and inflamed sooner than with my BP treatment.  Also the scarring left on the active spots is less than it was with the BP.  Obviously it's a strong smell you have to adjust to, but I much prefer it to the Aztec healing clay with apple cider vinegar!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "6ptibc",
    "title": "[Product Question] Best Neem Seed Oil on Amazon? not sure which to get, some reviewers claim some oils are cut with other oil.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/6ptibc/product_question_best_neem_seed_oil_on_amazon_not/",
    "score": 1,
    "num_comments": 2,
    "created": "2017-07-27T04:02:24+00:00",
    "body": "Please halp. I was looking at this:\n\nhttps://www.amazon.com/Certified-RejuveNaturals-Moisturizer-Antiseptic-Insecticide/dp/B01HU7RQ6G/ref=cm_cr_arp_d_product_top?ie=UTF8\n\n\nand\n\n\nhttps://www.amazon.com/Unrefined-Cosmetic-Skincare-Repellent-Oleavine/dp/B013FAJDVI/ref=cm_cr_arp_d_product_top?ie=UTF8",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "__looking_for_things",
        "body": "I can't comment on those but just in case your still unsure, take a look at gardenofwisdom for oils. They're pure and usually cold pressed. I've never had bad service; delivery is reasonable and products are well-packaged. There neem oil is 10$ for 4 oz, more expensive but you know what you're getting.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MxUnicorn",
        "body": "It looks like Amazon has NOW brand neem oil, which should be fine. If you're okay with purchasing elsewhere, Mountain Rose Herbs sells 4oz of neem oil for less than $5. I haven't purchased from them myself, but I know a lot of people who love their carrier oils.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2f3deh",
    "title": "pimples spread to other areas of the face AFTER tretinoin?!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2f3deh/pimples_spread_to_other_areas_of_the_face_after/",
    "score": 1,
    "num_comments": 9,
    "created": "2014-08-31T16:50:02+00:00",
    "body": "I started taking veltin (tretinoin and clindamycin phosphate) as a spot treatment since late May. It was only for my forehead scars which my derm said with prolonged use it would help diminish the scars. but my problem now is that i'm starting to break out everywhere (before i broke out in my forehead mainly). I know there is a purge period but it's just getting worse and worse (it's been 4 months) and I stopped using the tretinoin because i'm afraid i would break out even more. the pimples i'm getting are bigger on the perimeter of my face and smaller in the center of my face, i thought they would be closed cosmedones but after day 3 it started forming a yellow center. \n\nI don't know what i should do! should i continue with veltin as a spot treatment or should i stop? can i use it on a freshly popped pimple? should i try neem seed oil instead? My derm told me to apply bp in the morning and tretinoin at night but bp makes my skin so red and the pimples even more obvious\n\nMy very very simple routine is:\n\nAM- elta uv clear or iope uv shield sunscreen\n\nPM- bioderma to remove makeup\nhada labo bha+aha cleanser (in tube) with konjac or clarisonic \nhada labo toner or skii toner\n\nI am so scared to put anything on my face anymore.. i tried topix bp 5% wash but it doesnt seem to do much for me\nAlso the small pimples in the center of my face appeared (i forgot if it was before and after) i tried the aztec healing clay with apple cider vinegar\n\nmy skin has been looking worse after i started tretinoin- should i give up ?!\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "If you have questions about purging please see [this post](http://www.reddit.com/r/SkincareAddiction/comments/1w179w/guide_am_i_purging/). \n\n\n*[I am a bot](/r/AutoModerator/comments/q11pu/what_is_automoderator/), and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose?to=%2Fr%2FSkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "iJoyzilla",
        "body": "Omg. Same thing happened to me. I never had acne anywhere but my chin. I stopped tretinoin, and all of a sudden my acne is now worse than it ever has been before. All over my cheeks and jawline. Devastating. I'm now starting a new routine which seems to be helping, but staying away from the tretinoin. I was on tretinoin for 5 months before any issues.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2upvp5",
    "title": "GoW Blemish Prone Cleansing Oil odor... Can someone help me identify which oil smells awful?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2upvp5/gow_blemish_prone_cleansing_oil_odor_can_someone/",
    "score": 1,
    "num_comments": 5,
    "created": "2015-02-04T03:56:05+00:00",
    "body": "I'm somewhat new to oil cleansing and I've noticed awesome results in just a month or two. I started with Garnier Nourishing Cleansing Oil but wanted something without the extra ingredients. So I used plain mineral oil. I decided to give Garden of Wisdom a shot for their cleansing oils since I see that site mentioned a lot on here. Anyways, I bought the acne cleansing oil and the sensitive skin one to see which like best. The acne one contains:\n\n- safflower seed oil\n\n- grape seed oil\n\n- perilla seed oil \n\n- neem seed oil\n\n- thyme essential oil\n\nOne of these smells so bad that I gag. I like the product otherwise. I thought of mixing the same oils but removing the foul smelling one. Can anyone help me out? Also, another off topic question, can I mix some of these oils in with my night moisturizer? Thanks in advance!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ISwearImAGirl",
        "body": "Neem",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "idlehen",
        "body": "Definitely the neem. It's too bad because it's actually pretty good for inflammation ._. I like to dab it on active spots and I use it on my hands when I break out in hives. But yes, it smells like dead animal/rotting ramen.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kellykell",
        "body": "God.. I use that too. It's hard to get passed. It fucking reeks",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AusSkincare",
    "post_id": "fbr4fn",
    "title": "[SELL] Massive skincare and makeup destash, most barely used- Western and Asian Beauty Brands - A’kin, The Ordinary, Innisfree, Round Lab, Innisfree, Isntree, Klairs, Missha, Laneige, Bourjois, Dior, Nude by Nature, Tarte, LA Girl, Iope, Peripera",
    "url": "https://www.reddit.com/r/AusSkincare/comments/fbr4fn/sell_massive_skincare_and_makeup_destash_most/",
    "score": 0,
    "num_comments": 0,
    "created": "2020-03-01T08:16:42+00:00",
    "body": "I’ve bought lots of things I’ll never get around to using. Please help by taking them off my hands…\n\nMeet up in Sydney CBD weekdays. Can also post using Australia Post bags - $9.20 for small postage bag (35.5 x 22cm) or $12.45 for medium postage bag (38.5 x 26.5cm). Some smaller/flatter items that are less than 20mm wide can fit in letter post ($3.30) but won’t have tracking.\n\nOpen to offers. Prices are for Paypal F&F, or add 3% for Paypal G&S.\n\nA few items are free with any other item.\n\n**Skincare - Western Brands:**\n\nCleanser\n\n* A'KIN Nourishing Cream Cleanser & Toner - NEW - $10 ([Link](https://imgur.com/dYELZfO))\n* GARNIER Pure Active 3 in 1 (Travel Size) - NEW - Free with any other item ([Link](https://imgur.com/ydXVMs0))\n\nTreatments - Serums, Exfoliants\n\n* THE ORDINARY Buffet - NEW - $18 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Lactic Acid 10% + HA - NEW - $6 ([Link](https://imgur.com/ydXVMs0))\n* THE ORDINARY Lactic Acid 10% + HA - 70% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n* THE ORDINARY Mandelic Acid 10% + HA - 80% remaining - Free with any other item ([Link](https://imgur.com/4m7acWz))\n\nMoisturiser\n\n* A'KIN Calming Facial Moisturiser - NEW - $10 ([Link](https://imgur.com/dYELZfO))\n* SIMPLE Kind to Skin Replenishing Rich Moisturiser - NEW - $5 ([Link](https://imgur.com/dYELZfO))\n* THE ORDINARY Natural Moisturizing Factors + HA - NEW - $7 ([Link](https://imgur.com/ydXVMs0))\n\nOils\n\n* Neem Seed Oil - Used 1x - $5 ([Link](https://imgur.com/5qDQK78))\n* HAB SHIFA Black Cumin Seed Oil (Nigella Sative Oil) - 60% remaining - $5 ([Link](https://imgur.com/5qDQK78))\n\n**Skincare - Asian Beauty Brands:**\n\nCleanser\n\n* ROUND LAB 1025 Dokdo Cleanser - 60% left - $10 ([Link](https://imgur.com/VVhTEKD))\n\nTreatment - Toner, Essence\n\n* I’M FROM Mugwort Essence (mini) - NEW - $5 ([Link](https://imgur.com/cj6ucDU))\n\nMasks\n\n* INNISFREE Jeju Volcanic Melting Clay Mask - used 3-4 times - $5 ([Link](https://imgur.com/uAoB83a))\n* INNISFREE Jeju Volcanic Blackhead Out Balm - NEW - $8 ([Link](https://imgur.com/uAoB83a))\n\nMoisturiser\n\n* ISNTREE C-Niacin Toning Cream - 50% left - $6 ([Link](https://imgur.com/VVhTEKD))\n\nSunscreen\n\nKLAIRS Soft Airy UV Essence SPF50+ PA++++ - NEW - $30 ([Link](https://imgur.com/J9yf3td))\n\n* A'PIEU Power Block Daily Sun Cream SPF50+ PA++++ - NEW - $15 ([Link](https://imgur.com/J9yf3td))\n* DR G Airy Skin Up Sun Spf 50+ Pa++++ - NEW - $15 ([Link](https://imgur.com/J9yf3td))\n* MISSHA Cicadin Centella Rescue Sun Lotion SPF50+ PA++++ - NEW - $14 ([Link](https://imgur.com/J9yf3td)) - 2 available\n\n**Makeup - Western Brands:**\n\nFace - foundation, primers, concealers, setting sprays\n\n* BOURJOIS Healthy Mix Serum Foundation - 51 - Used 5x - $10 ([Link](https://imgur.com/pmtZLhd))\n* MAYBELLINE Fit Me Matte & Poreless Foundation - 128 Warm Nude - Swatched - $12 ([Link](https://imgur.com/pmtZLhd))\n* MAYBELLINE Face Studio Prime Anti-Redness Primer - Used 2x - $5 ([Link](https://imgur.com/pmtZLhd))\n* NUDE BY NATURE Natural Mineral Cover Foundation - Beige - Used 2x - $25 ([Link](https://imgur.com/pmtZLhd))\n* WET N WILD - Photo Focus Natural Finish Setting Spray - New - $5 ([Link](https://imgur.com/pmtZLhd))\n* ULTA3 Darkening Drops - NEW - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Green corrector - Used 2x - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Yellow corrector - Used 2x - $3 ([Link](https://imgur.com/pmtZLhd))\n* LA GIRL HD Pro Conceal - Creamy Beige - New - $4 ([Link](https://imgur.com/pmtZLhd))\n\nCheeks\n\n* TARTE Amazonian clay 12-hour blush - Paaarty (mini) - swatched - $10 ([Link](https://imgur.com/E6BJBPh))\n\nEyes\n\n* BOURJOIS Smoky Stories Quad Eyeshadow Palette - Sau Mondaine - Minimal use - $10 ([Link](https://imgur.com/E6BJBPh))\n* INNOXA Eyeshadow Palette - Daytime Neutrals - Minimal use - $10 ([Link](https://imgur.com/E6BJBPh))\n\nLips\n\n* BOURJOIS Rouge Fabuleux Lipstick - Perlimpinpink - swatched only - $10 ([Link](https://imgur.com/ecOZTb9))\n* DIOR Rouge - Victoire - barely used, see remaining - $30 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Ultra HD Lipstick - Rose - see remaining - $3 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Ultra HD Lipstick - Tulip - see remaining - $3 ([Link](https://imgur.com/ecOZTb9))\n* REVLON Super Lustrous Lipstick - Fuchsia Shock - - barely used - $3 ([Link](https://imgur.com/und6Cvc))\n\nTools\n\n* TARTE Picture Perfect Eyelash Curler - tested only, mini mascara not included - $20 ([Link](https://imgur.com/vLK5Y5K))\n\n**Makeup - Asian Beauty Brands:**\n\nFace - foundation, primers, concealers, setting sprays\n\n* IOPE Air Cushion Natural Glow w/ Refill SPF 50+ PA+++ - #23 - New - $50 ([Link](https://imgur.com/YlVWoSR))\n* PERIPERA Ink Skin Tint - #3 Sand Cover - Used 1x - $10 ([Link](https://imgur.com/pmtZLhd))\n* MISSHA Magic Cushion Moist Up SPF50+ PA+++ - #23 - New - $20 ([Link](https://imgur.com/YlVWoSR))\n* LANIEGE BB Cushion Anti Aging - #23 Refill Only - New - $25 ([Link](https://imgur.com/YlVWoSR))\n\nLips\n\n* CLIO Mad Matte - 13 Salmon Rose - Used 1x - $10 ([Link](https://imgur.com/ZwpwFay))",
    "flair_text": "SELL",
    "flair_template_id": "bba140fc-d838-11e9-a9b8-0e0f4724fdea",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "10lys87",
    "title": "Lotion",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/10lys87/lotion/",
    "score": 0,
    "num_comments": 20,
    "created": "2023-01-26T18:30:38+00:00",
    "body": "I made a big batch of lotion with a calculator online from thermal mermaid but it separated right after I bottled it. What did I do wrong, and how can I fix this. Please help. I would post a pic of my recipe but this sub doesn't allow it. I used:\n\nThermal Mermaid Lotion Calculator\nName:Total amount of batch: 25 lbs.\n\nOil Phase\t\tPounds\tOunces\tGrams\n\nSoft Oils: 15%\nNeem Seed Oil\t\t6.00 oz.\t\nPeanut Oil\t\t30.00 oz. MCT coconut oil instead\nOlive Oil\t18.00 oz.\t\nAlmond Oil, sweet\t6.00 oz.\n\nHard Oils: 5%\nKokum Butter\t\t6.00 oz.\t\nShea Butter\t8.00 oz.  Shorea instead \nCocoa Butter\t6.00 oz.\t\n\nWaxes: 0%\n\nHumectant: 2%\nSodium Lactate\t\t5.36 oz.\nVitamin E.\t2.64 oz.\t\n\nEmulsifier: 3%\nPolysorbate-80 (Tween 80)\t\t12.00 oz.\n\nThickener: 2%\nStearic Acid\t\t8.00 oz.\n\nWater Phase:\t\t\nA winter (heavy) lotion has 73% water in the formula.\n18.25 lbs.\n\nPreservative:\nA thick winter lotion does require a preservative because there is water. The amount of preservative varys depending on type selected. Typical recomendation is 0.5%-1.5%\n2.00 oz. - 6.00 oz.",
    "flair_text": "formula (completed)",
    "flair_template_id": "57f8713a-2823-11e4-9c1b-12313d0965b4",
    "comments": [
      {
        "author": "A_Cat12886475",
        "body": "I can’t tell if I’m missing something because the text is so hard to read but it seems you used just 3% polysorbate 80 as your emulsifier with an oil phase of maybe 20% or more? \n\nThis is the wrong emulsifier for this lotion. Polysorbate 80 is better for dispersing a small amount of oil into water. You need a compete emulsifying wax. Emulsifying Wax NF is good for beginners and should be used at about 25% of the oil phase. 3% is way too little for the amount of oil you seem to have. For a 20% oil phase, use 5% e wax. \n\nI’m sorry about the big batch of lotion. For the future, you can make smaller batches to test the formula before scaling up. I think most beginners make this mistake.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "mlizaz98",
        "body": "Why did you make 25 pounds in your first batch?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "RowanHouse",
        "body": "I know this was months ago but polysorbate 80 is a solubilizer not an emulsifier. To be honest I've never seen it in a lotion, more in shower oils or cleansing balms. \n\nI'd suggest Glyceryl Stearate (and) PEG-100 Stearate. It's an excellent emulsifier and won't change the consistency of your formulation.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "minniesnowtah",
        "body": "Hi! What is your formula? Please provide each ingredient and its percentage, typed out in your post or as a comment.\n \n> **Rule 2: Provide your formula:** You must provide your formula (each ingredient and its %) when posting something you’ve made, any work-in-progress, or a request for help.\n>\n> * If you cannot release your formula because it’s proprietary, then your post falls under rule 5 and should not be posted in r/DIYBeauty.\n> * If you’d like help with your formula, you must provide an attempt for critique.\n> * Formulas must include at least 3 ingredients (exceptions can be made for 2 ingredients if properly formulated).\n\n**To get your post reapproved**, please add your formula and reply to this message to let me know you've done it! Thank you!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "TheseGuidance259",
        "body": "So it doesn't matter how much polysorbate 80 I use it won't function as a emulsifier for that much oil? The calculator came up with all the percentages I just put what I had to work with. I thought maybe the MCT had something to do with it or the water wasn't hot enough before I combined. I guess for future reference don't use the Thermal mermaid calculator, it just wasted 25lbs of lotion. I can't believe there isn't a way to save all this!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "TheseGuidance259",
        "body": "That's what was given to me on the calculator",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "TheseGuidance259",
        "body": "So I can't add more polysorbate to help?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Tear-Ambitious",
        "body": "That's a huge amount; are you making this to sell? What preservative did you use?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  }
]