[
  {
    "subreddit": "Splendida",
    "post_id": "nlqezu",
    "title": "A full list of lash serums WITHOUT prostglandins or prostglandin alternatives",
    "url": "https://www.reddit.com/r/Splendida/comments/nlqezu/a_full_list_of_lash_serums_without_prostglandins/",
    "score": 342,
    "num_comments": 193,
    "created": "2021-05-26T20:16:38+00:00",
    "body": "Long, lifted lashes are a huge halo, and open up your eyes a ton. Unfortunately, lash serums are controversial on here. Many people have experienced fat loss around the eyes due to Latisse and similar serums, but prostaglandin (and prostaglandin analogues) are the only ingredients that have been scientifically proven to increase lash length beyond genetic limitations.\n\n**What about castor oil?**\n\n* Castor oil just conditions the lashes and gives the appearance of thicker lashes.\n* Some people swear on their life that castor oil truly increased their lash length, but they previously damaged their natural lashes with mascara or extensions. Putting on castor oil therefore \\*\\*did\\*\\* grow their lashes, but not beyond their genetic limitations. As someone who doesn’t wear mascara, this is useless to me.\n* Though to be fair, castor oil does contain a ton of ricinoleic acid, which can be stimulating for growth. This probably explains the ample anecdotal evidence when it comes to hair growth on the scalp (if your bald spots are NOT caused by genetics). I don’t think it would work much for lashes though.\n\nAnyway, I went on a hunt for alternatives without side effects. There are a few ingredients that have been **scientifically shown to cause hair and lash growth** (in studies of varying quality), which I’ve listed below, linking to sources:\n\nRed Clover Extract and [Acetyl Tetrapeptide-3](https://incidecoder.com/ingredients/acetyl-tetrapeptide-3) (makes up Capixyl)\n\n[Myristoyl Pentapeptide-17](https://incidecoder.com/ingredients/myristoyl-pentapeptide-17) and [Myristoyl Hexapeptide-16](https://incidecoder.com/ingredients/myristoyl-hexapeptide-16)\n\n[Biotinoyl Tripeptide-1 combined with Biotin](https://incidecoder.com/ingredients/biotinoyl-tripeptide-1)\n\nRELEVANT PRODUCTS:\n\n[Angfa, Scalp-D Beaute, Pure Free Eyelash Premium Serum](https://www.iherb.com/pr/Angfa-Scalp-D-Beaute-Pure-Free-Eyelash-Premium-Serum-0-14-fl-oz-4-ml/93530) \\- Contains biotinoyl tripeptide-1, oligopeptide-20, acetyl decapeptide-3, octapeptide-2, oligopeptide-41, caprooyl tetrapeptide-3, acetyl tetrapeptide-5, acetyl hexapeptide-8 high up on the ingredients list. Not sure what any of these do lol, except for biotinoyl tripeptide-1, which is the first peptide on the list. Reviews are good, but results are not dramatic. Seems to do more conditioning than growing.\n\n[The Glow Makers Eyelash and Brow Growth Peptide Complex Serum](https://theglowmaker.com/collections/all-products/products/eyelash-and-brow-growth-peptide-complex-serum) \\- Contains Myristoyl Pentapeptide-17, Myristoyl Hexapeptide-16, Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Red Clover Extract, Biotin. That’s EVERYTHING with studies on lash growth, what an absolute jackpot. The site is kind of sketchy though and there are no reviews, has anyone tried this?\n\n[Indeed Labs Peptalash II Eyelash Serum](https://www.ulta.com/peptalash-ii-eyelash-serum?productId=pimprod2012661) \\- Myristoyl Pentapeptide-17, Biotinoyl Tripeptide-1, N-Prolyl Palmitoyl Tripeptide-56 Acetate (which I think is a component of Matrixyl). Interesting choice of peptides for sure… also contains Apple Stem Cells ([Malus Domestica Fruit Cell Culture](https://incidecoder.com/ingredients/malus-domestica-fruit-cell-culture))… don’t know if that does anything for lashes. Reviews are mediocre, but it does work somewhat.\n\n[RevivLashes](https://revivserums.com/products/lash-brow-stimulating-serum) \\- rh-Polypeptide-3 (Keratinocyte Growth Factor, apparently), Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Myristoyl Pentapeptide-17, Myristoyl Octapeptide-1, Palmitoyl Tripeptide-1, Tripeptide-3, Copper Tripeptide-1 (Oof, copper peptides are a controversial but it’s the last ingredient). Reviews for this seem really good and it contains most of the peptides helpful for lash growth, plus some others that might be helpful. Also contains Apple Stem Cells.\n\n[Luna Nectar Moon Boost](https://lunanectar.com/products/moon-boost) \\- Contains Red Clover Extract, Castor Oil, and Biotin, but none of the peptides. I doubt this would work, but the reviews seem good if they can be believed. It’s definitely the most natural and “safest” out of everything in the list, though.\n\nI plan to try RevivLashes or The Glow Maker, but am wary of both. Has anyone tried a prostaglandin-free serum that actually worked? And what do you do for your lashes?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Sarahlpatt",
        "body": "Great post. I switched from Latisse to Grande Lash to avoid prostaglandins only to find out from this sub it has analogs, so I’ll definitely be picking one of these up when I finish the tube I currently have.",
        "score": 28,
        "is_top_level": true
      },
      {
        "author": "velvetcookiie",
        "body": "Thank you for this post!\n\nYeah i agree with the castor oil - they did make mine thicker/longer after months of consistent use (even new eyelashes grew like behind my normal eyelashes? kinda weird lol) but i have naturally pretty good eyelashes (my brother has amaaazing lashes) and genetically thick hair  \nI feel they 'optimised' them by conditioning them and keeping them healthy especially as i curl mine/wear mascara a lot  \ni  plan to keep using it as i like the effect on me but i'd be open to trying one of the serums you mention for fun :P",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "golden-trickery",
        "body": "i guess that's why mine never grew much no matter what products I used, I tried a lot of natural remedies and some cheap lash serums but they never did anything beyond making them wet and look a tiny bit longer, there's no miracle products that will allow you to grow lashes way beyond natural capacity and without side effects",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Carexstricta",
        "body": "I've been using Obagi Lash for about 6 weeks and am noticing results. Searching doesn't result in Obagi appearing on any lists.  I can't find specific info that it contains a prostaglandin, but only referring to its \"Nouri-plex\" containing biotin, pantethenol, sodium hyaluronate and a \"proprietary lipid formula.\"  Prostaglandins are lipid compounds, which would make me assume that Obagi's Lash/Brow serums contain this.  The package warning does indicate the possibility of iris color change and a dark line, neither of which I've yet experienced.   \n\n\nI did just email Obagi to ask and will post their response.  \n\n\nI just received GrandeBrow, choosing it because it was less expensive than Obagi, while reviews seemed to indicate good results. Now I'm nervous about using it on my brows.   \n\n\nWould brow side effects be the same as lash?   \n\n\nI'm really bummed, because the Obagi serum is working. Vegemour didn't do anything for me after 3 months.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Lexiealea",
        "body": "I’ve always wanted to try a lash serum but have been hesitant to because of it potentially changing eye color and the fat loss. Castor oil hasn’t worked for me and irritated my eyes so It’s nice to see this list.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "galllant",
        "body": "I use [XLash](https://xlash.com/xlash-eyelash-serum-3-ml/) and have never had a problem with it. My eyelashes have grown so much.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Shaakie",
        "body": "Excellent post thank you so much",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "268458",
        "body": "Does anyone know if orbital fat will return after extended use of latisse? Or is it permanent?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "XKrystalGemX",
        "body": "Hey! Could this [new serum](https://thrivecausemetics.com/products/liquid-lash-extensions-lash-serum?variant=39909600854106) be added to the list? Very eager to know if this one's safe as I'm on the verge of buying it.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "jansossobuco",
        "body": "Mascara damages your lashes?! 🤯",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Competitive_Celery11",
        "body": "Thank you very much, I’ve been trying to grow my lashes back since I used to pick and plunk them out when I was a kid. i’ve used the indeed one and I didn’t notice much difference",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "illumiee",
        "body": "Has anyone tried any of these or has any reviews? NewBeauty’s “free gift” friday today was the BabeLash serum, almost bought it, looked it up and it contains prostaglandins. Remembered this post and came back here. I’m probably going to try castor oil but not sure which one to get since I know some people have experienced eye irritation and not all castor oils on Amazon or wherever are pure? Maybe I’ll look at pricey “natural” stores like Whole Foods to get one that’s actually pure. \n\nEdit: Actually just stumbled across a bunch of good reviews on Reddit for moon boost, looks promising. $75 though(!) for a mix of oils (argan and castor) and aloe vera!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Miro-miro",
        "body": "Can anyone make a post like this but for Asia? Specifically Philippines since I live here, thanks",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SydneyGrace05",
        "body": "OP which serum did you decide to get ? And have you seen any results?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "reptileluvr",
        "body": "I was considering one of these but I just noticed rem beauty came out with a lash serum and I believe it's prostaglandin analogue free. Can anyone confirm? I'm not sure if I missed any other names for them when I was looking at the ingredients haha. It seems to just have peptides and botanicals https://rembeauty.com/products/flourishing-lash-brow-boosting-serum?variant=41598079172871#tt-reviews-tabs",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "avapatava",
        "body": "how [this one](https://www.mirabellabeauty.com/products/amp-lash-brow-enhancing-serum)?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Outside_Year_9411",
        "body": "This is wild a friend just told me about this side effect, after I was telling her how much I love the growth grande lash has given me. And then when she mentioned the eye bags I was like no sh**!?! Bc I just started noticing drastic dark hollow looking bags under my eyes which I’ve never had in my life. (I thought maybe this is just what happens as you get older🤷🏼‍♀️) I’m so bummed and quitting grande lash immediately.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FLSO8791",
        "body": "I’ve been using Scorolash and Peptalash for about two months now and my eye lashes have never been so sparse or thin….I threw them both out today.  Thinking about going back to Neulash but it has the prostaglandins and I do fear the orbital fat loss.  Any new updates on products that actually work???",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BigMommaAustin",
        "body": "Did you try those (Glow Maker and RevivLashes)?  And how did it go?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BooBelly",
        "body": "Hi OP, which lash serum did you end up liking?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Everythingispoetry",
        "body": "What about scorolash?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bealover566",
        "body": "Thank you!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "No-Drink8004",
        "body": "Do mascaras have that(prostaglandins)  in them?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Responsible_Cell_487",
        "body": "Do we know if Jouviance Restructiv Lash FX has the bad stuff in it?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "2inferior4u",
        "body": "Has anyone tried RevivLashes? By the looks of it The Glow Makers serum is getting a lot of mixed reviews…",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BirchNat",
        "body": "I use ADOREYES Plus Lashes serum, and it works, but you need to be patient. I believe it took me 3 or 4 months, and I can see that my lashes are longer and thicker. They have no prostaglandins or analogues. You also need a break when switching from prostaglandins based serum to peptide serum because the hormone needs to shed off. If you're trying getting pregnant or breastfeeding than at all cost avoid prostaglandins and analogues as they might have cause  problems during the pregnancy.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Aethtetitties",
        "body": "whats wrong with copper peptides?\n\nahhhhhh im so mad glowmaker doesn't ship internationally",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AR3234",
        "body": "Has anyone looked at Vegamour? Seems to be a good one...\n\nhttps://vegamour.com/products/vegalash-volumizing-serum\n\nWater/Aqua/Eau, Pentylene Glycol (plant based), Propylene Glycol (plant based), Glycerin, Butylene Glycol (plant based), Magnolia Officinalis Bark Extract, Gellan Gum, Xantham Gum, Trifolium Pratense (Clover) Sprout Extract, Vigna Radiata Seed Extract, Sodium Benzoate, Potassium Sorbate, Dextran, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Citric Acid.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "hippybitty",
        "body": "hey which one did you end up trying? how was it?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "aabb112",
        "body": "As far as I’ve seen Hairgenics Pronexa Lavish Lash doesn’t have prostaglandins or its analogues but before I buy it I want to be sure does anyone know?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 30,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "pbt6ku",
    "title": "(Review)BeMinimalist Hair Growth Actives 18%",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/pbt6ku/reviewbeminimalist_hair_growth_actives_18/",
    "score": 156,
    "num_comments": 80,
    "created": "2021-08-26T05:38:28+00:00",
    "body": "\nHey all! 👋🏻I want to review hair growth serum from minimalist-\n\nSo i have straight fine hair(little below shoulder length)(30s/F), oily scalp. \n\nI have been suffering from hair loss for past two years. I haven't checked with my derm. I have lost some hair (in patches) because of my tight hairstyle. Then came humidity season and my hair were everywhere. Before taking an appointment I decided to try hair serum. I started on 29th june. \n\n\n29/6: Started with serum. First application was hassle free. No burning or warming of the scalp. I used 4 drops front of scalp(problem area) and 4 drops back of my head, everyday, in the AM(as i take shower in the PM). Rubbed into my fingers and then Massaged only on my scalp and not on length. It was non greasy.\n\n\n01/07: In just two days I started to feel my hair fall is less, like 3-4 strands in my comb. I thought its a placebo effect.\n\n\nI continued it for two weeks straight, every day and my hair fall reduced by 20%. I stopped the application on 14/7 for two weeks as i was traveling and wanted to see if hairfall return and to my luck it Did. But it wasn't alot. I think some people miss understand that after stopping hairfall doubles but it's just the same amount you used to get(at least for me)\nI restarted again and still using it and now i can say I definitely see hair looks bit thicker, have seen baby hair growth especially at the hairline and hair fall has reduced to 80%. \n\nI will keep using it as it dint have any side effects except one stubborn cc which always occurs on my forehead if apply regularly. Thus i now use it 4-5 times a week(depends on which day i ll shampoo and workout)\n\nIts non greasy if applied less but if you directly use the dropper on scalp you might end up using alot and it will give oily look. My scalp normally gets oily on 3rd day but with everyday application of serum hair looks oily on 2nd day. \n\n\nPROS: 1. It works.\n2. New hair growth. \n3. Hair seem thicker.\n4. Less hairfall.\n\n\nCONS: 1.Everyday application is a task for long hair and oily scalp as you need to shampoo.\n2. Give cc on forehead with regular use.\n3. Don't think its a permanent cure.\n4. Expensive.\n\nInci:\nButylene Glycol, Aqua, Dextran, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Propanediol, Arginine, Glycine Soja (Soybean) Germ Extract, Triticum Vulgare (Wheat) Germ Extract, Scutellaria Baicalensis Root Extract, Sodium Benzoate, Gluconolactone, Calcium Gluconate, Glycerin, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Pisum Sativum (Pea) Sprout Extract, Isomalt, Sodium Metabisulfite, Larix Europaea Wood Extract, Glycine, Zinc Chloride, Camellia Sinensis Leaf Extract, Xylitylglucoside, Anhydroxylitol, Xylitol, Saccharide Isomerate, Sanguisorba Officinalis Root Extract, Serenoa Serrulata (Saw Palmetto) Fruit Extract, Capryloyl Glycine, Phenoxyethanol, Ethylhexylglycerin, Citric Acid, Sodium Citrate, Lactic Acid\n\n\nTL:DR- True to its claims, will repurchase it!\n------------------------------",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "charmingblush",
        "body": "If one can get greasy with dropper..how would u suggest to apply??..im also feeling greasy if used for more than 2 days with dropper",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "blah_bleh_blahh",
        "body": "Hey can you help with how much should I Apply? Actually I finish a bottle in less than a month even if I miss a few nights . I think I am applying way more than I am supposed to. And hair length won't matter, right? As it is just for the scalp?",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "PriyaSR26",
        "body": "Thanks OP! Great review!💜💜",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "nikagotnochill",
        "body": "Thank you for this comprehensive review OP. ❤",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Anagreysays",
        "body": "Why do i have a feeling that this product has minoxidil in it. (Although its not mentioned in the list)",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Alarmed-Spend9886",
        "body": "Is it absolutely necessary to wash the hair after serum application?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Deep_Many2226",
        "body": "How long did one bottle last you? As of now hows the progress?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Level-Ad2279",
        "body": "After hearing some great reviews, I have tried this item once. But unfortunately this didn't worked for me. \n\nI have moved to WishCare Hair growth serum. Surprisingly I have a good experience.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "panku7",
        "body": "What is meaning of it gives CC and what do you mean by \"not permanent solution \"??",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Just-Control-9815",
        "body": "Does it help in increasing hair lengths?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "knightmare89",
        "body": "I don't know if it's a coincidence but ever since I started using this, I've been getting scalp heat boils and they're getting more and more in quantity and are becoming painful as well. Any idea if this is related?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ScribieCloud",
        "body": "Can i keep the serum on for 2 -3 days. I mean I will first wash my hair and them apply, and them after 3 days I wash my hair usually. Will it be okay?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "keshav231",
        "body": "Is it absolutely necessary to wash your hair the next day after applying it overnight? Currently, I'm applying it everyday but I wash my hair only for 3 days a week",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Public-Bear387",
        "body": "Is once in a week application enough?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "VeganDiIdo",
        "body": "Did you stop using it? Did you get any hairloss or shedding once stopped?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Constant_Fix7207",
        "body": "What is CC?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Abs0lute_zer0K",
        "body": "Can someone tell me if I can use any onion oil while I'm using minimalist hair growth serum? Perhaps on the alternate days?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bitchrialy",
        "body": "what kind of shampoo do you use? suggestions please",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Then-Performance-463",
        "body": "Can I apply it in the morning and the night, is it more effective if I do and is it good for genetic hair loss",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "KaleidoscopeOk2422",
        "body": "What do U mean as you take shower in the PM? You only shower once a day? Indians.....",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Motor-Sand2847",
        "body": "j",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Upbeat-Ad5973",
        "body": "Hey, just read your review and it's a really comprehensive one thanks for this! \n\n\nIt's been a week since I started using it and I am iron deficient so I am on meds rn (effect of which I cannot see tbh). Even after proper care and using the serum I can't see any reduction in my hairfall instead I feel just after using the serum I have slightly more hairfall.\n\n\nCan you tell if anyone uk has faced any such issues? Or is is this part of the process ?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "nightwanderer0725",
        "body": "RemindMe! 1 Day",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Evening-Hour8934",
        "body": "Hello there. Thanks for review please follow include other things you do for hairfall. Also, please lmk which shampoo Nd conditioner you use",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ZealousidealDig6814",
        "body": "I have sensitive skin and 2 years back, I got bad acnes because of a hair old which was too potent and I needed to see dermatologist. Took me q year to clear my face again. \n\nSince then, I have been too afraid to try anything in my hair. Do you think this serum is potent enough to cause acne?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Reticent_Spirit",
        "body": "Well even I noticed a reduced hair-fall after using the serum. But it makes my scalp really oily. As I am a person with an oily scalp and dandruff, the cons weigh higher for me because washing the hair everyday is a big hassle. I would not recommend it for someone with a similar scalp situation. Now since I have bought it, I use it at night the day before washing my hair.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Realistic-Pumpkin516",
        "body": "What is mean by cc?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sonammumbai",
        "body": "Does it suits sensitive scalp?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Cookiemonster0w0",
        "body": "I applied it once and my hair has this tacky feeling that wont go away even after shampooing 4 times what do I do",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 30,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "rzpnvg",
    "title": "Review: The Ordinary Multi-Peptide Serum for Hair Density",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/rzpnvg/review_the_ordinary_multipeptide_serum_for_hair/",
    "score": 127,
    "num_comments": 46,
    "created": "2022-01-09T11:24:11+00:00",
    "body": "## [Product Deets from Deciem's website](https://deciem.com/en-in/theordinary/mas-rdn-multi-peptide-serum-for-hair-density.html?dwvar_mas-rdn-multi-peptide-serum-for-hair-density_size=60ml&quantity=1):\n\nThis concentrated formula is designed to support hair health so that it looks thicker, denser, fuller and healthier. The technologies present in this formula include **REDENSYL**™ complex (with Larix Europaea Wood Extract and Camellia Sinensis Leaf Extract), **Procapil**™ peptide complex (with Biotinoyl Tripeptide-1), **CAPIXY**L™ peptide complex (with Acetyl Tetrapeptide-3 and Trifolium Pratense Flower Extract), **BAICAPIL**™ complex (with Scutellaria Baicalensis Root Extract, Triticum Vulgare Germ Extract and Glycine Soja Germ Extract), **AnaGain**™ (Pisum Sativum Extract) and High-Solubility **Caffeine** (1% net Caffeine by weight), in an ultra-lightweight, emollient base for efficient penetration. The total concentration of these technologies in the formula by weight is 21.15%.\n\n## Purchased from:\n\n[Cult Beauty](https://www.cultbeauty.com/the-ordinary-multi-peptide-serum-for-hair-density-60ml/11841280.html?autocomplete=productsuggestion)\n\n*Customs Info for anyone who's interested*: The first time, I'd purchased two bottles, along with a few other products- my order total came to Rs 4530 and I had to pay \\~53% of that(Rs 2400) for customs. The second time, I'd purchased two bottles of this alone- they were on discount and the discount amount was higher than the shipping fees, so I paid for shipping and got both bottles for 3k(including shipping) and paid no customs fees. I've ordered from Cult Beauty 4 times so far- Order Amounts: 2.2k, 500, 4530 and \\~3k- and only had to pay customs once. Location: Kerala\n\n## Usage:\n\n*Usage Period:* \\~4 months\n\n*How I use it:*  I use it maybe around 4 night a week, concentrating on the front of my head, by sectioning my hair and dropping \\~3 drops of the serum along each parting(it spreads quite easily, so that's enough). It takes a little over half a pipette to do this(I have a pretty small head though, I think most people might need a bit more). I then put on an episode of a TV show/anime and massage till the episode ends if it's a short one, otherwise for half the episode, so roughly around 20 minutes?\n\n## Texture:\n\nViscous, easily spreadable liquid, which means a little goes a long way.\n\n## Greasiness:\n\nLeaves hair looking a tad greasy right afterwards, but it goes back to normal by morning(disclaimer: I don't have a greasy scalp at all, so idk how it'll fare for those of you who do).\n\n## Weird shit:\n\nMy scalp felt all weird and tingly the day after I used it for the first time- not bad, per se, but noticeable enough to be distracting. You know those sci-fi movies where they show the supervillain's head expanding till they look like more human versions of Mojo Jojo? Kinda felt like that was about to happen to me. Experienced this again to a slighter degree the next time, and then never again.\n\n## Results:\n\n* *Hair Fall:* By the end of the third week, my hairfall had decreased dramatically. I have depression, so every now and then, I go long periods of time without washing my hair, which sucks because I get insane hairfall if I go longer than 5-7 days without washing it. Towards the end of the first month, I was going through a tough time and didn't wash my hair for \\~10 days. I'd braced myself for the insane hairfall- and it never came! Not when I detangled my hair pre-wash, not when I shampooed or conditioned it and not when I towel-dried it. Like I was fully prepared for 100+ strands, but I'm pretty sure I didn't lose over 30 during the whole process.\n* *Hair Growth:* It's only been \\~4 months and I don't have any visible bald spots, plus I always have a halo of baby hair so I'm not sure I'll be able to tell how effective it is here, unless there's a dramatic difference. But while I'm not sure if it increased the growth of new hair, I think it sped up my hair growth? Like I think it got longer faster? My hair normally doesn't grow super quickly(for context, I've been getting my hair smoothened since I was in high school and when my roots grow out, they're not noticeable at all for the first 5-6 months, fairly noticeable from months 6-9 and very noticeable and looks pretty damn weird from months 9-12). Around the time I started using this, I had a big haircut and I just had another haircut yesterday back to that same length yesterday and the hairdresser definitely chopped off over 2 inches. So I think that's more than 2 inches in 4 months, which is higher than my usual rate. Sounds like I'm rambling, I know, but I'm explaining all this so you know this is all completely anecdotal, I hadn't taken any before and after pictures.\n\n## VFM:\n\nThe first time I purchased this before Cult Beauty turned evil and stopped docking prices on checkout for non-EU citizens. Two bottles of it cost me Rs 2732 then\n\n\\-> one bottle(60ml) = 2732/2 = **Rs 1366**\n\nBUT I had to pay 53% customs, which means\n\n\\-> one bottle(60ml) = 1366 x 1.53 = **Rs 2090**\n\nThe second time was after Cult Beauty turned evil, but with discount + shipping charges + no customs, I only had to pay Rs 3078 for 2 bottles, which means\n\n\\-> one bottle(60ml) = 3078/2 = **Rs 1539**\n\n*How long a bottle lasts for me:* 2.5-3 months\n\nCustoms fees are erratic, ranging from 0-70% from what I've seen on this sub, so I guess this answer's going to be very subjective. I'd say it's definitely worth a purchase if you have slight hairfall, especially if it's on sale, if it's within your budget, but if not, I think Be Minimalist has a dupe for it with all the same actives, which goes on B2G1 sales a lot(haven't tried that one myself, but I've heard good things about it on this sub).\n\n&#x200B;\n\n**Note:** If you have excessive hairfall, I think you should save your money and see a trichologist instead.\n\n&#x200B;\n\n## Repurchase Status:\n\nOn my second bottle now, already repurchased a third for myself and a fourth for my mom(might update in a few months if she sees significant results, but she's not consistent with beauty stuff, so don't count on this).\n\nI think I'd repurchase this forever and it would totally be my HG IF it were easier to source. Why oh why can't Deciem retail in India\n\nI think I might put a brief pause on repurchasing this after I empty my current stash to try the dupe by Be Minimalist, but such a tiny bottle ugh. If anyone has tried both, I'd love to hear a comparison!",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "Dramatic-Garbage-907",
        "body": "This makes me excited since I bought two bottles of that Minimalist hair growth actives at 40% off!",
        "score": 37,
        "is_top_level": true
      },
      {
        "author": "Introverted_gal",
        "body": "Thanks for the detailed review!\n\n'I purchased this was before Cult Beauty turned evil' - LMAO , I stopped buying altogether after the ownership change.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "Wild-Contribution-73",
        "body": "It’s available on Nykaa now and thanks a lot for the detailed review. I’ll be purchasing this now hehe",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "ohkayie",
        "body": "all this while I kept waiting to buy from cultbeauty and now they've risen prices \\*crie\\*",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "LogicalInvestment793",
        "body": "Thank you so much for the detailed review. You must be so happy since it's now available on Nykaa. It was on my wishlist but after this review,  I'm definitely planning on buying it. My scalp is on the dry side so I don't have to worry about the grease factor. How long does a bottle last if you use it every day?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Ani_Sin",
        "body": "Hi OP,\n\nHow is this working now? I mean:\n\n* Hairfall still less?\n* Seeing new hair or faster growth than earlier?\n\nCurrently using it or discontinued?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Professional-Item135",
        "body": "Thank you so much for the review...😁😁",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Moo-Mu",
        "body": "Which is the Minimalist dupe? Could you share?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "obsessedfangirl07",
        "body": "How do you store the serum? In the original packaging or just keep it out of direct sunlight?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "supr6m6",
        "body": "Hey, ik this is very old chat but does it help?\nDid you experience hair-fall if you stopped using it?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Whisky-In-Teacup",
        "body": "Has anyone tried the inkey list hair serums? It seems cheaper than TO and I was considering getting [This](https://www.theinkeylist.com/products/peptide-volumizing-hair-treatment-100ml#) or [This](https://www.theinkeylist.com/products/caffeine-stimulating-scalp-treatment-150ml#)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "wang-bang",
        "body": "Im going to buy this for my beard since I need some kind of oil for it anyways\n\nExcellent review, thanks!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ok_Boysenberry9557",
        "body": "Is it subderm safe?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Own-Foot7556",
        "body": "Hello. I felt the same sensations on my head after using it for the first time and i quickly washed it off. And have never used it again. Do you think it could be because of little bumps in the head due to dandruff? Like if you don't wash it for long the greasy dandruff dries out and then it turns into buns or micro scratches in the scalpe?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Fluffy-Occasion4026",
        "body": "Worked for me after 3 weeks. I noticed a big difference.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BarelyHuman_1010",
        "body": "Heya, are you still using it? Any long term benefits or side effects?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "FitYogurtcloset7955",
        "body": "Heyy OP . I hope you are doing good now ❤️ ❤️",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 18,
      "top_level": 18,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "8h930a",
    "title": "Is Deciem's Density Stimuli serum effective? Whats the science behind it? Anyone have experience with ANY hair serums?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/8h930a/is_deciems_density_stimuli_serum_effective_whats/",
    "score": 49,
    "num_comments": 3,
    "created": "2018-05-05T17:42:55+00:00",
    "body": "https://stemm.co/product/stm-fulvic-protein-stimuli-60ml\n\nA high-potency serum for hair that looks thicker, denser, fuller and healthier. This advanced leave-in scalp formula combines a wide array of vitamins, minerals, amino acids, peptides, polyphenols and other nutrients at extraordinarily high concentrations to help hair achieve its healthiest-, densest- and fullest look with continued use.\n\nAqua (Water), Propanediol, Centaurea cyanus flower water, Panthenol, Butylene Glycol, Glycerin, Caffeine, Niacinamide, Maltodextrin, Dimethyl Sulfone, Lactobacillus/Arundinaria Gigantea Leaf Ferment Filtrate, Biotinoyl Tripeptide-1, Biotin, Larix Europaea Wood Extract, Fulvic Acid, Humic Acid, Apigenin, Hydrolyzed Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Sodium Hyaluronate, Magnesium Aspartate, Zinc Gluconate, Copper Gluconate, Calcium Gluconate, Oxidized Glutathione, Citrulline, Arginine, Aspartic Acid, Glycine, Alanine, Serine, Valine, Isoleucine, Proline, Threonine, Histidine, Phenylalanine, Inositol, Glucose, Maltose, Fructose, Trehalose, Sodium PCA, PCA, Sodium Lactate, Urea, Allantoin, Oleanolic Acid, Pisum Sativum (Pea) Peptide, Mentha Arvensis Leaf Extract, Glycine Soja (Soybean) Seed Extract, Epilobium Angustifolium Flower/Leaf/Stem Extract, Camellia Sinensis Leaf Extract, Citrullus Lanatus (Watermelon) Fruit Extract, Lactobacillus/Eriodictyon Californicum Ferment Extract, Phospholipids, Disodium Phosphate, Sodium Metabisulfite, Zinc Chloride, Sodium Chloride, Citric Acid, Pentylene Glycol, Menthol, Menthyl Lactate, Xanthan gum, Hydroxyethylcellulose, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Sodium Hydroxide, Ethoxydiglycol, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Chlorphenesin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "huffliest_puff",
        "body": "Is this the same as Grow Goregeous? That's a deciem product. Not sure how well it works, but my hair loss is likely hormonal.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "8eanxo",
    "title": "[FOUND] New releases and interesting products.",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/8eanxo/found_new_releases_and_interesting_products/",
    "score": 36,
    "num_comments": 17,
    "created": "2018-04-23T11:14:27+00:00",
    "body": "**New Stuff**\n\n\n☀ **Apieu:** has some new skincare and makeup: [Apieu Oil Control Film Powder XP](http://apieu.beautynet.co.kr/goods.list.exhibition.do?ebtNo=4147), [BBOYAN Whitening Body Cream](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=79197), [Oil Control Film Cream](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=79192), [Shirts Frozen Mist](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=79189).\n\n\n☀ **TonyMoly:** has a new cheek palette [Cheektone Blusher Palette](http://www.etonymoly.com/html/ItemDetail.asp?guid=5442&cate=165).\n\n\n☀ **Skinfood:** added new products to their *Aqua Grape Bounce Line* : [Anti Oxidant Ampoule](http://www.theskinfood.com/goods/goodsDetail.do?goodsCd=2700-2), [Hydro Ampoule](http://www.theskinfood.com/goods/goodsDetail.do?goodsCd=2700-1), [Eye Cream](http://www.theskinfood.com/goods/goodsDetail.do?goodsCd=2700).\n\n\n☀ **Swisspure:** has some new suncare: [Blue Relief Soothing Sun Tension](http://swisspure.beautynet.co.kr/goods.detail.do?goodsNumber=79153), [Perfect Filter Water Sun Gel](http://swisspure.beautynet.co.kr/goods.detail.do?goodsNumber=79195), [Perfect Filter Air In Sun Cream](http://swisspure.beautynet.co.kr/goods.detail.do?goodsNumber=79196).\n\n\n☀ **Etude House:** has some new makeup: [Big Cover Concealer Skin Fit PRO](http://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=103001446&sapCd=), [Look At My Eyes Gelato](http://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=101006163&sapCd=).\n\n\n☀ **TCFS:** has  a new pencil [Art Class Frottage Pencil](http://www.toocoolforschool.com/shop/goods/goods_view.php?goodsno=14110444&category=008).\n\n\n☀ **SCINIC:** has come out with a pore care stick [All Day Fine Pore Blackhead Remover Stick](http://www.scinicmall.com/shop/shopdetail.html?branduid=1053068&special=3&GfDT=bm19W1w%3D).\n\n\n☀ **Ingrate:** has come out with a new foundation [Water Jelly](http://www.shiseido.co.jp/sw/products/SWFG070410.seam?shohin_pl_c_cd=849901&online_shohin_ctlg_kbn=1).\n\n\n☀ **The Saem:** has been updating and coming out with new products: [Powe Ampoule Pore Thightening](http://www.thesaemcosmetic.com/page/product/detail/14807), [Original Cream Mist](http://www.thesaemcosmetic.com/page/product/detail/14821), [Original Essence Mist](http://www.thesaemcosmetic.com/page/product/detail/14819), [Original Water Mist](http://www.thesaemcosmetic.com/page/product/detail/14817), [Healing Tea Garden Green Tea Oil In Cleansing Water](http://www.thesaemcosmetic.com/page/product/detail/14847), [Phyto Seven Cleansing Oil Cream](http://www.thesaemcosmetic.com/page/product/detail/14848).\n\n\nAll of the mists have a 300ml version and a 120ml version.\n\n\n☀ **Jungsaemmool:** has a new suncare product [Pre-tect Sun Mild](http://www.jsmbeauty.com/shop/shopdetail.html?branduid=2147080&xcode=011&mcode=000&scode=&type=P&sort=manual&cur_code=011&GfDT=bmx%2BW1w%3D).\n\n\n**Special Mentions:**\n\n\nA look at [RMK's Summer Collection 2018](https://www.rmkrmk.com/products/archives/2018summer/).It will be released on 27/4 and it's LE.\n\n\n*Lululun* has a LE cherry blossom mask pack [Premium Lululun Sakura Face Mask Spring 2018](http://lululun.com/premium/spring/).\n\n\nA look at [Jill Stuarts's Summer Collection](http://www.jillstuart-beauty.com/ja-jp/new-item/2018/0316_summer_collection/) that came out on the 6th of april.\n\n\nBison has an interesting primer [Chiffon Gel Primer](http://www.bison.co.jp/products/babypink-primer.html).[Here's](https://fortune-girl.com/articles/cV02m) a closer look at it.\n\n\nA look at [Three's Summer Makeup Collection](https://www.threecosmetics.com/brand/news/2018-summer-makeup-collection/) that will come out on may 2nd.\n\n\nANGFA has some nice looking eyelash care: \n\n\n•[Premium Eyelash Serum](https://www.cosme.com/products/detail.php?product_id=121977) -  peptides(Biotinoyl Tripeptide-1, Oligopeptide-20, Acetyl Decapeptide-3, Octapeptide-2, Oligopeptide-41, Caprooyl Tetrapeptide-3, Acetyl Tetrapeptide-5,Acetyl Hexapeptide-8), Pyrrolidinyl Diaminopyrimidine Oxide, Panthenol, Cystine, Hydrolized Silk,Soluble Keratin(Wool),Glucosylceramide.\n\n\n•[Pure Free Eyelash Serum](https://www.cosme.com/products/detail.php?product_id=121979) - peptides(Biotinoyl Tripeptide-1, Oligopeptide-20, Acetyl Decapeptide-3, Octapeptide-2), Pyrrolidinyl Diaminopyrimidine Oxide, Cystine, Panthenol, Hydrolized Silk,Soluble Keratin(Wool),Glucosylceramide.\n\n\nJourmoe's [3in1 makeup products](http://www.jourmoe.jp/) look very interesting. I really like that the Liner&Shadow comes with a waterproof gel liner.\n\n\nIf you are into cute powder puffs you may want to take a look at [these powders](http://ac-cosme.jp/item-cat/facepowder).\n\n\nShu Uemura has some interesting looking mousse makeup: [UV Under Base Mousse CC](https://www.shuuemura.jp/?p_id=MMB022), [UV Under Base Mousse Radiance-Moist](https://www.shuuemura.jp/?p_id=MMB020).",
    "flair_text": "FOUND",
    "flair_template_id": "c89bc5b4-45e8-11e7-826e-0e49a8a0253c",
    "comments": [
      {
        "author": "vulpix420",
        "body": "Frottage *sniggers*",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "Sister_Grimm",
        "body": "Man,  I am honestly blown away by how some of these brands have new product releases literally every week.   And I agree that the lash serums look really interesting.   Heck,  the ingredient lists look more impressive than the Dr.  Jart Peptidin serums!   Thanks,  as always!",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "kbrsuperstar",
        "body": "I am such a huge sucker for the Lululun limited edition/location specific masks, it's my biggest impulse buy weakness.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "PetiteMadeliefje",
        "body": "As someone who hates summer, I'm fascinated by the A'Pieu Shirts Frozen Mist.  I'd want one for my face too if it actually worked.  \n\nThank you for putting together these lists every week.  I always love them!",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "9mepqk",
    "title": "New Releases and Interesting Finds",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/9mepqk/new_releases_and_interesting_finds/",
    "score": 24,
    "num_comments": 3,
    "created": "2018-10-08T13:10:28+00:00",
    "body": "**New Releases**\n\n**Innisfree:** has some new makeup: [Like It Color Moody Chilli 7-Pan Palette](http://www.innisfree.com/kr/ko/ProductView.do?prdSeq=19678), [Skinny Microcara Zero](http://www.innisfree.com/kr/ko/ProductView.do?prdSeq=19676).\n\n**Apieu:** has some new [Couture Blushes, Highlighters and Shadows](http://apieu.beautynet.co.kr/goods.list.exhibition.do?ebtNo=4628).\n\n**Holika Holika:** the Naked Face Balancing Primer has been [renewed](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20012668) and they have a new primer [Naked Face Gold Serum Primer](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20014372) and a new cera product [Good Cera Super Ceramide Essential Oil](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20010819).\n\n**Clio:** has some new makeup: [Veil Tint Dewy](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201809176797&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Kill Brow Color Brow Lacquer](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201809175410&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Kill Cover Stay Perfect Foundation](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201809285376&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined).\n\n**Les** **M****erveilleuses Ladurée****:** has some new LE perfume products: [Pressed Fragrance Powder and Coffret I(scroll down to see them)](http://www.lm-laduree.com/products/fragrance/eau_de_parfum_iris/).\n\n**Canmake:** has some new Halloween colors out that can be seen [here](http://www.canmake.com/new/index02.html).\n\n**It's Skin:** has a new lip color: [Life Color Hipstick Sheer](http://www.itsskin.com/shop/view.asp?P_IDX=3468).\n\n**Momo Puri:** now has a sheet mask: [Jelly Mask](https://www.bcl-brand.jp/product/product-22114/).\n\n**Kate:** has come out with the [1st part of their Halloween Collection](https://www.nomorerules.net/special/fit_gel_glitter/).\n\n**Interesting Finds**\n\n*Beauty Mines* has an oil tint that has some pretty shades: [Oil Care Tint](https://www.bcl-brand.jp/special/beautymines/).Found swatches of some of the shades and you guys can see them [here](http://news.livedoor.com/article/detail/12964330/).\n\n[Jill Stuart's Holiday Collection](http://www.jillstuart-beauty.com/ja-jp/new-item/2018/1005_holiday_collection/) will be available for reservation starting the 19th of oct and will be released on the 2nd of nov.\n\n*Shiseido* will be comming out with their A/W collection on the 1st of nov: [2018 A/W Shiseido X Ribonesesia, Beauty Is A Gift](https://prtimes.jp/main/html/rd/p/000001253.000005794.html).\n\n*5Blanc* has some milk haircare that looks nice and it can be seen [here](http://www.5lanc.com/milrish.html#top)(scroll till you see the the band were all of the products are in a row and click the product to see the ingredient list & details(copy pastable)).The products have ingredient such as: *Whey, Casein,  Lactoferrin, Lactobacillus/Milk Ferment Filtrate, Yogurt, Zein, Hydrolyzed Keratin(wool), Hydrolyzed Silk, Hypericum Perforatum Flower/Leaf/Stem Extract, Chamomilla Recutita (Matricaria) Flower Extract, Calendula Officinalis Flower Extract, Tilia Cordata Flower Extract,  Anthemis Nobilis Flower Extract, Centaurea Cyanus Flower Extract, Sapindus Trifoliatus Fruit Extract, Shea Butter.*\n\nIf you're a fan of scented lip care then you'll like [Pure Smile's Delicious Lip Cream](http://www.ss-style.com/fs/puresmile/c/deliciouslipcream).They have some pretty interesting scents: bread, sweet potato, caramel popcorn, pancakes,etc.\n\n[4U2's Love Me More Blush](https://www.4u2thailand.com/category/3580/blush-/&p=1) has some very very pretty shades.Some swatches from youtube: [1](https://www.youtube.com/watch?v=0F75skN5EOY),[2](https://www.youtube.com/watch?v=joBlChf7SxY),[3](https://www.youtube.com/watch?v=ScRmHRUEKsM).\n\n*Cutepress* has a very nice looking lip color for dry lips: [Good Bye Dry Lips Moisturizing Lip Cream](http://www.cutepress.com/worldwide.php/makeup/lip/lipstick/good-bye-dry-lip.html). Some swatches from youtube: [1](https://www.youtube.com/watch?v=Kf_WZtoPfmc), [2](https://www.youtube.com/watch?v=bpGSnCmvnuY), [3](https://www.youtube.com/watch?v=_aSK6cL3IPA).\n\n\\----------------------------------------------------------\n\nSome nice looking lash care products:\n\n • [Mesiru Eye Care](https://jp.rohto.com/mesiru/eye-cream/)(lid and lash care), a look at some of the ingredients:  *Meadowfoam Seed Oil, Squalene, Myristoyl Pentapeptide-17, Licorice Root Extract, Kjellmaniella Crassifolia Extract, Panax Ginseng Root Extract, Chrysanthellum Indicum Extract, Pullulan, Shea Butter.*\n\n • [Refine Cobo Eye Lash](https://www.8341.jp/category/537.html), a look at some of the ingredients:  *Humulus Lupulus (Hops) Flower Extract, Chamomilla Recutita (Matricaria) Flower Extract, Swertia Japonica Extract,  Panax Ginseng Root Extract, Dipotassium Glycyrrhizate, Hydrolyzed Collagen, Hydrolyzed Silk, Hydrolyzed Keratin, Panthenol, Saccharomyces Lysate Extract, Arginine.*  \n • [Gran Fixer Eyelash Wise Creators](http://granfixer.com/ewc.html), a look at some of the ingredients: *Hydrolyzed Collagen, Royal Jelly Extract, Ziziphus Jujuba Fruit Extract,  Panax Ginseng Root Extract, Panthenol, Swertia Japonica Extract,  Sage Leaf Extract, Laminaria Japonica Extract,  Algae Extract,  Rhodophyta Extract,  Aloe Barbadensis Leaf Juice, Human Oligopeptide-1, Rice Sphingoglycolipids, Hydrolyzed Keratin, Hydrolized Silk, Sodium Tocopheryl Phosphate.*  \n • [Royal Kaken Love Eyeleashes Plus](https://www.royalkaken.jp/i/gd13), a look at some of the ingredients: *Prunus Yedoensis Leaf Extract, Panthenol, Placenta Extract, Brown Algae Extract,  Pueraria Mirifica Root Extract, Phyllostachys Pubescens Shoot Bark Extract, Trifolium Pratense (Clover) Flower Extract, Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Oligopeptide-41, Octapeptide-2, Hexapeptide-33.*\n\n • [Angfa Scalp De Beaute Pure Free Eyelash Serum](https://www.angfa-store.jp/brand/br_lp_eyelash), a look at some of the ingredients:  *Biotinoyl Tripeptide-1, Oligopeptide-20, Acetyl Decapeptide-3, Octapeptide-2, Pyrrolidinyl Diaminopyrimidine Oxide, Cystine,  Panax Ginseng Root Extract, Tocopheryl Acetate, Soluble Keratin(wool), Hydrolyzed Silk, Glucosyl Ceramide,  Hydrolyzed Collagen, Glutamic acid, Platinum, α‐glucan.*",
    "flair_text": "FOUND",
    "flair_template_id": "c89bc5b4-45e8-11e7-826e-0e49a8a0253c",
    "comments": [
      {
        "author": "pohet",
        "body": "Thanks so much for posting these!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Sister_Grimm",
        "body": "Those Clio dewy lip tints look really pretty.   I like the concept of lip tints but they haven't really worked for me as my lips are forever dry regardless of hydration or treatment. \n\nI have mixed feelings about holiday and seasonal collections.   I understand that different shades work for different seasons,  but brands should have a decent shade selection available at all times.   It also creates a false sense of scarcity that tricks people into thinking they need to be buying new makeup at all times to squeeze money out of us while we never finish a product.   But on the other hand, NEW RELEASES,  YAYYY!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionLux",
    "post_id": "1io56v3",
    "title": "Actives Insanity",
    "url": "https://www.reddit.com/r/SkincareAddictionLux/comments/1io56v3/actives_insanity/",
    "score": 23,
    "num_comments": 62,
    "created": "2025-02-12T23:33:27+00:00",
    "body": "Hi everyone! I didn’t know what else to title this post. Have you seen this new serum by numbuzin 9? I’ve never seen this many ingredients in a single product. Listing them here for your viewing pleasure:\n\n> Water, Glycerin, Hydrogenated Poly(C6-14 Olefin), Polyglycerin-3, Butylene Glycol, Pentaerythrityl Tetraethylhexanoate, Propanediol, Dimethicone, 1,2-Hexanediol, Niacinamide, Methylpropanediol, Cetearyl Alcohol, Glyceryl Stearate, Hydrogenated Vegetable Oil, Polyglyceryl-3 Methylglucose Distearate, Butyrospermum Parkii (Shea) Butter, Dimethicone Crosspolymer, Ammonium Acryloyldimethyltaurate/VP Copolymer, Sodium Polyacrylate, Hydrogenated Lecithin, Carbomer, Xanthan Gum, Pentylene Glycol, Tromethamine, Ethylhexylglycerin, Adenosine, Palmitic Acid, Stearic Acid, Sodium Phytate, Cholesterol, Sodium Hyaluronate, Adenosine Triphosphate, Hydroxypropyl Cyclodextrin, Nicotinamide Adenine Dinucleotide, Beta-Glucan, Tocopherol, Palmitoyl Tripeptide-5, Copper Gluconate, Saccharomyces/Copper Ferment, Saccharomyces/Iron Ferment, Saccharomyces/Magnesium Ferment, Saccharomyces/Silicon Ferment, Saccharomyces/Zinc Ferment, Capryloyl Dipeptide-17, Thioctic Acid, Leuconostoc/Radish Root Ferment Filtrate, Glutathione, Tremella Fuciformis (Mushroom) Extract, Haematococcus Pluvialis Oil, Potassium Hydroxide, Resveratrol, Hesperidin Methyl Chalcone, Sorbitan Laurate, Steareth-20, Astaxanthin, Sodium Lactate, Hydroxyethylcellulose, Acetyl Dipeptide-1 Cetyl Ester, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Heptasodium Hexacarboxymethyl Dipeptide-12, Panthenol, Polysorbate 20, Sodium Citrate, Chlorhexidine Digluconate, Dextran, Hexapeptide-2, Magnesium Chloride, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Acetyl Tetrapeptide-5, Dipeptide-2, Potassium Sorbate, Acetyl Hexapeptide-8, Palmitoyl Dipeptide-5 Diaminobutyroyl Hydroxythreonine, Citric Acid, Biotin, Palmitoyl Tetrapeptide-7, Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Tocopheryl Acetate, Palmitoyl Tripeptide-8, Dipeptide-4, Hexapeptide-11, Pentapeptide-18, Tripeptide-3, Sh-Decapeptide-7, Sh-Octapeptide-4, Palmitoyl Tripeptide-1, Ascorbic Acid Polypeptide, Hexapeptide-9, Oligopeptide-3, Palmitoyl Hexapeptide-12, Tripeptide-1, Palmitoyl Pentapeptide-4, Ubiquinone, Copper Tripeptide-1, Caffeoyl Tripeptide-1, Caffeoyl Sh-Octapeptide-4, Galloyl Pentapeptide-33, Kojyl Carboxy Dipeptide-23, Nicotinoyl Tripeptide-1, Octapeptide-7, Oligopeptide-1, Sh-Decapeptide-9, Sh-Oligopeptide-9, Sh-Pentapeptide-19, Asparagine, Glutamine, Tryptophan, Oligopeptide-2, Sh-Oligopeptide-1, Sh-Oligopeptide-2, Sh-Polypeptide-1, Sh-Polypeptide-22, Sh-Polypeptide-3, Acetyl Octapeptide-3, Acetyl Tetrapeptide-2, Acetyl Tetrapeptide-9, Carnosine, Nonapeptide-1\n\nHere’s the link to the product on incidecoder: https://incidecoder.com/products/numbuzin-no-9-nad-bio-lifting-sil-essence\n\nWe have multiple antioxidants, peptides, growth factors, and God knows what else. It isn’t exactly lux, but I thought it might appeal to maximalists among us. \n\n",
    "flair_text": "Let's Chat",
    "flair_template_id": "e30e54ce-85d1-11ec-bda4-0e3f11bd745a",
    "comments": [
      {
        "author": "Unfair_Finger5531",
        "body": "For the tl;dr, the standout actives are:\n\n- vitamin c in two forms \n- resveratrol \n- hesperidin (powerful brightening)\n- alpha lipoic acid \n- copper tripeptide \n- coq10 \n- growth factors\n- Astaxanthin (6,000x more powerful than vitamin c)\n- a bunch of neuropeptides I have never seen before \n- amino acids\n- fermented copper, zinc, magnesium, and iron (I don't know why but they sound important)",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "Sunny4611",
        "body": "😮😮😮",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "GreenBurningPhoenix",
        "body": "Am I wanting to try it badly? Yes. Am I worried that such load of ingredients will wreck my skin? Also yes, lol. I don't know what to think, to be honest. I like the idea of jack of all trades, at the same time I'm really worried about potential interactions between all these ingredients and skin. It's so many variables at once. I think I am a fan of simpler skincare. Also, I read a lot lately about dangers of growth factors and fancy peptides - unwanted skin growths and such - and I'm really cautious. There is no long term effect research on all these fancy new ingredients, and also I did have a bad experience with such packed product before. It is really tempting, though, to fix my face with one tonner. :D",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "RowanVC",
        "body": "Sweet fancy Moses! 😳 Are you going to try it, OP? If you do, report back please! LOL",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "CrimsonFractal",
        "body": "I have been using it for over a month. Have very sensitive dry skin prone to breaking out on the chin, and love it. It's very plumping and hydrating.\n\nIt is a bit sticky when you put it on, but it's creamy and doesn't feel sticky once you spread it out. But I do recommend using a toner or something to have your skin a little damp before you put it on so it spreads well.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Fuzzy-Beautiful-6159",
        "body": "That's a boat load of ingredients! Let us know how it is.\n\n\nNow the only thing that stuck out to me was that it has both Vitamin C AND Copper Peptides. When used together they cancel each other out. So I wonder what they were doing there.\n\n\nMaybe someone can enlighten me 😆",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Ok-Subject-9114b",
        "body": "and yet someone how the first ingredient is water lol.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "GottaBeStacy",
        "body": "I get very hesitant when people are applying 18 actives in a row, let alone in one formulation. Wouldn’t some of these actives just cancel out each other? Supposedly certain ones are formulated to work together, but I don’t know I have my doubts.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "strawberrymedz",
        "body": "😟 damn",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mytanoliveskin",
        "body": "What??? Is this even possible? the no. of peptides in this serum is bonkers!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "PL_88",
        "body": "There is no way the actives are being used at an effective level.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "No-Kiwi-3140",
        "body": "I have the Numbuzin 9 sheet mask on the way. I'll probably mask a couple times a week with them for the next month and see what happens. I ❤️ peptides.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Psychological-Hour14",
        "body": "someone drop this in Nina Poole's Dm and see what she says about it-",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "alwaysapprehensive1",
        "body": "I just ordered it but it won’t come for another month (living in Australia problems). Very excited to try it!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "TheConcreteBrunette",
        "body": "Why does this post and most of the responses feel like an ad?",
        "score": -5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 15,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FemaleHairLoss",
    "post_id": "1k5tvyk",
    "title": "Hairfall Nightmare: 2 Years, 10 Doctors, 0 Results",
    "url": "https://www.reddit.com/r/FemaleHairLoss/comments/1k5tvyk/hairfall_nightmare_2_years_10_doctors_0_results/",
    "score": 18,
    "num_comments": 20,
    "created": "2025-04-23T08:13:23+00:00",
    "body": "Hi everyone,\nI’m a 25F who has been dealing with hairfall for the past two years. It’s become quite distressing, with visible bald spots and very dry, frizzy strands — even though my scalp gets oily quickly. I’ve seen over 10 dermatologists so far (each with 15+ years of experience), but unfortunately, nothing has helped so far.\n\nTreatments I’ve Tried:\n\nMinoxidil 2% for 6 months last year – saw no major improvement.\n\nFollirich Serum for the last 3 months (ingredients: Butylene glycol, Apigenin, Oleanolic acid, Biotinoyl tripeptide-1, peptides, etc.).\n\nBiograce Supplements – Biotin, Inositol, DL Methionine, etc. (taken for 3 months).\n\nB12 tablets – consistently for the past 3 months.\n\n\nBloodwork:\n\nESR is slightly high at 25 (normal: 10–20)\n\nCholesterol is a bit high\n\nEverything else related to hair health appears normal\n\nI have attached the image of my current meds\n\nAt this point, I’m feeling stuck. I know no one here can diagnose, but I’m just hoping to hear from others who may have had a similar experience — especially those dealing with long-term hairfall that didn’t respond to typical treatments.\n\nHow did you eventually cope with it or manage it? Any lifestyle changes that helped? Emotional support ideas are also welcome — this has taken a toll on my self-confidence.\n\nThank you to this community — it really helps to not feel alone in this. ",
    "flair_text": "Support/Advice",
    "flair_template_id": "25f05418-7787-11eb-b1e6-0ece931eab07",
    "comments": [
      {
        "author": "perilladerafa",
        "body": "You need 5 % minoxidil and probably DHT blockers and first and foremost a derm who's specialized in hair loss. None of the other things will do a great deal. 2% is just pink tax, use the one for men or ask for oral minoxidil",
        "score": 28,
        "is_top_level": true
      },
      {
        "author": "phoenixtears25",
        "body": "I have no idea of your diagnosis but the 2% minoxidil as far as I’ve researched in women is modest at best, and dermatologists usually tell or prescribe 5% minoxidil apply once a day for women. Also, if this is androgenic alopecia usually a dht blocker or androgen blocker helps slow the progression of hair loss.\nFor topical solutions, there has been some promise on ketoconazole 2% shampoo to slow the progression of hair loss. (This is not medical advice, this is from my own personal research) \n\nI think the accurate diagnosis is what’s going to really make a huge difference, and I truly feel for you when you stated you’ve seen multiple doctors for this situation. \nYou’re going to have to find a doctor that specializes in this field. This is going to take some research in your area to find a doctor that has a very trained eye for this.  This could be anything from vitamin deficient to an autoimmune disorder, so specific treatment is paramount.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Top-Engine-5681",
        "body": "Hi, based on your image, I'm assuming you're from India. So am I. \n\n1. The Hairfact Kit is something I've been using for years myself - it's a multivitamin kit and we need those vitamins and trust me our diets - no matter how clean - are not supplying us with the necessary amounts. \n\n2. Diet is THE MOST important factor in hair care and hair loss. I've been on this journey for 12 years now, but finally learnt the lesson that a PCOS sensitive and focused diet is must. \n\n3. Minoxidil is your ride or die. Once you start, you should not stop. I made this mistake a few times and I'm suffering for it. Use minoxidil 5% (I was prescribed Minicheck 5%) and it's effective. But DO NOT STOP and 6 months is nearly not enough time to notice results. 6 months is pure shedding and realignment of your hair's growth cycle. The magic begins after 6 months. But it takes up to a year to really truly SEE the difference. \n\nI'm experiencing THE WORST SHEDDING of my life rn, cus I stopped Mino for a year and lost all the progress I had made over years! So I've had to restart and I've lost 1/2 my volume. I bun my hair cus my braid or pony is worryingly thin!\n\nAlso, idk if you've texted your fasting insulin, that's a key factor in reversing PCOS - if that's what you have. If you're not sure, get all your PCOS tests done for a better understanding of why you're losing hair. \n\nLastly, exercise. MUST. Even a 30 min walk - you have to. 5 times a week at least.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "perilladerafa",
        "body": "Oh your flair is alopecia areata, in this case there's other treatment - so please go look for a derm who's specialized in hair loss.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "baibaihair",
        "body": "Have you had a biopsy done?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ConcentrateLow3272",
        "body": "Hi! Normal results don’t always mean optimal for hair growth or preservation. Is your ferritin above 70 (ideally near 100)? And b12 is best above 500 I think. Double check your result because it’s a huge “normal” range but that’s not always best for most women :(",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Exciting_Product2940",
        "body": "I have a similar pattern of loss",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "always_want_moncler",
        "body": "try melatonic!! it works wonderss",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AustralianMakeup",
    "post_id": "3s4fop",
    "title": "Stupid question but can flies be attracted to certain ingredients?",
    "url": "https://www.reddit.com/r/AustralianMakeup/comments/3s4fop/stupid_question_but_can_flies_be_attracted_to/",
    "score": 12,
    "num_comments": 9,
    "created": "2015-11-09T11:39:59+00:00",
    "body": "So I've recently started using the Rimmel Lash Accelerator Endless mascara and that's the only thing that's changed in my makeup routine. I've noticed these past 2 weeks when I don't wear my glasses, flies become super attracted to my face, specifically my eyes (even landing on my eyelashes) and its gotten rather annoying (and as a germaphobe it is seriously creeping me out). Just wondering if anyone else has had this problem? Could it be a specific ingredient? \n\nIngredient list: Aqua/Water/Eau, Paraffin, Cera Alba/Beeswax/Cire D'abeille, Stearic Acid, PVP, Cetyl Alcohol, Arginine, Polysorbate 20, Propylene Glycol, Copernicia Cerifera Cera/Copernicia Cerifera (Carnuaba) Wax/Cire de Carnauba, Synthetic Wax, Panthenol, Talc, Candelilla Cera/Euphorbia Cerifera (Candelilla) Wax/Cire de Candelilla, Phenoxyethanol, Butylene Glycol, Caprylyl Glycol, Hectorite, Simethicone, Microcrystallina Cera/Microcrystalline Wax/Cire Microcrystalline, Tocopheryl Acetate, Glycerin, Acrylates/Carbamate Copolymer, Caffeine, PPG-26-Buteth-26, HDI/Trimethylol Hexyllactone Crosspolymer, PEG-40 Hydrogenated Castor Oil, Polyethylene, Hydrolysed Keratin, 1,2-Hexanediol, Sodium Sulphate, Biotin, Sodium Hyaluronate, Sodium Benzoate, Benzoic Acid, Myristoyl, Pentapeptide-17, Potassium Sorbate, Silica, Apigenin, Oleanolic Acid, Bambusa Arundinacea Leaf Extract, Biotinoyl Tripeptide-1\n\nSide note: I have previously used this mascara before but many years ago (maybe 5?) and it had a completely different packaging so the formula may have been different, and I didn't have this problem at all.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chevronbird",
        "body": "I don't know either but that's horrible. :(",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "paintedicecream",
        "body": "I'm not sure, but I was thinking of asking the same question!!  The other day I was wearing a burts bees lip balm, and the horrible fly wouldn't leave my lips alone, yuck!  I thought maybe it was attracted to the peppermint smell.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "addictedlikewoah",
        "body": "Flies are attracted to paraffin and it's derivatives ... (http://naldc.nal.usda.gov/download/IND43967187/PDF)",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "IrmaGehrd",
        "body": "Is the mascara a bit old or have a weird smell? I think flies like anything that smells off/rotting/decaying/fermenting. Nothing in that list stands out to me though.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "dinosaur_overlord",
        "body": "I don't have any insight for you but eeewwwww! I hate flies :(\n\n\nAre you in Melbourne? There were a heap of flies around the other day and it was SO unpleasant trying to play sport and having them land on you every 1.5 seconds.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "78oqmj",
    "title": "What makes a split end sealer a sealer?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/78oqmj/what_makes_a_split_end_sealer_a_sealer/",
    "score": 11,
    "num_comments": 9,
    "created": "2017-10-25T16:17:18+00:00",
    "body": "I am so happy to have stumbled upon this community! I had several inches cut off my hair and the stylist recommended [Redken Extreme Lengths Sealer](http://www.ulta.com/extreme-length-sealer?productId=xlsImpprod11951117). \n\nI couldn't afford it so decided to hold off, and I wondered what sets sealers apart from other products aimed toward avoiding/minimizing the appearance of split ends. \n\n**Ingredients:** Water, Amodimethicone, Cetearyl Alcohol, Trideceth-5, Polyquaternium-37, Phenoxyethanol, Propylene Glycol Dicaprylate / Dicaprate, Steareth-20, Parfum / Fragrance, Glycerin, Phenyl, Trimethicone, Cetyl Hydroxyethylcellulose, Trideceth-10, Cetyl Alcohol, PPG-1 Trideceth-6, Prunus Amygdalus Dulcis Oil / Sweet Almond Oil, Biotin, Polyquaternium-67, Arginine, Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate,Benzyl Benzoate, 2-Oleamido-1, 3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate Benzyl Benzoate, 2-Oleamido-1,3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid.\n\nI am also curious if [Not Your Mother's Way to Grow Leave In Conditioner](http://www.ulta.com/way-grow-leave-in-conditioner?productId=xlsImpprod6340354&sku=2270344&cmpid=PS_Non!google!Product_Listing_Ads&cagpspn=pla&CATCI=pla-195671275470&CAAGID=17996762790&CAWELAID=330000200000108699&catargetid=330000200000773138&cadevice=m&gclid=CjwKCAjw7MDPBRAFEiwAppdF9KAqiW1sDct8rIom3o5Yhh4loq8lEcyl_1sOPdgtIszBtET81iKRORoCZMcQAvD_BwE) has any ingredients with sealing properties. They state they have a top secret \"procapify\" formula but they don't delve into, what that means.\n\n**Ingredients:** Water, Butylene Glycol, Cetearyl Alcohol, Cetyl Triethylmonium Dimethicone PEG-8 Succinate, Fragrance, Quaternium-91, Propylene Glycol, Diazolidinyl Urea, Myristyl Myristate, Hydrolyzed Keratin, PPG-26-Buteth-26, Behentrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Iodopropynyl Butylcarbamate, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Citric Acid.\n\nThanks for any clarity you guys can bring to this! ",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "graythunderclouds",
        "body": "The only product on the market right now that will specifically mend split ends is b3 from Brazilian blowout. However, this is an in salon additive to a dye or flossing treatment. The simplest way to explain it is that the b3 works like doubled sided tape inside each hair strand and helps the strands reform as one strand. This treatment is only designed to last 6ish weeks, and is not a permanent long term fix.\nAlmost all products sold as a split end “repair” treatment will not actually repair the split ends. They’re most likely smoothing the hair shaft to give the appearance of less split ends, and it washes out when you wash your hair. The emollients concentration in these products is heavy, so they can be very challenging to people with oily hair, because you are essentially adding more oil to the hair.  These products will not help repair the split ends, they more likely mask the problem. \n\nThe only way to get rid of split ends once they are actually splitting is to get a haircut.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Peanutswithcream",
        "body": "Remember seeing somewhere that the best thing for split ends is cutting them off...",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "graythunderclouds",
        "body": "The hydrolyzed keratin in  the not your mother’s product should essentially act as a very mild sealant, but they won’t actually repair anything",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "13zkk56",
    "title": "Has anyone tried the Innovist Anti-hairfall tonic?",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/13zkk56/has_anyone_tried_the_innovist_antihairfall_tonic/",
    "score": 10,
    "num_comments": 11,
    "created": "2023-06-03T18:05:38+00:00",
    "body": "Product details:  \nLink:\nhttps://innovist.com/products/anti-hair-fall-tonic?variant=39913584984110\n\nMRP: ₹799\n\nClaims: Increase hair follicle thickness, increase hair growth by 121% in 14 days with Adenosine and Biotinoyl Tripeptide-1.\n\nI’m looking to buy this I’m quite skeptical of the active ingredients. Also, I couldn’t find reviews of this product on this sub. If there’s already a post or comment, please link it (and I’ll delete my post then)",
    "flair_text": "Seeking reviews",
    "flair_template_id": "1c296c70-f53f-11ed-b973-36b0e81907fc",
    "comments": [
      {
        "author": "ahseyakr",
        "body": "Hey ! Tried it. I bought their entire anti hairfall collection (shampoo, hair mask, serum, tonic)\nPersonally did absolutely nothing for me except make my hair smell good (which I’m sure every other shampoo can do)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Illustrious_Tie_2380",
        "body": "Guys its a big fraud company, don't pay anything, in advance, I paid it but they sent me something else, the phone number is fake, there is no response from email, I think I have lost my money, eve the product is worst wasted my money, be careful it's not a genuine company, otherwise you will end up losing your money like me,",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "yassh_123",
        "body": "Bakwas product. Buy product containing \n\n- Capilia Longa or Anagain Or Redensyl . All works well in long term",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Guilty_Material_2223",
        "body": "Honestly not even a single product by bare anatomy worked for me. I have a scalp scrub, leave on conditioner, hair mask and anti dandruff tonic.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "co3i4o",
    "title": "What’s the science behind this products instructions?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/co3i4o/whats_the_science_behind_this_products/",
    "score": 8,
    "num_comments": 1,
    "created": "2019-08-09T14:58:07+00:00",
    "body": "Need your guy’s expertise on a co-washing product by Drybar! I wash my hair ~6 times a week (it’s fine and gets gross otherwise) and I recently discovered that my hair loves Drybar’s Double Standard cleansing conditioning foam. It looks and feels so much better than when I use my traditional shampoo and conditioner.\n\n\nThe instructions say to use a traditional shampoo and conditioner every 2-4 washes. Do you guys see anything in the ingredient list that would indicate why I can’t just switch to this product for every wash? Sorry…I know it’s a little over the top but want to be cautious! Thank you so much!\n \n\nIngredients: \n\n\nAqua (Water, Eau), Cetearyl Alcohol, Glycerin, Decyl Glucoside, Dimethicone, Isopentane, Stearalkonium Chloride, Behentrimonium Methosulfate*, Glyceryl Stearate, PEG-100 Stearate, Mel Extract (Honey Extract, Extrait de Miel), Rubus Idaeus (Raspberry) Seed Oil, Prunus Insititia Seed Oil, Cyperus Esculentus Root Oil, Panthenol, Equisetum Arvense Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol , Aloe Barbadensis Leaf Extract, Arnica Montana Flower Extract, Melissa Officinalis Leaf Extract, Fucus Vesiculosus Extract, Calendula Officinalis Flower Extract, Chamomilla Recutita (Matricaria) Flower Extract, Geranium Maculatum Extract, Echinacea Angustifolia Extract, Salvia Officinalis (Sage) Leaf Extract, Juniperus Communis Fruit Extract, Helianthus Annuus (Sunflower) Seed Extract, Rhodiola Rosea Root Extract, Citrus Junos Seed Extract, Camellia Sinensis Leaf Extract, Parfum (Fragrance), Biotinoyl Tripeptide-1, Citric Acid, Caprylyl Glycol, Ethylhexylglycerin, Hexylene Glycol, Dicetyl Phosphate, Ceteth-10 Phosphate, Alcohol Denat., Apigenin, Oleanolic Acid, Hydroxyethylcellulose, Disodium Phosphate, Sodium Phosphate, Sodium Nitrate, Polysorbate 60, Isobutane, Steapyrium Chloride, Disodium EDTA, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Pentylene Glycol, Propylene Glycol, Sorbic Acid, Chlorphenesin, Benzoic Acid, Potassium Sorbate, Phenoxyethanol, Coumarin.",
    "flair_text": "Co-Washing",
    "flair_template_id": "98fdd186-58be-11e4-919f-12313b0d5dc5",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "7xk1p9",
    "title": "Stemm Density Stimuli",
    "url": "https://www.reddit.com/r/HaircareScience/comments/7xk1p9/stemm_density_stimuli/",
    "score": 10,
    "num_comments": 5,
    "created": "2018-02-14T18:18:02+00:00",
    "body": "What are your experiences using the Stemm Density Stimuli? I'm also having trouble telling from the ingredient list if there is any oil in it, which my scalp does not tolerate. \n\nAqua (Water), Propanediol, Centaurea cyanus flower water, Panthenol, Butylene Glycol, Glycerin, Caffeine, Niacinamide, Maltodextrin, Dimethyl Sulfone, Lactobacillus/Arundinaria Gigantea Leaf Ferment Filtrate, Biotinoyl Tripeptide-1, Biotin, Larix Europaea Wood Extract, Fulvic Acid, Humic Acid, Apigenin, Hydrolyzed Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Sodium Hyaluronate, Magnesium Aspartate, Zinc Gluconate, Copper Gluconate, Calcium Gluconate, Oxidized Glutathione, Citrulline, Arginine, Aspartic Acid, Glycine, Alanine, Serine, Valine, Isoleucine, Proline, Threonine, Histidine, Phenylalanine, Inositol, Glucose, Maltose, Fructose, Trehalose, Sodium PCA, PCA, Sodium Lactate, Urea, Allantoin, Oleanolic Acid, Pisum Sativum (Pea) Peptide, Mentha Arvensis Leaf Extract, Glycine Soja (Soybean) Seed Extract, Epilobium Angustifolium Flower/Leaf/Stem Extract, Camellia Sinensis Leaf Extract, Citrullus Lanatus (Watermelon) Fruit Extract, Lactobacillus/Eriodictyon Californicum Ferment Extract, Phospholipids, Disodium Phosphate, Sodium Metabisulfite, Zinc Chloride, Sodium Chloride, Citric Acid, Pentylene Glycol, Menthol, Menthyl Lactate, Xanthan gum, Hydroxyethylcellulose, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Sodium Hydroxide, Ethoxydiglycol, Leuconostoc/Radish Root Ferment Filtrate, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Chlorphenesin.\n\nCosDNA -- http://www.cosdna.com/eng/cosmetic_5c88329624.html",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "littlemisschiefs",
        "body": "Is this even still available? As far as I was aware, Stemm was discontinued a couple of weeks ago, and the parent company Deciem was selling off their remaining stock at a discounted rate. They’re apparently going to somewhat reformulate the products and bring them back under another brand heading, but idk if they’ve done that yet.\n\nStill, if they have any left and you’re thinking about getting it, here’s my experience so far. I just got the density stimuli like a week ago, after buying it when it became discounted. I use it every night, and the instructions say to use it on a dry scalp, and not to wash it off - so don’t use it directly before or after a shower.\n\nIt’s fairly easy to massage into my head, but it’s definitely a very wet serum, and it takes time to dry, almost an hour if I’ve been liberal with it. The top of my head definitely looks like I’ve just taken a shower after I use it. Its consistency is only slightly thicker than water and it kind of trickles down your head if you don’t immediately massage it in. But at the same time, it’s sticky?! Even after it dries, even in the morning, it feels a bit sticky, which is frustrating if you’ve just washed your hair. But if I brush through the stickiness, it dissipates and my hair looks normal. That’s my biggest complaint about this product - the stickiness makes my hair feel unclean.\n\nIt also has a very natural earthy but medicinal type of smell that doesn’t bother me and that I quite like, but I completely understand if someone else would be bothered by it. The first night I used it, the smell lingered for a while, but on subsequent nights I noticed it less and less, probably because I got used to the scent.\n\nIn terms of effectiveness, this is a serum that’s supposed to increase density of growing, so it needs time to take effect. As I understand it, it probably won’t have much effect on already grown strands of hair. So I need to wait about 3 months before I actually compare before and after. But so far there has been a very strong placebo effect where the morning after, I feel like my scalp is less visible through my hair. Again, probably just a placebo effect, but I like feeling like something is actually working, so that’s why I’ve kept it up.\n\nIn terms of ingredients, I’m most interested in the fact that it has a highly soluble version of caffeine, which has been proven to stimulate hair growth. As for oils, it says in the ingredients list that it has castor oil (which explains the stickiness to me, castor oil is notoriously sticky) so maybe not the best product for you? But also, it’s very low down on the ingredients list, so maybe you can tolerate it??\n\ntbh I’m 50/50 on it so far. I might be more upset if I’d actually paid the original $30+ for it, but since it was about $13 when I bought it, I’m ok with what it’s been doing so far.\n\nHope this helps!",
        "score": 5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "1d0pbj8",
    "title": "best way make topical melatonin solution",
    "url": "https://www.reddit.com/r/tressless/comments/1d0pbj8/best_way_make_topical_melatonin_solution/",
    "score": 7,
    "num_comments": 2,
    "created": "2024-05-26T00:16:24+00:00",
    "body": "hello i want try melatonin for hair.\n\ni have topical oil serum which i bough from store. if i buy melatonin powder and mix with this serum im using its possible i can get benefit of topical melatonin ? or melatonin cant mix with serum ?\n\n\n\n ingredients are; 30ml;  \nAqua, Isopentyldiol, Propanediol, Pentylene Glycol, Butylene Glycol, Glycerin, Panthenol, Panthenol, Phytantriol, Leontopodium Alpinum Flower Leaf Extract, Saccharide Isomerate, Sophora Root Extract, Biotinoyl Tripeptide-1, Lepidium Meyenii Root Extract, Dextran, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Biotin, Niacin, Rosmarinus officinalis Leaf Extract, Nasturtium officinale Leaf Extract, Salvia officinalis Leaf Extract, Phenoxyethanol, Ethylhexylglycerin",
    "flair_text": "Treatment",
    "flair_template_id": "fe3884ac-25d5-11e6-a82b-0ecb21004af1",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "It looks like this post is about general **Treatment**.\n\nBefore asking any questions,\n\n1. Learn about [different hair loss treatments](https://tressless.com/learn).\n\n2. [Search for treatments](https://tressless.com/search), because there's likely research, and your question has probably been asked before.\n\nIf this post is not about hair loss treatments, please downvote and report.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Jordan-Iliad",
        "body": "Following",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "1hugiir",
    "title": "Anyone have success with Lash Serums without prostaglandins?",
    "url": "https://www.reddit.com/r/beauty/comments/1hugiir/anyone_have_success_with_lash_serums_without/",
    "score": 5,
    "num_comments": 11,
    "created": "2025-01-05T20:33:16+00:00",
    "body": "Looking to avoid issues with eyelid drooping, darkening, or fat loss (sunken eyes).\n\nBeen seeing posts and blogs about Accrēscō Lash & brow enhancing serum from Alchemist Skincare. Would love to hear if anyone has used it since it's $74 per vial. \n\nSays it contains 3 peptides. Here are the ingredients:\n\nIngredients: Water/Aqua/Eau, Glycerol, Hyaluronic Acid (as Sodium Hyaluronate), Myristoyl Pentapeptide-17, Myristoyl Hexapeptide-16, Biotinoyl Tripeptide-1, Malus Domestica (Swiss Apple) Fruit Cell Culture Extract, Argania Spinosa (Argan) Sprout Cell Culture Extract, Organic Camellia Sinensis (Green Tea) Leaf Extract, Organic Lavandula Angustifolia (Lavender) Flower Extract, Organic Symphytum Officinale (Comfrey) Root Extract, Organic Aloe Barbadensis Leaf Juice, Organic Glycerin, Sodium PCA, Panthenol, Pentylene Glycol, Phospholipids, Isomalt, Xanthan Gum, Sodium Benzoate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Phenoxyethanol, Ethylhexyglycerin, Triethanolamine",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "GrandIndependent3028",
        "body": "I’ve just started using Etude House’s mylash serum and I think it’s going pretty good so far! If you want I can update you after a few weeks or so and tell you how that’s going.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "trichotillomania",
    "post_id": "1g7lxq4",
    "title": "Hair growth actives/product recommandations",
    "url": "https://www.reddit.com/r/trichotillomania/comments/1g7lxq4/hair_growth_activesproduct_recommandations/",
    "score": 6,
    "num_comments": 0,
    "created": "2024-10-19T23:45:24+00:00",
    "body": "Hey :)\n\nIf like me you are trying to grow back your hair in the hardship that trichotillomania is, here's a sum up of some info ChatGPT was kind enough to provide to me asking \"what prompted hair growth following repeated hair follicule traction due to trichotillomania?\" and \"which serums contains such ingredients and are available over-the-counter in France [I live there]?\":\nPeptides can play a significant role in promoting hair follicle health and supporting hair regrowth by stimulating specific pathways that encourage hair growth. Here’s a list of peptides, sorted from the most effective to the least, based on current research and usage in hair loss treatments:\n\n\" 1. Copper Peptides (GHK-Cu)\n   - Effectiveness: Very high\n   - Mechanism: Copper peptides, especially GHK-Cu, are one of the most researched peptides in hair growth. They have anti-inflammatory properties, promote blood flow to the scalp, and help repair damaged follicles. Copper peptides can also increase the size of hair follicles and prolong the growth phase (anagen phase) of hair.\n  \n2. Palmitoyl Tetrapeptide-20 (PTD-DBM)\n   - Effectiveness: High\n   - Mechanism: This peptide is designed to inhibit the actions of DKK-1, a protein that inhibits hair follicle activity. By blocking DKK-1, PTD-DBM promotes the growth of new hair and protects existing hair follicles from damage.\n   \n3. Biomimetic Peptides (Acetyl Tetrapeptide-3)\n   - Effectiveness: High\n   - Mechanism: This peptide helps stimulate the extracellular matrix of the hair follicle, improving anchorage and reducing hair loss. It is often combined with other peptides and natural extracts to support overall scalp health and hair density.\n    \n\n4. Thymosin Beta-4 (TB500)\n   - Effectiveness: Moderate to High\n   - Mechanism: TB500 is known for its healing and regenerative properties. While its main role is in tissue repair, it has been suggested to support hair follicle recovery by reducing inflammation and promoting cell regeneration around damaged hair follicles.\n   \n\n5. Oligopeptide-54\n   - Effectiveness: Moderate\n   - Mechanism: This peptide inhibits the negative effects of DHT (dihydrotestosterone), which is a major cause of hair thinning and loss. Oligopeptide-54 can help maintain hair density and support regrowth in cases of androgenetic alopecia.\n   \n6. Myristoyl Pentapeptide-17\n   - Effectiveness: Moderate\n   - Mechanism: This peptide is primarily known for stimulating keratin production, which is a key component of hair. While it is more commonly used in eyelash and eyebrow growth products, it can be used on the scalp to improve hair strength and thickness.\n   \n\n7. Biotinyl-GHK (Biotinoyl Tripeptide-1)\n   - Effectiveness: Moderate\n   - Mechanism: This peptide combines biotin (which supports keratin production) with GHK to improve hair strength and reduce breakage. It enhances the health of the hair shaft, though it may not be as effective in treating follicular damage or hair regrowth compared to copper peptides.\n   - Products: Found in hair strengthening treatments and serums.\n\n8. Argireline (Acetyl Hexapeptide-8)\n   - Effectiveness: Low to Moderate\n   - Mechanism: Argireline is better known for its anti-wrinkle properties, but it may support blood circulation in the scalp, indirectly helping to nourish hair follicles. It’s not a primary peptide for hair regrowth but may be used in conjunction with other more potent peptides.\n\n\n\nHere are some options containing these ingredients:\n\n1. The Ordinary Multi-Peptide Serum for Hair Density\n\n\t•\tKey Peptides: Copper Peptides (GHK-Cu), Acetyl Tetrapeptide-3.\n\t•\tOther Active Ingredients: Caffeine, Biotin, and Hyaluronic Acid.\n\t•\tDescription: This is a popular serum that targets thinning hair by nourishing the scalp and promoting healthy follicle function. Copper peptides play a role in collagen production and hair regeneration.\n\t•\tAvailability: Widely available in France through stores like Sephora, Lookfantastic, and other online platforms.\n\n2. The Inkey List Caffeine Stimulating Scalp Treatment\n\n\t•\tKey Peptides: Myristoyl Pentapeptide-17, Dipeptide Diaminobutyroyl Benzylamide.\n\t•\tOther Active Ingredients: Caffeine and Biotin.\n\t•\tDescription: This product helps stimulate hair growth, strengthen weakened follicles, and reduce hair loss. Peptides and caffeine boost hair density by promoting circulation.\n\t•\tAvailability: Found in pharmacies, beauty stores, and online retailers in France.\n\n3. RevivHair Stimulating Serum\n\n\t•\tKey Peptides: Copper Peptides (GHK-Cu), Palmitoyl Tetrapeptide-20.\n\t•\tOther Active Ingredients: Redensyl, Stemoxydine, and Procapil.\n\t•\tDescription: Designed to revitalize thinning hair, this serum contains copper peptides for scalp health and follicle repair, alongside advanced hair growth ingredients like Redensyl and Procapil to promote denser, healthier hair.\n\t•\tAvailability: Available through international online retailers that ship to France.\n\n4. Foligain Triple Action Complete Formula for Thinning Hair\n\n\t•\tKey Peptides: Biomimetic Peptides, Copper Tripeptide-1 (GHK-Cu).\n\t•\tOther Active Ingredients: Caffeine, Saw Palmetto Extract.\n\t•\tDescription: This product uses biomimetic peptides to mimic natural growth factors in the scalp. It also contains copper peptides for their anti-inflammatory and regenerative properties, which aid in repairing hair follicles damaged by trichotillomania.\n\t•\tAvailability: Available via French and European online stores, such as Amazon or specialized hair care websites.\n\n5. DS Laboratories Spectral DNC-N\n\n\t•\tKey Peptides: Copper Peptides, Myristoyl Pentapeptide-17, Biotinyl-GHK.\n\t•\tOther Active Ingredients: Nanoxidil, Adenosine, Retinol, and Caffeine.\n\t•\tDescription: This serum targets hair thinning with peptides and other advanced ingredients like Nanoxidil (a Minoxidil alternative). Copper peptides repair the scalp and follicles while promoting new growth.\n\t•\tAvailability: Sold online through French and international stores.\n\n6. Nanogen Hair Growth Factor Serum\n\n\t•\tKey Peptides: Oligopeptides, Thymosin Beta-4.\n\t•\tOther Active Ingredients: Redensyl, Hyaluronic Acid.\n\t•\tDescription: This serum contains peptides to boost follicle repair and hair strength. Thymosin Beta-4 plays a crucial role in tissue regeneration and helps accelerate the repair of damaged hair follicles.\n\t•\tAvailability: Available online through major beauty and health retailers like Amazon and Lookfantastic.\n\n7. Eucapil (Fluridil)\n\n\t•\tKey Peptides: Biomimetic Peptides.\n\t•\tOther Active Ingredients: Fluridil (an anti-androgen to reduce hair loss).\n\t•\tDescription: Though not peptide-heavy, this treatment contains biomimetic peptides that help stimulate hair growth and prevent damage from hormone-related hair loss, which can be beneficial for damaged follicles.\n\t•\tAvailability: Eucapil can be ordered online through French health and beauty websites.\n\n8. Neofollics Hair Growth Stimulating Lotion\n\n\t•\tKey Peptides: Biomimetic Peptides, Oligopeptide-54.\n\t•\tOther Active Ingredients: Ecklonia Cava, Raspberry Ketone, Vividine.\n\t•\tDescription: This lotion includes a combination of biomimetic peptides and Oligopeptide-54 to stimulate hair follicles and support scalp health, particularly useful for hair regrowth in damaged areas.\n\t•\tAvailability: Can be purchased online from European distributors or through international sellers shipping to France.\n\n9. Hairgenics Propidren\n\n\t•\tKey Peptides: Myristoyl Pentapeptide-17.\n\t•\tOther Active Ingredients: Biotin, Saw Palmetto.\n\t•\tDescription: This product targets thinning hair with peptides, biotin, and saw palmetto to strengthen follicles and improve overall hair health.\n\t•\tAvailability: Available on Amazon and other major online platforms in France.\n\n10. Labo Crescina HFSC 100% (Hair Follicle Stem Cells)\n\n\t•\tKey Peptides: Copper Peptides, Biomimetic Peptides.\n\t•\tOther Active Ingredients: Stem Cell Extracts, Cysteine.\n\t•\tDescription: This advanced treatment uses biomimetic peptides and copper peptides to target follicle stem cells, repairing damaged hair and stimulating regrowth.\n\t•\tAvailability: Sold in French pharmacies and online.\n\nConsiderations When Selecting a Product:\n\n\t•\tCopper Peptides (GHK-Cu): Promotes hair growth by stimulating the production of collagen and elastin in the scalp.\n\t•\tPalmitoyl Tetrapeptide-20: Improves scalp health and supports the repair of hair follicles.\n\t•\tThymosin Beta-4: Known for its tissue repair properties, it can accelerate follicle recovery.\n\t•\tBiotinyl-GHK: Boosts follicle health by supporting the scalp’s metabolism.\n\t•\tOligopeptide-54 & Biomimetic Peptides: Known for mimicking natural growth factors to aid in hair regrowth. \"\n",
    "flair_text": "Medications and Treatments",
    "flair_template_id": "32f08944-cf63-11ee-b4a7-eed2830b7e25",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "1fan4yx",
    "title": "Does the ordinary lash serum cause fat loss around the eye?",
    "url": "https://www.reddit.com/r/beauty/comments/1fan4yx/does_the_ordinary_lash_serum_cause_fat_loss/",
    "score": 3,
    "num_comments": 12,
    "created": "2024-09-06T19:04:24+00:00",
    "body": "Hi, I’m wondering if using The Ordinary products could make eyelid exposure or fat loss around my eyes worse. I heard prostaglandin analogues cause this, but there isn’t any this eyelashserum if you could let me know that would be great thank you (: \n\nThese are the ingredients in the ordinary lash serum:\n\nThis formula contains SYMPEPTIDE XLASH® complex (with Myristoyl Pentapeptide-17), Anargy® complex (with Oligopeptide-2 and Glycoproteins), Widelash™ complex (with Biotinoyl Tripeptide-1 and Panthenol), REDENSYL™ complex (with Larix Europaea Wood Extract, Camellia Sinensis Leaf Extract, and Zinc Chloride), CAPIXYL™",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fatpanda9652",
        "body": "Spreads it furiously on thighs*",
        "score": 38,
        "is_top_level": true
      },
      {
        "author": "Girlwhatuevendoingg",
        "body": "It really irritates my eyes too!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Puzzleheaded_Mix7873",
        "body": "No, it doesn’t have prostaglandins.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "vannesswho",
        "body": "Oh my gosh ! I used the ordinary hair serum for my eyelashes & I noticed full grow but very dark circles appear & yellowish eyeball color. Not sure if I should continue doing it though",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "BestBeautyDupes",
    "post_id": "vgvpdl",
    "title": "This Affordable Lash Serum could Replace Others with Prostaglandin Analogues",
    "url": "https://www.reddit.com/r/BestBeautyDupes/comments/vgvpdl/this_affordable_lash_serum_could_replace_others/",
    "score": 5,
    "num_comments": 1,
    "created": "2022-06-20T21:00:44+00:00",
    "body": "The Ordinary Multi-Peptide [Lash and Brow Serum](https://theordinary.com/en-us/multi-peptide-lash-brow-serum-100111.html) could not be launched at a better time. The GrandeLASH-MD serum, a popular lash serum, was under fire on TikTok as multiple users reported this serum caused fat losses on their eyelids, to the extent one user's monolid became a double lid! Further research shows that this is not something new, many lash serums have the culprit ingredient, a synthetic Prostaglandin Analogues that can cause darkening around the eye area, fat losses on eyelids, and even changes in eye colors. And…the ingredient is not approved by the FDA to be used in most of these eyelash serums.\n\nSo just when everyone is searching for a new lash and brow serum, The Ordinary launched a lash serum formulated with multi-peptides, Biotinoyl Tripeptide-1, and plant extracts. The Ordinary created this product because its customers were so much in love with their Multi-Peptide Hair Growth Serum that they applied it to brows and eyelashes and saw amazing results. Then customers were urging The Ordinary to create one to be absolutely safe and easy to be used on lashes and brows. \n\nThe [**Multi-Peptide Lash and Brow Serum**](https://theordinary.com/en-us/multi-peptide-lash-brow-serum-100111.html) ($14.5) was born.\n\nhttps://preview.redd.it/ihadq6akbu691.png?width=1350&format=png&auto=webp&s=cc67b26d3d9a0367fce4fc75855c5519753b6d79\n\nPeptides are the building blocks of proteins. They are often used in anti-aging products as some peptides stimulate cells to produce more collagen. Some support hair fibre. The Ordinary used a combination of peptides to aid hair growth and health.\n\nWe tried it and have to say, although the result is not as quick as the traditional lash serum, which is visible after a couple of days, it does work. After 2–4 weeks we could see obvious thickening of the brows and lashes, minus the side effects, with no irritation or darkening around the eyes. And it only costs around 15 bucks for 0.16oz. To put into perspective, Revital Lash costs $110 for 0.1oz (4 months of daily use)…\n\n&#x200B;\n\nhttps://preview.redd.it/vn1df6blbu691.png?width=1600&format=png&auto=webp&s=7f420f698293de5e13a4aa97323123714c4b0fe9",
    "flair_text": "Skincare Dupe",
    "flair_template_id": "c33d43ea-796a-11eb-b9c2-0e4bf153aa2f",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairlossResearch",
    "post_id": "15fe2gf",
    "title": "Any news about these hair loss / hair growth ingredients ?",
    "url": "https://www.reddit.com/r/HairlossResearch/comments/15fe2gf/any_news_about_these_hair_loss_hair_growth/",
    "score": 6,
    "num_comments": 8,
    "created": "2023-08-01T14:23:57+00:00",
    "body": "Promoted for hair loss, any evidences for ? : \n\nPouteria Sapota seed Oil\n\nNannochloropsis Oceanica Extract, \n\nPisum Sativum Sprout Extract,\n\nAcetyl Tetrapeptide-3, \n\nTrifolium Pratense Flower Extract \n\nBiotinoyl Tripeptide-1\n\nBiochanine-A",
    "flair_text": "Experimental compounds",
    "flair_template_id": "c8bf8be4-3d81-11ec-aa8e-1eec84ecc04a",
    "comments": [
      {
        "author": "Such-Ad6961",
        "body": "Essaye et dis nous mdr",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Thibault2121",
        "body": "tu as trouver ca sur amazon ?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Main_Ad4284",
        "body": "ça se rapproche du sérum aux peptides de The Ordinary",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "qx9snk",
    "title": "Has anyone tried the Curlsmith hair growth treatments?",
    "url": "https://www.reddit.com/r/curlyhair/comments/qx9snk/has_anyone_tried_the_curlsmith_hair_growth/",
    "score": 3,
    "num_comments": 4,
    "created": "2021-11-19T06:06:00+00:00",
    "body": "Firstly, I apologize if this has been discussed, I did try to search for it. \n\nHas anyone tried the Curlsmith hair growth [kit](https://curlsmith.com/products/hair-growth-starter-kit?variant=31125872115806) or any of the treatments?? I am SO tempted, but also unsure, the claims just seem too good to be true. Haha\n\nHow did it go? Did it work? Did you see any noticeable change in your hair?\n\nThe products are:  \n[Scalp Stimulating Booster](https://curlsmith.com/products/scalp-stimulating-booster?variant=13063769423966), to be rubbed into the scalp in the morning.  \n[Full Lengths Density Elixir](https://curlsmith.com/products/full-lengths-density-elixir?variant=13063748583518), to be rubbed into the scalp in the evening.  \n[Ultimate Lengths 30-day Therapy supplement](https://curlsmith.com/collections/stimulate-hair-growth/products/ultimate-lengths-30-day-therapy?variant=39493690687582), two pills to be taken once per day.\n\nAll three say best results after 3 months of use.\n\nHere are their ingredient lists:  \n[Scalp Stimulating Booster](https://curlsmith.com/products/scalp-stimulating-booster?variant=13063769423966) - Water (Aqua), Propanediol, Xanthan Gum, Pisum Sativum (Pea) Sprout Extract, Paullinia Cupana (Guarana) Seed Extract, Zingiber Officinale (Ginger) Root Extract\\*, Scutellaria Baicalensis (Chinese Skullcap) Root Extract, Hylocereus Undatus (Dragon) Fruit Extract, Urtica Dioica (Nettle) Leaf Extract\\*, Triticum Vulgare (Wheat) Germ Extract, Glycine Soja (Soybean) Germ Extract, Arginine, Caprylyl/Capryl Glucoside, Citric Acid, Ethylhexylglycerin, Glyceryl Caprylate, Polyglyceryl-6 Oleate, Sodium Cocoyl Glutamate, Glycerin, Gluconolactone, Calcium Gluconate, Sodium Benzoate, Potassium Sorbate, Sodium Surfactin, Phenoxyethanol, Lactic Acid, Hexyl Cinnamal, Alpha-Isomethyl Ionone, Linalool, Limonene, Fragrance (Parfum).\n\n[Full Lengths Density Elixir](https://curlsmith.com/products/full-lengths-density-elixir?variant=13063748583518) \\-  Water (Aqua), Propanediol, Glycerin, Larix Europaea (Larch Tree) Wood Extract, Glycine Soja (Soybean) Germ Extract, Pisum Sativum (Pea) Sprout Extract, Scutellaria Baicalensis (Chinese Skullcap) Root Extract, Camellia Sinensis (Green Tea) Leaf Extract, Phyllanthus Emblica (Amla) Fruit Extract, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Lavandula Angustifolia (Lavender) Flower Extract\\*, Thymus Vulgaris (Thyme) Leaf Extract\\*, Cedrus Atlantica (Cedarwood) Bark Extract, Peg-40 Hydrogenated Castor Oil, Trifolium Pratense (Clover) Flower Extract, Triticum Vulgare (Wheat) Germ Extract, Sodium Citrate, Citric Acid, Butylene Glycol, Glycine, Arginine, Ppg-26-Buteth-26, Gluconolactone, Dextran, Apigenin, Acetyl Tetrapeptide-3, Oleanolic Acid, Biotinoyl Tripeptide-1, Calcium Gluconate, Sodium Benzoate, Potassium Sorbate, Zinc Chloride, Sodium Metabisulfite, Lactic Acid, Phenoxyethanol. \n\n[Ultimate Lengths 30-day Therapy supplement](https://curlsmith.com/collections/stimulate-hair-growth/products/ultimate-lengths-30-day-therapy?variant=39493690687582) \\- ingredients per 2 capsules.   \n**Biotin** 5000mcg (16667% daily value)   \n**Pantothenic Acid** 20mg (400% daily value)  \n**MSM (Methylsulfonylmethane)** 150mg  \n**Gotu Kola Herb Extract (Centella asiatica)** 120mg  \n**Alpha Lipoic Acid** 50mg  \n**Fo-Ti Root Powder (Polygonum multiflorum)** 50mg  \n**Hydrolyzed Fish Collagen** 50mg  \n**Hydrolyzed Keratin Powder** 50mg  \n**AMLA Fruit Extract (Emblica officinalis)** 50mg  \n**Goji Berry Extract (Lycium barbarum)** 25mg  \n**Bladderwrack Macroalgae Powder (Fucus vesiculosus)** 5mg  \n**Nori Powder (Porphyra umbilicalis)** 5mg  \n**Wakame Seaweed Powder (Alaria esculenta)**\n\n\nThank you for any feedback or thoughts on this!!",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "_finnetic",
        "body": "I haven’t taken the supplement, but I enjoy the morning & evening serum. \n\nI can’t say that they made my hair grow faster / thicker / etc - and I don’t really believe anyone who does. Unless you apply them to half your head, how can anyone really compare the growth while using the products vs when not? All hair goes through growth cycles, even if someone saw amazing results it could have been so many other things in their life (diet, stress level, etc).\n\nAnyway - I like them because they remind me to give myself a scalp massage, and help me extend my washdays. A lot of other scalp oils are too heavy for me, but the nightly serum is so light and always helps reduce any scalp itch for me.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ladymorgahnna",
        "body": "I just started the program.  Edit after 44 days: seeing progress.  Doing all 3 steps. My hair loss is due to stress. Really working on that too.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "18k5r6k",
    "title": "Is this lash serum safe?",
    "url": "https://www.reddit.com/r/beauty/comments/18k5r6k/is_this_lash_serum_safe/",
    "score": 3,
    "num_comments": 9,
    "created": "2023-12-17T01:18:15+00:00",
    "body": "Just bought this lash serum, it's called grow like a boss by essence. I'm wondering if it's safe for use because I've heard some serums have adverse effects. \n\nThe ingredients list:\n\n \n\n* aqua (water)\n* isopentyldiol\n* propanediol\n* glycerin\n* hydroxypropyl methylcellulose\n* ricinus communis (castor) seed oil\n* panthenol\n* nephelium lappaceum seed extract\n* camellia japonica seed oil\n* camellia sinensis seed oil\n* camellia japonica flower extract\n* camellia japonica seed extract\n* sodium polyacrylate starch\n* hydroxyacetophenone\n* schisandra chinensis fruit extract\n* caprylyl glycol\n* 1,2-hexanediol\n* maltodextrin\n* biotinoyl tripeptide-1",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "andsimpleonesthesame",
        "body": "have you tried putting the ingredients in incidecoder.com? You can just copy paste the entire list and the site will give you a breakdown of what all the ingredients do and what the high and low points are, it's pretty good for roughly figuring out if there's anything in there that you don't want :-)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Zetophir",
        "body": "I generally stay away from any lash serum that contains prostaglandins. although that makes them more effective, that’s typically what people tend to be the most sensitive to.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "josiewittmansnark",
    "post_id": "12510i5",
    "title": "Are the serums toxic?",
    "url": "https://www.reddit.com/r/josiewittmansnark/comments/12510i5/are_the_serums_toxic/",
    "score": 4,
    "num_comments": 2,
    "created": "2023-03-28T20:22:08+00:00",
    "body": "Like many of you, I was curious about what is actually in Josie’s serums.\n\nHere are the ingredients listed for the lash growth serum and the Environmental Working Group rating (if available).\n\nIngredients: \n\nAqua - water obvi\n\nHyaluronate - “sodium hyaluronate can help your skin look youthful and supple. It also has benefits for joint and eye health.” Source: healthline \n\nPentylene Glycol: thickening agent EWG score: 1 (low toxicity)\n\nPanax Ginseng Extract: adaptogenic plant used to support hair growth EWG score: 1\n\nSwertia Japonica Extract: Asian botanical to support hair growth EWG score: 1\n\nPumpkin Seed Extract: supports hair growth\n\nAcorus Calamus Root Extract: hair growth EWG score: 1\n\nPanthenol: moisturizer EWG score: 1\n\nSerenoa Serrulata Fruit Extract: also known as saw palmetto EWG score: 1 note: this ingredient is commonly used in hair growth products but can decrease estrogen levels and is not safe for pregnant women. Source: WebMD\n\nBiotinoyl Tripeptide-1: hair growth peptide (EWG score 1, no data)\n\nMyristoyl Pentapeptide-17: hair growth peptide (EWG score 1, no data)\n\nOligopeptide-10: anti-microbial peptide (EWG score 1, no data)\n\nTocopherol: vitamin E EWG score: 1-2\n\nBiotin: hair growth vitamin EWG score: 1",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Ok-Difficulty-4853",
        "body": "That’s a big red flag - Serener Serrulata Fruit Extract ingredient isn’t safe for pregnant women and she said herself that her lash serum is safe to use during pregnancy as it is all natural. So she completely lied to make a buck and put people in danger.",
        "score": 9,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "minoxidil",
    "post_id": "1bh4let",
    "title": "Don't know if I got scammed...",
    "url": "https://www.reddit.com/r/minoxidil/comments/1bh4let/dont_know_if_i_got_scammed/",
    "score": 3,
    "num_comments": 5,
    "created": "2024-03-17T18:26:04+00:00",
    "body": "Hi guys! First off, I want to say that I am NOT from US. I got this \"minoxidil\" spray around 10 days ago. The thing is, I really do not know if this contains any minoxidil or its just a marketing scam. Nowhere on the bottle or the box (I don't have it anymore) says that it contains minoxidil. I am extremely sad because it is a bit pricy since my country is relatively poor. \n\nSo my question is: can anyone confirm me if I really got scammed or not? Bellow is the list of ingridients:\n\nAqua, Alcohol Denat, Butylene Glycol, Ethoxydiglycol, Parfum, Pyrrolidinyl Diaminopyrimidine Oxide Oxothiazolidinecarboxylate, Coceth-7, PPG-1-PEG-9 Lauryl Glycol Ether,Apigenin, Oleanolic Acid, Menthol, PEG-40 Hydrogenated Castor Oil, Biotinoyl Tripeptide-1, PPG-26-Buteth-26, Benzyl Salicylate, Citral, Citronellol, Eugenol, Linalool, Alpha-Isomethyl Ionone.Limonene, purified water",
    "flair_text": "Question",
    "flair_template_id": "5c390364-c7c2-11ea-875f-0ebab350e9ff",
    "comments": [
      {
        "author": "SectionDesperate6998",
        "body": "Hello, it does seem to contain some ingredient that can allegedly help with hair growth but no minoxidil, i am sorry.\nIt’s not even mentionned on the front of the bottle, so it’s even more concerning. I don’t know where you are from but minoxidil is generally widely avaible, try to check  in pharmacies .",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Robb_Greywind",
        "body": "No minoxidil. Try to return it.\n\nAlso try to ask the pharmacist for generic minoxidil brands since the brand name can be quite expensive since it's imported.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi No_Entertainment6792!** I noticed that you posted a question. This is a friendly reminder to read our pinned [FAQ post](https://www.reddit.com/r/minoxidil/comments/hk12ae/minoxidil_faqs/) in which you might find an answer to your question. This will help you find an answer quickly instead of waiting for a member to answer.\n\n**If you found the answer to your question, Reply to this comment with \" #done \" and I'll flair it as answered. This will make it easier for** r/Minoxidil **members and visitors to find answers to their questions.**\n\nThank you and good luck on your journey!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/minoxidil) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Men_RO",
    "post_id": "1bh4xlc",
    "title": "Am luat ce trebuie sau sal?",
    "url": "https://www.reddit.com/r/Men_RO/comments/1bh4xlc/am_luat_ce_trebuie_sau_sal/",
    "score": 4,
    "num_comments": 30,
    "created": "2024-03-17T18:39:16+00:00",
    "body": "Salut băieți! Pentru cei care folosesc minoxidil pentru chelie, recunoaște cineva brand-ul ăsta? Banuiesc că nu are minoxidil deloc în el. Nici pe ambalaj nici pe sticlă nu scrie nimic. Mai jos sunt ingredientele\n\nAqua, Alcohol Denat, Butylene Glycol, Ethoxydiglycol, Parfum, Pyrrolidinyl Diaminopyrimidine Oxide Oxothiazolidinecarboxylate, Coceth-7, PPG-1-PEG-9 Lauryl Glycol Ether,Apigenin, Oleanolic Acid, Menthol, PEG-40 Hydrogenated Castor Oil, Biotinoyl Tripeptide-1, PPG-26-Buteth-26, Benzyl Salicylate, Citral, Citronellol, Eugenol, Linalool, Alpha-Isomethyl Ionone.Limonene, ",
    "flair_text": "Întrebare",
    "flair_template_id": "7d55e52a-11df-11ee-8d53-a6c824a86764",
    "comments": [
      {
        "author": "skinnyman87",
        "body": "![gif](giphy|dBEZxF6TEm99knUCN3)\n\nUite așa.",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "Zealousideal_Bar_916",
        "body": "Nu cred ca contine minox. La mine e scris la ingrediente active, minoxidil + concentratia.\n\nRecomand minoxul de la Kirkland, ce folosesc eu. E cel mai bun pe raport calitate/pret. Eu unul mi le iau de pe emag, in jur de 250 de lei, 6 flacoane.\n\nIn schimb nu recomand sa treci pe minox decat daca esti sigur ca esti in stare sa ti pastrezi obiceiul cam toata viata si ti ai facut research’ul. Eu urasc partea din zi in care trebuie sa ma dau cu minox, but u do what u gotta do 🥲",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Training_Pass_2077",
        "body": "Poti incerca forcapil ca sa nu mai cada rau. 4 luni iei, 6 luni pauza. Vitamine naturale.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "ionpalos",
        "body": "Da bos, am citit ca parul dureaza cat iei tratamentul. Cabd incetezi cu tratamentul dispare si parul.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "quasar_rc",
        "body": "Omule, dacă chelești, nu te mai salvează nimic de la chelie.\n\nDacă ai fața frumoasă, atunci vei arăta bine chel, dacă nu, atunci vei arăta nasol. \n\nRestu’ sunt povești de a-ți lua banii.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "macaroanaman",
        "body": "Toti cei care dati sfaturi sa renunte, bre, let him be.\n\nMinoxidilul ajuta cat timp te dai cu el. Vad pe grupuri de reddit ca majoritatea folosesc combo-ul min+fin (finasterida care ajuta la oprirea caderii parului dar are si niste posibile side effects precum libido scazut sau tensiune crescuta ).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AimlessThunder",
        "body": "Best of luck, dar nu poți opri inevitabilul.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "systematic_chaos23",
        "body": "Ideal ar fi să vă acceptați așa cum sunteți, dar dacă nu se poate nicicum, decât să dați banii pe toate prostiile, mai bine vă faceți implant de păr.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Training_Pass_2077",
        "body": "Sau fugi la turci la implant cu 2500€",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "5txio8",
    "title": "Product compare and opinion? Kermax vs Viviscal",
    "url": "https://www.reddit.com/r/HaircareScience/comments/5txio8/product_compare_and_opinion_kermax_vs_viviscal/",
    "score": 3,
    "num_comments": 0,
    "created": "2017-02-14T02:43:37+00:00",
    "body": "I've been winning the fight on my thinning hair, which is awesome!  \nNot sure which has been the most effective; minoxidil, spiro, or my kermax conditioner. \n\nWas refilling my kermax today, and saw a competing product for about $10 less... and 100ml more!  \n\nThey look like they're of similar composition, but I really don't know a lick about what each ingredient does.  \n\nViviscal:\nhttp://www.viviscal.ca/media/wysiwyg/US_2014/Products/Viviscal-Densifying-Conditioner-For-Women-Ingredients-Web.png\n\n\nKermax:\nhttp://kermax.com/en/volumizing-conditioner\n\n    Ingredients: Aqua, Cetearyl Alcohol, Cetyl Esters Wax, Behentrimonium Chloride, Butylene Glycol, Amodimethicone, Octyldodecanol, Phenoxyethanol, Panthenol, Hydroxethylcellulose, Sodium Benzoate, Irvingia Gabonensis Kernel Butter, Parfum, Chlorphenesin, Cetyl Alcohol, Hydrogenated Coco-glycerides, Trideceth-12, Tocopheryl Acetate, Cetrimonium Chloride, Sodium Hydroxide, Disodium Edta, Ppg-26-buteth-26, Peg-40 Hydrogenated Castor Oil, Pisum Sativum (pea) Sprout Extract, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Psoriasis",
    "post_id": "1hjshwg",
    "title": "Has anyone tried the Ordinary Multi peptide hair serum for scalp psoriasis? ",
    "url": "https://www.reddit.com/r/Psoriasis/comments/1hjshwg/has_anyone_tried_the_ordinary_multi_peptide_hair/",
    "score": 4,
    "num_comments": 6,
    "created": "2024-12-22T05:56:06+00:00",
    "body": "I have tried various hair oils (didn’t help at all) and topical steroids (helped but I’m worried about side effects of long term use) without much success. I recently just decided to put the Ordinary hair serum on my itchy spots just because I have it on hand, and what do I lose anyway I just wanted some relief. And like magic, my scalp stopped itching! IMMEDIATELY. \n\nI have no idea how this thing helped or if I’m just imagining it now. Is this true? Is it possible? Has anyone tried the same thing?\n\nThe ingredients of the serum is as followed:\n\nAqua (water), Propanediol, Butylene Glycol, Glycerin, Caffeine, Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Larix Europaea Wood Extract, Pisum Sativum Extract, Scutellaria Baicalensis Root Extract, Triticum Vulgare Germ Extract, Glycine Soja Germ Extract, Trifolium Pratense Flower Extract, Camellia Sinensis Leaf Extract, Apigenin, Oleanolic Acid, Arginine, Glycine, Calcium Gluconate, Zinc Chloride, Lactic Acid, Gluconolactone, Dextran, Maltodextrin, Hydroxyethylcellulose, Xanthan Gum, Pentylene Glycol, Dimethyl Isosorbide, Polysorbate 20, PPG-26-buteth-26, PEG-40 Hydrogenated Castor Oil, Trisodium Ethylenediamine Disuccinate, Sodium Metabisulfite, Sodium Benzoate, Phenoxyethanol, Chlorphenesin.",
    "flair_text": "general",
    "flair_template_id": "5af788c4-31d9-11ea-bfbc-0e6b01e460fd",
    "comments": [
      {
        "author": "bellafulloftrix12",
        "body": "Interesting! While I can’t answer your question (sorry OP) I was wondering how long you’ve been using it? I’m always on the lookout for products that help with scalp psoriasis, and especially since it’s winter, my psoriasis is much worse atm.. thanks in advance!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hello! It looks like you're asking about scalp psoriasis**. We have [a guide to scalp psoriasis](/r/Psoriasis/wiki/scalp) in the sub's wiki that could be relevant to your question. (If not, just ignore this comment.)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Psoriasis) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "# Welcome to the Psoriasis sub!\n\nIf you haven't posted here before, please read this comment as it contains important information:\n\n* Please  [read and respect the rules](https://www.reddit.com/r/Psoriasis/about/rules/). In particular, **do not ask for about identifying undiagnosed medical conditions** , as skin diseases [cannot be diagnosed](https://www.reddit.com/r/Psoriasis/wiki/faq-diagnosis-rule) by random people on Reddit.\n* Photos that include skin rashes must be marked NSFW. If including private areas, _please indicate with flair_.\n* Posts that break the rules will be removed.\n\n## Check out our wiki!\n\nThe [Psoriasis wiki](https://www.reddit.com/r/Psoriasis/wiki/index) is a collection of guides and other pages about how to treat psoriasis, including a Frequently Asked Questions section. Many common questions about medications, shampoos, diet, tattoos, etc. are addressed there.\n\nThanks!\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Psoriasis) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "redmom68",
        "body": "I would be interested to know if it worked for you. \n\n\nI am not using The Ordinary's Multiple Peptide Serum for Hair Density but I've used its Natural Moisturizing Factors + HA Scalp Serum for the itchy areas on my scalp before I realized I had psoriasis (I thought it was just dry scalp). I found that it too provided relief. I stopped using it due to what I read in the guides in this subreddit---I decided to try coal tar shampoo to get rid of the scaling first, and then try the Natural Moisturizing serum to keep my scalp moisturized. The coal tar shampoo has worked wonders. The scaling disappeared and so did the itch after the first time using the shampoo. I've used it 3 times in the past 10 days. Today was a hair wash day but I didn't use the coal tar shampoo. I used one with oat milk and aloe vera. Since I have dry hair, I used a heavy conditioner (I don't apply conditioner to my head so I don't get any on my scalp). Before I blow dried my hair, I applied the hair serum to my scalp and massage it in. I am hoping the serum will keep me itch free. \n\n\nIf you could provide an update if the serum you're using continues to work, that would be great.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Strange_Chemistry_34",
        "body": "So interesting that you mention peptides.  On a whim I started using my face cream from One Skin (peptides) on my scalp -- I apply 2xday to the two persistant patches I've had for years -- and I'm actually amazed at how well it's working! It's early days but the silvery/red/flakey patches are greatly diminished.\n\nI'm hopeful because nothing I've tried, like MTC oil, glycolic/salicylic acids, squalane, etc. has helped at all. The silvery flakey patches return almost immediately.\n\nMaybe certain pepetides are the answer!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "# Welcome to the Psoriasis sub!\n\nIf you haven't posted here before, please read this comment as it contains important information:\n\n* Please  [read and respect the rules](https://www.reddit.com/r/Psoriasis/about/rules/). In particular, **do not ask for about identifying undiagnosed medical conditions** , as skin diseases [cannot be diagnosed](https://www.reddit.com/r/Psoriasis/wiki/faq-diagnosis-rule) by random people on Reddit.\n* Photos that include skin rashes must be marked NSFW. If including private areas, _please indicate with flair_.\n* Posts that break the rules will be removed.\n\n## Check out our wiki!\n\nThe [Psoriasis wiki](https://www.reddit.com/r/Psoriasis/wiki/index) is a collection of guides and other pages about how to treat psoriasis, including a Frequently Asked Questions section. Many common questions about medications, shampoos, diet, tattoos, etc. are addressed there.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Psoriasis) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FemaleHairLoss",
    "post_id": "1epjrtr",
    "title": "Is biotinoyl tripeptide-1 effective?",
    "url": "https://www.reddit.com/r/FemaleHairLoss/comments/1epjrtr/is_biotinoyl_tripeptide1_effective/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-08-11T12:36:24+00:00",
    "body": "",
    "flair_text": "Support/Advice",
    "flair_template_id": "25f05418-7787-11eb-b1e6-0ece931eab07",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Please set your hair loss diagnosis as your user flair. This will help folks respond to your post appropriately. You can follow this [guide](https://www.reddithelp.com/hc/en-us/articles/205242695-How-do-I-get-user-flair-) how to do it via user flair setting. More information is also available on this [thread](https://www.reddit.com/r/FemaleHairLoss/comments/x7qqlt/reminderrequest_to_please_set_a_user_flare/).\n\n\nIs your diagnosis missing? Please contact the mods to get it added to the user flair list!\n\n\nPlease note there may be a bug editing user flair via Reddit mobile app as changes cannot be saved. Easiest is via desktop browser.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FemaleHairLoss) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Foreign_Wasabi_4530",
        "body": "I would also like to know 🥹",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "lashextensions",
    "post_id": "122gz2m",
    "title": "Question as a lash receiver",
    "url": "https://www.reddit.com/r/lashextensions/comments/122gz2m/question_as_a_lash_receiver/",
    "score": 2,
    "num_comments": 3,
    "created": "2023-03-26T09:27:07+00:00",
    "body": "I’m absolutely bend over backwards on my knees OBSESSED with the ordinary multi peptide lash and brow growth serum but not sure if I should push my next appt back a bit to give it time to “fully come off my lashes” in case it affects retention? Would any of these ingredients affect lashing\nAqua (Water), Glycerin, Butylene Glycol, Myristoyl Pentapeptide-17, Biotinoyl Tripeptide-1, Oligopeptide-2, Acetyl Tetrapeptide-3, Caffeine, Panthenol, Arginine, Glycine, Glycoproteins, Larix Europaea Wood Extract, Trifolium Pratense Flower Extract, Camellia Sinensis Leaf Extract, Dextran, Maltodextrin, Zinc Chloride, Hydroxyethylcellulose, Xanthan Gum, Trisodium Ethylenediamine Disuccinate, Polysorbate 20, Sodium Metabisulfite, Caprylyl Glycol, 1,2-Hexanediol, Sodium Benzoate, Benzoic Acid, Ethylhexylglycerin, Phenoxyethanol, Chlorphenesin.\nTia ladies 🥰",
    "flair_text": "client",
    "flair_template_id": "c69a94aa-e6d6-11eb-8670-0e3df5511fa7",
    "comments": [
      {
        "author": "kelplash",
        "body": "My clients haven't had the best retention when using products with glycerin or glycols. Tends to break down the adhesive pretty quickly.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "sophiestru23",
        "body": "I use the ordinary serum even when i have lashes on (not a lot tho) this is just a personal experience but i haven’t had any issues with retention or anything. i’ve used it the night before a fill, then just washed my lashes before i went in. i feel like if anything it made my lashes stronger lol",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "lashlovee",
        "body": "The ingredients in The Ordinary Multi-Peptide Lash and Brow Growth Serum should not affect lash retention. However, it's always a good idea to let your lash artist know if you're using any lash growth serums or other products on your lashes before your appointment. This will allow them to adjust their application technique or recommend a different type of lash extension that may work better with the product you're using.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "1fidbxf",
    "title": "Is there anyone who tried this product?",
    "url": "https://www.reddit.com/r/tressless/comments/1fidbxf/is_there_anyone_who_tried_this_product/",
    "score": 2,
    "num_comments": 4,
    "created": "2024-09-16T19:20:30+00:00",
    "body": "Bought this a couple of days ago alongside a derma stamp. Used it only twice so far, so obviuosly no results to report. It smells of alcohol and is drying really fast on the scalp. Here is the full list of the ingredients: Minoxidil 10% (Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1), Finasteride 1%, Phenoxyethanol, Ethylhexylglycerin.\n\nhttps://preview.redd.it/ak2jvx0q18pd1.jpg?width=600&format=pjpg&auto=webp&s=0e878f16a890073a3fb93671d88c15af02175772\n\n",
    "flair_text": "Product",
    "flair_template_id": "406d510a-4ba1-11ea-8492-0e4320351cb3",
    "comments": [
      {
        "author": "Less-Amount-1616",
        "body": "I could be hallucinating, isn't 10% topical minoxidil no more effective than 5% with added sides of irritation?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "It looks like this post is about general **products**.\n\nBefore asking any questions,\n\n1. Learn about [different hair loss products](https://tressless.com/learn).\n\n2. [Search for products](https://tressless.com/products)\n\nIf this post is not about hair loss products, please downvote and report.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MetsandFin",
        "body": "Too strong. Proper dosage is 5%. this is just going to give you more sides.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "No-Village9980",
        "body": "gud stuff , use asap 💯💯",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FemaleHairLoss",
    "post_id": "17qpksh",
    "title": "Anyone use Nulastin for hair?",
    "url": "https://www.reddit.com/r/FemaleHairLoss/comments/17qpksh/anyone_use_nulastin_for_hair/",
    "score": 2,
    "num_comments": 5,
    "created": "2023-11-08T16:35:52+00:00",
    "body": "I started using this about three weeks ago so the jury is out. I don’t really trust the positive reviews but I figured I’d try for myself. I really don’t want to start minoxidil so I figured I’d try this. \n\n\n\nIngredients:\nWater (Aqua), Glycerin, Panthenol, Biotinoyl Tripeptide-1, Myristoyl Pentapeptide-17, Lactic Acid (Vegan), sh-Polypeptide-50 (Elastin), Keratin, Ceramide NP (Ceramide 3), Carbomer, Maltodextrin, Rubus Fruticosus (Blackberry) Leaf Extract, Citric Acid, Sodium Phosphate, Sodium Chloride, Potassium Sorbate, Mannitol, Sodium Carbonate, Benzoic Acid, Phosphatidylcholine, Sodium Benzoate, Decyl Glucoside, Hydrolyzed Sodium Hyaluronate, Xanthan Gum, Sodium Hyaluronate, (+)-Cloprostenol Isopropyl Ester, Cetyl Alcohol, Sodium Hydroxide, Phenoxyethanol",
    "flair_text": "Discussion",
    "flair_template_id": "f612dd74-4ce9-11ea-b260-0e548fbd6989",
    "comments": [
      {
        "author": "JanieBee83",
        "body": "u/Figpoop any updates? Have been thinking about it for a while and just purchased the two pack for my husband, who has used Rogaine without noticeable results. Just wondering what to expect in reality.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "musubimelts",
        "body": "Any updates? Came here to ask about this because I've been getting lots of ads for it!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "hq600n",
    "title": "Can I use this as a co-wash? Been CGM for years, and first time posting on this board.",
    "url": "https://www.reddit.com/r/NoPoo/comments/hq600n/can_i_use_this_as_a_cowash_been_cgm_for_years_and/",
    "score": 2,
    "num_comments": 6,
    "created": "2020-07-13T01:11:52+00:00",
    "body": "Hello! These are the ingredients in a product I'd love to use as a co-wash. I am slowly learning more about ingredients specifically but have seen some folks talk about whether or not something will work as a co-wash. My scalp, sadly, hates coconut so I've been having a hard time figuring out my curly girl method routine.\n\n&#x200B;\n\n>WATER (AQUA), CETEARYL ALCOHOL, PROPANEDIOL, HYDROXYPROPYL STARCH PHOSPHATE, MENTHYL LACTATE, CETYL ESTERS, BEHENTRIMONIUM CHLORIDE, CAMELLIA SINENSIS (GREEN TEA) LEAF EXTRACT, HAMAMELIS VIRGINIANA (WITCH HAZEL) LEAF EXTRACT, LAVANDULA ANGUSTIFOLIA (LAVENDER) FLOWER EXTRACT\\*, THYMUS VULGARIS (THYME) LEAF EXTRACT\\*, BUTYROSPERMUM PARKII (SHEA BUTTER), MELALEUCA ALTERNIFOLIA (TEA TREE) LEAF OIL, MENTHA PIPERITA (PEPPERMINT) OIL, CEDRUS ATLANTICA (CEDARWOOD) BARK EXTRACT, PHYLLANTHUS EMBLICA (AMLA) FRUIT EXTRACT, SODIUM HYALURONATE, BIOTINOYL TRIPEPTIDE-1, APIGENIN, OLEANOLIC ACID, GLYCERIN, PANTHENOL, GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, DISODIUM EDTA, CITRIC ACID, BUTYLENE GLYCOL, PPG-26-BUTETH-26, ETHYLHEXYLGLYCERIN, PEG-40 HYDROGENATED CASTOR OIL, SODIUM BENZOATE, POTASSIUM SORBATE, SODIUM HYDROXIDE, PHENOXYETHANOL, LIMONENE, LINALOOL, FRAGRANCE (PARFUM).\n\nThanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "shonaich",
        "body": "r/curlyhair has a bot you can paste that into and see if it passes!  They also have an extensive product list that you might find useful :)",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "NonoVirus",
        "body": "It is silicone free but it does have plastics in it. \n\nThose *can* cause build up. Or if you care for the fact that that is going on your skin and down the drain",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "17yykr8",
    "title": "Question regarding Sodium Laureath and shampoo alternatives (I already read the Quick Guide)",
    "url": "https://www.reddit.com/r/NoPoo/comments/17yykr8/question_regarding_sodium_laureath_and_shampoo/",
    "score": 2,
    "num_comments": 4,
    "created": "2023-11-19T14:39:11+00:00",
    "body": "Dear Community,\n\nI have a question regarding wether my current shampoo contains SLS or SLA.\n\nAs I understood it is important to wash your hair with a shampoo that contains SLS or SLA to remove parabens and plastic before starting the nopoo journey.\n\nNow my shampoo contains **Sodium Methyl 2-Sulfolaurate** is this the same as SLS or SLA?\n\nGenerally, is the shampoo suitable for the last wash before nopoo or should I wash with something else?  \nHere is the whole INCI List:\n\nWater (Aqua) (Eau), Sodium Methyl 2-Sulfolaurate, Sodium Cocoyl Isethionate, Cocamidopropyl Hydroxysultaine, Disodium 2-Sulfolaurate, Cocamidopropyl Betaine, PEG-2 Cocamide, PEG-150 Distearate, Panthenol, Zingiber Officinale (Ginger) Root Extract, Urtica Dioica (Nettle) Extract, Oleanolic Acid, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Euterpe Oleracea Fruit Extract, Bambusa Vulgaris Leaf/Stem Extract, Oryza Sativa (Rice) Bran Oil, Silk Amino Acids, Rice Amino Acids, Keratin Amino Acids, Aloe Barbadensis Leaf Juice, Creatine, Apigenin, Biotinoyl Tripeptide-1, Lactic Acid, Zinc Picolinate, Glycerin, Isopropyl Alcohol, Butylene Glycol, Propanediol, Butyloctanol, Dicetyldimonium Chloride, Silicone Quaternium-16, PPG-26-Buteth-26, Glycol Distearate, Guar Hydroxypropyltrimonium Chloride, Undeceth-11, PEG-120 Methyl Glucose Trioleate, Steareth-4, PEG-40 Hydrogenated Castor Oil, Undeceth-5, Polyquaternium-7, Polyquaternium-10, Disodium EDTA, Phenoxyethanol, Ethylhexylglycerin, Benzoic Acid, Potassium Sorbate, Sodium Benzoate, Lactobacillus Ferment, Leuconostoc/Radish Root Ferment Filtrate, Iodopropynyl Butylcarbamate, Citric Acid, Fragrance (Parfum), Benzyl Benzoate, Benzyl Salicylate, Hydroxycitronellal\n\nSome people use \"natural shampoo alternatives\" like apple vinegar or sodium bicarbonate (baking soda) to wash their hair. If you do this, is this then still considered nopoo with all its beneficial effects?\n\nI struggle with thin hair that get oily really quick (after 1-2 days) after washing. \n\nWhat is the best natural shampoo alternative to use 1-2 times a week?\n\nThank you already for helping out!!! \n\n&#x200B;",
    "flair_text": "Troubleshooting (HELP!)",
    "flair_template_id": "427aea9e-bea4-11eb-abf5-0ed12a1a3c6b",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Welcome! If you're new, get started here: [Natural Haircare Quick Start Guide](https://www.reddit.com/r/NoPoo/wiki/index/quickstart) \n\nPlease answer the following questions to help us help you. \n\nDo you have hard water? If you don't know what it is, there's an [article in the wiki](https://www.reddit.com/r/NoPoo/wiki/index/hardwater) that discusses it. \n\nWhat is the porosity of your hair? If you don't know, there's a quiz linked in the sidebar. \n\nHow long have you been doing nopoo? \n\nNo-poo can mean many different things. Describe in detail how you wash your hair. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoPoo) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "shonaich",
        "body": "It is not suitable. This is a low poo with gentle surfactants that will not reliably remove silicone and other coatings.\n\nYou might check your liquid dish detergent. While I absolutely do NOT recommend it for regular use, they can often be suitable for the SINGLE clarifying wash needed to get started.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTransplants",
    "post_id": "1gz26un",
    "title": "Hair Serums",
    "url": "https://www.reddit.com/r/HairTransplants/comments/1gz26un/hair_serums/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-11-24T21:34:20+00:00",
    "body": "Someone I know recommended to use this hair serum. Is this any good? Following is the list of ingredients.\n\nINGREDIENTS: Aqua, Panthenol, Glycenn, Polysorbate-20, Propylene Glycol, Serenoa Serrulata Fruit Extract, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Biotin, Equisetum Arvense Extract, Niacin, Calcium Pantothenate, Humulus Lupulus Extract, Arctium Lappa Root Extract, Lawsonia Inermis Extract, Panicum Miliaceum Seed Extract, Betula Alba Leaf Extract, Urtica Dioica Leaf Extract, Chamomilla Recutita Flower Extract, Salvia Officinalis Leaf Extract, Echinacea Purpurea Extract, Calendula Officinalis Flower Extract, Centella Asiatica Extract, Melissa Officinalis Leaf Extract, Hamamelis Virginiana Leaf Extract, Tilia Cordata Flower Extract, Beta-Glucan, Maltodextrin, Benzoic Acid, Dehydroacetic Acid, Pisum Sativum Seed Extract, Phenoxyethanot, Sodium Benzoate, Malus Domestica Fruit Cell Cutture Extract, Lecithin, Xanthan Gum, Opuntia Ficus-Indica Stem Extract, Sodium PCA, Sodium Lactate, Arginine, Aspartic Acid, PCA, Glycine, Alanine, Serine, Valine, Proline, Threonine, Isoleucine, Histidine, Phenylalanine, Hyaluronic Acid, Tocopheryl Acetate, Sodium DNA, Potassium Chloride, Potassium Glutathione Isomerized Linoleate, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Tocopherol, Alcohol, Vitis Vinifera Seed Extract, Parfum, Ethylhexylglycerin",
    "flair_text": "Medication",
    "flair_template_id": "656e2dd8-c946-11ec-8cbe-d23e70b738b5",
    "comments": [
      {
        "author": "hairburner4",
        "body": "That's just snake oil. Don't waste your money",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SingaporeHairAndScalp",
    "post_id": "1i6m452",
    "title": "The Ultimate Battle Plan to Defy Aging Hair (And Win)",
    "url": "https://www.reddit.com/r/SingaporeHairAndScalp/comments/1i6m452/the_ultimate_battle_plan_to_defy_aging_hair_and/",
    "score": 2,
    "num_comments": 1,
    "created": "2025-01-21T16:11:36+00:00",
    "body": "**The Ultimate Battle Plan to Defy Aging Hair (And Win)**  \n*Your Hair Doesn’t Have to Look Older Than You Feel. Here’s How to Fix It.*\n\nYou’ve earned every gray hair. But thinning strands, brittle texture, and a scalp that feels like the Sahara? **That’s not wisdom—it’s war.**\n\nLet’s cut through the noise. Aging hair isn’t inevitable. New science proves you can *reverse* damage, *rebuild* density, and *reclaim* the thick, glossy hair you thought was gone forever.\n\nHere’s the battle-tested playbook—*no fluff, no myths, just results*.\n\n# Problem #1: Your Hair Thins Faster Than Your Patience\n\nThinning hair isn’t just about genetics. It’s a sabotage mission: shrinking follicles, hormonal shifts, and a scalp starving for nutrients.\n\n**The Fix:**\n\n* **Nuke DHT (The Silent Killer)** DHT—a testosterone byproduct—strangles follicles, shortening their growth phase. Block it with pumpkin seed extract, clinically shown to inhibit 5-alpha reductase, the enzyme that fuels DHT production.\n* **Peptide Power** Peptides like *Copper Tripeptide-1* and *Biotinoyl Tripeptide-1* penetrate follicles, stimulating collagen, keratin, and blood flow. Think of them as “hair fertilizer” for thicker, stronger strands.\n* **PRP Therapy** Platelet-rich plasma (PRP) injections flood your scalp with growth factors, waking up dormant follicles. Advanced versions like *Magick PRP* boost efficacy by 96%, turning miniaturized hairs back into lions.\n\n# Problem #2: Your Scalp is a Desert (And Your Hair is Dying of Thirst)\n\nDry, flaky scalp? It’s not just dandruff. Aging reduces sebum production, leaving follicles parched and prone to inflammation.\n\n**The Fix:**\n\n* **Ceramide Bombs** Swap harsh shampoos for ceramide-infused formulas. These lipids rebuild your scalp’s moisture barrier, locking in hydration and shielding against pollution.\n* **HydraFacial Keravive** This clinical-grade treatment detoxifies your scalp, exfoliates dead skin, and floods follicles with peptides and hyaluronic acid. Results? A scalp that feels 20 years younger.\n* **Scalp Serums** Nightly serums with caffeine and niacinamide boost microcirculation, delivering oxygen and nutrients straight to follicle roots.\n\n# Problem #3: Your Hair Breaks Like Cheap Plastic\n\nYears of heat styling, coloring, and UV damage leave hair brittle. Aging strips keratin, turning strands into fragile twigs.\n\n**The Fix:**\n\n* **Vegan Keratin Shampoos** Vegan keratin binds to damaged areas, repairing cracks in the hair shaft. Pair with silk peptide conditioners to add a bulletproof shield against breakage.\n* **Exosome Therapy** The next-gen alternative to PRP, exosomes deliver regenerative signals to follicles, reversing structural damage and accelerating growth.\n* **Heat Protection** Never style without a thermal guard. Look for dimethicone-free options that won’t weigh hair down.\n\n# Problem #4: Your Hair Cycle is Stuck in Reverse\n\nAging shortens the *anagen* (growth) phase and traps follicles in *telogen* (resting). Result? Less hair, slower regrowth.\n\n**The Fix:**\n\n* **Prolong Anagen with Retinol** Scalp retinol unclogs follicles, speeds cell turnover, and extends growth cycles. Pair with lactic acid to enhance absorption.\n* **Microneedling** 0.5mm needles create micro-injuries, triggering collagen production and pushing follicles back into growth mode.\n* **Nutrient Overload** Biotin, zinc, and iron deficiencies starve follicles. Supplement with hair-specific blends or eat *more*: spinach, eggs, salmon.\n\n# Problem #5: You’re Losing the Mental Game\n\nStress isn’t just in your head—it’s on your pillow. Cortisol spikes push follicles into shedding mode, accelerating aging.\n\n**The Fix:**\n\n* **Adaptogens** Ashwagandha and rhodiola lower cortisol, protecting follicles from stress-induced fallout.\n* **Mindful Massage** Daily scalp massage with a jade comb boosts blood flow by 22%, turning tension into thicker hair.\n* **Sleep > Serum** Poor sleep hikes DHT. Prioritize 7-8 hours nightly—your follicles repair themselves during deep REM cycles.\n\n**Final Rally Cry**  \nAging hair isn’t a life sentence. It’s a problem with a *proven solution*.\n\nYou’re not just fighting symptoms—you’re rebuilding from the ground up.\n\nStart today:\n\n1. **Assault DHT** with pumpkin seed extract.\n2. **Bombard follicles** with peptides and PRP.\n3. **Fortify strands** with vegan keratin.\n4. **Dominate stress** with adaptogens.\n\nYour hair doesn’t retire at 50. Neither should you.\n\n*Want more? Dive into our free guide on reversing hair aging—or book a consultation with a trichologist. Time’s ticking.*\n\n*Tags: aging hair solutions, reverse hair thinning, peptide therapy for hair, PRP treatment, DHT blockers, scalp health 2025*",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chocolateboy06",
        "body": "Omg love all the info",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_SnooChipmunks9390",
    "post_id": "nll3ir",
    "title": "Make your eyes the best beauty with Revamin lash",
    "url": "https://www.reddit.com/r/u_SnooChipmunks9390/comments/nll3ir/make_your_eyes_the_best_beauty_with_revamin_lash/",
    "score": 2,
    "num_comments": 0,
    "created": "2021-05-26T16:27:52+00:00",
    "body": " \n\n## REVAMIN LASH, WHAT IS IT?\n\nRevamin Lash is an eyelid serum made of natural ingredients of the highest quality to ensure maximum efficiency and safety.\n\n### What works [Revamin Lash](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)?\n\nThe eyelashes are made by regular application of the product:\n\nMore and thicker and longer The product contains zinc and caffeine, which help to stimulate the growth of the bulbs. Strengthened Biotin and panthenol have a positive effect on hair structure, enhancing, strengthening, and thickening the hair. \n\nEnhanced and nurtured The application of the product will enhance and nourish weak hair that every day is subject to external factors. Glycerin is the cause of this\n\n### Hydrated deeply\n\nYour skin and hair should be kept hydrated. Due to the area, it contains the natural moisture of the product.\n\n&#x200B;\n\nhttps://preview.redd.it/s3tgcwo2rh171.jpg?width=252&format=pjpg&auto=webp&s=6e3be1a22e5ea8beb1117fe39ca29885036fa052\n\n[ORDER YOUR PRODUCT NOW](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)\n\n&#x200B;\n\nhttps://preview.redd.it/cwzpudo7rh171.jpg?width=818&format=pjpg&auto=webp&s=6f90e473a1ab516ca065f0a7325f88b80e97e6af\n\n## HOW CAN I USE LASH REVAMIN?\n\n1- Wash your make-up off Revamin Use\n\n2- Use along with the eyelid Revamin Use\n\n3- In the morning and at night apply.\n\n&#x200B;\n\nhttps://preview.redd.it/0p5igbl8rh171.jpg?width=319&format=pjpg&auto=webp&s=539a87701e7eb4138c50b9a732c4c1ce38571ba9\n\n[ORDER YOUR PRODUCT NOW](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)\n\n## WHAT'S REVAMIN LASH'S SECRET?\n\nProof of the ingredient and effective TRIPEPTIDE BIOTINOYL - 1\n\nRepeatedly tested and known for its beneficial effect on eyelashes' longitude and density as well as their prevention.\n\nIn-vitro studies demonstrate that the tripeptide molecule promotes keratinocyte proliferation from the bulb, i.e. hair cell propagation. Moreover, it helps to anchor the hair optimally by stimulating the synthesis and organization of the alpha 5 laminin and collagen IV adhesion molecules.\n\nHowever, a clinical study of 30 people showed that the [eyelashes ](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)were 17% longer and 19 percent thicker after 30 days thanks to the use of the Biotinoyl Tripeptide-1 product\n\n**Ingredients of Revamin Lash:**\n\nIt is certainly distinct from other products by the rich composition of the [Revamin Lash eyelash](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w) serum. The combination of so many active ingredients allows eyelashes to grow naturally and become conditioned.\n\n**Benefits from Arginine Proven:**\n\n·         Reduce Failure\n\n·         The fat barrier strengths\n\n·         Skin and hair moisturizes\n\n**Proven advantages of panthenol:**\n\n·         Enhance your hair smoothness\n\n·         Restoration of your hair\n\n·         Hydrates heavily.\n\n**Benefits of Glycerin Proven:**\n\n·         Recovers the cloves\n\n·         condition the cloves deeply\n\n·         Protest the harmful consequences of external factors\n\n**Proven benefits of sodium hyaluronate:**\n\n·         Enhance laminated condition\n\n·         Hydrates the cloves\n\n·         Reinforce bulbs\n\n**The benefits of Urea Proven  :**\n\n·         Hydrates naturally\n\n·         Act like a gentle keratolytic agent\n\n·         Enhances skin barrier protecting functions\n\n&#x200B;\n\nhttps://preview.redd.it/ty8dmmp9rh171.jpg?width=674&format=pjpg&auto=webp&s=32a003a79e4560c73f1d241fb12a1aaf248b04f9\n\n**\\*- Is it safe for** [**Revamin Lash**](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)**?**\n\nThe product is exclusively made of natural ingredients that are completely safe and tested for your health.\n\n**\\*- How long does the use of Revamin Lash take to see?**\n\nAfter 21 days after starting use, the first effects will be visible. It is recommended that Revamin Lash be used for up to 3 months.\n\n**\\*- How long shall I wait for the delivery of my package?**\n\nWithin 24 hours after placing an order, we ship the products. After a maximum of 2 business days, Revamin Lash will reach you.\n\n**\\*- Is shipping available internationally?**\n\nYes, yes. Yes. In 5-7 days of placing the order, international shipping orders will reach you. \n\n[ORDER YOUR PRODUCT NOW](https://www.google.com/url?q=https%3A%2F%2Fbit.ly%2F3woSbr6&sa=D&sntz=1&usg=AFQjCNEYfeITQ5cTsGbY-T5tOVp5F0mE6w)\n\n### Pick Your Coupon for you shopping online - CLICK THE BUTTON BELOW \n\n[PICK YOUR COUPON](https://www.google.com/url?q=https%3A%2F%2Fpickyourcoupon.com%2F&sa=D&sntz=1&usg=AFQjCNEZMs1OL_V_oR-lHumxvnElG5oOdA)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "fcjnyy",
    "title": "Help! Is it CG approved??",
    "url": "https://www.reddit.com/r/curlyhair/comments/fcjnyy/help_is_it_cg_approved/",
    "score": 2,
    "num_comments": 5,
    "created": "2020-03-02T21:48:54+00:00",
    "body": "I found a bunch of Not your Mother's products on sale at Bed Bath and Beyond today (score!). I got the Not your mother's way to grow leave in conditioner and I'm questioning if it's curly girl friendly. I checked isitcg.com but I want to make sure. I just started the CG method a couple weeks ago, and I don't want to mess up! Here's the ingredients. Thanks for any help!\n\nWater/Aqua, Butylene Glycol, Cetearyl Alcohol, Cetyl Triethylmonium Dimethicone PEG-8 Succinate, Fragrance/Parfum, Quaternium-91, Propylene Glycol Diazolidinyl Urea, Myristyl Myristate, Hydrolyzed Keratin, PPG 26-Buteth-26, Behentrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Iodopropynyl Butylcarbamate, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Citric Acid",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "PauseAndThinkAboutIt",
        "body": "It's CG approved, but barely.  It does contain ingredients that can build up and cause problems.  That particular Dimethicone is just barely water soluble, and you may have to clarify every now and then, but it should be fine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Jessachelle",
        "body": "I read somewhere that water soluble silicones are preceded by PPG, PEG, etc. But I dont know where I saw/read it so you might want to look into those.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_DAVIDBANX",
    "post_id": "n8bdbi",
    "title": "The Best Eyelash Serum : Revamin Lash",
    "url": "https://www.reddit.com/r/u_DAVIDBANX/comments/n8bdbi/the_best_eyelash_serum_revamin_lash/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-09T10:20:06+00:00",
    "body": "Have you ever wondered why your eyelashes are so thin and sparse? The following are the key reasons that damage your eyelashes:\n\n&#x200B;\n\nAdverse weather conditions\n\nHeavy make-up\n\nGluing artificial eyelashes\n\nRubbing your eyes\n\nImproper facial hygiene\n\nThe end result may be a lot of shedding and a noticeable fading of your lashes.\n\n&#x200B;\n\nKeep in mind that your eyelashes should be treated with the same respect as the rest of the body. Moisturizing and nourishing them on a regular basis can result in an appearance of beautiful, thick lashes.\n\n&#x200B;\n\nThis is due to the high-quality ingredients in the Revamin Lash cream, which were formulated to produce the full benefit of eyelash lengthening and thickening.\n\n&#x200B;\n\n[Revamin](https://nplink.net/azouipoy)Lash is a modern eyelash cream for those who wish to enhance the condition of their lashes. The product was made with organic, tried-and-true natural ingredients. The solution thickens and lengthens lashes while both stimulating their development and preventing them from falling out.\n\n&#x200B;\n\n[Revamin](https://nplink.net/azouipoy)Lash nourishes the lashes and the skin around the eyes, promoting eyelash formation. The effect of long and thick eyelashes can be obtained with the application of Revamin Lash serum on a regular basis. Since it is healthy for the eyes and does not irritate the skin of the eyelids, it is a popular choice. \n\n&#x200B;\n\nAfter just three weeks of use, the first effects become visible.\n\n&#x200B;\n\nBenefits of Using Eyelash Serum\n\n&#x200B;\n\nAccelerate eyelash growth\n\nStrengthen the hair structure\n\nVisibly thicken and lengthen the lashes\n\nMoisturize and improve their appearance\n\nWho is Revamin Lash for?\n\n&#x200B;\n\n[Revamin](https://nplink.net/azouipoy)Lash serum was created for women who want their lashes to be naturally long and thick every day.\n\n&#x200B;\n\nHow Does Eyelash Serum Works?\n\n&#x200B;\n\n[Revamin](https://nplink.net/azouipoy)Lash is an eyelash treatment made from only the finest quality natural ingredients to ensure optimum effectiveness and purity.\n\n&#x200B;\n\n&#x200B;\n\nHow to use Revamin Lash Serum?\n\n&#x200B;\n\n&#x200B;\n\n[Order Here](https://nplink.net/azouipoy)\n\nWhy to Choose Revamin Lash Serum?\n\n&#x200B;\n\nTested and effective ingredient BIOTINOYL TRIPEPTIDE – 1\n\n&#x200B;\n\nIt has been repeatedly studied and recognised for its positive impact on the duration and density of eyelashes, as well as its ability to keep them from falling out.\n\n&#x200B;\n\nIn vitro experiments show that the tripedptide molecule promotes the proliferation of bulb keratinocytes, i.e. hair cell proliferation. Furthermore, it aids in the optimum anchoring of hair by promoting the synthesis and organizing of alpha 5 laminin and collagen IV adhesion molecules.\n\n&#x200B;\n\nAfter 30 days, a clinical trial of 30 participants revealed that eyelashes were 17 percent longer and 19 percent thicker due to the use of a substance containing Biotinoyl Tripeptide-1.\n\n&#x200B;\n\nAfter Effects\n\n&#x200B;\n\n&#x200B;\n\n[Visit Official Website to Buy](https://nplink.net/azouipoy)\n\n&#x200B;\n\nRevamin Lash Ingredients\n\n&#x200B;\n\nThe rich composition of the Revamin Lash eyelash serum definitely distinguishes it from other products. The combination of so many active ingredients allows for the natural growth and conditioning of the eyelashes.\n\n&#x200B;\n\n[\\>>> Biotin](https://nplink.net/azouipoy)\n\n&#x200B;\n\nStrengthens Lashes\n\nImproves the structure of lashes\n\nVisibly thickens the lash\n\n\\>>> Caffeine\n\n&#x200B;\n\nHelps hair growth\n\nAntioxidant properties\n\nReduces visible shadows under the eyes\n\n[\\>>> Zinc PCA](https://nplink.net/azouipoy)\n\n&#x200B;\n\nBeneficial effect on the hair structure\n\nStrengthens lashes\n\nAccelerate eyelash growth\n\n\\>>> Arginine\n\n&#x200B;\n\nMoisturizes the skin and hair\n\nReduces irritation\n\nStrengthens lipid barrier\n\n\\>>> Panthenol\n\n&#x200B;\n\nImproves the smoothness\n\nIntensely moisturizes\n\nRestores the hair structure\n\n[\\>>> Glycerine](https://nplink.net/azouipoy)\n\n&#x200B;\n\nRegenerates the lashes\n\nProtects against the harmful effects of external factors\n\nDeeply conditions the lashes\n\n\\>>> Sodium Hyaluronate\n\n&#x200B;\n\nImproves the condition of lashes\n\nMoisturizes the lashes\n\nStrengthens the bulbs\n\n\\>>> Urea\n\n&#x200B;\n\nImproves the protective functions of the skin barrier\n\nNaturally moisturizes\n\nActs as a mild keralytic agent\n\n[Is Revamin Safe?](https://nplink.net/azouipoy)\n\n&#x200B;\n\nThe product is made entirely of natural ingredients that have been thoroughly tested and shown to be completely healthy for your body, with no known side effects.\n\n&#x200B;\n\nHow long it takes to see the effects?\n\n&#x200B;\n\nAfter 21 days of use, the first results will become noticeable.[Revamin](https://nplink.net/azouipoy) Lash can be used for three months to get the best results.\n\n&#x200B;\n\nCan I wear make up while using Revamin Lash?\n\n&#x200B;\n\nYes, you can use make up.\n\n[Click here](https://nplink.net/azouipoy)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "1ff50br",
    "title": "Does my lash serum contain prostaglandins/prostaglandin analogs?",
    "url": "https://www.reddit.com/r/beauty/comments/1ff50br/does_my_lash_serum_contain/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-09-12T15:14:42+00:00",
    "body": "I’ve just found out about the adverse effects of prostaglandin analogs in lash serums after years of using them 🙃 I’m very much disappointed but not surprised how uncommon it is that you find the beauty community and brands discussing these possibly harmful ingredients. I’ve tried to do research about my own serums, but I know nearly nothing about chemical cosmetic terminology so I’ve come here for help.\nHere are 2 ingredient lists of lash serums I’ve been using: \n\nNo. 1: Aqua, Propanediol, Glycerin, Propylene Glycol, Xanthan Gum, Cellulose Gum, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Phenoxyethanol, Disodium EDTA, Biotinoyl Tripeptide-1, Panthenol, Sodium Hydroxide, Ethylhexylglycerin.\n\nNo. 2: Aqua, Propanediol, Propylene Glycol, PEG-20 Castor Oil, Glycerin, Alcohol denat., PEG-60 Hydrogenated Castor Oil, Zea Mays Oil, Calcium Pantothenate, Inositol, Retinol, Rosa Moschata Seed Oil, Biotin, Tocopheryl Acetate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Coco-Glucoside, Hydroxyethy/cellulose, Xanthan Gum, Phenoxyethanol, Ethylhexy/Iglycerin, Panthenol, Hydrolyzed Silk, Sodium Hydroxide, Disodium EDTA.",
    "flair_text": "Seeking Advice",
    "flair_template_id": "b1df0422-fe6f-11ec-86f6-7e886122dc37",
    "comments": [
      {
        "author": "blancawiththebooty",
        "body": "Based on what I've learned about the naming of the prostaglandin analogs, I don't see any in either ingredient list.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Minoxbeards",
    "post_id": "drfn3u",
    "title": "Would this product work along side minoxidil or on its own,. Item description :- Water (Aqua), Butylene Glycol, Polysorbate 20, Citric Acid, PPG-26-Buteth-26, Menthol, Rosmaris Officinalis (Rosemary) Leaf Oil, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Sodium B",
    "url": "https://www.reddit.com/r/Minoxbeards/comments/drfn3u/would_this_product_work_along_side_minoxidil_or/",
    "score": 1,
    "num_comments": 3,
    "created": "2019-11-04T10:10:49+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "mills217",
        "body": "Rosemary is a vasodilator like Minoxidil but its not as effective. Basically they do the same thing but Minoxidil does a better job.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "JavaScriptParser",
        "body": "Make sure there are no DHT blockers in the product",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "5g6d4p",
    "title": "I was wondering what do you think of the Art Naturals Organic Argan Oil Hair Loss Shampoo?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/5g6d4p/i_was_wondering_what_do_you_think_of_the_art/",
    "score": 1,
    "num_comments": 1,
    "created": "2016-12-02T22:54:06+00:00",
    "body": "https://www.amazon.ca/gp/product/B016XB280Y/ref=ox_sc_act_title_1?smid=A2F36HIMG5OH69&psc=1\n\nI am male 23, noticed that my hairline is reclining. I take biotin, probiotics, and vitamin D.  \n\nThe Ingredients of this shampoo is. \n\nULTRA PURIFIED H2O INFUSED WITH PROPRIETARY BOTANICAL & HERBAL COMPLEX INCLUDING IVY, BUR- DOCK, FENUGREEK, ROSEMARY, NETTLE, THYME, ALTHAEA OFFICINALIS (MARSHMALLOW) ROOT EXT- RACT (BOTANICAL ORIGIN), BETULA ALBA (BIRCH) LEAF EXTRACT (BOTANICAL ORIGIN), EQUISETUM ARVENSE (HORSETAIL) EXTRACT (BOTANICAL ORIGIN), JUGLANS REGIA SEED EXTRACT (WALNUT, BOTANICAL ORIGIN), RIBES NIGRUM SEED OIL (BLACK CURRANT, BOTANICAL ORIGIN), ALOE VERA (ALOE BARBADENSIS), HOPS (HUM- ULUS LUPULUS ) EXTRACT, SAGE, SEA BUCKTHORN (HIPPOPHAE RHAMNOIDES), Orange Blossum Essen- tial Oil, Atlas Cedarwood Essential Oil, EUTERPE OLERACEA (ACAI) FRUIT EXTRACT, BURDOCK ROOT EXTRACT, NEEM (MELIA AZADIRACHTA LEAF EXTRACT) BOTANICAL EXTRACT, WILD CHERRY BARK EXTRACT, CAPSICUM ANNUUM FRUIT EXTRACT, White Willow Bark Extract, SODIUM (C14-16) OLEFIN SULFONATE, COCAMIDOPROPYL BETAINE, COCAMIDOPROPYLAMINE OXIDE, COCO-GLUCOSIDE, GLYCOL DISTEARATE, LACTA- MIDOPROPYL TRIMONIUM CHLORIDE, GLYCERIN, PPG-5-CETETH-10 PHOSPHATE, PEG-7 GLYCERYL COCOA, PEG-12 DIMETHICONE CAFFEINE, ZINC PCA, NIACIN- AMIDE, SILK AMINO ACIDS, HYDROLYZED WHOLE WHEAT PROTEIN (AND) HYDROLYZED STARCH, HYDRO- LYZED WHOLE OAT, HYDROLYZED QUINOA PROTEIN, TRIDECETH-5, GLYCERIN, TRIDECETH-10, PPG-26- BUTHET- 26, PEG-40 HYDROGENATED CASTOR OIL, APIGENIN, Argania Spinoza Kernal Oil (Aragan Oil), OLE- ANOLIC ACID, BIOTINOYL TRIPEPTIDE-1, TOCOPHERYL ACETATE (VITAMIN E), SAW PALMETTO, BUTYLENE GLYCOL, PHENOXYETHANOL\n\nAre any of the chemicals good? Apparently, the reviews from amazon says it worked really against hair loss. But I can't help but feel that the reviews are fake.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_customsynthesis2",
    "post_id": "yvl37q",
    "title": "peptides custom synthesis",
    "url": "https://www.reddit.com/r/u_customsynthesis2/comments/yvl37q/peptides_custom_synthesis/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-11-15T03:07:01+00:00",
    "body": "(+Pro5)-Alarelin\t\n\nAngiotensin 1 Human\t70937-97-2/484-42-4\n\nDes-Trp-Eptifibatide\t\n\nDes-Pro-Eptifibatide\t\n\nDi-Trp-Eptifibatide\t\n\nDi-Pro-Eptifibatide\t\n\nPE 22-28\t\n\nN-acetyl semax amidate\t\n\n\\[D-His1\\]-Sermaglutide；\\[D-His1\\]-索玛鲁肽\t\n\n\\[β-Asp9\\]-Sermaglutide；\\[β-Asp9\\]-索玛鲁肽\t\n\n\\[10-31\\]-Sermaglutide；\\[10-31\\]-索玛鲁肽\n\n\\[Glu17\\]-Sermaglutide\t\n\n侧链-\\[D-Glu\\]-Sermaglutide\t\n\nDimer Atosiban\t\n\nAc-Pepstatin\t28575-34-0\n\nBiotin-Liraglutide\t\n\nParathyroid Hormone (1-34), human, biotinylated\t\n\nCys-Teriparatide\t\n\nVosoritide acetate\t1480724-61-5\n\nAngiotensin III (huMan, Mouse)\t13602-53-4\n\nAsp5-Argipressin\t\n\nDi-Gly-Argipressin\t\n\nAsp-Clipped Eptifibatide\t\n\nGRF (1-44) (HUMAN)\t83930-13-6\n\nThymopentin; Thymopentin acetate\t\"69558-55-0/\n\n177966-81-3\"\n\nN-acetyl selank amidate\t\n\nAcetyl-α-MSH (11-13)\t57899-96-4\n\nAc-Epithalone\t\n\n\\[Ser4(tBu)\\]-Cetrorelix\t\n\nsGnRH-A\t96497-82-4\n\nFertirelin\t38234-21-8\n\nZiconotide-Biotin\t\n\nTeriparatide Impurity 1 (Teri-Met 8&18 (O))\t\n\nTeriparatide Impurity 2 (Teri-Met 8(O))\t\n\nTeriparatide Impurity 3 (Teri-Met 18(O))\t\n\nApraglutide\t1295353-98-8\n\n\\[1-9\\]-索玛鲁肽；\\[1-9\\]-Sermaglutide\t\n\n\\[1-2\\]-索玛鲁肽；\\[1-2\\]-Sermaglutide\t\n\n\\[3-31\\]-Sermaglutide\t\n\n\\[Trp25O\\]-Sermaglutide;\\[Trp25O\\]-索玛鲁肽\t\n\n\\[Asp9\\]–比伐芦定,\\[Asp9\\]–Bivalirudin\t\n\n\\[β-Asp9\\]-比伐芦定;\\[β-Asp9\\]–Bivalirudin\t\n\n\\[D-Phe12\\]-比伐芦定\\[D-Phe12\\]–Bivalirudin\t\n\nrhPTH (1–30)\t\n\n\\[O-Ac-Tyr5\\] -曲普瑞林；\\[O-Ac-Tyr5\\]-Triptorelin\t\n\n曲普瑞林游离酸杂质A；Gly-Triptorelin\t\n\nα-Melanocyte Stimulating Hormone, acetylated-\\[D-Val13\\] (11-13) (MSHa)；Acetyl-(D-Val13)-alpha-MSH (11-13)\t137359-89-8\n\nD-His2 Leuprolide\t112642-11-2\n\nDes-Thr-ol  Octreotide\t\n\n\\[Des-Thr-O\\]8-Des-D-Trp\\]-Octreotide\t\n\n\\[AC-D-Phe1,D-Cys7\\]-Octreotide\t\n\nSemaglutide main chain\t\n\nGly double addition eptifibatide\t\n\nd-Asp eptifibatide\t\n\nd-Pro eptifibatide\t\n\nReduced eptifibatide\t\n\nAc-Ser-DAsp-DLys-Pro-NH2\t\n\nAc-Ala-Gly-Glu-Ser-NH2\t\n\nTrisulfide bridge Octreotide Impurtiy; 杂质E (2-7)三硫 键奥曲肽\t1546983-27-0\n\nOctreotide Impurtiy A;奥曲肽杂质A\t\n\nOctreotide Impurtiy F;奥曲肽杂质F\t\n\nOctreotide Impurtiy B;奥曲肽杂质B\t\n\nOctreotide Impurtiy G;奥曲肽杂质G\t\n\nDpro Acetyl-α-MSH (11-13)\t\n\nOxytocin Trisulfide\t\n\nbeta-Oxytocin Dimer\t20054-93-7\n\nAtosiban impurity 16\t\n\nOxytocin impurity 18\t10551-48-1\n\nDTrp(CH2OH) Octreotide\t\n\nO-Acetyl-Ser4 Leuprolide\t1926163-25-8\n\nD-Ser4 Leuprolide；EP A\t62621-13-0\n\nLeuprorelin EP Impurity C\t54785-87-4\n\nLeuprorelin (Leuprolide) EP Impurity E\t1926163-23-6\n\nalpha-Oxytocin Dimer\t19645-28-4\n\n开环缩宫素杂质\t\n\nDesmopressin EP Impurity C\t\n\nDesmopressin EP Impurity A\t\n\nOctreotide Impurity 13\t1546983-33-8\n\nCys-Liraglutide\t\n\ndes-22-tyrosin-Calcitonin（salmon)\t\n\nCalcitonin（salmon) EP Impurity D\t\n\nGlu4-Oxytocin\t4314-67-4\n\nPasireotide dimer，帕瑞肽低聚体杂质\t\n\nAsp5-缩宫素；Asp5-Oxytocin\t65907-78-0\n\nTeriparatide succinimide\t\n\nTB4 caped\t\n\nThymogen Capped\t\n\nVilon Capped\t\n\nFITC-Teriparatide\t\n\nAcetyl hexapeptide-3\t616204-22-9\n\nPalmitoyl Tripeptide-5\t623172-56-5\n\nTripeptide-1/Copper peptide\t130120-57-9/89030-95-5\n\nBiotinoyl tripeptide-1\t299157-54-3\n\nPalmitoyl tripeptide-1\t147732-56-7\n\nNonapeptide-1\t158563-45-2\n\nDecapeptide-12\t137665-91-9\n\nHexapeptide-3\t\n\nMyristoyl Pentapeptide-17\t959610-30-1\n\nDipeptide-2\t24587-37-9\n\nPalmitoyl Tetrapeptide-7/3\t221227-05-0\n\nAcetyl Tetrapeptide-5\t820959-17-9\n\nPalmitoyl pentapeptide-4/Palmitoyl pentapeptide-3\t214047-00-4\n\nAcetyl tetrapeptide-15\t928007-64-1\n\nPentapeptide-18，Leuphasyl\t64963-01-5\n\nmu-conotoxin/936616-33-0\n\nAcetyl Hexapeptide-38\t1400634-44-7\n\nCarnosine\t305-84-0\n\nDipeptide diaminobutyroyl benzylamide diacetate\t823202-99-9\n\nTetrapeptide-30\t1036207-61-0\n\nPalmitoyl hexapeptide-12，Palmitoyl Oligopeptide，Oligopeptide-34\t171263-26-6\n\nAcetyl tetrapeptide-3，capixyl\t827306-88-7\n\nMelittin\t20449-79-0\n\nHexapeptide-9\t1228371-11-6\n\nGHK\t72957-37-0\n\nSnap-8 ；Acetyl Octapeptide-3\t868844-74-0\n\nMatrixyl?3000\t\n\nAHK Tripeptide-3\t\n\nMyristoyl Hexapeptide-23\t\n\nAc-Tyr-Arg-cetylester\t196604-48-5\n\nN-Acetyl Carnosine\t56353-15-2\n\nOctapeptide-2\t\n\nMelanostatin DM\t123689-72-5\n\nPalmitoyl Dipeptide-7；palestrina\t911813-90-6\n\nAcetyl Tetrapeptide-11\t928006-88-6\n\nMyristoyl Hexapeptide-16\t959610-54-9\n\ngamaGlu-Cys-Gly；L-Glutathione reduced\t70-18-8\n\nEyeliss\t\n\nMelitane(AcetylHexapeptide-1)\t448944-47-6\n\nMyristoyl tripeptide-31\t\n\nPTD-DBM Acetate\t\n\nOligopeptide-3\t\n\nPalmitoyl Tripeptide-38\t1447824-23-8\n\nPentapeptide-3；五肽-3\t135679-88-8\n\nEGF\t62253-63-8\n\nSH-Oligopeptide-5\t\n\nGarlic peptide\t\n\nTripeptide-32\t\n\nHexapeptide-10\t146439-94-3\n\nTTD-1  \t918629-48-8\n\nPalmitoyl Dipeptide-5 Diaminohydroxybutyrate;Dipeptide 6/ Waglerin 1  \t794590-34-4\n\nAcetyl Tetrapeptide-9 \t928006-50-2\n\nMyristoyl Hexapeptide-4；Sympeptide 230\t959610-44-7\n\nTetrapeptide-21\t960608-17-7\n\nPalmitoyl Tripeptide-8\t936544-53-5\n\nAcetyl Tetrapeptide-22\t\n\nTripeptide-29\t2239-67-0\n\nMyristoyl Octapeptide-1\t\n\nAcetyl Decapeptide-3\t935288-50-9\n\nOligopeptide-10\t466691-40-7\n\nTetrapeptide-4\t\n\nAcetyl Tetrapeptide-40\t\n\nPalmitoyl tetrapeptide-10\t887140-79-6\n\nAcetyl Tetrapeptide-2；Uplevity\t757942-88-4\n\nOligopeptide-24\t\n\nOligopeptide-2\t\n\nPeptamide-6；Hexapeptide-11\t161258-30-6/100684-36-4\t\n\n\"Pentadecanedioicacid\n\n十五烷二酸\"\t1460-18-0\n\n十六烷二酸，Hexadecanedioic Acid\t505-54-4\n\n十七烷二酸HeptadecanedioicAcid\t2424-90-0\n\n十八烷二酸Octadecanedioicacid\t871-70-5\n\n十九烷二酸Nonadecanedioicacid\t6250-70-0\n\n二十烷二酸EicosanedioicAcid\t2424-92-2\n\n二十一烷二酸henicosanedioic acid\t505-55-5\n\n二十二烷二酸Behenicacid\t505-56-6\n\n十四烷二酸单叔丁酯 14-(tert-Butoxy)-14-oxotetradecanoic acid\t234082-00-9\n\n十五烷二酸单叔丁酯Pentadecanedioic acid mono-tert-butyl ester\t905302-42-3\n\n十六烷二酸单叔丁酯Hexadecanedioic acid mono(1,1-dimethylethyl) ester\t843666-27-3\n\n十七烷二酸单叔丁酯17-(TERT-BUTOXY)-17-OXOHEPTADECANOICACID\t905302-44-5\n\n十八烷二酸单叔丁酯18-(tert-Butoxy)-18-oxooctadecanoicacid\t843666-40-0\n\n二十烷二酸单叔丁酯Eicosandioicacid,1-(1,1-dimethyl)ester\t683239-16-9\n\n3,5-二氯苯甲醛3,5-Dichlorobenzaldehyde\t10203-08-4\n\n3,5-二氯苯甲醇3,5-Dichlorobenzyl alcohol\t60211-57-6\n\n四氢噻喃-4-酮Tetrahydrothiopyran-4-one\t1072-72-6\n\n十九烷二酸单叔丁酯Nonadecanedioicacidmono-t-butylester\t1643852-37-2\n\n2-甲氧基丙酸甲酯METHYL2-METHOXYPROPIONATE\t17639-76-8\n\n十六烷二酸单甲酯 Hexadecanedioic acid, 1-methyl ester\t18451-85-9\n\nMyrcludex B atto565 \t\n\n2-(2-(2-aminoethoxy)ethoxy)aceticacid\t134978-97-5\n\n(2S)-3-\\[4-({\\[(2,2-Dichloroethenyl)oxy\\]sulfonyl}oxy)phenyl\\]-Fmoc-2-aminopropanoicacid\t1151854-06-6\n\nAEEA-AEEA\t1143516-05-5\n\nPEG2-PEG2-(γ-Glu-tBu)-17-carboxyheptadecanoyl-tBu\t1118767-16-0\n\nsodium,8-\\[(2-hydroxybenzoyl)amino\\]octanoate8-(2-羟基苯甲酰胺基)辛酸钠\t203787-91-1\n\nSumo蛋白酶UIP\t\n\nDodecanedioicAcid十二烷基二酸\t693-23-2\n\n9-(tert-Butoxy)-9-oxononanoic acid  \t1290540-34-9\n\n6-Aminocaproic acid 6-氨基己酸\t60-32-2 \n\n二十六烷二酸 Hexacosanedioic Acid\t3365-67-1 \n\nFmoc-L-Ser(β-D-GlcNAc(Ac)3)-OH\t160067-63-0\n\nFmoc-L-Thr(β-D-GlcNAc(Ac)3)-OH\t160168-40-1\n\n5-amino-1-methylquinolin-1-ium iodide\t42464-96-0/685079-15-6\n\nFmoc-Adam-OH \t875211-10-2\n\nFmoc-DCit(Ac)-OH\t\n\n22-(tert-Butoxy)-22-oxodocosanoic acid\t1642333-05-8\n\nMyrcludex B atto647\t\n\nFmoc-Nle-OH\t77284-32-3\n\nFmoc-D-Ile-OH\t143688-83-9\n\nbenzyl 1-(9H-fluoren-9-yl)-3,6-dioxo-2,9-dioxa-4,7-diazaunde\t1599440-07-9\n\n3-amino-1-adamantanecarboxylic acid hydrochloride\t6240-01-3\n\nFmoc-Glu(OtBu)-Thr{psi(Me,Me)pro}-OH\t957780-56-2\n\nWeinreb linker\t247021-90-5\n\n4-(2-Hydroxyethyl)-1-piperazineacetic acid\t124335-65-5\n\nFmoc-L-3,3-Diphenylalanine\t201484-50-6\n\n十二烷基二酸单叔丁酯   tert-Butyl Hydrogen Dodecanedioate\t234081-98-2\n\n十三烷二酸单叔丁酯\t\n\nTridecanedioic acid\t505-52-2\n\nTetradecanedioic acid\t821-38-5\n\nPam2Cys-Ser-Ser-PEG12-Gly-NH2\t\n\n18-methoxy-18-oxooctadecanoic acid\t72849-35-5\n\nAc-RLLLAR-pNA；Ac-Arg-Leu-Leu-Leu-Ala-Arg-PNA\t\n\nKASVM-R8-LTISYL-S5-VR（stapled on R8&S5）；Lys-Ala-Ser-Val-Met-R8-Leu-Thr-Ile-Ser-Tyr-Leu-S5-Val-Arg（stapled on R8&S5）",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hairloss",
    "post_id": "1ha5bp8",
    "title": "Are these products fine to use together and would they give results?",
    "url": "https://www.reddit.com/r/Hairloss/comments/1ha5bp8/are_these_products_fine_to_use_together_and_would/",
    "score": 1,
    "num_comments": 2,
    "created": "2024-12-09T08:31:59+00:00",
    "body": "(I would've provided images but I wasn't able to upload them apparently) for reference both have yellow packaging\n\nGrowth bomb growth and volume booster serum:\nWater (Aqua), Propanediol, Carrageenan, Ginkgo Biloba Leaf Extract, Callitris Glaucophylla Leaf Extract, Ilex Paraguariensis (Yerba Maté) Leaf Extract, Biotinoyl Tripeptide-1, Musa Paradisiaca Fruit Extract, Aloe Barbadensis Leaf Juice Powder, Glycerin, Alcohol, Xanthan Gum, Citric Acid, Sodium Citrate, Benzyl Alcohol, Dehydroacetic Acid, Sodium Benzoate, Potassium Sorbate.\n\nMinoxidil extra strength - 3 month treatment:\nPropylene glycol, ethanol, water, Minoxidil \n\n",
    "flair_text": "Topical Solutions",
    "flair_template_id": "de675c62-4c09-11ea-820d-0ea8a3274a3d",
    "comments": [
      {
        "author": "Federal-Formal3538",
        "body": "If you have aga then you need finasteride/ dutasteride. Minoxidil is a good secondry treatment. The other product won't do anything for hair growth",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_mostafadesha2000",
    "post_id": "n7eya8",
    "title": "Genuine Review Of Revamin Lash Eyelash Serum",
    "url": "https://www.reddit.com/r/u_mostafadesha2000/comments/n7eya8/genuine_review_of_revamin_lash_eyelash_serum/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-08T02:12:02+00:00",
    "body": " \n\n# What is [Revamin Lash](https://nplink.net/u5is5fcz)?\n\n*Revamin Lash is an eyelash serum, which was created from the highest quality natural ingredients, so as to ensure maximum efficiency and safety of use.*\n\n*How* [*Revamin Lash*](https://nplink.net/u5is5fcz) *works:*\n\n*Regular application of the product makes the eyelashes:*\n\n[Longer and thicker](https://nplink.net/u5is5fcz)\n\n*Zinc and caffeine contained in the product stimulate the bulbs, which contributes to faster eyelash growth.*\n\n[Thickened](https://nplink.net/u5is5fcz)\n\n*Biotin and panthenol have a positive effect on hair structure, making the hair nourished, stronger and thicker.*\n\n[Nourished and strengthene](https://nplink.net/u5is5fcz)*d*\n\n*The use of the product will strengthen and nourish weak hair, which is exposed to external factors every day. This is due to the glycerine contained in the product, which nourishes the hair, and sodium hyaluronate, which makes the hair more resistant.*\n\n[Deeply moisturised](https://nplink.net/u5is5fcz)\n\n*It is very important to keep your skin and hair hydrated. The natural moisture in the product may be due to the urea it contains.*\n\n&#x200B;\n\nhttps://preview.redd.it/fd969as11tx61.jpg?width=444&format=pjpg&auto=webp&s=ffdad28673b6edfc8eca89ec8fcf951f356b95d8\n\n \n\n# How do I use [Revamin Lash?](https://nplink.net/u5is5fcz)\n\n# 1-Wash off your make-up\n\n# Use revamin\n\n# 2-Apply along the eyelash line\n\n# Use revamin\n\n# 3-Apply in the morning and in the evening\n\n&#x200B;\n\nhttps://preview.redd.it/7war7l6i1tx61.jpg?width=319&format=pjpg&auto=webp&s=42daea089915d4237b265d4d9e1a4d67030bb418\n\n#  \n\n# [What is the secret of Revamin Lash?](https://nplink.net/u5is5fcz)\n\n*Tested and effective ingredient BIOTINOYL TRIPEPTIDE - 1*\n\n*Repeatedly tested and known for its beneficial effect on the length and density of eyelashes, as well as for its prevention of their falling out.*\n\n*Conducted in vitro studies prove that the tripedptide molecule supports the proliferation of keratinocytes of the bulb, i.e. the propagation of hair cells. What is more, it helps to optimally anchor the hair by stimulating the synthesis and organization of the adhesion molecules of alpha 5 laminin and collagen IV.*\n\n*However, a clinical trial with 30 volunteers showed that thanks the use of a product containing Biotinoyl Tripeptide-1, the eyelashes were 17% longer and 19% thicker after 30 days.*\n\n# [Revamin Lash](https://nplink.net/u5is5fcz)Ingredients:\n\n*The rich composition of the Revamin Lash eyelash serum definitely distinguishes it from other products. The combination of so many active ingredients allows for the natural growth and conditioning of the eyelashes.*\n\n# [Arginine Proven Benefits :](https://nplink.net/u5is5fcz)\n\n*·         Reduce Irritation*\n\n*·         Strengths’ the lipid barrier*\n\n*·         Moisturzes the skin and hair*\n\n# [Panthenol Proven Benefits:](https://nplink.net/u5is5fcz)\n\n*·         Improve the smoothness of your hair*\n\n*·         Restore the hair structures*\n\n*·         Intensely moisturzes*\n\n# [Glycerine  Proven Benefits :](https://nplink.net/u5is5fcz)\n\n*·         Regenerates the lashes*\n\n*·         deeply condition the lashes*\n\n*·         Protest against the harmful  effects  of external  factors*\n\n# [Sodium  hyaluronate Proven Benefits :](https://nplink.net/u5is5fcz)\n\n*·         Improve the condition of lashes*\n\n*·         moisturizes  the lashes*\n\n*·         strengthen the bulbs*\n\n# [Urea Proven Benefits  :](https://nplink.net/u5is5fcz)\n\n*·         Naturally moisturizes*\n\n*·         Act as a mild keralytic agent*\n\n*·         Improves the protective functions of the skin barrier*\n\n# Is [Revamin Lash](https://nplink.net/u5is5fcz)safe?\n\n*The product consists exclusively of natural ingredients, which are tested and fully safe for your health, so they do not cause any side effects.*\n\n*How long will it take before I see the effects of using Revamin Lash?*\n\n*The first effects will be visible after 21 days from the start of use. To achieve the maximum the use of* [Revamin Lash](https://nplink.net/u5is5fcz)*for a period of 3 months is recommended.*\n\n# [How long will I have to wait for my package to be delivered?](https://nplink.net/u5is5fcz)\n\n*We ship the products within 24 hours of placing an order.*[Revamin Lash](https://nplink.net/u5is5fcz) *will reach you after a maximum of 2 business days.*\n\n*Is international shipping also available?* \n\n*Yes. International shipping orders will reach you within 5-7 days after placing the order.*\n\n&#x200B;\n\n&#x200B;\n\n# [click her to go to the  official website](https://nplink.net/u5is5fcz)\n\n#",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_mina_zakaria",
    "post_id": "n8dznr",
    "title": "Genuine Review Of Revamin Lash Eyelash Serum",
    "url": "https://www.reddit.com/r/u_mina_zakaria/comments/n8dznr/genuine_review_of_revamin_lash_eyelash_serum/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-09T13:12:53+00:00",
    "body": " \n\n*What is* [*Revamin Lash*](https://nplink.net/b1nm39ha)*?*\n\n*Revamin Lash is a eyelash serum, which was created from the highest quality natural ingredients, so as to ensure maximum efficiency and safety of use.*\n\n*How* [*Revamin Lash*](https://nplink.net/b1nm39ha) *works:*\n\n*Regular application of the product makes the eyelashes:*\n\n*Longer and thicker*\n\n*Zinc and caffeine contained in the product stimulate the bulbs, which contributes to faster eyelash growth.*\n\n*Thickened*\n\n*Biotin and panthenol have a positive effect on hair structure, making the hair nourished, stronger and thicker.*\n\n*Nourished and strengthened*\n\n*The use of the product will strengthen and nourish weak hair, which is exposed to external factors every day. This is due to the glycerine contained in the product, which nourishes the hair, and sodium hyaluronate, which makes the hair more resistant.*\n\n*Deeply moisturised*\n\n*It is very important to keep your skin and hair hydrated. The natural moisture in the product may be due to the urea it contains.*\n\n&#x200B;\n\nhttps://preview.redd.it/6dm2oeczg3y61.jpg?width=444&format=pjpg&auto=webp&s=75c3915868f95fad16965bd564e0a9ceb5ee2609\n\n*How do I use* [*Revamin Lash?*](https://nplink.net/b1nm39ha)\n\n*Wash off your make-up*\n\n*Use revamin*\n\n*2*\n\n*Apply along the eyelash line*\n\n*Use revamin*\n\n*3*\n\n*Apply in the morning and in the evening*\n\n*What is the secret of* [*Revamin Lash*](https://nplink.net/b1nm39ha)*?*\n\nhttps://preview.redd.it/uyn0p7c0h3y61.jpg?width=319&format=pjpg&auto=webp&s=f58dbc7606a509bbc7afe4ae19ff80ef299342ba\n\n*Tested and effective ingredient BIOTINOYL TRIPEPTIDE - 1*\n\n*Repeatedly tested and known for its beneficial effect on the length and density of eyelashes, as well as for its prevention of their falling out.*\n\n*Conducted in vitro studies prove that the tripedptide molecule supports the proliferation of keratinocytes of the bulb, i.e. the propagation of hair cells. What is more, it helps to optimally anchor the hair by stimulating the synthesis and organization of the adhesion molecules of alpha 5 laminin and collagen IV.*\n\n*However, a clinical trial with 30 volunteers showed that thanks the use of a product containing Biotinoyl Tripeptide-1, the eyelashes were 17% longer and 19% thicker after 30 days.*\n\n[Revamin Lash](https://nplink.net/b1nm39ha)*Ingredients:*\n\n*The rich composition of the Revamin Lash eyelash serum definitely distinguishes it from other products. The combination of so many active ingredients allows for the natural growth and conditioning of the eyelashes.*\n\n*Arginine Proven Benefits :*\n\n*·         Reduce Irritation*\n\n*·         Strengths’ the lipid barrier*\n\n*·         Moisturzes the skin and hair*\n\n*Panthenol Proven Benefits:*\n\n*·         Improve the smoothness of your hair*\n\n*·         Restore the hair structures*\n\n*·         Intensely moisturzes*\n\n*Glycerine  Proven Benefits :*\n\n*·         Regenerates the lashes*\n\n*·         deeply condition the lashes*\n\n*·         Protest against the harmful  effects  of external  factors*\n\n*Sodium  hyaluronate Proven Benefits :*\n\n*·         Improve the condition of lashes*\n\n*·         moisturizes  the lashes*\n\n*·         strengthen the bulbs*\n\n*Urea Proven Benefits  :*\n\n*·         Naturally moisturizes*\n\n*·         Act as a mild keralytic agent*\n\n*·         Improves the protective functions of the skin barrier*\n\n*Is* [Revamin Lash](https://nplink.net/b1nm39ha)*safe?*\n\n*The product consists exclusively of natural ingredients, which are tested and fully safe for your health, so they do not cause any side effects.*\n\n*How long will it take before I see the effects of using Revamin Lash?*\n\n*The first effects will be visible after 21 days from the start of use. To achieve maximum the use Revamin Lash for a period of 3 months is recommended.*\n\n*How long will I have to wait for my package to be delivered?*\n\n*We ship the products within 24 hours of placing an order. Revamin Lash will reach you after a maximum of 2 business days.*\n\n*Is international shipping also available?* \n\n*Yes. International shipping orders will reach you within 5-7 days after placing the order.*\n\n[Buy From This Link](https://nplink.net/b1nm39ha)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "malehairadvice",
    "post_id": "1ekr186",
    "title": "Natural serums",
    "url": "https://www.reddit.com/r/malehairadvice/comments/1ekr186/natural_serums/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-08-05T15:41:34+00:00",
    "body": "Hello everyone \nI was recommended a serum to revitalize my hair and give it more volume, however I'm a little skeptical about the composition and I cant find anything online about it. The pharmacist said it was all 100% natural but I can't really tell. If you're familiar with these components please enlighten me, it would really help \n\n\"Water, propylene glycol, denatured alcohol, butylene glycol, PEG-40 hydrogenated castor oil, panthenol, pyridoxine HCL, biotin, apigenin, oleanolic acid, biotinoyl tripeptide-1, sodium hydroxide, fragrance, PPG-26 buteth-26, BHT, methylisothiazolinone, amyl cinnamal, benzyl salicylate, citronellol, coumarin, hexyl cinnamal\"\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_drbbrmja",
    "post_id": "n9xrp7",
    "title": "Revamin Lash , Its perfect product and Safe for eyelashes",
    "url": "https://www.reddit.com/r/u_drbbrmja/comments/n9xrp7/revamin_lash_its_perfect_product_and_safe_for/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-11T14:05:27+00:00",
    "body": "  \n\n**What is Revamin Lash, and how does it work?**\n\nRevamin Lash is an eyelash serum made from only the finest quality natural ingredients to ensure optimum effectiveness and protection.\n\n&#x200B;\n\nhttps://preview.redd.it/mzlx9eitzhy61.jpg?width=750&format=pjpg&auto=webp&s=f4614ed4376ae99b8ace394fdb39df41350d5586\n\n[Revamin Lash's](https://nplink.net/tr6afioh) **mechanism of action is as follows:**\n\nWhen the product is used on a regular basis, the eyelashes become:\n\n**Longer and more substantial**\n\nThe zinc and caffeine in the product stimulate the bulbs, resulting in quicker eyelash development.\n\n**Increased in thickness**\n\nBiotin and panthenol have a beneficial effect on hair structure, nourishing, strengthening, and thickening it.\n\n**nourished and fortified**\n\nThe substance will reinforce and nourish weak hair that is constantly exposed to external influences. This is because the substance contains glycerine, which nourishes the hair, as well as sodium hyaluronate, which strengthens the hair.\n\n**Intensively hydrated**\n\nIt is important to maintain hydration in your skin and hair. It's possible that the urea in the product is responsible for the product's natural moisture.\n\n&#x200B;\n\nhttps://preview.redd.it/n7ml8g570iy61.jpg?width=720&format=pjpg&auto=webp&s=7f880b033649df573179a1e4c800f76143f665dc\n\n**What is the best way to apply Revamin Lash?**\n\n1. Remove your make-up.\n\n2. Run your finger along the lash line.\n\n3. Use it in the morning and evening.\n\n**What is the secret of** **Revamin Lash****?**\n\nBIOTINOYL TRIPEPTIDE - 1 is a tried and true ingredient.\n\nIt has been repeatedly tested and proven to improve the duration and density of eyelashes as well as prevent them from falling out.\n\nIn vitro experiments show that the tripedptide molecule promotes the proliferation of keratinocytes in the bulb, i.e. hair cell proliferation. Furthermore, it aids in the optimum anchoring of hair by stimulating the synthesis and organization of alpha 5 laminin and collagen IV adhesion molecules.\n\nAfter 30 days, a clinical trial of 30 participants revealed that eyelashes were 17 percent longer and 19 percent thicker due to the use of a product containing Biotinoyl Tripeptide-1.\n\n**Revamin Lash** **Ingredients:**\n\nThe rich composition of the Revamin Lash eyelash serum definitely distinguishes it from other products. The combination of so many active ingredients allows for the natural growth and conditioning of the eyelashes.\n\nArginine Proven Benefits :\n\n· Reduce Irritation\n\n· Strengths’ the lipid barrier\n\n· Moisturzes the skin and hair\n\nPanthenol Proven Benefits:\n\n· Improve the smoothness of your hair\n\n· Restore the hair structures\n\n· Intensely moisturzes\n\nGlycerine Proven Benefits :\n\n· Regenerates the lashes\n\n· deeply condition the lashes\n\n· Protest against the harmful effects of external factors\n\nSodium hyaluronate Proven Benefits :\n\n· Improve the condition of lashes\n\n· moisturizes the lashes\n\n· strengthen the bulbs\n\nUrea Proven Benefits :\n\n· Naturally moisturizes\n\n· Act as a mild keralytic agent\n\n· Improves the protective functions of the skin barrier\n\n**Is** **Revamin Lash** **safe?**\n\nThe product is made entirely of natural ingredients that have been thoroughly tested and proven to be completely healthy for your health, with no known side effects.\n\nWhen will I be able to see the results of using [Revamin Lash](https://nplink.net/tr6afioh)?\n\nAfter 21 days of use, the first results will become apparent. Revamin Lash should be used for three months to get the best results.\n\nI'm not sure how long I'll have to wait for my shipment to arrive.\n\nWe ship orders within 24 hours of receiving them. [Revamin Lash](https://nplink.net/tr6afioh) will meet you within 2 business days at the most.\n\nIs there an option for foreign shipping?\n\nYes, indeed. Orders for international shipping will arrive within 5-7 days of being placed.\n\n[Click Here To Get Instant Access And To Know More](https://nplink.net/tr6afioh)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Accutane",
    "post_id": "1fy5b8p",
    "title": "Can I use The Ordinary Lash serum during my treatment?",
    "url": "https://www.reddit.com/r/Accutane/comments/1fy5b8p/can_i_use_the_ordinary_lash_serum_during_my/",
    "score": 1,
    "num_comments": 5,
    "created": "2024-10-07T11:27:41+00:00",
    "body": "Will I get some kind of irritation or not really any side effects will happen? Anyone of you used lash serums? Im starting at 10mg\n\n  \nIngredients:\n\nAqua, Glycerin, Butylene Glycol, Myristoyl Pentapeptide-17, Biotinoyl Tripeptide-1, Oligopeptide-2, Acetyl Tetrapeptide-3, Caffeine, Panthenol, Arginine, Glycine, Glycoproteins, Larix Europaea Wood Extract, Trifolium Pratense Flower Extract, Camellia Sinensis Leaf Extract, Dextran, Maltodextrin, Zinc Chloride, Hydroxyethylcellulose, Xanthan Gum, Trisodium Ethylenediamine Disuccinate, Polysorbate 20, Sodium Metabisulfite, Caprylyl Glycol, 1,2-Hexanediol, Sodium Benzoate, Benzoic Acid, Ethylhexylglycerin, Phenoxyethanol, Chlorphenesin.",
    "flair_text": "Side Effects",
    "flair_template_id": "a00e6f80-e185-11ee-9bce-f23e7c57ab30",
    "comments": [
      {
        "author": "Imaginary-Growth-605",
        "body": "i used it throughout my whole treatment",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "adesperateapplicant",
        "body": "I'm using it too and am on the same dose (week 3). Had no issues but that's also because I proactively slather moisturiser or vaseline on my eye lids most of the day after I've applied it in the morning",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Please read the rules before posting and remember to abide by them!\nPosts and comments not following the rules will immediately be removed!\n\nHave you tried using the search bar?  \nMany questions are asked daily, and your question may have already \nbeen answered!  \nIf so, your post will be subject to deletion.\n\nPlease refer to the following commonly discussed \ntopics:\n\n1) No one can predict whether or not you will purge! \nStatistically, most people DO NOT purge.  \nThat is what the science and medical literature says.\n\n2) No one can predict how long your purge will last \nnor when it could start. \nBe patient, the purge can be tough but so many people have gotten through it - \nyou can too!\n\n3)  Any questions related about dosage MUST include DOSE and WEIGHT(lbs or kg).  \nOtherwise, that is considered LOW EFFORT and will subsequently be REMOVED.   \n\n4)  Most people DO NOT replase when Accutane is taken until cumulative dosage is reached.\n\n5) HOWEVER, cumulative dosage is a guideline.  \nEveryone is different.  Some may need more Accutane, and others may need less.  Your dermatologist \nevaluates you as an individual.  \nThis also applies to your prescription.  Everyone is different, so no comparing of doses or asking why your dose is low or high.\nIf you do not trust your dermatologist, you should find a different one.\n\n6) When in doubt, please consult a medical \nprofessional(dermatologist, doctor, pharmacist).  \nDO NOT solicit medical advice from this subreddit.  \nRemember Reddit is a bunch of strangers on the internet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Accutane) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "llammacookie",
        "body": "No one will know until you try and find out.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "OneEntertainment6191",
        "body": "I have had no problems using the ordinary lash serum + 40mg! Ive used it before treatment and had no issues, so if this is your first time using it, maybe try spot testing??",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "lashextensions",
    "post_id": "1lfxjpf",
    "title": "Lash serum ingredient",
    "url": "https://www.reddit.com/r/lashextensions/comments/1lfxjpf/lash_serum_ingredient/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-06-20T07:05:08+00:00",
    "body": "Are any of these ingredients going to cause orbital fat loss? \n\nAqua, Hyaluronate, Pentylene\nGlycol, Panax Ginseng Extract, Swertia Japonica Extract, Pumpkin Seed Extract, Acorus Calamus Root Extract, Panthenol, Serenoa\nSerrulata Fruit Extract, Biotinoyl Tripeptide-1, Myristoyl Pentapeptide-17, Oligopeptide-10, Tocopherol,\nBiotin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Minoxbeards",
    "post_id": "f35rxj",
    "title": "Switched to alcohol free Minoxidil, but just found out it has Oleanolic Acid, which is a DHT blocker.",
    "url": "https://www.reddit.com/r/Minoxbeards/comments/f35rxj/switched_to_alcohol_free_minoxidil_but_just_found/",
    "score": 1,
    "num_comments": 6,
    "created": "2020-02-13T06:30:14+00:00",
    "body": "I use minoxidil both on my hair and my beard, Alcohol based solution worked wonders for both but gave me flaky skin so I switched to foam based, but the foam one was extremely greasy after application. Got to know about alcohol free minoxidil from my friend and bought it (Minichek 5 by Abbott), but it has Oleanolic Acid as one of the excipients along with Apigenin, Biotinoyl Tripeptide-1 and Hydrogenated Castor Oil. Should I use it on my beard?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Rezod_",
        "body": "I use a DHT blocker in the moisturizer I use and I’m about to be 2 months in and I’m seeing great results despite the fact of it having a “DHT blocker”",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Content_Cat8746",
        "body": "Can I wash off minoxidil after 4 hours?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tretinoin",
    "post_id": "1jopsec",
    "title": "Numbuzin NAD essence with Tretinoin?",
    "url": "https://www.reddit.com/r/tretinoin/comments/1jopsec/numbuzin_nad_essence_with_tretinoin/",
    "score": 1,
    "num_comments": 15,
    "created": "2025-04-01T07:23:05+00:00",
    "body": "Hello beautiful creatures! I have a question, I'm using tretinoin right now with a simple and hydrating routine but I wanted to step up my game and to introduce this essence, full of peptides and other ingredients (I know that without knowing the percentage it's probably just a marketing strategy but I still wanted to give it a try).\nCan I use it with Tretinoin?\n\nIngredients list\n\nWater, Glycerin, Hydrogenated Poly(C6-14 Olefin), Polyglycerin-3, Butylene Glycol, Pentaerythrityl Tetraethylhexanoate, Propanediol, Dimethicone, 1,2-Hexanediol, Niacinamide, Methylpropanediol, Cetearyl Alcohol, Glyceryl Stearate, Hydrogenated Vegetable Oil, Polyglyceryl-3 Methylglucose Distearate, Butyrospermum Parkii (Shea) Butter, Dimethicone Crosspolymer, Ammonium Acryloyldimethyltaurate/VP Copolymer, Sodium Polyacrylate, Hydrogenated Lecithin, Carbomer, Xanthan Gum, Pentylene Glycol, Tromethamine, Ethylhexylglycerin, Adenosine, Palmitic Acid, Stearic Acid, Sodium Phytate, Cholesterol, Sodium Hyaluronate, Adenosine Triphosphate, Hydroxypropyl Cyclodextrin, Nicotinamide Adenine Dinucleotide, Beta-Glucan, Tocopherol, Palmitoyl Tripeptide-5, Copper Gluconate, Saccharomyces/Copper Ferment, Saccharomyces/Iron Ferment, Saccharomyces/Magnesium Ferment, Saccharomyces/Silicon Ferment, Saccharomyces/Zinc Ferment, Capryloyl Dipeptide-17, Thioctic Acid, Leuconostoc/Radish Root Ferment Filtrate, Glutathione, Tremella Fuciformis (Mushroom) Extract, Haematococcus Pluvialis Oil, Potassium Hydroxide, Resveratrol, Hesperidin Methyl Chalcone, Sorbitan Laurate, Steareth-20, Astaxanthin, Sodium Lactate, Hydroxyethylcellulose, Acetyl Dipeptide-1 Cetyl Ester, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Heptasodium Hexacarboxymethyl Dipeptide-12, Panthenol, Polysorbate 20, Sodium Citrate, Chlorhexidine Digluconate, Dextran, Hexapeptide-2, Magnesium Chloride, Tetradecyl Aminobutyroylvalylaminobutyric Urea Trifluoroacetate, Acetyl Tetrapeptide-5, Dipeptide-2, Potassium Sorbate, Acetyl Hexapeptide-8, Palmitoyl Dipeptide-5 Diaminobutyroyl Hydroxythreonine, Citric Acid, Biotin, Palmitoyl Tetrapeptide-7, Biotinoyl Tripeptide-1, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Tocopheryl Acetate, Palmitoyl Tripeptide-8, Dipeptide-4, Hexapeptide-11, Pentapeptide-18, Tripeptide-3, SH-Decapeptide-7, SH-Octapeptide-4, Palmitoyl Tripeptide-1, Ascorbic Acid Polypeptide, Hexapeptide-9, Oligopeptide-3, Palmitoyl Hexapeptide-12, Tripeptide-1, Palmitoyl Pentapeptide-4, Ubiquinone, Copper Tripeptide-1, Caffeoyl Tripeptide-1, Caffeoyl SH-Octapeptide-4, Galloyl Pentapeptide-33, Kojyl Carboxy Dipeptide-23, Nicotinoyl Tripeptide-1, Octapeptide-7, Oligopeptide-1, Sh-Decapeptide-9, SH-Oligopeptide-9, SH-Pentapeptide-19, Asparagine, Glutamine, Tryptophan, Oligopeptide-2, SH-Oligopeptide-1, SH-Oligopeptide-2, SH-Polypeptide-1, Sh-Polypeptide-22, SH-Polypeptide-3, Acetyl Octapeptide-3, Acetyl Tetrapeptide-2, Acetyl Tetrapeptide-9, Carnosine, Nonapeptide-1",
    "flair_text": "Routine Help",
    "flair_template_id": "5f5bdcf0-1ba1-11eb-8f19-0e8dfcb50bc9",
    "comments": [
      {
        "author": "Unfair_Finger5531",
        "body": "Do not do it. There are about 97 ingredients in this product that don’t work with tret. You gotta know that ascorbic acid, resveratrol, copper peptides, and eleventy peptides are not okay to use with tret. \n\nJust assume that when the ingredients list is this long, it shouldn’t be used with tret. Just use it in the daytime, and don’t layer it with anything. I use it, and pretty loaded.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "strikealightt",
        "body": "Holy INCI list.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "cotoMELON",
        "body": "My routine is :\n\nAM Geek & gorgeous C-glow, Finacea Gel and Skin aqua SPF (and Rohto lip SPF)\n\nPM Kose softymo speedy cleansing oil, Skin first cleanser, BOJ eye serum, BOJ rice milk, Transparent lab zi-k balm, Cerave healing ointment (for slugging or lips) and finally Tretinoin",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_younors",
    "post_id": "n7mzk3",
    "title": "Go for naturally long and thick lashes!",
    "url": "https://www.reddit.com/r/u_younors/comments/n7mzk3/go_for_naturally_long_and_thick_lashes/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-08T11:09:55+00:00",
    "body": "&#x200B;\n\n# Go for naturally long and thick lashes! \n\n# \n\nhttps://preview.redd.it/wn43blx4ovx61.jpg?width=300&format=pjpg&auto=webp&s=e9918efba00ed3df3982a5311d4f76014ef2c22d\n\n# [Revamin Lash](https://nplink.net/scf4ide7) ingredients:\n\n* Accelerate eyelash growth\n* Strengthen the hair structure\n* Visibly thicken and lengthen the lashes\n* Moisturize and improve their appearance\n\n#    [Order](https://nplink.net/scf4ide7) [Now](https://nplink.net/scf4ide7)\n\n&#x200B;\n\nhttps://preview.redd.it/pllntgh4qvx61.png?width=350&format=png&auto=webp&s=5c72e81879e8e21ba35596fb252f375d979dc875\n\n## Who is [Revamin Lash](https://nplink.net/scf4ide7) for?\n\n**Revamin Lash serum was designed for women who want naturally long and thick lashes every day.**\n\n**Wondering why you have thin and sparse eyelashes? The main factors threatening your eyelashes are:**\n\n* adverse weather conditions\n* heavy make-up\n* gluing artificial eyelashes\n* rubbing your eyes\n* improper facial hygiene\n\n**The result may be the excessive falling out and a significant weakening of your lashes.**\n\n \n\nRemember that you should take care of your eyelashes just as much as other parts of the body. Regular moisturising and nourishing them will pay off with a look with beautiful and full lashes.\n\nYou will achieve this thanks to the highest quality ingredients contained in the Revamin Lash serum, which were composed in such a way as to achieve the maximum effect of lengthening and thickening of the eyelashes.\n\n \n\n## How [Revamin Lash](https://nplink.net/scf4ide7) works:\n\n**Revamin Lash** **is a eyelash serum, which was created from the highest quality natural ingredients, so as to ensure maximum efficiency and safety of use.**\n\n**Regular application of the product makes the eyelashes:**\n\n\\- **Longer and thicker**\n\nZinc and caffeine contained in the product stimulate the bulbs, which contributes to faster eyelash growth.\n\n\\- **Thickened**\n\nBiotin and panthenol have a positive effect on hair structure, making the hair nourished, stronger and thicker.\n\n\\- **Nourished and strengthened**\n\nThe use of the product will strengthen and nourish weak hair, which is exposed to external factors every day. This is due to the glycerine contained in the product, which nourishes the hair, and sodium hyaluronate, which makes the hair more resistant.\n\n\\- **Deeply moisturised**\n\nIt is very important to keep your skin and hair hydrated. The natural moisture in the product may be due to the urea it contains.\n\n## How do I use [Revamin Lash](https://nplink.net/scf4ide7)?\n\n&#x200B;\n\nhttps://preview.redd.it/fueso5qrnvx61.jpg?width=1080&format=pjpg&auto=webp&s=8ff3300f9443c637a5525466ddcc98da53ef186f\n\n## What is the secret of [Revamin Lash](https://nplink.net/scf4ide7)?\n\nTested and effective ingredient BIOTINOYL TRIPEPTIDE - 1\n\nRepeatedly tested and known for its beneficial effect on the length and density of eyelashes, as well as for its prevention of their falling out.\n\nConducted in vitro studies prove that the tripedptide molecule supports the proliferation of keratinocytes of the bulb, i.e. the propagation of hair cells. What is more, it helps to optimally anchor the hair by stimulating the synthesis and organization of the adhesion molecules of alpha 5 laminin and collagen IV.\n\nHowever, a clinical trial with 30 volunteers showed that thanks the use of a product containing Biotinoyl Tripeptide-1, the eyelashes were 17% longer and 19% thicker after 30 days.\n\n#   [Order](https://nplink.net/scf4ide7) [Now](https://nplink.net/scf4ide7)\n\n# \n\n&#x200B;\n\nhttps://preview.redd.it/tv0d9y6znvx61.jpg?width=300&format=pjpg&auto=webp&s=5cf053af63f32df64fd3d98cf490fb5a9b910e13\n\n#   [Order](https://nplink.net/scf4ide7) [Now](https://nplink.net/scf4ide7)\n\n# \n\nhttps://preview.redd.it/rh4qf160pvx61.jpg?width=720&format=pjpg&auto=webp&s=9026c98f560a2d2d8f994c9e383929e603a1d321\n\n&#x200B;\n\nhttps://preview.redd.it/i3byez73pvx61.jpg?width=720&format=pjpg&auto=webp&s=468c0a84fa847f3bd1c3956d6d426c6e82fa2089",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_mina_zakaria",
    "post_id": "n8s16v",
    "title": "REVAMIN LASH CUSTOMERS REVIEW",
    "url": "https://www.reddit.com/r/u_mina_zakaria/comments/n8s16v/revamin_lash_customers_review/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-10T00:57:42+00:00",
    "body": " \n\n**What Is Revamin Lash?** **Who is the Revamin Lash? How do I use Revamin Lash ?**\n\n&#x200B;\n\nhttps://preview.redd.it/m7uxyf3vy6y61.png?width=444&format=png&auto=webp&s=f18db21372920a6555206cbf3076592f71865498\n\n**What Is Revamin Lash?**\n\n**Repeatedly tested and known for its beneficial effect on eyelid length and density and its prevention.**\n\n**The tripedptide molecules show in vitro that support the keratinocytes proliferation of the bulb, i.e. the spread of hair cells. In addition, it helps to anchor the hair optimally by stimulating the synthesis and organization of alpha five laminine and collagen IV adhesion molecules.**\n\n**A clinical trial involving 30 voluntary workers showed, however, that the eyelashes were 17 percent longer and 19 percent bigger after 30 days thanks to a product containing Biotinoyl Tripeptide-1.**\n\n**Revamin Lash nurtures eyewear and the skin around the eyes, encouraging the formation of eyelash. With Revamin Lash serum the effect of long and thick eyelashes can be achieved regularly. It is a popular choice as it is eye healthy and does not irritate the eyelids.**\n\n**The first effects become visible after only three weeks of use.**\n\n**Eyelash Serum Use Benefits**\n\n**Accelerate growth of eyelash**\n\n**Reinforce the hair structure**\n\n**Thicken and extend the cloves visibly**\n\n**Moisturize and improve your look**\n\n[**Visit Official Website**](https://www.google.com/url?q=https%3A%2F%2Fnplink.net%2Fb1nm39ha&sa=D&sntz=1&usg=AFQjCNHRWiOKhDzmdxPWWQRamw3C68BdHQ)\n\n**Who is the Revamin Lash?**\n\n**Revamin Lash Serum has been conceived for women who want natural lashes that are long and thick every day.**\n\n**Why have you sparse and thin eyelashes? The main threats to your cloves are:**\n\n**Conditions of bad weather**\n\n**Artificial eyelashes gluing heavy make-up rub your eyes inadequately with facial hygiene**\n\n**This can lead to an excessive fall and a considerable reduction in your clothes.**\n\n**Please remember that as much as other parts of the body you should take care of your eyelids. They are regularly moisturized and nutritious with a beautiful and full look.**\n\n**This is accomplished through the highest quality ingredients in the Revamin Lash serum, composed so that maximum lengthening and thickening effect is achieved.**\n\n[**Visit Official Website**](https://www.google.com/url?q=https%3A%2F%2Fnplink.net%2Fb1nm39ha&sa=D&sntz=1&usg=AFQjCNHRWiOKhDzmdxPWWQRamw3C68BdHQ)\n\n**How do I use Revamin Lash?**\n\n**Apply on the eyelash line in the morning and evening. Before use, shake well.**\n\n**What do experts think about the product?**\n\n**Extensions of eyelash are very popular nowadays, most women probably chose to use artificial eyelashes at least once. Sadly, this treatment weakens our natural hair. It is true. It is often the case also that a beauty designer who takes a lot of money for eyelash extensions is not trained enough. In this case, natural and delicate eyelashes are not harder to damage.**\n\n**The good news is that women give up this method of embellishment and choose a natural look ever more. But long and dense eyelashes are still to be achieved.**\n\n**Revamin Lash is a means of saving slim, weakened eyelids. Eyelashes are daily exposed to wind, rain, frost and the sun, so we need to be careful of them! Thanks to its rich and natural structure, your product systematically strengthens and prolongs your cloths to ensure they are exactly what they need.**\n\n**The main ingredient - biotinyl tripeptide 1 - which significantly impairs and prevents the development of eyelashes from collapsing is what makes this product distinguishable from other eyelashes!**\n\n[**Visit Official Website**](https://www.google.com/url?q=https%3A%2F%2Fnplink.net%2Fb1nm39ha&sa=D&sntz=1&usg=AFQjCNHRWiOKhDzmdxPWWQRamw3C68BdHQ)\n\n**Revamin Lash Ingredients**\n\n**It is clearly distinguished from other products by the rich composición of the Revamin Lash eyelash serum. The combination of so many active ingredients allows eyelashes to develop naturally.**\n\n**Biotin**\n\n**Reinforces lashes**\n\n**Improves the lamination structure**\n\n**Threads the laugh visibly**\n\n**Caffeine** \n\n**Helps growth of hair**\n\n**Properties of antioxidant**\n\n**Reduces visible eye shadows**\n\n**Zinc PCA** \n\n**Hair structure beneficial effect**\n\n**Reinforces clods**\n\n**Accelerate growth of eyelash**\n\n**Arginine**\n\n**Skin and hair moisturizes**\n\n**Reduces turbidity**\n\n**Fulfill lipid barrier** \n\n**Panthenol** \n\n**Enhances fluidity**\n\n**Hydrates heavily**\n\n**Hair structure restore** \n\n**Glycerine**\n\n**Recovers the clogs**\n\n**Protects from the damaging effects of outside factors**\n\n**The lashes are deeply affected**\n\n**Sodium Hyaluronate**\n\n**Improves the state of laughter**\n\n**Hydrates clogging**\n\n**Reinforces the bulbs**\n\n**Urea**\n\n**Improves skin barrier protection functions**\n\n**Hydrates naturally**\n\n**It acts as a mild keralytic substance**\n\n**Is Revamin Safe?**\n\n**This product consists entirely of naturally occuring components tested thoroughly and showing no known side effects that have been completely healthy for your body.**\n\n**How long it takes to see the effects?**\n\n**The first results are noticeable after 21 days of use. For three months, Revamin Lash is able to obtain the best results.**\n\n**Can I wear make up while using Revamin Lash?**\n\n**Yes, make up can be used.**\n\n[**Visit Official Website**](https://www.google.com/url?q=https%3A%2F%2Fnplink.net%2Fb1nm39ha&sa=D&sntz=1&usg=AFQjCNHRWiOKhDzmdxPWWQRamw3C68BdHQ)\n\n**How long will it take before I see the effects of using Revamin Lash?**\n\n**The first effects will be visible after 21 days from the start of use. To achieve maximum the use Revamin Lash for a period of 3 months is recommended.**\n\n**How long will I have to wait for my package to be delivered?**\n\n**We ship the products within 24 hours of placing an order. Revamin Lash will reach you after a maximum of 2 business days.**\n\n[**Visit Official Website**](https://www.google.com/url?q=https%3A%2F%2Fnplink.net%2Fb1nm39ha&sa=D&sntz=1&usg=AFQjCNHRWiOKhDzmdxPWWQRamw3C68BdHQ)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Hichemmedea",
    "post_id": "nhsbww",
    "title": "Genuine Review Of Revamin Lash Eyelash Serum",
    "url": "https://www.reddit.com/r/u_Hichemmedea/comments/nhsbww/genuine_review_of_revamin_lash_eyelash_serum/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-05-21T13:19:20+00:00",
    "body": " \n\n# What is [Revamin Lash](https://nplink.net/zeg0r7bf)?\n\n# Revamin Lash is a eyelash serum, which was created from the highest quality natural ingredients, so as to ensure maximum efficiency and safety of use.\n\n# How [Revamin Lash](https://nplink.net/zeg0r7bf) works:\n\n# Regular application of the product makes the eyelashes:\n\n# Longer and thicker\n\n# Zinc and caffeine contained in the product stimulate the bulbs, which contributes to faster eyelash growth.\n\n# Thickened\n\n# Biotin and panthenol have a positive effect on hair structure, making the hair nourished, stronger and thicker.\n\n# Nourished and strengthened\n\n# The use of the product will strengthen and nourish weak hair, which is exposed to external factors every day. This is due to the glycerine contained in the product, which nourishes the hair, and sodium hyaluronate, which makes the hair more resistant.\n\n# Deeply moisturised\n\n# It is very important to keep your skin and hair hydrated. The natural moisture in the product may be due to the urea it contains.\n\n \n\nhttps://preview.redd.it/xyxdhddr4h071.png?width=359&format=png&auto=webp&s=591a1bc9390ca11fc64d256dd3c7f9b341bc1582\n\n# How do I use [Revamin Lash?](https://nplink.net/zeg0r7bf)\n\n# 1-Wash off your make-up Use revamin\n\n# 2-Apply along the eyelash line Use revamin\n\n# 3-Apply in the morning and in the evening\n\n \n\nhttps://preview.redd.it/07yeys5u4h071.png?width=1175&format=png&auto=webp&s=ceb1bb44be149efb5d77259cc590a585f8f988b1\n\n# What is the secret of [Revamin Lash](https://nplink.net/zeg0r7bf)?\n\n# Tested and effective ingredient BIOTINOYL TRIPEPTIDE - 1\n\n# Repeatedly tested and known for its beneficial effect on the length and density of eyelashes, as well as for its prevention of their falling out.\n\n# Conducted in vitro studies prove that the tripedptide molecule supports the proliferation of keratinocytes of the bulb, i.e. the propagation of hair cells. What is more, it helps to optimally anchor the hair by stimulating the synthesis and organization of the adhesion molecules of alpha 5 laminin and collagen IV.\n\n# However, a clinical trial with 30 volunteers showed that thanks the use of a product containing Biotinoyl Tripeptide-1, the eyelashes were 17% longer and 19% thicker after 30 days.\n\n# [Revamin Lash](https://nplink.net/zeg0r7bf)Ingredients:\n\n# The rich composition of the Revamin Lash eyelash serum definitely distinguishes it from other products. The combination of so many active ingredients allows for the natural growth and conditioning of the eyelashes.\n\n# Arginine Proven Benefits :\n\n# ·         Reduce Irritation\n\n# ·         Strengths’ the lipid barrier\n\n# ·         Moisturzes the skin and hair\n\n# Panthenol Proven Benefits:\n\n# ·         Improve the smoothness of your hair\n\n# ·         Restore the hair structures\n\n# ·         Intensely moisturzes\n\n# Glycerine  Proven Benefits :\n\n# ·         Regenerates the lashes\n\n# ·         deeply condition the lashes\n\n# ·         Protest against the harmful  effects  of external  factors\n\n# Sodium  hyaluronate Proven Benefits :\n\n# ·         Improve the condition of lashes\n\n# ·         moisturizes  the lashes\n\n# ·         strengthen the bulbs\n\n# Urea Proven Benefits  :\n\n# ·         Naturally moisturizes\n\n# ·         Act as a mild keralytic agent\n\n# ·         Improves the protective functions of the skin barrier\n\n# Is [Revamin Lash](https://nplink.net/zeg0r7bf)safe?\n\n# The product consists exclusively of natural ingredients, which are tested and fully safe for your health, so they do not cause any side effects.\n\n# How long will it take before I see the effects of using Revamin Lash?\n\n# The first effects will be visible after 21 days from the start of use. To achieve maximum the use Revamin Lash for a period of 3 months is recommended.\n\n**TO READ MORE CLICK** [**HERE**](https://nplink.net/zeg0r7bf)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "peptidewiki",
    "post_id": "1lhsav5",
    "title": "The Peptide Revolution: Unlocking the Future of Hair Restoration for Optimal Follicle Health",
    "url": "https://www.reddit.com/r/peptidewiki/comments/1lhsav5/the_peptide_revolution_unlocking_the_future_of/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-06-22T16:40:36+00:00",
    "body": "For more similar guides and sources check out: [PEPTIDEWIKI.NET](http://peptidewiki.net/)\n\nIOS Mobile Peptide Tracker App: [Peptide Tracker & Calculator](https://apps.apple.com/us/app/peptide-tracker-calculator/id6744902384)\n\nHair loss is a deeply personal and often distressing experience, affecting millions worldwide. From genetic predispositions like androgenetic alopecia to environmental factors, stress, and nutritional deficiencies, the causes are varied, and traditional solutions often fall short, offering limited efficacy or undesirable side effects. But what if there was a more natural, targeted, and profound way to rejuvenate your hair follicles and reclaim a fuller, healthier mane? Enter peptides – the unassuming yet powerful signaling molecules poised to redefine the landscape of hair restoration. This isn't just about slowing hair loss; it's about fostering genuine follicle health from the ground up, ushering in a new era of proactive and effective solutions.\n\n## The Hair Loss Dilemma: Why Traditional Approaches Often Miss the Mark\n\nFor decades, the battle against hair loss has largely relied on a handful of conventional treatments. Minoxidil, a topical vasodilator, aims to improve blood flow to the scalp and stimulate follicles, but its effects are often temporary and require continuous application. Finasteride, an oral medication, works by blocking DHT, a hormone linked to male pattern baldness, but carries potential systemic side effects. Hair transplant surgery, while offering a permanent solution for some, is invasive, costly, and depends on donor hair availability.\n\nThe common thread among these traditional methods is their reactive nature and broad-stroke approach. They might address symptoms but often fail to tackle the intricate cellular and molecular imbalances that contribute to follicle miniaturization and hair thinning. Many individuals seek alternatives that are less invasive, have fewer side effects, and promote sustainable, long-term hair health rather than just temporary growth. This is where the precision and biological intelligence of peptides shine.\n\n## What Are Peptides and How Do They Relate to Hair?\n\nAt their core, **peptides are short chains of amino acids**, the building blocks of proteins. Unlike proteins, which are long and complex, peptides are smaller and more agile, allowing them to act as highly specific biological messengers. They occur naturally throughout the body, playing crucial roles in virtually every physiological process, from hormone regulation and immune response to cell growth and repair.\n\nIn the context of hair, peptides function as sophisticated communicators, instructing cells within the hair follicle to perform specific tasks. They can signal for increased blood flow, reduce inflammation, stimulate the production of essential proteins, or even extend the hair growth cycle. By interacting with cellular receptors, peptides can modulate complex biological pathways that are directly relevant to the health, vitality, and growth of hair follicles. Their ability to deliver precise, targeted instructions makes them incredibly promising for addressing the multi-faceted nature of hair loss.\n\n## Peptides for Hair Restoration: A Deeper Dive into the Mechanism\n\nThe true power of peptides lies in their ability to influence the delicate ecosystem of the hair follicle. They don't just \"grow hair\"; they optimize the environment for healthy growth by addressing underlying issues.\n\n### Stimulating Follicle Growth and Proliferation\n\nCertain peptides act as potent growth factors, directly encouraging hair follicle cells (dermal papilla cells, keratinocytes) to proliferate and differentiate. For instance, **GHK-Cu (Copper Peptides)**, one of the most well-researched peptides, has been shown to stimulate the production of collagen and elastin, essential components of a healthy scalp and hair structure. More critically, GHK-Cu promotes **angiogenesis** – the formation of new blood vessels. A robust blood supply is vital for delivering oxygen and nutrients to the hair follicles, which are among the most metabolically active cells in the body. Improved circulation directly translates to better nourished, stronger follicles capable of producing thicker hair.\n\n### Reducing Inflammation and Oxidative Stress\n\nChronic inflammation and oxidative stress in the scalp can significantly impede hair growth and even lead to follicle damage. Conditions like seborrheic dermatitis or even general environmental stressors can create an inflammatory environment. Many peptides, including GHK-Cu, possess **powerful anti-inflammatory and antioxidant properties**. By neutralizing free radicals and dampening inflammatory pathways, these peptides create a healthier micro-environment for follicles to thrive, reducing the likelihood of premature hair loss and promoting repair.\n\n### Extending the Anagen (Growth) Phase\n\nHair growth occurs in a cycle with three main phases:\n*   **Anagen (Growth Phase):** Hair actively grows.\n*   **Catagen (Transition Phase):** Hair growth stops.\n*   **Telogen (Resting Phase):** Hair sheds.\n\nIn individuals experiencing hair loss, the anagen phase often shortens, leading to thinner, shorter hairs that shed prematurely. Certain peptides are being explored for their ability to **prolong the anagen phase** and delay the onset of the catagen phase. This means hair stays in its active growth cycle for longer, resulting in more hair density and length over time. Peptides can achieve this by influencing signaling pathways that regulate cell division and survival within the follicle, essentially telling the hair to \"keep growing.\"\n\n### Improving Scalp Health and Blood Circulation\n\nA healthy scalp is the foundation for healthy hair. Peptides can contribute to overall scalp vitality by:\n*   **Enhancing blood flow:** As mentioned with GHK-Cu, increased circulation ensures follicles receive ample nutrients and oxygen.\n*   **Modulating the scalp microbiome:** While research is ongoing, some peptides may help balance the microbial environment of the scalp, preventing conditions that can hinder hair growth.\n*   **Strengthening the skin barrier:** A robust skin barrier protects the scalp from irritants and infections, further supporting follicle health.\n\n## Key Peptides Gaining Traction in Hair Restoration\n\nThe field of peptide research for hair is rapidly expanding, with several compounds showing significant promise:\n\n*   **GHK-Cu (Copper Peptides):** Often considered the gold standard in cosmetic peptides for hair and skin. Its multifaceted benefits include stimulating collagen production, promoting angiogenesis, acting as an anti-inflammatory and antioxidant, and potentially reactivating dormant follicles. It's commonly found in topical serums and shampoos.\n*   **Biotinoyl Tripeptide-1:** This peptide is frequently incorporated into hair care formulations. It's believed to improve hair follicle anchorage by strengthening the dermal-epidermal junction and promoting the proliferation of keratinocytes, leading to stronger, less brittle hair.\n*   **Acetyl Tetrapeptide-3 (Capixyl™):** This biomimetic peptide is designed to target the root causes of hair loss, particularly those related to DHT and inflammation. It works by inhibiting the 5-alpha reductase enzyme (which converts testosterone to DHT) and reducing inflammatory cytokines, thereby improving hair density and thickness.\n*   **Palmitoyl Tripeptide-38 (Matrixyl® synthe'6™):** While primarily known for its anti-aging effects on skin, this peptide can also contribute to scalp health by supporting the synthesis of essential matrix components like collagen and hyaluronic acid, indirectly creating a healthier environment for hair growth.\n*   **Growth Factor Mimics:** Newer peptides are being developed that mimic the action of natural growth factors (like FGF, EGF, IGF-1) that are crucial for hair follicle development and cycling. These are often proprietary blends and represent the cutting edge of peptide science in this area.\n\n## Advantages of Peptide-Based Hair Treatments\n\nThe emergence of peptides offers compelling advantages over traditional hair loss solutions:\n\n*   **Targeted Action:** Peptides work by specifically signaling biological pathways, leading to more precise and effective interventions.\n*   **Reduced Side Effects:** Because many peptides are biomimetic (mimicking natural body compounds) or are naturally occurring, they tend to have a favorable safety profile with fewer systemic side effects compared to pharmaceutical drugs.\n*   **Non-Invasive Options:** The majority of peptide hair treatments are available as topical serums, shampoos, or in conjunction with microneedling, making them highly accessible and non-invasive.\n*   **Synergistic Potential:** Peptides can be combined with other therapies (e.g., PRP, low-level laser therapy) to enhance overall results and provide a more comprehensive approach to hair restoration.\n*   **Focus on Follicle Health:** Rather than just stimulating temporary growth, peptides aim to restore and maintain the long-term health and function of the hair follicle itself.\n\n## The Future Landscape: What's Next for Peptides in Hair Restoration?\n\nThe journey for peptides in hair restoration is still evolving, but the trajectory is exciting. We can anticipate:\n\n*   **Personalized Peptide Formulations:** As research advances, it's likely we'll see more diagnostic tools that identify an individual's specific hair loss pathways, leading to custom-blended peptide solutions.\n*   **Enhanced Delivery Systems:** Innovations in nanotechnology and delivery methods will improve the penetration and efficacy of topical peptide applications, ensuring they reach their target cells more effectively.\n*   **Integration with Regenerative Medicine:** Peptides will increasingly be combined with other cutting-edge regenerative therapies like stem cell treatments and exosome therapy to amplify their regenerative effects on hair follicles.\n*   **Broader Accessibility:** As clinical evidence mounts and production scales, peptide-based hair treatments are expected to become more widely available and potentially more affordable.\n*   **New Peptide Discoveries:** The vast world of peptides is still being explored. Expect new peptides with novel mechanisms of action to emerge, offering even more targeted solutions for various types of hair loss.\n\n## Conclusion\n\nThe quest for effective hair restoration has reached a pivotal moment, and peptides are leading the charge. Moving beyond symptomatic relief, these intelligent biomolecules offer a paradigm shift towards truly regenerative and health-focused solutions for hair follicles. By harnessing the body's own communication systems, peptides are proving to be a game-changer, fostering an environment where hair can not only regrow but thrive with renewed vitality.\n\nIf you're seeking a sophisticated, science-backed approach to addressing hair thinning or loss, exploring peptide-based therapies is a compelling next step. Always consult with a qualified dermatologist or healthcare professional to determine the best course of action for your specific needs and to ensure you choose reputable, high-quality products. The future of hair restoration is here, and it’s signaling a new era of hope and healthy hair.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "19d756x",
    "title": "Does Grande Lash Leave in Lash Conditioner (Not The Serum) Contain Prostaglanding Or Cause Orbital Fat Loss?",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/19d756x/does_grande_lash_leave_in_lash_conditioner_not/",
    "score": 1,
    "num_comments": 2,
    "created": "2024-01-22T21:37:43+00:00",
    "body": "[https://grandecosmetics.com/products/granderepair-leave-in-lash-conditioner](https://grandecosmetics.com/products/granderepair-leave-in-lash-conditioner)\n\nIngredients: Water, Dimethicone, Aloe Barbadensis Leaf, Cyclopentasiloxane, Butylene Glycol, Cetyl Alcohol, Glyceryl Stearate, PEG-100 Stearate, Panthenol, Helianthus Annuus (Sunflower) Seed Oil, Cyclohexasiloxane, Phenethyl Alcohol, Chamomilla Recutita (Matricaria) Flower Extract, Caprylyl Glycol, Cetearyl Olivate, Sorbitan Olivate, Persea Gratissima (Avocado) Oil, Carbomer, Vitis Vinifera (Grape) Seed Extract, Ethylhexylglycerin, Biotinoyl Tripeptide-1, Allantoin, Pyrus Malus (Apple) Fruit Extract, Panax Ginseng Root Extract, Arnica Montana Flower Extract, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Tocopherol, Sodium Hydroxide, Fragrance\n\n### I don't see Isopropyl Cloprostenate which is prostaglandin... so is this lash conditioner prostaglandin free?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "sera_beth",
        "body": "There aren't any prostaglandins in it based on that ingredient list. I don't think they would put any prostaglandins in something applied directly to the lash, either. Because that would greatly increase the risk of getting it inside your eye, which can increase the risk of adverse effects. Usually prostaglandins have \"prost\" somewhere in the name....bimatoprost (Latisse), isopropyl cloprostenate, fluprostenol, ethylcloprostenolamide, etc.\n\nSeems to mostly be plant oils and extracts along with aloe, vitamin E, panthenol, and allantoin, as well as a couple of peptides and hydrating ingredients. So it should be very gentle.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mcbeemilo",
        "body": "Did you ever find out? I am wondering the same thing.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTransplants",
    "post_id": "1irpc5e",
    "title": "which mesotherapy serum?",
    "url": "https://www.reddit.com/r/HairTransplants/comments/1irpc5e/which_mesotherapy_serum/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-02-17T17:29:01+00:00",
    "body": "hey guys,\n\na friend of mine offers mesotherapy and has the proper equipment/mesogun to inject the serum right unter the scalp.\n\nhe's using the hair growth booster from \"dermida\", however, he encouraged me to do my own research on what serum is known to be best looking at the ingredients.\n\ni know that other solutions apart from fin/dut/min are generally seen as nothing more than snake oil here, but as he'd offer me the \"treatment\" for free and i'd only have to pay for the serum, i think it's worth a try, especially in the first months after my HT, even if it's just a 10% boost.\n\nso my question is to anyone who has more knowledge about the individual ingredients and their effectiveness than i do. as i don't want to link any specific products here, i thought just listing the ingredients that are listed on the product pages would be fine.\n\nso here you go:\n\ndermida: Biotin, Pyridoxne HCL and Thiamine HCL / essential ingredients: Vitamin B1, B5, B6 and B7. 20€/$ per 10ml\n\nskinderma: Panthenol, Biotin, Methylsilanol Mannuronate, hydrolyzed Collagen, and Glutathione 10€/$ per 10ml\n\ntoskani: Panthenol, Sabal Serrulata, Troxerutine, Glutathione, Biotin, Taurine, Ferrous Gluconate, Pyridoxine, Thiamine 25€/$ per 10ml\n\ndr. balwi mesotherapy: 10€/$ per 10ml essential ingredients: procapil, anagain, phytocelltec (plant-based stem cells). detailed: Aqua, Panthenol, Glycerin, Polysorbate-20, Propylene Glycol, Serenoa Serrulata Fruit Extract, Aloe Barbadensis Leaf Juıce, Camellia Sinensis Leaf Extract, Biotin, Equisetum Arvense Extract, Niacin, Calcium Pantothenate, Humulus Lupulus Extract, Arctium Lappa Root Extract, Lawsonıa Inermis Extract, Panicum Miliaceum Seed Extract, Betula Alba Leaf Extract, Urtica Dioica Leaf Extract, Chamomilla Recutita Flower Extract, Salvia Officinalis Leaf Extract, Echinacea Purpurea Extract, Calendula Officinalis Flower Extract, Centella Asiatica Extract, Melissa Officinalis Leaf Extract, Hamamelis Virginiana Leaf Extract, Tilia Cordata Flower Extract, Beta-Glucan, Maltodextrin, Benzoic Acid, Dehydroacetic Acid, Pisum Sativum Seed Extract, Phenoxyethanol, Sodium Benzoate, Malus Domestica Fruit Cell Culture Extract, Lecithin, Xanthan Gum, Opuntia Ficus-Indica Stem Extract, Sodium PCA, Sodium Lactate, Arginine, Aspartic Acid, PCA, Glycine, Alanine, Serine, Valine, Proline, Threonine, Isoleucine, Histidine, Phenylalanine, Hyaluronic Acid, Tocopheryl Acetate, Sodium DNA, Potassium Chloride, Potassium Glutathione Isomerized Linoleate, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Tocopherol, Alcohol, Vitis Vinifera Seed Extract, Parfum, Ethylhexylglycerin\n\nThe last one is from the online store of Elithair, the well-known \"Hair Mill\" in Istanbul. That's why I'm most skeptical about this product, even though it's the cheapest and has the most ingredients – though that doesn't necessarily mean anything. But since all the other products in the shop, like dermarollers, etc., are outrageously overpriced, I would be surprised if this particular product was actually worth its price. On the other hand, the other manufacturers are probably making huge margins on their products as well, that's for sure.",
    "flair_text": "Medication",
    "flair_template_id": "656e2dd8-c946-11ec-8cbe-d23e70b738b5",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "2pveu1",
    "title": "Should I get this Protein Treatment? (with ingredients)",
    "url": "https://www.reddit.com/r/HaircareScience/comments/2pveu1/should_i_get_this_protein_treatment_with/",
    "score": 1,
    "num_comments": 0,
    "created": "2014-12-20T08:53:51+00:00",
    "body": "HI haircarescience :)\n\nI want to get a Protein Treatment for my hair, since I live in Germany most of the recommendations on this side are very hard (and expensive) for me to get but I found this one and wondered of it might be any good.\n\nIngredients:\nWater (Aqua Purificata) Purified, Stearalkonium Chloride, Keratin Amino Acids (KIS® M.W. 150), Cetyl Alcohol, Glyceryl Stearate, PEG-100 Stearate, Stearic Acid, Symphytum Officinale (Comfrey) Leaf Extract, Urtica Dioca (Nettle) Extract, Camellia Sinensis Leaf Extract, Helianthus Annuus (Sunflower) Extract, Panthenol, Kaolin, Petrolatum, Polyquaternium-10, PVP, Sodium Chloride, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Phenoxyethanol, Caprylyl Glycol, Hexylglycerin, Hexylene Glycol, Fragrance (Parfum), Yellow 6 (CI 15985), Yellow 5 (CI 14140). \n\nFor anyone who is interested: its the Keramax Treatment from KIS\n\nAny help is appreciated :)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "1lfxk25",
    "title": "Lash serum ingredients",
    "url": "https://www.reddit.com/r/beauty/comments/1lfxk25/lash_serum_ingredients/",
    "score": 0,
    "num_comments": 3,
    "created": "2025-06-20T07:05:49+00:00",
    "body": "Are any of these ingredients going to cause orbital fat loss? \n\nAqua, Hyaluronate, Pentylene\nGlycol, Panax Ginseng Extract, Swertia Japonica Extract, Pumpkin Seed Extract, Acorus Calamus Root Extract, Panthenol, Serenoa\nSerrulata Fruit Extract, Biotinoyl Tripeptide-1, Myristoyl Pentapeptide-17, Oligopeptide-10, Tocopherol,\nBiotin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "catcristtal",
        "body": "Honestly, it feels like everything comes down to how much you use",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]