[
  {
    "subreddit": "AsianBeauty",
    "post_id": "a719g6",
    "title": "[Review] Moist Diane Perfect Beauty Extra Damage Repair Shampoo",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/a719g6/review_moist_diane_perfect_beauty_extra_damage/",
    "score": 216,
    "num_comments": 47,
    "created": "2018-12-17T16:26:15+00:00",
    "body": "**Background**  \n\nIn August my favorite shampoo, Hask Argan Oil Repairing Shampoo, got reformulated with ingredients I'm allergic to, so I decided it was high time to try out some AB shampoos.  One of the things I really liked about the Hask shampoo was that it cleansed thoroughly but gently, so I knew I wanted a shampoo that shared some (if not all) of the same surfactants as they can make a huge difference in the harshness of the shampoo.  I also wanted a sulfate/silicone free shampoo that had a few oils like the Hask shampoo as well.  After many nights scouring cosdna for ingredients lists, I settled on Moist Diane Perfect Beauty Extra Damage Repair Shampoo.  \n\n**Product Claims/Ingredients**  \n\nMoist Diane's [website](http://www.moist-diane.jp/en/products/extra-damage.html) claims the purpose of this line is to \"restore extremely damaged hair ends and roughness\", as well as repairing hair damage when heat is applied due to the line's unique \"nano repair matrix\".  I don't heat treat my hair, nor is it permed, bleached, etc so I wasn't really drawn in by these claims. \n\nMy main draw was the [ingredients list](http://cosdna.com/eng/cosmetic_63e4326873.html):\n\n>Water, **Olefin (C14-16) sodium sulphonate**, **Cocamidopropyl betaine**, **Cocamidomethyl MEA**, Cocoyl glutamic acid TEA, Potassium cocoyl hydrolyzed keratin, PEG-7 glyceryl cocoate, Myristamine oxide, Sodium cocoamphoacetate, Sodium methyl cocoyl taurate, Gamma-docosalactone, Quaternium-18, Quaternium-33, **Cholesterol**, **Ceramide EOP**, **Ceramide NG**, **Ceramide NP**, **Ceramide AG**, **Ceramide AP**, Propylene glycol, Hydrolyzed keratin, **Argania spinosa kernel oil**, Mango seed oil, Theobroma grandiflorum seed butter, Prune seed extract, Carapa guaianensis seed oil, Sclerocarya birrea seed oil, **Baobab seed oil**, Opuntia Ficus-Indica seed oil, Steardimonium hydroxypropyl hydrolyzed keratin, Pouteria sapota seed oil, Keratin, Isostearoyl hydrolyzed keratin, Alanine, Hydroxyproline, Sodium-PCA, Cetearamidoethyl diethonium hydrolyzed rice protein, **Sodium Hyaluronate**, Hydroxypropyltrimonium hyaluronate, **Hydrolyzed hyaluronate**, **Hydrolyzed honey protein**, Malus domestica fruit cell culture extract, Argania spinosa sprout cell extract, Rhododendron ferrugineum leaf cell culture extract, **Collagen**, Hydrolyzed conchiolin, Bis-ethoxydiglycol cyclohexane 1,4-dicarboxylate, Propanediol, Dipropylene glycol, Butylene glycol, Isomalt, Polyquaternium-10, Isononyl isononanoate, Soybean sterols, Sodium chloride, Xanthan gum, Lecithin, Behentrimonium chloride, Glycerin, Citric acid, **Lactic acid**, Tocopherol, Disodium EDTA, Sodium benzoate, Phenoxyethanol, Aroma, Caramel \n\nBold indicates ingredients that my face likes or surfactants that are the same (or very similar) to the Hask shampoo.  Wow.  Five ceramides plus cholesterol, some nice oils (including baobab!!!), and some HA and collagen thrown in?  Yeah.  I like it.  \n\n**Performance**\n\nThis shampoo is a dream.  It lathers richly, which feels great, and it also has a mild fragrance (generic bubble bath scent) that is noticeable while using it but fades very quickly.  It comes in a large pump bottle, which is genius for shampoo and so much easier than fiddling with a squeeze tube.\n\nI have a naturally oily scalp that needs daily washing.  My scalp gets flaky if I use a shampoo that's too harsh, or if it gets super dry in the winter.  I've had no problems with flakiness since starting this shampoo and my scalp overall feels more hydrated and strong.  My hair also feels stronger and is glossier than it has been in a while.  I used to use Hask's argan oil hair mask 2-3x weekly, but I haven't felt the need to do so since starting this shampoo. \n\nI've also used this as a body wash since I ran out a month ago and thought why not share the goodness of this shampoo with all of my body skin. My skin is hydrated and appreciates the extra pampering.  \n\nFor curiosity's sake, I tested the pH with my aquarium drop test kit.  It's a narrow range test kit so it only shows 6.0 to 7.5, with anything below or above those values showing as a 6 or 7.5 respectively.  However, I'm not going to use anything above a 6.5 so it works for my purposes.  Moist Diane Perfect Beauty Extra Damage Repair Shampoo comes in at a 6.0 or below, which is awesome so I'm considering testing it on my face because YOLO.\n\n**Verdict**\n\nI have been using this shampoo daily since September and I will continue using it for my hair and body until they reformulate it or discontinue it. **HG**\n\n**Where to find it**\n\nI bought mine off Amazon prime for $15, although it's no longer available on Prime.  You can also find it and the refill pouches for a similar price on Ebay or Amazon Japan. Edit: and Dokodemo",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "SRSA",
        "body": "I have a dry scalp that gets flakey and rashes with harsh shampoo, and this shampoo (and the conditioner) have been a dream. I’ve had a lot less breakage and frizziness since I switched to using it, too ❤️",
        "score": 41,
        "is_top_level": true
      },
      {
        "author": "kagamiis97",
        "body": "Funny how something that works well for someone completely doesn’t work for someone else. I bought the extra shine line of this shampoo and my hair felt dry and oily at the same time. It was the worse my hair had ever felt and I used it for a week before moving on. Now I use them as shaving creams lol. Perhaps the extra shine wasn’t for me but since I had such a bad experience with it I don’t even want to try the others. \n\nEdit: I have fine Asian hair which is non treated. I was also using a silicone free shampoo before using this one so it’s not like my hair wasn’t used to it or something.",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "KeriEatsSouls",
        "body": "Oh i love Moist, Diane hair products! Ive used them ever since i moved to Japan (and luckily i can find them in Hawaii now as well). They always make my hair look so shiny and healthy",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "Sosumi_rogue",
        "body": "You can also order it from Dokodemo for really cheap. I've had good luck ordering there. My scalp was terrible until I found a shampoo by RinRen. I have a very oily scalp, now I can wash my hair every other day. Such a relief!",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Vassiliki96",
        "body": "May I ask what are the benefits of a silicone-free shampoo in comparison with one that has them?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Hiddenagenda876",
        "body": "Its still on amazon for $17, just not prime.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "crechickee",
        "body": "Thanks for sharing! I’ve also been on the hunt for sulfate/silicone free hair products, so will definitely check this out.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "iixxy",
        "body": "What is your hair texture and thickness? I'm wondering if this formula would weigh down my fine hair.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Ohaisaelis",
        "body": "I’ve used the Extra Straight, Moist and Shine and Damage Repair. I like all of them, though I think the Damage Repair seems like the best one. It leaves my hair the least dry even if I forget to condition it.\n\nThey’re pretty much as good as drugstore brands get here in Singapore.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "townofcats",
        "body": "Thank you for this recommendation! I've been looking for an AB alternative for keratin-based hair products so I'm eager to test this brand out. After some googling, I came across [Moist Diane's USA website](https://www.moistdianeusa.com). I just purchased the shampoo and conditioner for $12 each, and the shipping didn't change from $8 when I added their botanical body wash, which I think is a good deal for shipping! Hope that helps everyone else looking to purchase upon reading your rec xx",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Wolvenna",
        "body": "Thank you for sharing this! I avoid shampoos with silicones and sulfates as well. It's surprisingly hard to find good brands in American stores so I'm glad to see there are some AB options. My scalp also gets dry and itchy/flaky in the winter so this sounds amazing.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "home_in_pleiades",
        "body": "Is this safe for color treated hair?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "_someoneyeah_",
        "body": "has anyone tried the extra shine version?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "whythefuckyoulying",
        "body": "I'm using this! It's great. Don't even need a conditioner after the shampoo! I have pretty dry hair and some shampoos and conditioners don't work that well as it creates drag when I run my fingers through my wet hair. But this shampoo made it a pretty silky. Yall should give it a try.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "eilonlav",
        "body": "Anyone tried their extra straight line? Mind writing a short review please?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Friendlycumdumpster",
        "body": "I’m new on this forum, is testing shampoo on the face a common practice? Because to me it sounds terrifying. Lol",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Alright_Fine",
        "body": "Thanks for the detailed review :). This is definitely going to be in my radar now.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "TankingHealer",
        "body": "Oh, if only this review had been out in September, when my local Marukai had the entire Diane brand on sale! Since I'm interested in changing hair products (I use Ahalo Butter, which is wonderful but I like to try new things), I really appreciate your review.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "mrshobutt",
        "body": "I'm always put off by their packaging but this seems to be exactly what my hair needs! Especially since I really liked the bonheur rose line! Thank you for the review :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Aikea_Guinea83",
        "body": "Im using this too an love it. A very good shampoo for a good price.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "beauty_ghetto",
        "body": "I have tried searching for the moist diane perfect beauty extra damage repair shampoo on dokodemo, but I can only find the botanical version. Can someone please help me out?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nazia_N",
        "body": "i buy this from teso for 11 dollar, its in queens flushing.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 22,
      "top_level": 22,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "1l5p6cp",
    "title": "Some nice an pure dimethyl cubane-1,4-dicarboxylate",
    "url": "https://www.reddit.com/r/chemistry/comments/1l5p6cp/some_nice_an_pure_dimethyl_cubane14dicarboxylate/",
    "score": 200,
    "num_comments": 44,
    "created": "2025-06-07T16:42:07+00:00",
    "body": "Confirmed by 1H- and 13C-NMR",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "pr0crasturbatin",
        "body": "Why do you have the flask outside?",
        "score": 62,
        "is_top_level": true
      },
      {
        "author": "DeliberateDendrite",
        "body": "Don't let Tom see this",
        "score": 57,
        "is_top_level": true
      },
      {
        "author": "Kiwi_Carbide",
        "body": "Make a polyester! React it with ethylene glycol!",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "Ellinikiepikairotita",
        "body": "What is the purity? What would you do with it?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Virtual-Feeling-43",
        "body": "The lack of tar is amazing",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Possible_Golf3180",
        "body": "Now you need to synthesise hypercubane",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Infernalpain92",
        "body": "That is very nice product",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Working_Row_6119",
        "body": "You made this in your laboratory?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "7df90s",
    "title": "[Review] Skinfood Black Sugar Perfect Cleansing Oil",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/7df90s/review_skinfood_black_sugar_perfect_cleansing_oil/",
    "score": 101,
    "num_comments": 30,
    "created": "2017-11-16T20:30:10+00:00",
    "body": "This isn't a new product (to me or the sub) but I rarely see it talked about, so I figured I would give it a review. I've been using this cleansing oil on and off for about 18 months.\n\n**Skin type:** I'm in my 30s, and my skin is generally oily (formerly dehydrated/oily), but has recently become a lot more dry due to the dry winter weather and prescription tretinoin use. My primary skin concerns run a wide gamut - I'm focused on anti-aging because of my age, but I also have acne, clogged pores, PIH, and melasma. My skin is very, very clog prone. Basically, my skin is a \"special snowflake\" that thinks the world should tremble in fear.\n\n**Location/weather:** I live in the Mid-Atlantic area of the US, so the weather is hot and humid in the summer, and cold and dry in the winter.\n\n**Other first cleansers I have tried:**\n\n* Heimish All Clean Balm\n* LJH Dr's Care Cleansing Oil\n* Whamisa Organic Flowers Cleansing Oil\n\nI have also, in the past, tried traditional OCM with mineral oil. It did not go well (lots of clogs), and in general, I now try to avoid cleansing oils with mineral oil in them, hence why I haven't tried some of the more popular cleansing oils on this sub. The LJH Dr's Care also contains mineral oil, and also didn't go over well with my skin.\n\nAnyway, onto the actual review.\n\n**Ingredients (copied from Ulta.com):** Ethylhexyl Palmitate, Peg-20 Glyceryl Triisostearate, Pentaerythrityl Tetraethylhexanoate, C12-15 Alkyl Benzoate, Pentaerythrityl Tetraisostearate, Peg-10 Isostearate, Bis-Ethoxydiglycol Cyclohexane 1,4-Dicarboxylate, Simmondsia Chinensis (Jojoba) Seed Oil, Olea Europaea (Olive) Fruit Oil, Oenothera Biennis (Evening Primrose) Oil, Macadamia Ternifolia Seed Oil, Limnanthes Alba (Meadowfoam) Seed Oil, Camellia Oleifera Seed Oil, Water, Fragrance, Dimethicone, Black Sugar Extract, Sodium Pca, Betaine, Threonine, Sorbitol, Proline, Lysine, Lepidium Meyenii Root Extract, Glutamic Acid, Arginine, Alanine, Butylene Glycol, Cholesterol, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Carica Papaya (Papaya) Fruit Extract, Serine, Glycine, Alcohol Denat., Rice Ferment Filtrate (Sake), Hydrogenated Lecithin, 1,2-Hexanediol, Phenoxyethanol, Ceramide Np, Sarcodon Aspratus Extract, Sucrose, Ethylhexylglycerin, Tocopheryl Acetate, Disodium Edta.\n\n**Price:** This oil cleanser is easily found on tons of websites. I most often buy from Amazon, and pay about $14-15 USD for a 200mL bottle.\n\n**Smell:** This oil smells *strongly* of lemon, with the faint hint of sugar. The smell is very noticeable on application, but once the cleanser is rinsed off, it dissipates completely. I happen to like the smell, but others may find it a little too reminiscent of Lemon Pledge.\n\n**Texture:** This cleansing oil seems rather thin - it seems to be slightly thinner and less viscous than vegetable oil. Sometimes this is annoying, as I have to use a little more oil than I'd like to really massage my face well without pulling my skin (3 pumps or so).\n\n**Cleansing Power:** In my opinion, this oil cleanser does a fantastic job with face makeup and sunscreen. It does not excel with waterproof eyeliner and mascara - it will remove some but not all waterproof eye makeup. I, however, do not like to use this on my eyes. I wear contact lenses and it always causes them to get milky, making it difficult to see. The cloudy residue lasts several hours. I do not know if this would impact someone who doesn't wear contacts. However, with face makeup and sunscreen, as well as with some superficial clogs, this oil cleanser does a great job. I sometimes, but not routinely, feel grits coming out of my skin. It does not help break up deeper clogs or closed-head blemishes.\n\n**Emulsification:** This stuff turns pretty darned white when mixed with water. I make sure to rinse all traces of it off my face so I don't see any of the cleanser, especially near my hairline. It emulsifies and rinses off easily, and doesn't leave any feeling of residue on my face. I always follow with a second cleanser, but I do not feel a film or greasiness with this cleanser. It also doesn't make my skin feel tight or dry - just clean.\n\n**Overall:** I really like this cleanser and have repurchased it many times. At the price point, it does what I need it to do. It breaks down the face makeup (Mac Studio Fix Fluid or Estee Lauder Double wear, topped with Innisfree powder) and my sunscreen (La Roche Posay Ultra Fluid). It rinses cleanly, and it is inexpensive and easy to find. I don't expect **any** cleanser to address aging concerns, or to meaningfully use acids. Any claims of brightening from a cleanser are probably worthless, since the product isn't on your face long enough to do any meaningful chemical exfoliation. This cleanser is best at what it does not do: it doesn't create new acne for me and it doesn't irritate my skin.\n\nIt is probably not my favorite of all oil cleansers. Right now that would be Whamisa, which is great, but expensive, and which also doesn't seem to penetrate pores as deeply as the Skinfood cleanser. Skinfood Black Sugar Perfect Cleansing Oil is a great choice that I will probably continue to buy it, especially since it's easy to get in the United States. I think it's an excellent pick for a first cleanser that isn't based on mineral oil, but only if you are not sensitive to fragrances.",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "sl33pl3ssn3ss",
        "body": "I like this one too but I depise its pump. More often than not the oil comes from around the pump than the pump itself. I transfered it to a dropper, much happier\n\n\n\nI found this one get out more grits than the kose speedy I used before and yes, took off that double wear. The extra oil in the makes it less drying than kose too.",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "Fluffcats",
        "body": "This was the first oil cleanser that I ever used when got into AB and it solidified my love for oil cleansing.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Away_She_Went",
        "body": "Great review! This is one of the first oil cleansers I tried (AB and in general) and I really liked it. Like someone else said I also had problems with the pump and how it dispensed product - I found mine leaked sometimes. \n\nThe one I'm currently using is the Rice Water Brightening Cleansing Oil from The Face Shop and it's comparable in performance, texture and after effect IMO. I think the fragrance in it is lighter as well :) If you're looking to try something new I would recommend!",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "fennbi",
        "body": "Love this product and have been using it for at least a year I think (this and the older version). Mostly wanted to comment on using it for eye makeup removal and me not wearing contacts. I use waterproof mascara and this product does a really good job removing it. Part of why I stayed with this oil is because it doesn't make my eyes sting when I use it to remove tight-lined eyeliner. The only problem I've had with it is some slightly blurry vision like you'll get with any liquidy product that's in your eyes, but even that effect seems to not be as present anymore since they updated the product.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "nailgirlblog",
        "body": "Dang, I'm kind of sad it doesn't smell caramel-y or sugary!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "ElderKingpin",
        "body": "I used to use this oil cleanser too, but I vibed more with the previous formulation, the new packaging came with a new formula and it wasn't doing much for my skin. I ended up switching to banila co's oil cleanser",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Lingb",
        "body": "Great review! I'm going through my first bottle and I absolutely love it! It makes my skin feel so plump and soft without the oiliness. I alternate between banila cleansing balm and this, and I always look forward to using it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mmmountaingoat",
        "body": "Would you recommend this to a guy? I don't exactly have to worry about makeup removal but my skin sounds really similar to yours, and I'm also dealing with the mid-Atlantic weather, so I'm wondering if it's worth trying",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Odd_Girl",
        "body": "Great review! I may have to give it a try. Btw, I love the description of your skin as a \"special snowflake\", cracked me up!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Sarahlorien",
        "body": "Nice review! Honestly, it kind of sounds like the effects I get from The Face Shop's light oil cleanser. It's the first oil cleanser I've used, and I also feel some grittiness, but I want to try something that gets a little deeper but I'm afraid to explore. I love a lot of things from skin food so this has me eager to try it!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "PMaggieKC",
        "body": "Do you think this is a no go for fragrance sensitivity? I'm not super sensitive, like I use the black sugar mask, but is it super fragranced?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "antmatech",
        "body": "Does the Whamisa oil cleanser emulsify? Why do You like it best? curious!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "cocoloaf",
        "body": "I am on my fourth bottle of this, it's just that good. It's great to travel with (I transfer the product into small Daiso containers) because it gets the job done of both removing makeup + cleansing. Getting kind of tired of the lemon scent though.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Kether_S",
        "body": "You sound like my skin twin! We even live in the same general area. Gonna keep an eye out for more reviews from you.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 14,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "crqy4l",
    "title": "[Guide] Comprehensive list of Daily Sheet Masks that come in resealable multipack form, with ingredients!",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/crqy4l/guide_comprehensive_list_of_daily_sheet_masks/",
    "score": 79,
    "num_comments": 6,
    "created": "2019-08-17T19:46:05+00:00",
    "body": "I've become concerned about the amount of waste generated from sheet masking, particularly when it comes to single-use plastics, so I decided to look into sheet masks packaged together in a resealable multipack for daily use. Here's a list of ever pack I could find with 30+ sheets per pack - please feel free to add onto this in the comments! This will continue to be updated whenever I come across another brand.\n\n**Fragrance Free, but may contain EOs:**\n\n* **Lululun Precious White (Anti-aging Brightening)**: Water, Glycerin, Propanediol, Ascorbyl Tetraisopalmitate, Tocopheryl Acetate, Hydrolyzed Hyaluronic Acid, Hydroxypropyltrimonium Hyaluronate, Carnosine, Persea Gratissima (Avocado) Oil, Prunus Armeniaca (Apricot) Kernel Oil, Euterpe Oleracea Fruit Extract, Hylocereus Undatus Fruit Extract, Peg-40 Hydrogenated Castor Oil, Xanthan Gum, Citric Acid, Sodium Citrate , Disodium Edta, Phenoxyethanol, Methylparaben, Butylene Glycol\n* **Lululun Precious Green (Anti-aging L22 Complex):** Water, squalene, macadamia nut fatty acid phytosteryl, phytosterols, tocopherol, cocoyl hydrolyzed collagen K, α-glucan oligosaccharide, Saccharomyces / Gray wheat seed fermentation solution, plankton extract, arginine ferulic acid, polyglyceryl isostearate-10, xanthan gum, citric acid, Na citrate, phenoxyethanol, methyl paraben\n* **Lululun Precious Red (Anti-aging Rice Extract):** Water, Glycerin, Propanediol, Peg/ppg/polybutyleneglycol-8/5/3 Glycerin, Oryza Sativa (Rice) Bran Oil, Camellia Japonica Seed Oil, Glycosphingolipids, Hydrogenated Lecithin, Lysolecithin, Sodium Hydroxide, Pyrus Cydonia Seed Extract, Oryza Sativa (Rice) Bran Extract, Hydrolyzed Rice Extract, Prunus Mume Fruit Extract, Oryza Sativa (Rice) Lees Extract, Yeast Extract, Sorbitol, Polyglyceryl -10 Isostearate, Xanthan Gum, Citric Acid, Sodium Citrate , Phenoxyethanol, Methylparaben, Butylene Glycol\n* **Lululun White (Whitening):** Water, Glycerin, Propanediol, Ascorbyl Glucoside, Ascorbyl Tetraisopalmitate, Panthenol, Tocopherol, Retinyl Palmitate, Arachis Hypogaea (Peanut) Oil, Squalane, Hydrogenated Lecithin, Sorbitol, Dipotassium Glycyrrhizate , Biosaccharide Gum-1, Echinacea Purpurea Extract, Thymus Serpyllum Extract, Prunus Yedoensis Leaf Extract, Vaccinium Myrtillus Leaf Extract, Peg-40 Hydrogenated Castor Oil, Xanthan Gum, Disodium Edta, Potassium Hydroxide, Citric Acid, Sodium Citrate, Phenoxyethanol, Methylparaben, Butylene Glycol\n* **Lululun Pink (Moisture Balance):** Water, Glycerin, Propanediol, Sodium Pca, Dipotassium Glycyrrhizate, Ectoin, Alpha-glucan Oligosaccharide, Honey, Citrus Reticulata (Tangerine) Peel Extract, Aloe Barbadensis Leaf Extract, Passiflora Edulis Fruit Extract, Peg-40 Hydrogenated Castor Oil, Xanthan Gum, Citric Acid, Sodium Citrate, Phenoxyethanol, Methylparaben, Butylene Glycol,\n* **Lululun Blue (Intensive Moisture):** Water, Glycerin, Propanediol, Polyquaternium-51, Glycosyl Trehalose, Hydrogenated Starch Hydrolysate, Glyceryl Glucoside, Sodium Pca, Hydroxypropyltrimonium Hyaluronate, Hydrolyzed Viola Tricolor Extract, Hydrolyzed Adansonia Digitata Extract, Carbomer, Cymbopogon Schoenanthus Leaf/stem Extract, Malva Sylvestris (Mallow) Flower Extract, Peg-40 Hydrogenated Castor Oil, Xanthan Gum, Citric Acid, Sodium Citrate, Phenoxyethanol, Methylparaben, Butylene Glycol,\n* **Hada Labo Koi-Gokujyun Perfect White Mask**: Water,, butylene glycol,, glycerin,, diglycerin,, propylene glycol,, niacinamide,, 3-O-ethyl ascorbic acid,, tocopherol,, sodium hyaluronate,, hydrolyzed hyaluronic acid (nano hyaluronic acid),, hydrolyzed jojoba esters,, ratzillacosme.com do.not.copy,, tremella fuciformis polysaccharide,, PPG-10 methyl glucose ether,, acrylates/C10-30 alkyl acrylate crosspolymer,, ethylhexylglycerin,, disodium EDTA,, citric acid,, polyglyceryl-10 laurate,, methyparaben, phenoxyethanol.\n* **Hada Labo Koi-Gokujyun Perfect Mask (Gold):** Water,, butylene glycol,, glycerin,, diglycerin,, hydrolyzed hyaluronic acid (nano hyaluronic acid),, sodium acetylated hyaluronate (super hyaluronic acid),, sodium hyaluronate,, hydroxypropyltrimonium hyaluronate,, squalane,, glucosyl ceramide,, aphanothece sacrum exopolysaccharides,, polyglyceryl-10 isostearate,, ratzillacosme.com do.not.copy,, hydrogenated poly(C6-12 olefin),, phenoxyethanol,, methylparaben,, pullulan,, PEG-8,, xanthan gum,, disodium EDTA,, acrylates/C10-30 alkyl acrylate crosspolymer,, triethanolamine,, alpha-glucan.\n* **Hado Labo Koi-Gokujyun 3D Perfect Mask**: Water,, glycerin,, butylene glycol,, squalane,, PPG-6-decyltetradeceth-30,, sodium hyaluronate crosspolymer,, sodium acetylated hyaluronate,, hydrolyzed sodium hyaluronate,, ratzillacosme.com do.not.copy,, hyaluronic acid,, hydrolyzed collagen,, glucosyl ceramide,, beheneth-5,, phytosteryl/behenyl/octyldodecyl lauroyl glutamate,, carbomer,, tocopheryl acetate,, disodium EDTA,, xanthan gum,, triethanolamine,, lactobacillus/oryza sativa (rice) ferment,, maltitol,, dextrin,, arginine,, pentylene glycol,, phenoxyethanol,, methylparaben,, propylparaben.\n* **Hada Labo Shirojyun Cooling Jelly Sheet Mask:** Water, DPG, glycerin, ethanol, hyaluronic acid Na, hydrolyzed hyaluronic acid (nano-ized hyaluronic acid), ascorbyl glucoside (vitamin C derivative), hamamelis leaf extract, BG, gellan gum, polyquaternium-51, black pepper oil, menthol, xanthan gum , Carbomer, EDTA-2Na, PG, hydroxylated K, polysorbate 20, phenoxyethanol, methyl paraben… or in other words, Water,, dipropylene glycol,, glycerin,, alcohol,, sodium hyaluronate,, hydrolyzed hyaluronic acid,, ascorbyl glucoside,, hamamelis virginiana (witch hazel) leaf extract,, butylene glycol,, gellan gum,, polyquaternium-51,, mentha piperita (peppermint) oil,, menthol,, xanthan gum,, carbomer,, disodium EDTA,, propylene glycol,, potassium hydroxide,, polysorbate 20,, phenoxyethanol,, methylparaben.\n* **Kose Clear Turn Babyish Precious Ultra Rich Moisture Mask (Pink):** Water,, butylene glycol,, dipropylene glycol,, glycerin,, PPG-10 methyl glucose ether,, glycosyl trehalose,, hydrogenated starch hydrolysate,, chamomilla recutita (matricaria) extract,, perilla ocymoides leaf extract,, salvia officinalis (sage) leaf extract,, sodium hyaluronate,, polyquaternium-51,, prunus persica (peach) leaf extract,, rosmarinus officinalis (rosemary) leaf extract,, disodium EDTA,, PEG-8,, ratzillacosme.com do.not.copy,, acrylates/C10-30 alkyl acrylate crosspolymer,, glycerylamidoethyl methacrylate/stearyl methacrylate copolymer,, PEG-50 hydrogenated castor oil isostearate,, xanthan gum,, diglycerin,, triethylhexanoin,, sodium hydroxide,, phenoxyethanol.\n* **Kose Clear Turn Babyish Precious Ultra Rich White Mask (Blue):** Water,, butylene glycol,, dipropylene glycol,, glycerin,, PPG-10 methyl glucose ether,, chamomilla recutita (matricaria) extract,, glycosyl trehalose,, perilla ocymoides leaf extract,, salvia officinalis (sage) leaf extract,, coix lacryma-jobs tears oil,, prunus persica (peach) leaf extract,, saxifraga sarmentosa extract,, rosmarinus officinalis (rosemary) leaf extract,, ratzillacosme.com do.not.copy,, disodium EDTA,, PEG-8,, acrylates/C10-30 alkyl acrylate crosspolymer,, PEG-50 hydrogenated castor oil isostearate,, xanthan gum,, diglycerin,, triethylhexanoin,, hydrogenated starch hydrolysate,, sodium hydroxide,, phenoxyethanol.\n* **Kose Clear Turn Babyish Precious Oil-In-Milky Lustrous Plumping (Yellow/Gold):** Water, BG, ethanol, glycerin, triethylhexanoin, water hydrogenated polydecene, ascorbic acid sulfate 2 Na, alganiaspinosa kernel oil, cysteine, cinnamyl Ascorbic tetrahexildecane acid, tocopherol, Baobab seed oil, palmitate, hyaluronic acid PG, saxifraga sarmentosa extract, spring water, hydrolyzed conchiolin, crosspolymer (acrylates / acrylic acid alkyl (C10-30)), oleic acid cholesteryl, xanthan gum, coconut oil, sodium hydroxide, hydrogenated lecithin , Phenoxyethanol, methylparaben\n* **Kose Clear Turn Coenzyme Q10:** Water, BG, Glycerin, Ethanol, Triethylhexanoin, Hydrogenated Polydecene, Sodium PCA, Serine, Ubiquinone, Hot Spring Water, Acrylates/C10-30 Aklyl Acrylate Crosspolymer, Xanthane Gum, Cholesterol, Propylene Glycol Dicaprate, Sodium Hydroxide,Hydrogenated Lecithin, Sodium Lactate, Phenoxyethanol, Methylparaben\n* **Kose Clear Turn Essence Collagen:** [https://www.skincarisma.com/products/kose/clear-turn-essence-mask-collagen/ingredient\\_list](https://www.skincarisma.com/products/kose/clear-turn-essence-mask-collagen/ingredient_list)\n* **Kose Clear Turn Essence Hyaluronic Acid:** Water,, butylene glycol,, glycerin,, dipropylene glycol,, PEG-8,, ratzillacosme.com do.not.copy,, glycosyl trehalose,, sodium hyaluronate,, laminaria japonica extract,, PEG-50 hydrogenated castor oil isostearate,, citric acid,, sodium citrate,, triethylhexanoin,, hydrogenated starch hydrolysate,, methylparaben.\n* **Kose Clear Turn Essence Vitamin C:** Active: Ascorbyl Glucoside, Inactive: Water,, butylene glycol,, dipropylene glycol,, glycosyl trehalose,, hydrogenated starch hydrolysate,, algae extract,, ratzillacosme.com do.not.copy,, disodium EDTA,, citric acid,, sodium citrate,, triethylhexanoin,, sodium hydroxide,, glycerin,, methylparaben.\n* **Kose Clear Turn Essence Placenta:** Water, BG, Glycerin, DPG, PCA-Na, Panthenol, Placenta Extract (Salmon), Hot Spring Water, EDTA-2Na, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, PEG-50 Hydrogenated Castor Oil Isostearate, Xanthane Gum, Triethylhexanoin, Sodium Hydroxide, Phenoxyethanol, Methylparaben.\n* **Kose Clear Turn Essence Tranexamic Acid:** Tranexamic Acid + Purified Water, 1.3-Butanediol, L-Theanine, Mixed Solution of Glycosyl Trehalose and Hydrogenated Starch Hydrolysate, Seaweed Extract (1), Disodium Edetate, Sodium Citrate, Sodium Metabisulfite, Sodium Dihydrogen Phosphate, Water, Concentrated Glycerine, Methylparaben\n* **Kose Clear Turn Medicated Whitening (white bag)**: Tranexamic Acid + Purified Water, 1.3-Butylene Glycol, Concentrated Glycerin, Ethanol, L-Serine, Astaxanthin Solution, Sodium Hyaluronate (2), Water Soluble Collagen Solution (A), Natural Vitamin E, 2-Cetyl Ethylhexanoate, Polyoxyethylene Hydrogenated Castor Oil, Sodium Edetate, Carboxy Vinyl Polymer, Xanthane Gum, Caprylic/Capric Triglyceride, Sodium Metabisulfite, Potassium Dihydrogen Phosphate, Sodium Hydroxide, Phenoxyethanol, Methylparaben\n* **Kose Clear Turn 100% Made In Japan Rice Mask EX (light blue bag):** Water,, dipropylene glycol,, butylene glycol,, glycerin,, alcohol,, argania spinosa kernel oil,, oryza sativa (rice) bran extract,, rice ferment filtrate (sake),, tocopherol,, limnanthes alba (meadowfoam) seed oil,, ubiquinone,, hydrolyzed rice extract,, hydrolyzed rice bran extract,, ratzillacosme.com do.not.copy,, disodium EDTA,, PEG-20 hydrogenated castor oil,, xanthan gum,, di-C12-15 pareth-8 phosphate,, cetearyl alcohol,, sorbeth-30 tetraoleate,, polysorbate 80,, mineral oil,, disodium phosphate,, sodium phosphate,, ethylparaben,,  phenoxyethanol,, methylparaben.\n* **Kose Clear Turn Hada Fukkura/Plumping (red bag):** Water, BG, Glycerin, Ethanol, Astaxanthin, Serine, Tocopherol, Retinol Palmitate, Sodium Hyaluronate, Haematococcus Pluvialis Extract, Hydrolyzed Elastin, Water Soluble Collagen, EDTA-2Na、Acrylates/C10-30 Aklyl Acrylate Crosspolymer, PEG-50 Hydrogenated Castor Oil Isostearate, Cetyl Ethylhexanoate, Xanthane Gum, Caprylic/Capric Triglyceride, Peanut Oil, Sodium Hydroxide, Phenoxyethanol, Methylparaben\n* **Kose Clear Turn Ultra-Concentrated Moisturizing Mask EX:** Water · DPG · BG · glycerin · ethanol · argania spinosa core oil · serine · tocopherol · hyaluronic acid Na · polyquaternium-51 · meadowfoam oil · ubiquinone · water soluble collagen · EDTA-2Na · PEG-20 hydrogenated castor oil · Cetearyl alcohol · tetraoleate sorbes-30 · polysorbate 80 · mineral oil · phosphoric acid 2Na · phosphoric acid Na · phenoxyethanol · methylparaben\n* **Kracie Hadabisei All In One Moisturizing:** Too lazy to type, photo here: [https://i.imgur.com/2baifTt.png](https://i.imgur.com/2baifTt.png)\n* **Kracie Hadabisei All In One Brightening:** Too lazy to type, photo here: [https://i.imgur.com/E5bAH4D.png](https://i.imgur.com/E5bAH4D.png)\n* **Sana Namerakahonpo Moist Sheet Mask (red Soy Milk package I think?):** Water,, glycerin,, butylene glycol,, alcohol,, diglycerin,, soymilk ferment filtrate,, glycine soja (soybean) extract,, glycine soja (soybean) protein,, dipotassium glycyrrhizate,, ratzillacosme.com do.not.copy,,\\&nbsp;styrene/acrylates copolymer,,\\&nbsp;PEG-60 hydrogenated castor oil,, xanthan gum,, citric acid,, sodium citrate,,\\&nbsp;bis-ethoxydiglycol cyclohexane 1,4-dicarboxylate,, betaine,,\\&nbsp;phenoxyethanol,, methylparaben…..Water, glycerin, BG, ethanol, diglycerin, soymilk fermented liquid, soybean seed extract, soy protein, glycyrrhizinic acid 2K, (styrene / acrylate) copolymer, PEG-60 hydrogenated castor oil, xanthan gum, citric acid, citric acid sodium, Cyclohexane-1,4-dicarboxylic acid bisethoxydiglycol, betaine, phenoxyethanol, methyl paraben\n* **Quality First All in One Sheet Mask White EX:** Water, BG, DPG, glycerin, placenta extract, ascorbyl phosphate Mg, lecithin, arbutin, linoleic acid, linolenic acid, linolenic acid, tocopherol acetate, ascorbyl palmitate, glutathione, PEG-60 hydrogenated castor oil, xanthan gum, damask rose flower oil, Ethyl hexyl glycerin, anisic acid Na, citric acid, citric acid Na, ioite diquay oil, palma rosa oil, lavender oil, grapefruit peel oil, rosemary oil\n* **Quality First All in One Sheet Mask The Best EX:** Water, BG, Glycerin, DPG, Betaine, Ectoine, Ascorbyl Mg Phosphate, Hydrolyzed Silk, Platinum, Hyaluronate Na, Succinyl Atelocollagen, Water Soluble Proteoglycan, Chamomile Flower Extract, Trichoderma Extract, Fern Root Extract, Tea Leaf Extract , Japanese apricot root extract, rosemary leaf extract, aubergine extract, aubergium extract, hydrolysed yeast, hydrolysed yeast extract, clematis leaf extract, aubergine extract, aubergine extract, apricot leaf / stem extract, aubergine flower extract, hydrogenated Lecithin, soybean sterols, ceramide 3, Roman chamomile flower extract, Anchovy flower extract, cornflower flower extract, St. John's flowers / leaf / stems extract, Hypsizygusa flower extract, Bilberry fruit extract, sugar cane extract, sugarcane extract Extract, orange fruit extract, lemon fruit extract, water soluble collagen, aloe vera leaf extract, chlorella extract, cuckon extract, human oligopeptide-1, polysorbate 80, PEG-60 hydrogenated castor oil, xanthan gum, arnica flower extract, cucumber fruit Extract, zinnia flower extract, parietalia extract, Sinia ticosa flower extract, garlic extract, burdock root extract, red clover flower / leaf / stem excis, watercress leaf / stem extract, Scots pine stem extract, mannitol, ethylhexylglycerin, anise Acid Na, Citric Acid, Citric Acid Na, Damask rose flower oil, Miotenjikuaoi oil, Palmarosa oil, Lavender oil, Grapefruit peel oil, Rosemary oil\n* **Sun Smile - Pure Smile Essence Mask:** GreenWater, Glycerin, Methylpropanediol, Hydroxyacetophenone, 1,2-Hexanediol, Trehalose, Arginine, Carbomer, Xanthan gum, Allantoin, PEG-60 hydrogenated castor oil, Dimethicone, Isohexadecane, BG, Polymethylsilsesquioxane, EDTA-2Na, flavor, menthol, cetearyl methicone, sodium hyaluronate, tocopherol acetate, octyldodecanol, seawater, hydrogenated lecithin, PEG-40 stearate, steareth-2, steareth-21, ceramide NP, cullin extract, figs Fruit extract, Papaya fruit extract, Magou fruit extract, Edelweiss extract, Hydrolyzed hyaluronic acid, Polyglutamic acid, Saccharomyces fermented extract of Saccharomyces persimmon, Caprilyl glycol, Lactobacillus / Soybean fermented extract, Saccharomyces fermented root extract, Hydrolyzed collagen , Ethylhexylglycerin, citric acid, benzoic acid Na, sorbic acid K\n* **Sun Smile - Pure Smile Essence Mask (Blue):** Water, glycerin, methylpropanediol, hydroxyacetophenone, 1,2-hexanediol, trehalose, arginine, carbomer, xanthan gum, allantoin, PEG-60 hydrogenated castor oil, dimethicone, isohexadecane, BG, polymethylsilsesquioxane, EDTA-2Na, flavor, cetearyl methicone, octyl dodecanol, hyaluronate Na, tocopherol acetate, seawater, hydrogenated lecithin, ceramide NP, stearic acid PEG-40, steareth-2, steareth-21, karin extract, fig fruit extract , Papaya fruit extract, Magwa fruit extract, Edelweiss extract and others\n\n**Containing Fragrance:**\n\n* **Missha Green Tea Daily Sheet Mask Soothing:** Water, Glycerin , Dipropylene Glycol, Camellia Sinensis Leaf Extract, Betaine, Allantoin, Xanthan Gum, Disodium EDTA, Arginine, Carbomer, C12-14 Pareth-12, Caprylyl Glycol, Ethylhexylglycerin, Centella Asiatica Extract, Portulaca Oleracea Extract, Citrus Grandis (Grapefruit) Seed Extract l, Bambusa Vulgaris Leaf/Stem Extract , Aloe Barbadensis Leaf Extract , Melaleuca Alternifolia (Tea Tree) Leaf Extract , Propanediol, Butylene glycol, Illicium Verum (Anise), Fruit Extract, 1,2-Hexanediol, Sodium Hyaluronate, Fragrance\n* **Missha Black Tea Daily Sheet Mask Hydrating:** Water, Glycerin, Dipropylene Glycol, Camellia Sinensis (Black Tea) Leaf Extract, Betaine, 1,2-Hexanediol, Centella Asiatica (Gotu Kola) Extract, Portulaca Oleracea (Green Purslane) Extract, Citrus Grandis (Grapefruit) Seed Extract, Caprylyl Glycol, Allantoin, Citrus Limon (Lemon) Fruit Extract, Punica Granatum (Pomegranate) Extract, Hibiscus Sabdariffa (Roselle) Flower Extract, Arginine, Carbomer, C12-14 Pareth-12, Ethylhexylglycerin, Xanthan Gum, Disodium EDTA, Theobroma Cacao (Cocoa) Extract, Sodium Hyaluronate, Butylene Glycol, Illicium Verum (Anise) Fruit Extract, Propanediol, Fragrance\n* **Apieu Nonco Mastic Daily Sheet Mask:** Water, Glycerin, Dipropylene Glycol, Centella Asiatica Extract, Butylene Glycol, Betaine, Allantoin, Propanediol, Illicium Verum (Anise) Fruit Extract, Citrus Grandis (Grapefruit) Seed Extract  , Althaea Rosea Root Extract , Aloe Barbadensis Leaf Extract, 1,2-Hexanediol, Carbomer, Arginine, C12-14 Pareth-12, Caprylyl Glycol, Sodium Hyaluronate, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Ethylhexylglycerin,  Vigna Radiata Seed Extract   , Bifida Ferment Lysate, Lactobacillus Ferment Lysate, Lactococcus Ferment Lysate, Saccharomyces Lysate, Pistacia Lentiscus (Mastic) Gum  , PEG-60 Hydrogenated Castor Oil, Phenoxyethanol, Disodium EDTA, Xanthan Gum, Gluconolactone  , Fragrance\n* **Missha Hyaluthione Daily Sheet Mask - found 2 different lists online:** a) Purified Water, Glycerin, Dipropylene glycol, Sodium Hyaluronate Crosspolymer, Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Hyaluronic Acid, Betaine, C12-14 pareth-12, Aloe Vera, T.E.A, Arginine, Carbomer, Ethylhexylglycerin, Xanthan Gum, Disodium Edetate, Butylene Glycol, Star Anise, Propanediol, Glutathione, Benzyl Glycol, Raspberry Ketone, Phenoxyethanol, Fragrance , 1,2 - Celadrin, Philippine orange extract, Chestnut bulgarius leaf / stem extract, hydrolized diglycosaminoglycan----- b) Purified Water, Glycerin, Dipropylene Glycol, Sodium Hyaluronate Crosspolymer , Sodium hyaluronate , Hydrolyzed Hyaluronic Acid , Hyaluronic Acid , Glutathione, Butylene glycol, Phenoxyethanol, Ethylhexylglycerin, Betaine, 1,2-Hexanediol, Centella Asiatica Extract, Portulaca Oleracea Extract, Citrus Grandis (Grapefruit) Seed Extract   , Caprylyl Glycol, Allantoin, C12-14 Pareth-12, Citrus Nobilis (Mandarin Orange) Fruit Extract , Bambusa Vulgaris leaf/Stem Extract, Aloe Barbadensis Leaf Extract, Melaleuca Alternifolia (Tea Tree) Leaf Extract   , Arginine, Carbomer, Xanthan Gum, Disodium EDTA, Illicium Verum (Anise) Fruit Extract, Hydrolyzed Glycosaminoglycans, Benzyl Glycol, Raspberry Ketone, Fragrance\n* **Missha Pong Dang Water Daily Mask:** Aqua, Propanediol, Sodium Hyaluronate, Betaine, Piper Methysticum Leaf / Root / Stem Extract, Allantion, C12-14 Pareth-12, Aloe Barbadensis Leaf Extract, Centella Asiatica Extract, Illicium Verum (Anise) Fruit Extract, Arginine, Carbomer , Caprylyl Glycol, Adamsonia Digitata Leaf Extract, Chamaecyparis Obtusa Leaf Extract, Portulaca Oleracea Extract, Butylene Glycol, 1,2-Hexanediol, Ethylhexylglycerin, Xanthan Gum, Disodium EDTA, Fragrance (Parfum)\n* **Dewytree Pick and Quick Refreshing Aqua Mask:** Water, Glycerin, Methylpropanediol, 1,2-Hexanediol, Sodium Hyaluronate, Sodium Acetylated Hyaluronate, Hydrolyzed Hyaluronic Acid, Lactobacillus/Soybean Ferment Extract, Lactobacillus/Rice Ferment, Lactobacillus/Ginseng Root Ferment Filtrate, Saccharomyces/Coix Lacryma-Jobi Ma-yuen Seed Ferment Filtrate, Saccharomyces/Potato Extract Ferment Filtrate, Olea Europaea (Olive) Fruit Oil, Butyrospermum Parkii (Shea) Butter, Hydrogenated Lecithin, Squalane, Cholesterol, Ceramide NP (Ceramide 3), Phytosphingosine, Acetyl Glucosamine,  Sodium Polyglutamate, Musa Sapientum (Banana) Fruit Extract, Caprylic/Capric Triglyceride, Propanediol, Fructan, Allantoin, Trehalose, Arginine, Glycolic acid, Hydroxyacetophenone, Tocopheryl Acetate, Carbomer, Xanthan gum, Polyglyceryl-10 Laurate, Citric Acid, Sodium Citrate, Disodium EDTA, Fragrance\n* **Etude House 3-Minutes Care Mask In The Morning - Pumpkin:** Water, Butylene Glycol, 1,2-Hexanediol, Pentylene Glycol, Phenoxyethanol, Betaine, Alcohol, PEG-60 Hydrogenated Castor Oil, Xanthan Gum, Panthenol, Ethylhexylglycerin, Allantoin, Disodium EDTA, Dipotassium Glycyrrhizate, Sodium Hyaluronate, Cucurbita Pepo (Pumpkin) Fruit Extract, Fragrance, Glycerin\n* **The Face Shop Daily Green Tea Face Mask:** Water, propanediol, glycerin, 1-2 hexanediol, betaine, allantoin, carbomer, arginine, peg 60 hydrogenated castor oil,, caprylyl glycol, citrus grandis seed extract, butylene glycol, centella extract, portulaca extract, ethylhexylglycerin, xanthan gum, disodium edta camellia sinensis leaf extract, aloe leaf extract, sodium hyaluronate, illicium verum fruit extract, fragrance\n* **Madeca21 Tecasol Sheet mask (2 sets of ingredients, don't know which is right):** a) Purified water, glycerin, dipropylene glycol, 1,2-hexanediol, betaine, erythritol, centella extract, butylene glycol, purslane extract, allantoin, trehalos, tangerine seed extract, carbomer, tromethamine, caprylyl glycol, propanediol, stanis extract, disodium ethane, C12-14 parse-12, ethylhexyl Glycerin, Asiaticoside, Asiantic Acid, Madecaic Acid, Xanthan Gum, Glycine, Serine, Glutamic Acid, Aspartic Acid, Leucine, Alanine, Lysine, AlginNin, tyrosine, phenylalanine, threonine, proline, valine, isoleucine, histidine, methionine, cysteine, palmitoylpentapeptide-4, acetylhexapeptide-8, copper peptide-1, Olive Tree Leaf Extract, Lavender Extract, Orange Extract, Scented Geranium Extract, Sunflower Seed Extract, Fragrance-------- b) Centella asiatica extract, Purified water, Glycerin, Dipropylene glycol, 1,2-hexanediol, Cranberry seed extract, Stanisian extract, Carbomer, Tromethamine, Caprylyl glycol, Propanediol, C12-14 Palace -12, asiaticoside, asiatic acid, madecaic acid, disodium ethane, fragrance\n* **MAYBENA Multiple Intensive Moisture Mask:** Purified water, butylene glycol, glycerin, panthenol, 1,2-hexanediol, xanthan gum, green tea extract, ginger extract, Spanish licorice root extract, Schisandra chinensis extract, rye root extract, dipropylene glycol, ethylhexyl glycerin, Allantoin, hydroxyethyl cellulose, sodium hyaluronate, disodium ethane, dipotassium glycyriate, polyglyceryl-10 laurate, polyglyceryl-10 mysteryte, capryl glycol, ka Prilic / Capric Triglycerides, Hydrogenity Lecithin, Ceramide NP, Cholesterol, Tea Tree Leaf Extract, Hydrolyzed Hyaluronic Acid, Fragrance, Acetylhexapeptide-8, Cappertripeptide-1, Sodium Acetyl Ray Tied hyaluronate, palmitoylpentapeptide-4\n* J**ayJun So Cool Mask**: Purified water, erythritol, ethanol, methylpropanediol, glycerin, triethyl citrate, dipropylene glycol, caprylic / capric triglyceride, butylene glycol, hydrogenated lethicin, xanthan gum, sclerotium gum, beta- Glucan, Grapefruit Extract, Mung Bean Seed Extract, Manchurian Birch Bark Extract, White Root Extract, Sodium Hyaluronate, Bovine Cactus Stem Extract, Wheat Bran Extract, Sugar Cane Extract, Marshmallow Root Extract, Centella Extract, Ethyl Mentan Carboxamide , Bergamot oil, Eucalyptus leaf oil, Sunflower seed oil, Scented geranium flower oil, Lithium magnesium sodium silicate, Polyglyceryl-10 oleate, Carbomer, Acrylate / C10-30 Alkyl acrylate crosspolymer, Disodium EDTA, Tromethamine\n* **Dr Packer Only 5 Minutes Daily Mask:** Water, Methylpropanediol, Glycerin, Camellia Sinensis Leaf Extract, Jasminum Officinale (Jasmine) Flower Extract, Riboflavin, Folic Acid, Niacinamide, Pyridoxine Hcl, Thiamine Hcl, Inositol, Tryptophan, Glycine, Methionine, Histidine Hcl, Serine, Calcium Chloride, Cystine, Phenylalinine, Arginine Hcl, Valine, Threonine, Tyrosine, Isoleucine, Leucine, Sodium Pyruvate, Lysine Hcl, Sodium Phosphate, Potassium Chloride, Glucose, Sodium Bicarbonate, Sodium Chloride, 1,2-Hexanediol, Paeonia Suffrutinesin, Hydroxyacetophenone, Disodium Edta, Fragrance.\n* **Lirikos Marine Energy Easy Mask:** Purified water, ethanol, butylene glycol, dipropylene glycol, 1,2-hexanediol, pentylene glycol, phenoxyethanol, Fiji-60 hydrogenated castor oil, allantoin, panthenol, arginine, Disodium ethane, ethylhexyl glycerine, carbomer, dipotassium glycylizate, fragrance, leaf extract, menthol, sodium hyaluronate, apple extract, alteromonas fermented extract, oxygen\n* **Saborino Morning Mask (Fresh White, Fruity Herbal, Grapefruit, Mixed Berries, Green Mandarin, etc- Ingredients may differ per variety):** Water, Glycerin, BG, Ethanol, Ascorbyl Glucoside, Avocado Extract, Orange Oil, Cucumber Fruit Extract, Grapefruit Peel Oil, Chrysanthemum Polysaccharide, Aphalic Leaf Extract, Tea Tree Leaf Oil, Honey, Hyaluronate Na, Betaine, Water Soluble Collagen , PEG-60 hydrogenated castor oil, sodium acetyl hyaluronate, xanthan gum, citric acid, sodium citrate, menthol, malic acid, phenoxyethanol, ethyl paraben, methyl paraben, perfume\n* **Saborino Night Mask:** Water, Glycerin, Propanediol, Diglycerin, PPG-14 Polyglyceryl-2 Ether, Ascorbyl Glucoside, Izayoibara Extract, Orange Oil, Chamomile Flower Extract, Glycyrrhizin Acid 2K, Sphingomonas Culture Extract, Silver Leaf Extract, Honey, Hyaluronic Acid Na , Betaine, jojoba seed oil, polyquaternium-61, evening primrose seed extract, lavender flower extract, wild thyme extract, water soluble collagen, peat extract, (Eicosan diacid / tetradecanedioic acid) polyglyceryl-10, BG, PEG-60 water Castor oil, ethanol, xanthan gum, citric acid, sodium citrate, cyclohexane-1, 4-dicarboxylic acid bisethoxy diglycol, menthol, malic acid, tocopherol, phenoxyethanol, ethyl paraben, methyl paraben, perfume\n* **Stella Seed - Botanical Esthe Sheet Mask (3 types) - Ingredients may vary based on type:** Water, BG, Glycerin, Ethanol, Rosemary Leaf Extract, Sage Leaf Extract, Lavender Flower Extract, Hawthorn Fruit Extract, Scutellaria Flower / Leaf Extract, Achillea Millifolium Extract, Caninaba Fruit Extract, Bilberry Fruit Extract, Sugar Cane Extract, Sugar Maple Extract , Orange fruit extract, lemon fruit extract, arch chalk leaf extract, aloe vera leaf extract, avocado extract, honey, mint leaf oil, argania spinosa kernel oil, coconut oil, rosehip oil, hyaluronic acid Na, ascorbic acid palmitate 3 Na Hydrolysed collagen, malic acid, menthol, carbomer, betaine, sodium citrate, polysorbate 80, phenoxyethanol, methyl paraben, perfume\n* **pdc - Liftarna Concentrate Face Mask:** Water,, butylene glycol,, alcohol,, glycerin,, cynara scolymus (artichoke) leaf extract,, retinyl palmitate,, soluble collagen,, glycine soja (soybean) seed extract,, ascorbyl glucoside,, trisodium ascorbyl palmitate phosphate,, aminopropyl ascorbyl phosphate,, ratzillacosme.com do.not.copy,, vaccinium myrtillus fruit extract,, saccharum officinarum (sugar cane) extract,, acer saccharum (sugar maple) extract,, citrus aurantium dulcis (orange) fruit extract,, citrus limon (lemon) fruit extract,, zea mays (corn) oil,, zea mays (corn) oil,, PEG-60 hydrogenated castor oil,, xanthan gum,, polysorbate 80,, citric acid,, sodium citrate,, phenoxyethanol,, methylparaben,, fragrance\n* **Kose Clear Turn Princess Veil Mask Whitening (Black):** Water, DPG, BG, ethanol, endomyces / sodium hyaluronate fermented solution, kiwi extract, glycine, ascorbyl tetrahexyldecanoate, tocopherol, cottonseed extract, hamamelis leaf extract, hyaluronan sodium, button extract, hot spring water, water soluble collagen , Soymilk fermented liquid, EDTA-2Na, PEG-10 methyl ether dimethicone, PEG-60 hydrogenated castor oil, citric acid, sodium citrate, glycerin, di (C12-15) palace-8 phosphate, diphenylsiloxyphenyl trimethicone Sorbitan sesquioleate, lactic acid, sodium lactate, ethyl paraben, phenoxyethanol, methyl paraben, perfume\n* **Kose Clear Turn Princess Veil Mask Anti-Aging Care (Dark Pink):** Water, BG, DPG, glycerin, ethanol, perilla seed oil, ascorbyl tetrahexyldecanoate, tocopherol, retinol palmitate, sodium hyaluronate, ubiquinone, hydrolysed elastin, water-soluble collagen, EDTA-2Na, (acrylates / alkyl acrylates C10-30)) Crosspolymer, PEG-50 hydrogenated castor oil isostearate, cetyl ethylhexanoate, xanthan gum, corn oil, squalane, sodium hydroxide, sodium hydroxide, phenoxyethanol, methyl paraben, perfume\n* **Kose Clear Turn Princess Veil Mask Ultra-Rich Moisture (Light Pink):** Water · DPG · BG · ethanol · glycerin · endomyces / sodium hyaluronate fermented liquid · glycine · tocopherol · honey · cotton seed extract · Hamameris leaf extract · hyaluronic acid Na · button extract · polyquaternium-51 · hot spring water · water soluble collagen・ Soy milk fermented liquid ・ EDTA-2Na ・ PEG-10 methyl ether dimethicone ・ PEG-60 hydrogenated castor oil ・ isotridecyl isononanoate ・ citric acid ・ citric acid ・ citric acid Na ・ di (C12-15) palace-8 phosphate ・ diphenylsiloxyphenyl Trimethicone, sorbitan sesquioleate, lactic acid, sodium lactate, ethyl paraben, phenoxyethanol, methyl paraben, perfume\n* **Kose Clear Turn Princess Veil Mask Morning Care (Yellow):** Water, BG, ethanol, glycerin, raspberry extract, grapefruit fruit extract, succinyl atelocollagen, black pepper leaf extract, honey, hamamellis leaf extract, hyaluronan sodium, bilberry leaf extract, flagaria tyroensis juice, betaine, lime juice, lemon fruit Extract, EDTA-2Na, PEG-50 hydrogenated castor oil isostearate, citric acid, sodium citrate, diglycerin, menthol, malic acid, ethyl paraben, salicylic acid, phenoxyethanol, methyl paraben, perfume\n* **Kracie Hadabisei Face Mask (Wrinkle Care):** Water, DPG, glycerin, ethanol, PEG-75, retinol palmitate, royal jelly extract, aubergine root extract, hyaluronic acid Na, lemon fruit extract, maltitol, PEG-60 hydrogenated castor oil, polysorbate 20, methyl gluceth-20, citric acid Acid Na, BG, xanthan gum, citric acid, corn oil, phenoxyethanol, methyl paraben\n\nUnknown Ingredients/Too Lazy to look up right now, please help me lmao:\n\n* Dewytree Pick and Quick Calming Full Mask\n* Dewytree Pick and Quick Moisture Full Mask\n* Kose - Clear Turn 30 Botanical Essence In Cotton\n* Kose - Clear Turn 23 Marine Essence in Cotton (Blue box)\n* Kose - Elsia Platinum Quick Essence Mask\n* Saborino Night Mask Moisture Rich\n* Kracie - Hadabisei 28 Day Lotion Mask\n* Sana Soy Milk Sheet Mask Brown Package\n* AMINUTE Primer Mask 350g\n\n&#x200B;\n\nThank you for coming to my TED talk.",
    "flair_text": "Guide",
    "flair_template_id": "a77b0496-cd68-11e7-8a57-0eba7e80ccec",
    "comments": [
      {
        "author": "etherealemilyy",
        "body": "There’s a Melano CC mask that comes in a [pack of 20.](https://global.rakuten.com/en/store/at-life/item/4987241135028/)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "sca1yfreak",
        "body": "I share your concern, but since I love sheet masks I have looked on Amazon for resealable multipacks. I found the Hado Labo Koi-Gokujyun 3D Perfect Mask which I have purchased and use weekly, but it's not optimal for my skin. This list will make my search for replacement sheet masks sooo much easier!\n\nThank you for taking the time to put this together!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "ForestNudibranch",
        "body": "Thank you sooo much!! I've been using Secret Key Rose, and Aloe toners on sheet mask tablets because I'm so sensitive to butylene glycol. The only multipacks my local store has are the blue, pink, and white Lululun ones which all have it. I'll have to check again for the green one!",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairlossResearch",
    "post_id": "17u3zjg",
    "title": "A holistic approach to re-growth",
    "url": "https://www.reddit.com/r/HairlossResearch/comments/17u3zjg/a_holistic_approach_to_regrowth/",
    "score": 77,
    "num_comments": 23,
    "created": "2023-11-13T05:41:01+00:00",
    "body": "I´m not a professional hair-research guy, I’m a biologist with experience in toxico-pharmacology, environmental science and evo-devo. This article is pure speculation. Always do your own research.\n\nIn this post, we try to hypothetically optimize the two widely used methods topical minoxidil and microneedling. \n\n# Let's begin with minoxidil:\n\nMinoxidil is a pro-drug. Pro-drugs are compounds that are not bioactive but are activated by your body. The active molecule is minoxidil-sulfate. The sulfate is added by Sulfotransferase 1A1 which is an enzyme that in humans is encoded by the SULT1A1 gene. \n\nAmong humans, you see a large variability in sulfotransferase enzyme expression in the hair shaft. Low sulfotransferase activity is a predictor of poor or no response to topical minoxidil in AGA treatments. (Gupta et al. 2021) \n\n^(A. K. Gupta, M. Talukder, M. Venkataraman & M. A. Bamimore (2021): Minoxidil: a comprehensive review, Journal of Dermatological Treatment, DOI: 10.1080/09546634.2021.1945527)\n\n**How to become a minoxidil hyper-responder?** \n\nYou need high sulfotransferase activity and you need the bioactive metabolite (minoxidil sulfate) at your target structure (drug target). You do not need minoxidil, you need minoxidil sulfate and you do not need stuff on your scalp, you need minoxidil sulfate at the follicular unit (where the bulb and the papilla sit)\n\n   \n \n\n[The Hair follicle. By National Institutes of Health - Public Domain, https:\\/\\/commons.wikimedia.org\\/w\\/index.php?curid=6910143](https://preview.redd.it/ogn0yigysqzb1.png?width=1024&format=png&auto=webp&s=e6526ec40180c5ef57019b886fe7e023c389b296)\n\nWhy there? Because this is where the stem cells are, or in other words, where the dormancy originates.\n\n**The drug-target**\n\nTopical is not topical, there are multiple pathways into your scalp.\n\nThe skin is made of three layers. From below: Subcutis, Dermis and Epidermis (top-layer).\n\n&#x200B;\n\n[The Skin. By US-Gov - Public Domain, https:\\/\\/commons.wikimedia.org\\/w\\/index.php?curid=23214373](https://preview.redd.it/5984d3lktqzb1.png?width=1000&format=png&auto=webp&s=a042b2ce2c99a63aa2b1f67f9adda8f4c95a0f4f)\n\nThe epidermis is where most cosmetical agents have their effect, the epidermis has no blood vessels and depends on the highly vascularized dermis with its blood vessels, lymphatic vessels, and nerves.\n\nNote that the hair follicle with the bulb and papilla sits in the dermis.\n\nThere are multiple pathways – and we do not know that much about their relative relevance.\n\n\\- intercellular,\n\n\\- transcellular,\n\n\\- via pores (hairs, sebaceous glands)\n\nThe follicular route as a shunt pathway is often considered irrelevant, because of the limited surface area the hair follicles represent (0.1%), however, the scalp shows a representation of 10%, it is a special case, therefore the follicular route is relevant, especially because it is our main target.\n\nWith the advent of nanotechnology and the observation that solid nanostructures naturally accumulate into the hair follicles, the follicular route is of particular interest for treating AGA. ([Pereira MN et al. 2022](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10383440/))\n\nIgnore unproblematic-unknows. Yes, we don't know exactly how minoxidil works, but from there, it reaches the surrounding tissue anyway. We know that SULT1A1 activity in the outer root sheath (ORS) of the hair follicle correlates directly with topical minoxidil response ([Ramos et al. 2020](https://pubmed.ncbi.nlm.nih.gov/32432358/)) and we have evidence that nanocarriers loaded with minoxidil are effective in treating AGA. ([Oliveira et al. 2022](https://pubmed.ncbi.nlm.nih.gov/35143972/))\n\n^(Oliveira PM, Alencar-Silva T, Pires FQ, Cunha-Filho M, Gratieri T, Carvalho JL, Gelfuso GM. Nanostructured lipid carriers loaded with an association of minoxidil and latanoprost for targeted topical therapy of alopecia. Eur J Pharm Biopharm. 2022)\n\n**One does not simply drink Grapefruit Juice.**\n\nOrally taken compounds undergo something we call \"first pass\" (the hepatic metabolization). Metabolization of xenobiotics has only one goal, elimination. For this task, the liver has a variety of enzymes. One important enzyme group is subsumed as the Cytochrome P450 Isoenzyme Complex or CYP P450.\n\nWhen your drug is a pro-drug, that needs enzymatic activation by your body (which is part of the elimination process), then you can target that specific enzyme by increasing its hepatic production. \n\nThere are lots of compounds that act as CYP450 inducers and there are lots of compounds that act as inhibitors. When you inhibit the enzyme that eliminates a certain compound, then you don’t get rid of that compound and its effect. When you induce the enzyme, you can have no effect at all. However, when your compound is a pro-drug, induction means an increase in conversion into the active metabolite, hence an increase in effect.\n\nCYP450 interaction can be looked up in CYP-P450 drug interaction tables. Not every drug undergoes hepatic elimination, so it could be that you do not find the drug that’s effect you want to enhance.\n\nA look into the [Flockhart Table](https://drug-interactions.medicine.iu.edu/MainTable.aspx) shows you that Grapefruit Juice (mostly [naringin](https://en.wikipedia.org/wiki/Naringin)) is indeed an inducer (of CYP 3A4)\n\n&#x200B;\n\n[Flockhart table - https:\\/\\/drug-interactions.medicine.iu.edu\\/MainTable.aspx](https://preview.redd.it/e5f48hnpwqzb1.png?width=1719&format=png&auto=webp&s=befab9b25231de3fb9b5e6076f49e1a85116874a)\n\nBut is Minoxidil even a CYP 3A4 Substrate, in other words, does it get metabolized there? When you take it orally it surely undergoes some hepatic metabolism, but which ones are those? We know that the majority of orally administered minoxidil is metabolized in the liver by glucuronidation, hydroxylation, and sulfation (Gupta et al. 2021). Still, our active drug is minoxidil sulfate, so grapefruit juice needs to influence the hepatic sulfotransferase, but does it? If naringin is not an issue, then maybe quercetin or other polyphenols?\n\n**Lots of polyphenol-rich beverages are known to affect sulfotransferase activity, but in which way?**\n\n>“The activities of both SULT1A1 and SULT1A3 were significantly inhibited by all the beverages investigated at a concentration of 10%. The beverage constituents were tested in concentration ranges considered to be physiologically relevant.”   \n>  \n>“The grapefruit constituent, quercetin, completely inhibited SULT1A1, while quercetin and naringin both partially inhibited SULT1A3. The orange constituents, tangeretin and nobiletin, also completely inhibited SULT1A1. The tea constituents, (-)-epicatechin gallate and (-)-epigallocatechin gallate, both almost completely inhibited SULT1A1 and SULT1A3. Moreover, the theaflavin and thearubigin fractions of black tea both completely inhibited SULT1A1 and strongly inhibited SULT1A3.” (Nishimuta et al. 2007)\n\nIf Grapefruit Juice influences minoxidil, it is NOT an enhancer. Rather the opposite should be the case.\n\n^(Nishimuta H, Ohtani H, Tsujimoto M, Ogura K, Hiratsuka A, Sawada Y. Inhibitory effects of various beverages on human recombinant sulfotransferase isoforms SULT1A1 and SULT1A3. Biopharm Drug Dispos. 2007 Dec;28(9):491-500. doi: 10.1002/bdd.579. PMID: 17876860.)\n\n**Building a real Minoxidil Booster**\n\nThere are different approaches to increase local sulfotransferase activity. A) hypoxia and B) hypoxia mimicking e.g. by pH-buffering which means alkalizing the hair cells´ milieu/ increasing the local pH. \n\nThe irony is that minoxidil-sulfate is suspected to have part of its effect via a hypoxia-mimetic property, it increases HIF (hypoxia-inducible factor):\n\n>“In particular, minoxidil’s molecular mechanism of action is strictly connected with the HIF pathway. It is widely known that the prolyl-hydroxylase 2 (PHD-2)-mediated hydroxylation of HIF-1α causes its rapid degradation. Blocking PHD-2 leads to HIF-1α survival and hypoxia-response element gene (HRE) transcription such as VEGF, CCL5 and Endothelins ET–1 and ET–2 \\[12\\]. Accordingly, minoxidil stimulates HIF and all its angiogenic components.” ([Thor et al. 2023](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9861617/))\n\nHypothesis: So, once you kick-start HIF, minoxidil-sulfate COULD maintain its own conversion to a certain degree.\n\n^(Thor D, Pagani A, Bukowiecki J, Houschyar KS, Kølle ST, Wyles SP, Duscher D. A Novel Hair Restoration Technology Counteracts Androgenic Hair Loss and Promotes Hair Growth in A Blinded Clinical Trial. J Clin Med. 2023 Jan 6;12(2):470. doi: 10.3390/jcm12020470. PMID: 36675398; PMCID: PMC9861617.)\n\nRamos et al. 2020 used a liposomal encapsulated alkalizing agent (sodium bicarbonate) to change the pHi of the ORS.\n\n>\"Nineteen subjects successfully completed the study. Follicular sulfotransferase activity, as measured by the sulfotransferase assay (OD), increased for 10 of 19 patients (Table 1). More importantly, subjects predicted to be non-responders to minoxidil (OD<0.4) had a significant increase in their minoxidil response. Pre-treatment, the average OD in the non-responder group was 0.2206 (95%CI: 0.1661 to 0.2750) compared to post-treatment 0.4946 (95%CI: 0.2036 to 0.7855) (p<0.03).\" (Ramos et al. 2020)\n\nDon't be fooled by averages, some patients have seen a decrease in OD, so it is not a guaranteed solution. Plus, metabolization like sulfonation is impaired in diabetic patients and in people with other chronic low-grade inflammation. So maybe the long-term solution is not putting more stuff on your scalp, but rather by restoring your health (Yalcin et al. 2013, Redan et al. 2016).\n\n^(Yalcin EB, More V, Neira KL, Lu ZJ, Cherrington NJ, Slitt AL, King RS. Downregulation of sulfotransferase expression and activity in diseased human livers. Drug Metab Dispos. 2013 Sep;41(9):1642-50. doi: 10.1124/dmd.113.050930. Epub 2013 Jun 17. PMID: 23775849; PMCID: PMC3876809.)\n\n^(Redan BW, Buhman KK, Novotny JA, Ferruzzi MG. Altered Transport and Metabolism of Phenolic Compounds in Obesity and Diabetes: Implications for Functional Food Development and Assessment. Adv Nutr. 2016 Nov 15;7(6):1090-1104. doi: 10.3945/an.116.013029. PMID: 28140326; PMCID: PMC5105043.)\n\nHowever, we need targeted + boosted Minoxidil. Let´s write this on our wish list for later. For now, we simply make a side note:\n\n\\- Stemoxidine\n\n\\- liposomal encapsulated sodium bi-carbonate\n\n&#x200B;\n\n&#x200B;\n\n# Micro-Needling\n\nRight now, we lack the understanding of pharmaceutics so we will jump into the next method, which is microneedling. \n\n**Now, I know that people have no long attention span, so I will give you my approach first:**\n\n\\- train, \n\n\\- microneedle (you read right, micro needle after physical exercise), \n\n\\- get your post-workout shake, \n\n\\- apply post-needling ointment\n\n\\- recover and repeat\n\nThe whole hypothesis is about getting micro-trauma into its evolutionary natural context and designing a nutrient matrix around it. Micro-trauma does not belong into a vacuum. The lion does not get micro-traumatized by sitting in a beauty salon. Evolution is retrospective – repair mechanisms evolved because the microtrauma (a cost) was worth the reward.\n\n&#x200B;\n\n**Training - Micro-trauma in its natural context**\n\nA wholistic **Co-integration**\n\nWhen you already have established a training and postworkout routine, then you could combine it with your micro-needling routine. Of course, not after any training session but for example after every second upper body split routine, hence every other week. Why?\n\n&#x200B;\n\n* First: you already      have established discipline for your training (you simply make it an      addition to your routine)\n* you benefit from necessary conditions like a pro-oxidative, pro-inflammatory but insulin-sensitizing and blood-sugar-lowering environment around the training.\n* You supply nutrients with your post-workout nutrition.\n* You have an anabolic environment due to the circulation of growth factors (like hGH and IGF).\n* AND you can crosscheck for effectiveness\n\n**More than Nutricosmetics**\n\nAround treatments like oral collagen peptides, the concept of [Nutricosmetics](https://link.springer.com/article/10.1007/s43538-023-00181-x) evolved. This concept is a special case of nutraceuticals. Let's get this clear, a protein or peptide is unlikely to be bioactive. Whey protein or collagen has no effect since it is digested. However, the ratio of amino acids is an influential factor. The proposed approach using a postworkout shake as a neutricosmetic is more than just a cocktail of nutraceutics. It is about the timing and the state your body is in after a resistance training session.\n\nThe effect of a given chemical agent (like a drug, e.g. Minox or a nutrient like Collagen) or physical treatment is modulated by your body. In pharmacology, this concept is called [pharmacokinetics.](https://en.wikipedia.org/wiki/Pharmacokinetics)\n\nFor example, oral glucose can lead to a decrease in free testosterone. In some men with normal T at baseline, testosterone drops to hypogonadal levels:\n\n>\" Of the 66 men with normal T levels at baseline, 10 (15%) had levels that decreased to the hypogonadal range (<9·7 nm) at one or more time points. SHBG, LH and cortisol levels were unchanged. Leptin levels decreased from baseline at all time points (P < 0·0001). \" ([Caronia et al. 2013](https://pubmed.ncbi.nlm.nih.gov/22804876/))\n\nThis is not the normal reaction to oral glucose. The effect of a xenobiotic or nutrient is not inherent to the substance itself. However, high intensity exercise changes the way our body reacts to glucose.\n\n&#x200B;\n\n**The optimal post-needling Nutrition**\n\nI would state that the optimal postworkout nutrition for muscle growth = the optimal microneedling nutrition. The reason is the evolutionary context of microtrauma and the anabolic mTor pathway. Microtrauma only appears in a certain natural context. The lion does not go to a beauty salon to get his 0.5mm Microneedling session. He does not get his protein by mixing a shake and drinking it before he runs after the antelope or fights with the buffalo for life and death... this is not how it works. When the lion approaches a buffalo and kills it, he gets injured (not only microtrauma, but lots of microtrauma for sure). If the response induced by eating fresh dead animal was not worth the effort (trauma), there would not be any mega-predatory lions. The lion would go hunting frogs and hedgehogs or be a vegetarian.\n\nAs we know from muscle hypertrophy research, anabolism per se (measured as muscle protein synthesis) is not hypertrophy - hypertrophy comes from a net tissue gain when anabolism > catabolism. However, the anabolic response is greater when you combine multiple stimuli:\n\nTraining < Training + Protein Shake (amino acid profile matched for at least 5g Leucine).\n\n**The post-workout shake for your scalp**\n\nPost-workout nutrition is a whole field itself:\n\n* protein low in leucine < protein high in leucine,\n* protein < protein + carbs,\n* protein + carbs < protein + carbs + creatine\n* and so on...\n\nSimplified version: The more additive or potentiating agents in the matrix --> the bigger the response. There is probably a reason why there are such additive and supra-additive effects on protein synthesis (PS), maybe it is that a matrix that resembles fresh animal evokes the biggest anabolic response. However, muscle protein synthesis (MPS) is only a proxy measurement, such studies do not measure actual muscle growth. \n\nPlus, certain molecules are contraindicated around the training window such as Anti-Oxidants. It seems that we need ROS for mediating the training stimulus. So be cautious when you think \"more is per se more\". ([Clemente-Suarez et al. 2023](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10220679/))\n\nWhen we look at suitable anabolic post-workout nutrients we find:\n\n\\- Protein (\\~20g and at least 5g Leucin Content). Leucine is the limiting factor when it comes to MPS.\n\n\\- Accordingly, BCAA that adds up to 5g of Leucine can also increase MPS\n\n\\- Creatine post-workout was shown to increase MPS\n\n\\- Collagen. Collagen synthesis rates were elevated with 15 g/day COL but did not have a significant impact on MPS when compared to isonitrogenous higher-quality protein sources. (Khatri et al. 2021) BUT Collagen + Protein shows a greater effect than Protein alone when matched for the EAA content ([Jacinto et al 2021](https://pubmed.ncbi.nlm.nih.gov/35042187/)). There are also Studies of the effect of Collagen Peptides on hair growth.\n\n^(Hwang SB, Park HJ, Lee BH. Hair-Growth-Promoting Effects of the Fish Collagen Peptide in Human Dermal Papilla Cells and C57BL/6 Mice Modulating Wnt/β-Catenin and BMP Signaling Pathways. Int J Mol Sci. 2022 Oct 7;23(19):11904. doi: 10.3390/ijms231911904. PMID: 36233206; PMCID: PMC9569759.) \n\n**It is not all about the trauma**\n\nWithin the bro-science community, it is an established fact: \"Hypertrophy comes from micro-trauma\". We are not sure whether muscle damage is a contributor at all. It is mainly load, but also hypoxia, ROS, and maybe cell swelling. ([Schoenfeld et al. 2019](https://journals.physiology.org/doi/full/10.1152/japplphysiol.00685.2018))\n\nHypoxia - a reoccurring theme\n\nMeta-studies on training strategies like bloodflow-restriction training have shown, that inducing hypoxia can be as efficient as higher loads when it comes to hypertrophy (Bradley et al. 2021, Perera et al. 2021). The use of hypoxia-mimetics in the treatment of AGA was popularized by LOreal with their molecule Stemoxydine. It was shown that hypoxia indeed leads to stemcell activation and the use of hypoxia mimetics shortcuts the process by directly inducing HIF1:\n\n>\"Based on these results, we hypothesized that induction of hypoxia signaling may be important in maintaining hair follicle stem cell functionality. Hypoxia signaling is mediated by the hypoxia-inducible transcription factor HIF1, a subunit of which is degraded in an oxygen-dependent manner through prolyl-4-hydroxylase (P4H)-mediated hydroxylation. A potent P4H competitive inhibitor, named Stemoxydine, was tested for its ability to induce hypoxia-like signaling. Transcriptomic studies show that treatment of hair follicles with Stemoxydine in normoxic conditions modifies the expression of a panel of genes in the same manner as culturing under hypoxic conditions. In addition, when ORS-derived hair follicle cells were grown in normoxic conditions with Stemoxydine, CFE and clone morphology were similar to those observed in hypoxic conditions. These results suggest that hypoxia may be an important regulator of stem/progenitor cells function in the human hair follicle. We hypothesize that molecules that mimic hypoxic signaling, such as Stemoxydine, may figure as new approach to sustain hair growth and cycling.\"\n\n[Rathman-Josserand et al. 2014](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4158624/) (\"Hair Density Recovery: New Insights in Hair Growth Biology - L’Oreal Research: O 10: The Niche of Human Hair Follicle Stem Cells: A Specific Environment\")\n\nDo you remember hypoxia as a Sulfotransferase Inducer? (We just collect associations)\n\n^(Jitsukawa S, Rathman-Josserand M, Bernard BA (2014). \"Human hair follicle stem/progenitor cells and hypoxia: a new hair care approach with diethyl pyridine-2,4-dicarboxylate\".) *^(Fragrance Journal)* ^((in Japanese).) **^(42)** ^((6): 12–19.) \n\n^(Miller BC, Tirko AW, Shipe JM, Sumeriski OR, Moran K. The Systemic Effects of Blood Flow Restriction Training: A Systematic Review. Int J Sports Phys Ther. 2021 Aug 2;16(4):978-990. doi: 10.26603/001c.25791. PMID: 34386277; PMCID: PMC8329318.) \n\n^(Perera E, Zhu XM, Horner NS, Bedi A, Ayeni OR, Khan M. Effects of Blood Flow Restriction Therapy for Muscular Strength, Hypertrophy, and Endurance in Healthy and Special Populations: A Systematic Review and Meta-Analysis. Clin J Sport Med. 2022 Sep 1;32(5):531-545. doi: 10.1097/JSM.0000000000000991. Epub 2021 Nov 29. PMID: 36083329.) \n\n**Limitations of trauma-induction**\n\nMicro-trauma is a very limited inductor when it comes to high-frequency application. You simply can't micro-needle any day, not even EOD (every other day) or probably not even every week - we simply do not have evidence on the optimal dose of micro-needling, but we can make an educated guess:\n\nTake for example the paper \"Microneedling: A Review and Practical Guide\" by Alster et al. 2018\n\nWhat you can control is the healing phase. \n\nIn both fetuses and adults, wound healing consists of four distinct phases: \n\n\\- hemostasis, \n\n\\- inflammation, \n\n\\- proliferation, \n\n\\- and remodeling \n\n(Enoch and Leaper 2008)\n\nAfter [Pandit et al. 2023](https://link.springer.com/article/10.1007/s44174-023-00093-w) those phases can be characterized as:\n\nHemostasis = platelet activation and coagulation. After an injury, the clotting cascade is initiated, resulting in platelet aggregation, fibrin polymerization and the formation of a clot. \n\nInflammation = release of cytokines and growth factors. Neutrophils aggregate at the injury site due to the release of interleukin (IL)-1, transforming growth factor beta (TGF)-β, and other products.\n\nProliferation = epithelization. Epithelial cells at the wound’s edge begin to proliferate and lay down the provisional matrix consisting of collagen. Additionally, fibroblasts migrate into the wound area and deposit significant amounts of extracellular matrix (ECM). \n\nRemodeling = collagen deposition and remodeling of such, fibroblasts secrete glycosaminoglycan and other proteins to support the new matrix. At this point, wound contraction occurs through interactions between fibroblasts and the ECM, resulting in a healed wound.\n\n^(Pandit, S., Nellenbach, K. & Brown, A.C. Characteristics of Fetal Wound Healing, and Inspiration for Pro-healing Materials. Biomedical Materials & Devices (2023). https://doi.org/10.1007/s44174-023-00093-w)\n\nEverything that speeds up wound healing is a suitable compound for our stack, and one molecule pops up quite often…Dexpanthenol which has hair growth-promoting effects and accelerates wound healing:\n\n**Dexpanthenol (topical and oral)**\n\n^(Gorski J, Proksch E, Baron JM, Schmid D, Zhang L.) **^(Dexpanthenol in Wound Healing after Medical and Cosmetic Interventions)** ^((Postprocedure Wound Healing). Pharmaceuticals (Basel). 2020) \n\n^(Shin JY, Kim J, Choi YH, Kang NG, Lee S.) **^(Dexpanthenol Promotes Cell Growth by Preventing Cell Senescence and Apoptosis in Cultured Human Hair Follicle Cells.)** ^(Curr Issues Mol Biol. 2021)\n\n^(Kutlu Ö, Metin A.) **^(Systemic dexpanthenol as a novel treatment for female pattern hair loss)**^(. J Cosmet Dermatol. 2021)\n\n^(Shin, J.Y.; Kim, J.; Choi, Y.-H.; Kang, N.-G.; Lee, S.) **^(Dexpanthenol Promotes Cell Growth by Preventing Cell Senescence and Apoptosis in Cultured Human Hair Follicle Cells)**^(.) *^(Curr. Issues Mol. Biol.)* **^(2021)**^(,) *^(43)*^(, 1361-1373. https://doi.org/10.3390/cimb43030097)\n\n^(M.G. Davis, J.H. Thomas, S. van de Velde, Y. Boissy, T.L. Dawson, R. Iveson, K. Sutton,) **^(A novel cosmetic approach to treat thinning hair)**^(,) *^(British Journal of Dermatology)*^(, Volume 165, Issue s3, 1 December 2011, Pages 24–30,) [^(https://doi.org/10.1111/j.1365-2133.2011.10633.x)](https://doi.org/10.1111/j.1365-2133.2011.10633.x)\n\n^(Weßollek K, Marquardt Y, Wagner-Schiffler S, Baron JM, Huth S.) **^(Post-Treatment of Micro-Needling with a Dexpanthenol-Containing Ointment Accelerates Epidermal Wound Healing in Human 3D Skin Models)**^(. Clin Cosmet Investig Dermatol. 2023)\n\n**Wound healing nutrient Matrix**\n\nAnother bio-engineering trick is looking into nature, where we see \"high-performance\" wound healing, which we see in embryos and newborns.\n\nIn short, Pandit et al. characterize the differences between adults and fetuses:\n\n* Hyaluronic acid\n\nFetal wounds show higher levels of hyaluronic acid (HA). The hypothesis is that higher activity of adults hyaluronidase breaks HA down. HA leads to neovascularisation, modulates collagen formation and leads to scarless healing.  Longer fragments of HA upregulate TGF-β3 expression and collagen III production, which is consistent with a fetal scarless wound healing-like environment. HA is up 2 weeks in fetal wounds and only 3 days in adult wounds.\n\n&#x200B;\n\n* TGF-ß \n\nFetal wounds show a different ratio of TGF-ß Isoforms. The TFG-β isoforms are involved in inflammation, collagen synthesis, and remodeling of the extracellular matrix. TGF-ß3 decreases collagen synthesis (what is needed for scarless nonfibrotic tissue). \n\n> \"Adult wounds have increased levels of latent TGF-β1 and a decreased expression of α-SMA. Additionally, MMPs upregulate the secretion of TGF-β1 \\[[41](https://link.springer.com/article/10.1007/s44174-023-00093-w#ref-CR41)\\] and α-SMA expression is inhibited by matrix metalloproteinase (MMP) inhibitors. An increase in TGF-β3 is observed during fetal wound healing, while TGF-β1 levels are nearly undetectable\" (Pandit et al. 2023)\n\nSo du prevent fibrosis, we need anything that can promote the upregulation of TGF-β3 and downregulation of TGF-β1.\n\n&#x200B;\n\n* Collagene\n\nIn wound healing, we see Collagen Type 1 and 3. The difference in the level and type of collagen results in scarless wound healing in fetuses. Adult wounds show mostly Type 1.  The timing is different, in an adult wound we see collagen deposition at 5 days post-wound, while fetuses have collagen already at 48 hours post-injury.\n\n&#x200B;\n\n* Fibroblasts\n\nWhile adult fibroblasts mainly express TGF-ß1 and cytokines, fetal fibroblasts express genes associated with migration and neovascularization, including, fibronectin 1 (Fn1), insulin-like growth factor 1 (Igf1), insulin-like growth factor 2 (Igf2), and vascular endothelial growth factor A (VEGFa) \n\n&#x200B;\n\n* There are some other points like the extracellular matrix (ECM) modulators, e.g. decorin, lysyl oxidase, and MMPs, but for now, we stop here. For further information look into Pandit et al. 2023\n\n^(Pandit, S., Nellenbach, K. & Brown, A.C. Characteristics of Fetal Wound Healing and Inspiration for Pro-healing Materials.) *^(Biomedical Materials & Devices)* ^((2023). https://doi.org/10.1007/s44174-023-00093-w) \n\n&#x200B;\n\nHow does a hydrogel mimicking the fetal milieu perform?\n\n&#x200B;\n\n> *In vitro* results revealed that hydrogels exerted significant [angiogenesis](https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/angiogenesis) and hair follicle regeneration efficacy. *In vivo* results confirmed that hydrogels significantly promoted wound healing, and the closure ratio reached over 94 % after 14 days of hydrogels-treatment. The regenerated skin exhibited a complete epidermis, dense and ordered collagen. Furthermore, the number of neovessels and hair follicles in the HA-DA-CS/Zn-ATV group were 1.57- and 3.05-fold higher than those of the HA-DA-CS group. Thus, HA-DA-CS/Zn-ATV serves as multifunctional hydrogels for simulating the fetal milieu and achieving efficient skin reconstruction with hair follicle regrowth, exhibiting potential in clinical wound healing. (Rong et al. 2023)\n\n^(Rong H, Dong Y, Zhao J, Zhang X, Li S, Sun Y, Lu T, Yu S, Hu H. Fetal milieu-simulating hyaluronic acid-dopamine-chondroitin sulfate hydrogel promoting angiogenesis and hair regeneration for wound healing. Int J Biol Macromol. 2023)\n\nI saw this study popping up here before, but couldn't find it. It looks like a simple but effective approach.\n\n# First conclusion\n\nNow, we do not exactly know how to make those compounds, but we know the basic concept of an optimized Minox+Needling regime.\n\n&#x200B;\n\n**Targeted and boosted Minox:**\n\n\\- Apply minox after alkalizing the local milieu and or inducing HIF (e.g. stemoxidine)\n\n\\- Try to optimize metabolization by optimizing your insulin sensitivity/managing chronic inflammation (we address this later)\n\n\\- Use minox in combination with LLLT\n\n\\- Use a nanocarrier for minox\n\n&#x200B;\n\n**Optimized Needling:**\n\n\\- Needle after physical resistance exercise (anabolic environment)\n\n\\- Use post-workout nutrition to fuel the remodeling in the scalp\n\n\\- Use post-needling topical nutrient and modulator matrix (\"fetal milieu\")\n\n\\- Use dexpanthenol (oral + topical)\n\n\\- Use LLLT during the refractory period\n\n&#x200B;\n\nMaybe you have Ideas on how to make such formulations. I will come back with another post, in which I describe possible methods. \n\n&#x200B;\n\n&#x200B;\n\n \n\n&#x200B;",
    "flair_text": "Theories and speculation",
    "flair_template_id": "1b52e168-b095-11ec-b38b-aae726b248b5",
    "comments": [
      {
        "author": "BroScienceAlchemist",
        "body": "> - Apply minox after alkalizing the local milieu and or inducing HIF (e.g. stemoxidine)\n\nThe patent for the minoxidil booster that originally mentions it also includes some other ingredients that may be worth exploring.   https://uspto.report/patent/app/20220296486\n\nStemoxidine is often formulated with benzyl salicylate, which would have some inhibitory effect on SULT1A1 and on minoxidil effectiveness as it is a COX inhibitor. I looked into acquiring raw Stemoxidine (Diethyl 2,4-pyridinedicarboxylic acid), but it is costly.... I'm sure the amount of benzyl salicylate may be small enough not to matter too much, but I dislike it on that principle. Maybe someone could object that that tretinoin by itself, and retinoids, can induce their own type of temporary hairloss, but we have more study on minixodil + tretinoin being a net benefit that I don't see it as a concern until stronger data showing otherwise comes out.\n\nIf not for salicylate, I would recommend it. Trying to extract it from the OTC solutions does not have a safe method that I am aware of, as applying heat to an alcohol formulation is a bad idea. It's a shame because while it is weak, I like that it attacks a different pathway, and it is very well tolerated. \n\nTretinoin boosts SULT1A1 expression and enhances absorptions of minoxidil. That's an easy win there. Azelaic acid also boosts absorption, and it is a very cheap ingredient.\n\n> managing chronic inflammation\n\nTopical magnesium plays a powerful role in preventing calcification, and it absorbs well in hair follicles and sweat glands. Anti-oxidants also play a helpful role in preventing fibrosis and controlling inflammation. Melatonin is cheap and easy here. Viagra and cialis are also potent for inhibiting TGF beta, increasing blood circulation, and reducing inflammation, and topical viagra has been studied as a hair loss treatment. It's a very cheap ingredient, and tiny amounts are needed.\n\nThe nutrition, inflammation, and metabolic health aspects are essential for general health, and while I would recommend it for that alone, I wouldn't expect much, if anything, here. Collagen, has many health benefits for skin, nails, and hair, so that would provide the most value. \nSauna induced heat shock protein release has beneficial effects on resistance training and muscle hypertrophy. I can't say if it would help hair, if anything, you would want to protect your hair from heat damage, but sauna sessions have a lot of health benefits.\n\nDexpanthenol is a good callout. Most of those studies shared are in cell cultures when it comes to androgenic alopecia application, but if it works for enhancing wound healing and is cheap, it's worth exploring. \n\nPRP-type treatments are the most potent for inducing that paracrine effect for hair neogenesis and follicle revival, but that is expensive, and regular treatments are inaccessible to most. I make my PRF and microneedle it in my scalp on a quarterly basis, but I can't recommend others draw their blood to save their hair.\n\nNanoparticle carriers are generally inaccessible, but Beta-Hydroxypropyl Cyclodextrin is very cheap, and I was surprised to find some very positive studies on it for topical minoxidil. I use it for formulating injectables, but I may experiment with this for the next version of the topical I use. https://www.sciencedirect.com/science/article/abs/pii/S0022354917308389\n\n> LLLT \n\nFor LLLT, the power of the lasers used matters, and most OTC devices are too weak compared to what was studied. Likely, you could compensate by increasing the duration of exposure, but that is a shot in the dark. I have a laser messiah 2, and I generally like it despite the kinks of the power supply. I would love to see the community try DIY solutions here, as the price point is comparable to the influencer branded devices. http://overmachogrande.com/omg/list/category/do-it-yourself\n\n---\n\nAnyway, if I had to summarize a protocol breakdown:\n\n* Hair growth topical with minoxidil, SULT1A1 boosters, topical anti-androgens, topical 5ar inhibitors like Ketoconazole/Alfatradiol, a nanoparticle carrier for certain actives, anti-oxidants, anti-fibrotics, cofactors, ingredients that enhance absorption, and then other actives that attack other pathways\n* Post microneedling topical that focuses more on topical nutrition, anti-fibrotics, and anti-oxidants\n* LLLT, microneedling, and alternative approaches to inducing microtrauma that results in a net up regulation of healing response.\n* General metabolic health\n* Systemics (orals, injections, etc): low dose sublingual minoxidil (FYI, anything that boosts hair follicle SULT1A1 expression benefits oral minoxidil for hair), replacement HGH for those that are older and are deficient, and oral fin/dut for those that are comfortable with it.\n\nI like this post. It brings up some research that has been around for a while and I have commented about a few times, but many people are not aware that there are some cheap, easy ways to boost their protocol effectiveness.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "3flaps",
        "body": "Thanks for writing this. \n\nHave you heard of verteporfin?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "tomtomfreedom",
        "body": "Has/is anyone here currently using dexpanthenol?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "lemmejustdothis",
        "body": "Great job! My 2 cents:\n\n- The timing might not be as important as you think, if we are to draw conclusions from the post-exercise 'window of opportunity' that was thought to be critical but actually isn't (take example from the lion.)\n\n- it's much more nuanced than mTOR anabolism, as we know that controlled mTOR inhibition / starvation promotes mitophagy (\"anti-aging\"). Rapamycin looks promising.\n\n- VIP increases VEGF expression\n\n- alpha-KG might play an important role\n\n- low dose oral minox is underrated \n\n- GH/IGF-1 agents can help (ipamorelin, mk677, etc.)",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Sharp-Huckleberry862",
        "body": "So let me see if I understood, correct me if I misunderstood or misinterpreted something.\n\nMinoxidil’s active form is minoxidil sulfate, and minoxidil gets converted into minoxidil sulfate by the SULFA1 enzyme. So to increase the body’s response to minoxidil we need to increase SULFA1, and an increase in SULFA1 enzyme is a response to a hypoxic environment or something mimicking a hypoxic environment. Minoxidil by some mechanism mimics a hypoxic environment via HIF pathway in the hair follicle and could maintain the increased SULFA1 expression on its own, but we need something to kickstart it which is where the sodium bicarbonate and stemoxidine comes into play.\n\nThen we need to maximize the amount of minoxidil that goes into the hair follicle, and nano carriers naturally accumulate in the hair follicle, so by putting minoxidil into a nano carrier it make the delivery more effective. And since sodium bicarbonate isn’t very bioavailable, putting it in the nano carrier is optimal.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "tomtomfreedom",
        "body": "I dm'd you fyi.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "douglasman100",
        "body": "From everything I'm seeing, it seems like to get good results there are two options.\n\nIf you have low SULF1A1, take oral minoxidil.\n\nIf you have high SULF1A1 or can modify the hair follicle environment to induce this, take sublingual minoxidil.\n\nYou can avoid having to do topical applications with minox, avoiding having PG or alcohol in your hair, but still get the same effects if you take it sublingually, as it's no longer relying on liver metabolism.\n\nAdditionally, it would seem people with hEDS/Long Covid/POTS/MCAS might actually be innate hyperresponders as HIF1a is upregulated in all of them.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Available-Volume-593",
        "body": "Nah minoxidil wont work longterm even in hyperresponders. Promoting one factor while dht effects almost all of them sinply doesnt work long term.",
        "score": -3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tretinoin",
    "post_id": "1eukkhk",
    "title": "Moisturiser and ingredients help!",
    "url": "https://www.reddit.com/r/tretinoin/comments/1eukkhk/moisturiser_and_ingredients_help/",
    "score": 1,
    "num_comments": 10,
    "created": "2024-08-17T15:37:31+00:00",
    "body": "**I'm looking for moisturiser and sunscreen recommendations!**\n\nI'm on week 2 of tret 0.025 (Renactyl) every other day and I'm starting to get dry skin and peeling and sensitivity, especially on my cheeks. Before this I've built up tolerance to using TO 0.5% Squalane Retinol everyday, before switching to the green Cerave retinol, also everyday. Neither has given me dry skin or peeling. They helped reduce acne but not clear them, and also did not help much with my skin texture. So I decided to get prescription strength, oh boy I was underestimating its potency!\n\nI'm struggling to find a suitable moisturiser because honestly, I've never really had to moisturise prior to this. I live in SEA, very humid and hot year round, and I have oily skin. The only \"moisturiser\" I use for the past few year is Hada Labo Lotion (white bottle) and I'm From Mugwort Essence. Since starting tret, many ingredients are starting to tingle or sting my cheeks!\n\nCurrent routine:  \nAM  \nCleanser - [Purifying Neem Face Wash](https://www.watsons.com.sg/purifying-neem-face-wash-100ml/p/BP_82126)  \nLotion - [Hada Labo Lotion (white bottle)](https://www.watsons.com.sg/hydrating-lotion-5ha-improves-skin-elasticity-promotes-healthy-radiant-skin-170ml/p/BP_83702)  \nSunscreen\n\nPM  \nOil cleanser - [Manyo Pure Cleansing Oil](https://www.cocomo.sg/products/ma-nyo-pure-cleansing-oil-200ml?srsltid=AfmBOorJCjhs4dq8JiWiU6O95dV5uF9zPnVNmquvgYGEa_AIwW99IW7e)  \nLotion - Hada Labo Lotion (white bottle)  \nTret - 0.025% Retacnyl every other day.\n\nI use tret every other day based on derm's recommendation. And also seen many derms on IG/TikTok from my country saying that tret is generally well tolerated every 1-2 days since our air is so humid.\n\nI'm creating a log of different products I've tried so far since I've started tret, including a rating of how much it stings and the ingredients.\n\n1 [Hada Labo Lotion](https://www.watsons.com.sg/hydrating-lotion-5ha-improves-skin-elasticity-promotes-healthy-radiant-skin-170ml/p/BP_83702), sting rating = **0/5** THANK GOD!!! <3\n\n    Water，Butylene Glycol，Pentylene Glycol, Diproplene Glycol, PPG-10 Menthyl Glucose Ether, Diglycerin, Phenoxyethanol, Disodium Succinate, Sodium Hyaluronate, Disodium EDTA, hydroxyethylcellulose, Succinic Acid, Sodium Acetylates Hyaluronate, Hydrolyzed Sodium Hyaluronate, Lactococcus/ Hyaluronic Acid Ferment Filtrate\n\n2 [Glad2Glow Centella Allantoin Soothing Gel Moisturizer](https://www.sociolla.com/face-gel/78040-centella-allantoin-soothing-gel-moisturizer), sting rating = **4/5** :(\n\n    AQUA, CENTELLA ASIATICA LEAF EXTRACT, METHYL GLUCETH-10, PROPYLENE GLYCOL, BUTYLENE GLYCOL, 1,2-HEXANEDIOL, HYDROXYACETOPHENONE, ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER, GLYCERIN, ALLANTOIN, AMINOMETHYL PROPANOL, PENTYLENE GLYCOL, HAMAMELIS VIRGINIANA (WITCH HAZEL) EXTRACT, GENTIANA SCABRA ROOT EXTRACT, MENTHYL LACTATE, ETHYL MENTHANE CARBOXAMIDE, HYDROXYPHENYL PROPAMIDOBENZOIC ACID, PANTHENOL, ROYAL JELLY, CASTANEA SATIVA (CHESTNUT) SEED EXTRACT, HELIANTHUS ANNUUS (SUNFLOWER) SEED EXTRACT, VIOLA TRICOLOR EXTRACT, GLYCYRRHIZA INFLATA ROOT EXTRACT, SALIX ALBA (WILLOW) BARK EXTRACT, SCUTELLARIA BAICALENSIS ROOT EXTRACT, SEA WATER, GLYCINE SOJA (SOYBEAN) SEED EXTRACT, SECALE CEREALE (RYE) SEED EXTRACT, ECTOIN, SOPHORA FLAVESCENS ROOT EXTRACT, FOMES OFFICINALIS (MUSHROOM) EXTRACT, PYRUS CYDONIA SEED EXTRACT, HIBISCUS ABELMOSCHUS SEED EXTRACT, ASCORBYL PALMITATE, PANICUM MILIACEUM (MILLET) SEED EXTRACT, PEG-40 HYDROGENATED CASTOR OIL, PPG-26-BUTETH-26, DISODIUM EDTA, METHYL DIISOPROPYL PROPIONAMIDE, CAPRYLYL GLYCOL, PARFUM, BIS-ETHOXYDIGLYCOL CYCLOHEXANE 1,4-DICARBOXYLATE, XANTHAN GUM\n\n3 [Azarine Hydrashoothe Sunscreen Gel Spf45+++](https://www.sociolla.com/sunscreen/53824-hydrashoothe-sunscreen-gel-spf45), sting rating = **3/5**\n\n    Aqua, Glycerin, Propanediol, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Aloe Barbadensis Leaf Extract, Polymethyl methacrylate, Portulaca Oleracea Extract, Sodium Hyaluronate, Niacinamide, Cucumis Sativus (Cucumber) Extract, Tea (Camelia Sinensis) Extract, Punica Granatum Fruit Extract, Phenoxyethanol, Octocrylene, Butylene Glycol, Sodium Acrylates/C10-30 Alkyl Acrylates Crosspolymer, Propolis, Picea Abies Extract, Allantoin, Xanthan Gum*, Panthenol, Disodium EDTA, Fragrance, Lechitin. (Note: *Ingredients From Natural Resources)\n\n4 SKIN1004 Madagascar Centella Hyalu-Cica Water-Fit Sun Serum, sting rating = **2/5**\n\n    Water, Dibutyl Adipate, Propanediol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Polymethylsilsesquioxane, Ethylhexyl Triazone, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Niacinamide, Coco-Caprylate/Caprate, Caprylyl Methicone, Diethylhexyl Butamido Triazone, Glycerin, 1,2-Hexanediol, Butylene Glycol, Centella Asiatica Extract(9800ppm), Betula Platyphylla Japonica Bark Extract, Ginkgo Biloba Leaf Extract, Camellia Sinensis Leaf Extract, Triticum Vulgare (Wheat) Sprout Extract, Medicago Sativa (Alfalfa) Extract, Brassica Oleracea Italica (Broccoli) Sprout Extract, Eruca Sativa Leaf Extract, Camellia Japonica Leaf Extract, Sodium Hyaluronate(10ppm), Behenyl Alcohol, Poly C10-30 Alkyl Acrylate, Polyglyceryl-3 Methylglucose Distearate, Decyl Glucoside, Tromethamine, Carbomer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Stearoyl Glutamate, Polyacrylate Crosspolymer-6, Adenosine, Xanthan Gum, T-Butyl Alcohol, Tocopherol, Hydrolyzed Hyaluronic Acid(1ppm), Inositol, Hyaluronic Acid(0.01ppm), Pentylene Glycol, Ethylhexylglycerin\n\n5 I'm From Mugwort Essence, sting rating = **4/5** :(\n\n`Artemisia Princeps Extract 100%`\n\n6. [Glad2Glow Mugwort Salicylic Acid Acne Clay Stick](https://www.sociolla.com/clay-mask/78037-mugwort-salicylic-acid-acne-clay-stick), sting rating = 4/5. Even before tret I've always felt that this mask was tingly. Now it just stings.\n\n    WATER、KAOLIN、BUTYLENE GLYCOL、GLYCERIN、ARTEMISIA VULGARIS EXTRACT、SODIUM PALMITATE、DIGLYCERIN、SALICYLIC ACID、GLYCERYL POLYMETHACRYLATE、PVM/MA COPOLYMER、ILLITE、MICA、PEG-32、CI 77288、CI 77492、BETA-GLUCAN、PHENOXYETHANOL、CENTELLA ASIATICA EXTRACT、PEG-40 HYDROGENATED CASTOR OIL、TITANIUM DIOXIDE、PROPYLENE GLYCOL、CAPRYLYL GLYCOL、CURCUMA LONGA (TURMERIC) ROOT EXTRACT、FRAGRANCE、MENTHYL LACTATE、NIACINAMIDE、PINUS DENSIFLORA LEAF EXTRACT、RHAMNOSE、VERBASCUM THAPSUS EXTRACT.\n\n7. [ICM PHARMA Aqurea Moisturising Cream](https://www.nscpharmacy.com.sg/product/detail?id=639), sting rating = **2/5**. I thought this was supposed to be gentle.\n\n    Purified Water, Urea BP, White Soft Paraffin, Cetostearyl Alcohol, Disodium Hydrogen Orthophosphate, Liquid Paraffin, Ceteareth-20, Dimethicone, Citric Acid, Phenoxyethanol, Ethylhexylyglycerin\n\n8. Neutrogena Neutrogena Ultra Sheer® Dry-Touch Sunscreen Broad Spectrum SPF 55, sting rating = **2.5/5**.\n\n    water, styrene/acrylates copolymer, silica, dimethicone, potassium cetyl phosphate, benzyl alcohol, beeswax, caprylyl methicone, glyceryl stearate, peg-100 stearate, cetyl dimethicone, caprylyl glycol, ethylhexylglycerin, aluminum starch octenylsuccinate, behenyl alcohol, acrylates/dimethicone copolymer, xanthan gum, sodium polyacrylate, chlorphenesin, dimethicone/peg-10/15 crosspolymer, hydrolyzed jojoba esters, fragrance, disodium edta, ethylhexyl stearate, tocopheryl acetate, bht, trideceth-6, jojoba esters\n\n9. La Roche Posay Cicaplast Baume B5+, sting rating = **0/5!!** But I've read that this is not supposed to be used as a daily moisturiser? It is a lot thicker and oilier than products I'm used to but if there are no other options, it will do.\n\n    AQUA • HYDROGENATED POLYISOBUTENE • DIMETHICONE • GLYCERIN • BUTYROSPERMUM PARKII BUTTER / HEA BUTTER • PANTHENOL • PROPANEDIOL • BUTYLENE GLYCOL • ALUMINUM STARCH OCTENYLSUCCINATE • CETYL PEG/PPG-10/1 DIMETHICONE • TRIHYDROXYSTEARIN • ZINC GLUCONATE • MADECASSOSIDE • TRIBIOMA • MANGANESE GLUCONATE • SILICA • ALUMINUM HYDROXIDE • MAGNESIUM SULFATE • DISODIUM EDTA • COPPER GLUCONATE • CAPRYLOYL GLYCINE • CITRIC ACID • ACETYLATED GLYCOL STEARATE • POLYGLYCERYL-4 ISOSTEARATE • TOCOPHEROL • PENTAERYTHRITYL TETRA-DI-T-BUTYL HYDROXYHYDROCINNAMATE • CI 77891 / TITANIUM DIOXIDE\n\n10. La Roche Posay Lipikar Baume AP+M, sting rating = **1/5**\n\n    AQUA / WATER • BUTYROSPERMUM PARKII BUTTER / SHEA BUTTER • GLYCERIN • DIMETHICONE • NIACINAMIDE • CETEARYL ALCOHOL • BRASSICA CAMPESTRIS SEED OIL / RAPESEED SEED OIL • GLYCERYL STEARATE • AMMONIUM POLYACRYLOYLDIMETHYL TAURATE • PEG-100 STEARATE • PROPANEDIOL • OPHIOPOGON JAPONICUS ROOT EXTRACT • PEG-20 METHYL GLUCOSE SESQUISTEARATE • SORBITAN TRISTEARATE • DIMETHICONOL • SODIUM CHLORIDE • MANNOSE • COCO-BETAINE • DISODIUM EDTA • CAPRYLOYL GLYCINE • CAPRYLYL GLYCOL • VITREOSCILLA FERMENT • CITRIC ACID • MALTODEXTRIN • XANTHAN GUM • TOCOPHEROL • PENTAERYTHRITYL TETRA-DI-T-BUTYL HYDROXYHYDROCINNAMATE\n\n11. Vaseline Cocoa Butter, sting rating = **0/5**. But quite likely clogs my facial pores based on experience from years ago. Though I've been using this on my lips and dry eyelids for years.\n\n    Petrolatum, Theobroma Cacao (Cocoa) Seed Butter, Fragrance.\n\n12. The Tret Itself, sting rating = **1/5** LOL. It is less stinging than most other things here.\n\n**Yes I'm trying new products everyday** (except Hada Labo) because I'm trying to find one that doesn't sting! I haven't even started to evaluate if any of them are clogging my pores and breaking me out. Or even evaluating texture. I usually hate heavy emollients since I have oily skin in humid country but now I'm willing to try anything that works.\n\nThe products sting my cheeks and tingles my upper lip. The rest of my face feels ok, even my jaws which is usually where my acne is. And so far my skin type has slowly transformed into combo/dry when it was oily before.\n\nPS Vanicream is not available in my country :(\n\nAny advice or recommendations will be appreciated!",
    "flair_text": "Routine Help",
    "flair_template_id": "5f5bdcf0-1ba1-11eb-8f19-0e8dfcb50bc9",
    "comments": [
      {
        "author": "Exotic_Composer_2274",
        "body": "My latest choice is Round Lab dokdo cream 1025. \nBeen using it on tret .1% with no side effects. \nAnd for ultimate hydration I’d recommend Eucerin creams/lotions with 10% urea.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Exotic_Composer_2274",
        "body": "However I’m in the same boat with you for choosing a decent sunscreen. From my own experience I’ve learnt that chemical sunscreens can be veeeery irritating, especially while applied on “tret damaged” skin. And not even they can sting or burn it, I’m not 100% sure chemical sunscreens guarantee good protection (my pigmentation used to get darker and wider, uhhh). These days I’m using a physical sunscreen and I can say my skin colour doesn’t change even if I stay in the sun for 3-4 hours daily. \nThe main concern about a mineral sunscreen is a white cast on the face. Not every one wants to look like a kabuki actor, I guess 😄\nThat’s why I’ve recently switched to Japanese mineral sunscreens. They are mostly waterproof and have sort of a tint so that they give you a natural finish.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "huanghuanger",
        "body": "Hi op! I went through a similar retinoid journey as you and also started with a retinol before going with prescription strength. Also same thing with never needing a moisturizer because of the SEA heat and humidity before tret. Currently im using the isntree yam cream as a night moisturizer and i no longer buffer the tret after getting used to it. Maybe look into it? Isntree has an official shop on shopee so it’s p accessible. \n\nRegarding the stinging, personally ive found that products with niacinamide would end up stinging my face on extra sensitized days. I still use a sunscreen with niacinamide because i love the formula but if it starts stinging i know i need to up my barrier care.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Beep boop! It looks like you'd like information about applying tretinoin around the eyes. While many people do apply tretinoin around their eyes, this can cause permanent damage to the oil glands in the eyes, and can result in permanently dry eyes. Remember that tretinoin travels up to 2\" below the skin, so you'll still get anti-aging benefits even if you don't apply right next to your eyes. Be safe, and protect your eyes: don't apply tretinoin near your eyes or on your eyelids. [Here's what the Mayo Clinic has to say about safe tretinoin application.](https://www.mayoclinic.org/drugs-supplements/tretinoin-topical-route/proper-use/drg-20066521#:~:text=Do%20not%20use%20this%20medicine,the%20tips%20of%20your%20fingers) (To learn more, search for \"Meibomian gland dysfunction\")\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tretinoin) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  }
]