[
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "11ktfjb",
    "title": "Shelfie: ☀️😎 Sunscreens😎 ☀️ + more info ! (updated with more reviews✨✨)",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/11ktfjb/shelfie_sunscreens_more_info_updated_with_more/",
    "score": 160,
    "num_comments": 65,
    "created": "2023-03-07T08:18:47+00:00",
    "body": "edit : ek repost le lo kyuki garmi aagayi frands ☀️☀️😎✨\n\n \n\nhttps://i.redd.it/0cb7bo7kx9ma1.gif\n\nGarmi aaa gayi haiiii\\~ dhoop badh hui hai aur heatwaves pardhaar chuke hai 🥵🥵 obviously we need sunscreens! I realized I never reviewed the sunscreens I've used so far lmao and I've tried plenty . so here's a review on all of them!. edit : this post was found in my draft, eating dust , so I decided to finish and publish it! lmao what a great way to ignore ki boards chal rahe hai 🤡\n\nBut first , a little guide on what filters are used in sunscreens!\n\n**what is a filter ?**\n\n* *Specific chemicals, known as ultraviolet (UV) filters, are added to sunscreens to absorb or block UV radiation from the sun. UV filters can offer protection against both UVA and UVB rays.*\n\n**what are UVA and UVB rays?**\n\n* *UVA rays* :  Long-wavelength. Can damage our skin’s DNA, which leads to signs of aging such as wrinkles. UVA is also responsible for hyperpigmentation. Can penetrate to and affect the deeper layers of the skin. May also promote the development of skin cancers.\n* *UVB rays* : Short-wavelength. Responsible for sunburn, skin aging and can promote the development of skin cancer. Doesn’t penetrate beyond the skin’s superficial layers.\n\n**types of filters** :\n\n* *UVA* : fights UVA rays\n* *UVB* : fights UVB rays\n* *Broad spectrum* : Fights both UVA and UVB\n\nI've mentioned all the filters and their types under the sub-heading of each sunscreen. their IUPAC names or chemical names are written in the ingredients list so on that basis, you should be able to choose which sunscreen to buy by looking at the chemical names of the filters! they're all mention in order and a simple run on incidecoder can tell you all! I didn't know about filters in the beginning or while buying sunscreens, so it was fun learning experience making this post !\n\n**how to differentiate between a mineral and chemical sunscreen?**\n\n* simple! if a sunscreen uses minerals in their ingredients then its a mineral/physical sunscreen. minerals to look out for : zinc oxide and titanium dioxide. if a sunscreen uses stuff besides these too, their chemical sunscreens! lol this is the simplest way I can explain these two.\n* most sunscreens on this list and in general, use a mixture of both minerals and chemicals . so mineral + chemical = hybrid sunscreens!\n\nOur country lies near the equator, so the UV index here is quite high at all times . so applying sunscreen is a must. *#dhoopsebacherahosunscreenlagateraho\\~*\n\n**F18 (umar badh gayi but dimaag nahi 💀)**\n\n**skin type** : dry , dehydrated and acne-prone. earlier : oily/combo acne prone so this has a mix of both ss for dry and oily skin.\n\n**concerns** : PIH , acne (pustules, fungal and cystic) pit scars, pores, blackheads and sebaceous filaments .\n\n**weather** : tapti garmi + humidity . dry winters.\n\n&#x200B;\n\n[dhoop se bachne ki vastuae ](https://preview.redd.it/fnjipguox9ma1.png?width=4000&format=png&auto=webp&s=29d880ff6b482ade3f03237375ef02cdd64fb4e3)\n\n&#x200B;\n\n* **Dermaco. 1% Hyaluronic Sunscreen Aqua Gel \\[SPF 50 PA++++\\]**\n\n**Mrp** : Rs. 500 for 50ml from their website\n\n**for skin types** : all!\n\n**texture and appearance :** thin pale yellow gel-liquid. same texture as aloe vera gel but a little runny. fragrance free. absorbs completely . *hybrid sunscreen*.\n\n**ingredients list**: Aqua,Titanium Dioxide, Ethylhexyl Methoxycinnamate, Sodium Polyacrylate, Zinc Oxide,Glycerin, Butyl Methoxydibenzoylmethane, Xylitol, Phospholipids, Caprylic Acid, Glyceryl Stearate, Dimethicone, Hyaluronic Acid, Helianthus Annuus (Sunflower) Seed Oil, 1,3-Butylene Glycol, D-Alpha Tocopheryl Acetate, C12-C15 Alkyl Benzoate, Benzophenone-3, Aloe Barbadensis Leaf Juice, Sodium Benzoate, E-Ascorbic acid, Sodium Levullinate, Phenoxyehtanol, Allantoin, Melanin.\n\n**filters** :\n\n* Titanium oxide (UVB mineral filter)\n* zinc oxide (broad spectrum filter)\n* oxybenzone (UVB filter)\n* octinoxate (UVB filter)\n* avobenzone (UVA filter)\n\nlove, love, love it!! one of the best budget sunscreens out there! wish they had a bigger size tho :( . super hydrating and absorbs really fast! 1% HA keeps the skin hydrated and it does pill at all regardless of how congested your routine ( for people like me, who stuff their morning and evening routines with +5 products lmao #thooso thooso aur thooso). the pump makes it seem like you run out of it pretty quick but cut the bottle in half and it will last another 3 days! no whitecast either due to the gel consistency . can be used by all skin types since the new formulation doesn't have fragrance (the old one did). pretty hard to get sine its oos on all platforms sometimes :( . best thing is that , it doesn't give that greasy feeling when you touch your skin. however , it does have oxybenzone and octinoxate, which can irritate your skin so be careful! do give it a try tho!\n\n**rating** : 5/5 and WRP\n\n* **Re'equil oxybenzone free sunscreen \\[SPF 50 PA+++\\] (not in the pic since I finished it!)**\n\n**Mrp**: Rs. 460 for 50ml . bought from nykka.\n\n**for skin types** : oily and acne prone. maybe even combo.\n\n**texture and appearance** : white runny lotion. has fragrance. gives a shiny finish. *chemical sunscreen*.\n\n**ingredients list** : Aqua,Titanium Dioxide, Ethylhexyl Methoxycinnamate, Sodium Polyacrylate, Zinc Oxide,Glycerin, Butyl Methoxydibenzoylmethane, Xylitol, Phospholipids, Caprylic Acid, Glyceryl Stearate, Dimethicone, Hyaluronic Acid, Helianthus Annuus (Sunflower) Seed Oil, 1,3-Butylene Glycol, D-Alpha Tocopheryl Acetate, C12-C15 Alkyl Benzoate, Benzophenone-3, Aloe Barbadensis Leaf Juice, Sodium Benzoate, E-Ascorbic acid, Sodium Levullinate, Phenoxyehtanol, Allantoin, Melanin.\n\n**filters** :\n\n* octisalate (UVB filter)\n* octocrylene (UVB filter)\n* Tris-biphenyl triazine (UVB filter)\n* Tinosorb S (broad spectrum)\n\nok this was a huge let down. bought it since it was specifically marketed for oily skin. so much pilling and burning the area round my eyes :( . I got the airless pump packaging instead of the tube in some sort if limited edition packaging. whitecast is not an issue tho so that's nice. overall, didn't really find anything that good about it. didn't aggravate my acne so that's good. isn't water or sweat proof and will pill horrendously under a face mask 😖. if you have oily skin, you can give it a go although i would hardly suggest it to anyone tbh\n\n**rating** : 1/5 and WNRP\n\n* **L'Oreal Paris Uv Defender Serum Protector Sunscreen, Moist & Fresh \\[SPF 50+\\]**\n\n**Mrp** : Rs. 700 for 50ml (bought for Rs.550 from nykka)\n\n**for skin types** : only dry and combo skin types\n\n**texture and appearance** : white runny lotion. takes some time to absorb and rub in to eliminate whitecast. has a strong fragrance. the bottle design could be a pain when we're reaching the end of the product. hybrid sunscreen, has both physical and chemical filters!\n\n**ingredients list :** Aqua, Water, Ethylhexyl Methoxycinnamate, Titanium Dioxide, Squalane, Glycerin, Drometrizole trisiloxane , Terephthalylidene Dicamphor Sulfonic Acid, Propylene Glycol, Alcohol Denat., Triethanolamine, Dipropylene Glycol, Mica, Stearic Acid, Potassium Cetyl Phosphate, Tocopherol, Nylon-12, Ci 77891, Titanium Dioxide, Niacinamide, Sodium Cocoyl Sarcosinate, Sodium Chloride, Phenoxyethanol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Paeonia Suffruticosa Root Extract, Thermus Thermophillus Ferment, Peg-100 Stearate, Ethylhexyl Triazone, Trisodium Ethylenediamine Disuccinate, Palmitic Acid, Polysorbate 80, Limonene, Xanthan Gum, Linalool, Tromethamine, Isohexadecane, Caprylyl Glycol, Alpha-Isomethyl Ionone, Barium Sulfate, Carbomer, Acrylamide/Sodium Acryloyldimethyltaurate Copolymer, Myristic Acid, Sorbitan Oleate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Cetyl Alcohol, Butylene Glycol, Bht, Butyrospermum Parkii Seed Cake Extract, Shea Seedcake Extract, Potassium Sorbate, Aluminum Hydroxide, Hexyl Cinnamal, Glyceryl Stearate, Parfum, Fragrance\n\n**filters :**\n\n* octinoxate (UVB filter)\n* titanium dioxide (UVB mineral filter)\n* Mexoryl XL (UVA and UVB filter, marketed by loreal as meroxyl XL but is called Drometrizole trisiloxane everywhere else)\n* Mexoryl XS (UVA filter , again marketed exclusively by loreal but known as Terephthalylidene Dicamphor Sulfonic Acid everywhere else)\n* Uvinul A plus (UVA filter)\n* Uvinul T 150 (UVB filter)\n\nomg this was so hyped when it first came out lol. I'd never tried loreal's previous ss so I had no previous expectations from it. first of all, its nice that they have different variants. I ultimately went with moist and fresh since it was marketed for dry skin types. the result was....underwhelming to say the least. its really greasy and sit on my face for a good 30 mins before the greasiness goes away. no pilling so that's nice. it does require some more rubbing for the whitecast to go away. leaves a shiny dewy look which I'm not very fond of but if you're into it, then go ahead. really strong fragrance tho so it could irritate sensitive skin types. for the hydrating factor, I'm not sure if it did anything since my AM routine already has quite a bit of hydration layering going around. overall, its a little heavy for humid climate where i live. drier ones might benefit from it. sun protection is okayish . also have to comment on the good range of filters it has so more frequent use will prevent tanning for sure!\n\n**rating** : 3/5 and MRP maybe in another variant.\n\n* **A'PIEU Sun Block Cream \\[SPF 45\\]**\n\n**Mrp:** Rs. 700 for 50ml (bought it from amazon at dhamaka sale. had 60% so it was very cheap but due to customs and all it retails for around 2000 now. there are some sites like maccaron which sell it at 700 tho)\n\n**for skin types** : all except for sensitive type due to fragrance! packaging says dry skin types but could work for all imo.\n\n**texture and appearance** : off white cream. kind of thick but blendable. takes a while to absorb but once it does, it leaves a refreshing finish. has fragrance. chemical sunscreen.\n\n**ingredients list**: Water, Butyl Methoxydibenzoylmethane, Citrullus Lanatus (Watermelon) Fruit Extract, Sorbitan Olivate, Citrus Aurantifolia (Lime) Flower Extract, Sorbitan Isostearate, Tocopheryl Acetate, Nylon-12, Panthenol, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Oryza Sativa (Rice) Bran Extract, Polyisobutene, Caprylyl Glycol, BHT, Sea Water, Polyacrylate-13, Polysorbate 20, Cetearyl Olivate, Phenylbenzimidazole Sulfonic Acid, Ethylhexyl Salicylate, Fragrance, Dimethicone, Aloe Barbadensis (Aloe Vera) Leaf Extract, Glyceryl Stearate, Ethylhexylglycerin, Prunus Persica (Peach) Flower Extract, Punica Granatum Flower Extract, Pyrus Malus (Apple) Flower Extract, Malpighia Glabra (Acerola) Fruit Extract, Eucalyptus Globulus (Tasmanian Blue Gum) Leaf Extract, Sorbitan Stearate, Ethylhexyl Methoxycinnamate, PEG-100 Stearate, Butylene Glycol, Methyl Methacrylate Crosspolymer, Citrus Aurantium Dulcis (Orange) Flower Extract, 1,2-Hexanediol, Prunus Avium (Sweet Cherry) Flower Extract, Disodium EDTA, Caprylic/Capric Triglyceride, Cetearyl  Alcohol, Sodium Hydroxide, Rosa Damascena (Rose) Flower Water\n\n**filters**:\n\n* Avobenzone (UVA filter)\n* Tinosorb S (broad spectrum)\n* octyle salicylate (UVB filter)\n* ensulizole (UVB filter)\n* octinoxate (UVB filter)\n\nBought this at first glance since it looked so cheap on amazon lmao. probably the cheapest Korean sunscreen I've found. and it works so good! really creamy and gel like. absorbs within minutes and no whitecast whatsoever. fragrance is there but it smells like any other sunscreen. there is a 100ml variant as well for 1050 I think but I haven't been able to find that. but either way, super effective in preventing tanning and doesn't irritate my acne at all!\n\n**rating** : 5/5 and WRP\n\n* **Conscious Chemist sun drink Hybrid Lightweight Gel Sunscreen \\[SPF 50 PA++++\\]**\n\n**Mrp**: Rs. 600 for 50ml (bought for 450 from foxy)\n\n**for skin types** : all! no exceptions for this one!\n\n**texture and appearance** : off white light gel. pump packaging so ease in takin the product out. fragrance free. absorbs withing seconds no joke. hybrid sunscreen.\n\n**ingredients list** : Aqua, Titanium Dioxide, Zinc Oxide, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Octocrylene, 1,3 Butylene glycol, Lecithin, Ceramide NP, Phospholipids, Aluminum Hydroxide, Stearic Acid, Helianthus Annuus (Sunflower) Seed Oil, Alpha lipoic acid, Sodium Polyacrylate, Xylitol, Ceramide AP, Ceramide EOP, Cholesterol, Sodium Lauroyl Lactylate, Caprylic Acid, Glyceryl Stearate, Sodium Hyaluronate, Phytosphingosine, Milk Thistle Extract, D-alpha Tocopherol Acetate, Olive squalane, Sorbitol, Resveratrol, Sodium Levulinate and Potassium Sorbate\n\n**filters**:\n\n* titanium dioxide (UVB mineral filter)\n* zinc oxide (UVB mineral filter)\n* octinoxate (UVB filter)\n* avobenzone (UVA filter)\n* octocrylene (UVB filter)\n\nthis was a major surprise! I know conscious chemist has a shitty rep here, which is completely understandable. I too have had ugly experiences with their new pigmentation serum (which I ultimately returned) but I ordered this along with it. and this is by far the best indian ss I've came across! even I cant believe this jewel came from a shitty company like cc but damn 🔥🔥. comparison wise, quite similar to dermaco HA (bonus!) but way thinner and kind of watery. super refreshing to apply. no greasy feeling or pilling. no whitecast. wished it had more UVA filters tho since they cause more skin diseases. but since it has a lot of UVB filters, it does prevent tanning pretty well! budget wise , its at 25% off at foxy most of the times, not so much on nykka. really enjoy this one!\n\n**rating** : 5/5 and WRP\n\n* **La Roche-Posay Anthelios UVMune 400 Invisible Fluid Fragrance-Free \\[SPF 50+\\]**\n\n**Mrp**: CHF 31.95 for 50ml ( dad bought it from Switzerland but around Rs. 2450 🥵)\n\n**for skin types** : all! no exceptions for this one either!\n\n**texture and appearance** : pale yellow fluid. really really watery , almost like a serum. lightweight and absorbs in a few minutes. fragrance free. chemical sunscreen.\n\n**ingredients list** : AQUA / WATER ● ALCOHOL DENAT. ● TRIETHYL CITRATE ● DIISOPROPYL SEBACATE ● SILICA ● ETHYLHEXYL SALICYLATE ● BIS-ETHYLHEXYLOXYPHENOL METHOXYPHENYL TRIAZINE ● ETHYLHEXYL TRIAZONE ● BUTYL METHOXYDIBENZOYLMETHANE ● GLYCERIN ● PROPANEDIOL ● C12-22 ALKYL ACRYLATE/HYDROXYETHYLACRYLATE COPOLYMER ● SODIUM CITRATE ● METHOXYPROPYLAMINO CYCLOHEXENYLIDENE ETHOXYETHYLCYANOACETATE ● PERLITE ● TOCOPHEROL ● CAPRYLIC/CAPRIC TRIGLYCERIDE ● ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER ● CAPRYLYL GLYCOL ● CITRIC ACID ● DIETHYLAMINO HYDROXYBENZOYL HEXYL BENZOATE ● DROMETRIZOLE TRISILOXANE ● HYDROXYETHYLCELLULOSE ● TEREPHTHALYLIDENE DICAMPHOR SULFONIC ACID ● TRIETHANOLAMINE ● TRISODIUM ETHYLENEDIAMINE DISUCCINATE\n\nsorry in all caps lol. its the only way I found it and I ain't changing it cuz I'm ✨lazy✨\n\n**filters** :\n\n* octisalate (UVB filter)\n* Tinosorb S (broad spectrum)\n* Uvinul T 150 (UVB filter)\n* avobenzone (UVA filter)\n* Uvinul A Plus (UVA filter)\n* Mexoryl XL (broad spectrum)\n* mexoryL SX (UVA filter)\n\nis it a surprise that foreign sunscreens have more filters than indian ones?🥲 hehe, we'll get there someday! anyway I had no idea about how LRP products worked on indian skin. but my dad bought a bunch of them (cicaplast baume, vit-c and hyalu 5 serums) from his trip so here we are! so due to my not-so-aware-about-this-brand thingy, I didn't expect this to be this watery damn. even the ones on insta were cream like but no this was the fluid. I absolutely love how this just absorbs and moisturizes my skin instantly. no whitecast or greasy feeling at all! I feel like this would work wonders for the most oiliest of skin types especially, since it hydrates but absorbs oil at the same time! because its so fluid, didnt pill my routine at all. does it prevent tanning tho? haven't clearly tested it out yet. I'm trying to stretch this as much as i can, knowing well enough id never buy it in INR again unless my dad goes again lmao. i will update this portion once i feel like its showing its effects for tanning! till then , this is amazeballs!\n\n**rating** : 4/5 and sabko pata hai 🥲\n\n* **Isntree Hyaluronic Acid Airy Sun Stick**\n\n**Mrp** : Rs. 1850 for 22 gm (bought from beauty barn. sale lage toh cheen lena lol although youll get it much cheaper from an insta seller at around 1550)\n\n**for skin types** : dry and sensitive. could be icky for oilier types. okayish for combo. read the review for further explanation.\n\n**texture and appearance** : pura roll out karne ke baad, it looks like a candle lol. waxy and soft when you glide and ahaaa\\~ ekdum hawa ki tarah lagta hai hehe. have to rub and spread it out evenly after running the stick over. fragrance free. kind of sits on the face for a while but then vanishes into skin like magic! chemical sunscreen.\n\n**ingredients list** : Water, Polyethylene, Propylheptyl Caprylate, C12-15 Alkyl Benzoate, Homosalate, Silica, Ethylhexyl Methoxycinnamate, Neopentyl Glycol Diheptanoate, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Ethylhexyl Salicylate, Butylene Glycol, Synthetic Fluorphlogopite, Niacinamide, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Vinyl Dimethicone, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Ozokerite, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Pinus Pinaster Bark Extract, Bambusa Vulgaris Water, Mesembryanthemum Crystallinum Extract, Hibiscus Sabdariffa Flower Extract, Ceramide NP, Glycerin, Olea Europaea (Olive) Fruit Oil, Laminaria Japonica Extract, Ulmus Davidiana Root Extract, Aloe Barbadensis Leaf Extract, Viola Mandshurica Flower Extract, Dioscorea Japonica Root Extract, Polyglyceryl-2 Dipolyhydroxystearate, Polyurethane-11, Glyceryl Caprylate, Sorbitan Sesquioleate, Sodium Hyaluronate, Adenosine, Astaxanthin, Pentylene Glycol, Sodium Acetylated Hyaluronate, Sodium Hyaluronate Crosspolymer, Ascorbyl Propyl Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Hydrolyzed Sodium Hyaluronate, Hydrolyzed Hyaluronic Acid, Hyaluronic Acid, Triethoxycaprylylsilane, Caprylyl Glycol, Ethylhexylglycerin, 1,2-Hexanediol\n\n**filters**:\n\n* homosalate (UVB filter)\n* octinoxate (UVB filter)\n* octisalate (UVB filter)\n* Uvinul A Plus (UVA filter)\n* Tinosorb S (broad spectrum)\n\nwhat a challenge it was to convince my dad to let me buy this 😖 somewhere even I wondered whether I should go with their watery sun gel instead of this. but then I was , aalas toh hoga hi, try karlete hai . le liya, daant bhi khai, bhashand bhi suna. but got it finally! I treat it very careful since this is probably the most expensive thing I've got with my own money lmao 🤡 maheeno ki pocket money ki bachai ke baad liya gaya hai, had a lot of expectations. and they did meet! really smoothe and soft when applied on the skin. have to rub in a little so it spreads out evenly. the texture after application is kind of like how a silicon ss would feel like but way less intense. even if it has a  fuckton of variants of HA , it isn't as hydrating , which was expected since its in a hard form lol. no whitecast obviously. thankfully no pilling since I was expecting stuff to pill when I drag it over. but it didn't happen! now for skin types, it can definitely work for dry and sensitive skins. oily skin types can find it a bit chip-chip due to humidity and high temperatures. could work substantially for combo skins as well, just take care of the t-zone tho. that being said, this is more suitable to work on all skin types during cooler temperatures in winter. also don't know whether it will let makeup stay on after application since I dont use makeup . but I can try since I do have foundation and shit. lemme know! sunburn and tanning is still under observation. will update this portion in the coming weeks!\n\n**rating** : 4/5 and lets see 👀 / id highly recommend this to buy only if your wallet allows you to! I did find it a bit mediocre and kind of not worth the price (should be retailed around 1100 smth) and you're better off buying a better fluid/cream ss in that much money.\n\n* **The Derma Co.** **1% Hyaluronic Acid Sunscreen Serum** \\[SPF 50 PA+++\\]\n\n**Mrp** : Rs. 500 for 30 ml (bought from amazon)\n\n**For skin type** : all!\n\n**texture and appearance** : white thin liquid. fragrance free. really watery and leaves a dewy-shiny finish. chemical sunscreen.\n\n**ingredient list** : Purified Water, Glycerin, Avena Strigosa Seed Extract, Lecithin, Potassium Sorbate, Citric Acid, Hydrogenated Polyisobutene, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Benzophenone-3, Phospholipids, 1,3 Butylene Glycol, Niacinamide, Silica, Sodium Hyaluronate, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Decyl Glucoside, Propylene Glycol, Xanthan Gum, Betaine, Phenoxyethanol, Ethylhexylglycerin, Polyacrylamide, C13-14 Isoparaffin, Laureth-7 & Disodium EDTA.\n\n**filters** :\n\n* octinoxate (UVB filter)\n* avobenzone (UVA filter)\n* oxybenzone (UVB filter)\n* Tinosorb M (broad spectrum)\n\nthis was....okay-ish? idk but I was really excited for this since their HA sun gel is one of my HGs. This is kind of enjoyable, I really liked the watery texture and it didn't pill my routine at all , even during re-application. the dropper wasn't that much of a hassle to handle and worked great. the finish is something I'm not a fan of . the dewy-ness makes me look oily and sweaty and I have a tendency to touch my face a lot (really bad ik) but it feels greasy when I do that. its not sweatproof but the good thing is that when you do sweat, it doesn't bead off as white, meaning it wouldn't look like you got milk thrown at your face lmao. it does a good job in preventing tan but again with frequent application . I feel like it made me sweat a little faster but that could just be me. also the quantity you get is really less 😖 if I was to apply this everyday with 4 re-applications , this would  get over within 2 weeks. I used one whole dropper full on my face and neck btw. but being a liquid, I feel it spreads much better than a cream.\n\nrating : 3/5 and WNRP . you're better off with the gel formulation. I found this really mediocre.\n\n* **Axis-Y Complete No-Stress Physical Sunscreen \\[SPF 50+ PA++++\\]**\n\n**Mrp** : Rs. 1450 for 50ml (bought for Rs.999 from beauty barn)\n\n**For skin types** : oily combo skin types. those with dry skin like mine, might find it a bit more drying. good one for sensitive skins since it has a lot of calming ingredients as well!\n\n**texture and appearance** : thick white cream. fragrance free but has very strong ayurvedic smell. matte finish. physical sunscreen.\n\n**ingredients list** : Water, Zinc Oxide, Propylheptyl Caprylate, Butyloctyl Salicylate, Propanediol, Titanium Dioxide, Butylene Glycol Dicaprylate/Dicaprate, Dicaprylyl Ether, Caprylyl Methicone, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Disiloxane, Niacinamide, Trimethylsiloxysilicate, Calendula Officinalis Flower Extract, Camellia Sinensis Leaf Extract, Artemisia Capillaris Flower Extract, Vitis Vinifera (Grape) Seed Extract, Juniperus Virginiana Oil, Cedrus Atlantica Bark Oil, Amyris Balsamifera Bark Oil, Pogostemon Cablin Oil, Chamomilla Recutita (Matricaria) Flower Water, Disteardimonium Hectorite, Magnesium Sulfate, Stearic Acid, Aluminum Hydroxide, Triethoxycaprylylsilane, Methyl Methacrylate Crosspolymer, Polyglyceryl-3 Polydimethylsiloxyethyl Dimethicone, 1,2-Hexanediol, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Polymethylsilsesquioxane, Glyceryl Caprylate, Caprylyl Glycol, Ethylhexylglycerin, Adenosine, Copaifera Officinalis (Balsam Copaiba) Resin, Tocopherol, Squalane, Allantoin, Butylene Glycol, Glycerin, Palmitoyl Tripeptide-5\n\n**filters** :\n\n* zinc oxide (mineral filter)\n* titanium dioxide (mineral filter)\n\nthis had been on my 'to buy' list for such a long time! and I finally got it during a march beauty barn sale! when I first tried it, I was really skeptical since it gave me a pretty bad whitecast and smelt so weird. I'm still not fond of the smell as it smells like the corner of an ayurvedic shop 😭. but afterwards I let it set on my face a little longer, and the whitecast goes away! it takes a good 5-7 min for it go away and I still got whitecast around my mouth. looked like doodh ki moochi lol (also have pigmentation and have to colour correct with orange) . so a little bummed about that :(  but then with mineral sunscreens, you're more prone to get a whitecast than a chemical one. it settles to a matte finish which I really liked! surprisingly I didn't really sweat with this on, maybe because I wore this inside my house more than outside so I'm not sure whether it will sweat off white or not. tanning and sun protection wise, cant say much (previous sentence). this was a bit drying for me and I had to apply 3 fingers worth to get some moisturization. I feel like I have to use this for a little longer to give a better review but for now I hope this helps.\n\nupdate : this ones a hard no for me. is it calming? yes. but the whitecast is too much. and when i sweat it literally looks like I'm secreting milk from my skin  (~~nipple)😭😭~~\n\n**rating** : 3.5/5 and MRP . on the edge of recommending this to people having medium-dark skin types (like mine) due to white cast.\n\n* **ISNTREE Hyaluronic Acid Watery Sun Gel \\[SPF 50 PA++++\\]**\n\n**Mrp** : Rs. 1650 for 50ml (bought for Rs.1400 from beauty barn)\n\n**For skin types** : all! although most people say its for oily-combo, I found this to work equally well for dry skin types as well.\n\n**texture and appearance** : white watery gel as the name suggests lol. fragrance free. dewy-matte finish. chemical sunscreen.\n\n**ingredients list** : Water, Butylene Glycol, Ethylhexyl Salicylate, Homosalate, Dibutyl Adipate, Niacinamide, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Cyclopentasiloxane, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Polysilicone-15, Diethylamino Hydroxybenzoyl Hexyl Benzoate, 1,2-Hexanediol, Pentylene Glycol, Pinus Pinaster Bark Extract, Ceramide NP, Centella Asiatica Extract, Glycerin, Portulaca Oleracea Extract, Houttuynia Cordata Extract, Olea Europaea (Olive) Fruit Oil, Ficus Carica (Fig) Fruit Extract, Sodium Hyaluronate, Ceteth-10, Hydrogenated Lecithin, Decyl Glucoside, Propanediol, Tocopherol, Astaxanthin, Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Ascorbyl Propyl Hyaluronate, Hydrolyzed Hyaluronic Acid, Hydroxypropyltrimonium Hyaluronate, Acrylates/​C10-30 Alkyl Acrylate Crosspolymer, Sodium Acetylated Hyaluronate, Hydrolyzed Sodium Hyaluronate, Adenosine, Xanthan Gum, Cetyl PEG/​PPG-10/​1 Dimethicone, Tromethamine, Carbomer, Propylene Glycol, Ethylhexylglycerin.\n\n**filters** :\n\n* Tinosorb M (broad spectrum)\n* Parsol SX (inorganic UV filter)\n* Uvinul A Plus (UVA filter)\n* octisalate (UVB filter)\n* homosalate (UVB filter)\n* Tinosorb S (broad spectrum)\n\nman people don't lie when they say its there HG cuz damn this one is 🔥🔥🔥. so worth the hype! lightweight, watery and absorbs really well! when I touch my face, it doesn't feel greasy and really hydrating as well. and those filters already make me drool 🤤 only one drawback is the dewy finish , which I'm not fond of. no whitecast and no sweating milk drops for sure! in terms of sun burn and tanning prevention, this is gold! ughhhh it would be my HG if the price tag wasn't so hefty 😖 I use this only when I'm out for important outings aka bahar junk food khane jana lmao 😌 so you can guess I go out a lot heheh. I feel like this one is getting over sooner than others in my ss ki theli 😫 but either way, if you find a good deal on it, blindly add this to your cart and order it. you wont be dissappointed!\n\nrating : 5/5 and WRP on reduced mrp only.\n\n* **Beauty of Joseon Relief Sun : Rice + Probiotics (SPF50+ PA++++)**\n\n**Mrp** : Rs. 1530 for 50ml (bought for Rs.1200 from beauty barn)\n\n**For skin types** : dry, sensitive, acne prone and combination\n\n**texture and appearance** : creamy white lotion (ya nasty-). unscented ( ha, ha , aur socho ashleel cheeze 🤡)\n\n**ingredients list :**   Oryza Sativa (Rice) Bran Water, Glycerin, Methyl Methacrylate Crosspolymer, C12-15 Alkyl Benzoate, 1,2-Hexanediol, Behenyl Alcohol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Niacinamide, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Sodium Acrylate/​Sodium Acryloyldimethyl Taurate Copolymer, Potassium Cetyl Phosphate, Water, Ammonium Acryloyldimethyltaurate/​VP Copolymer, Polyisobutene, Silica, Caprylyl/​Capryl Glucoside, Sorbitan Oleate, Adenosine, Butylene Glycol, Disodium EDTA, Bifida Ferment Filtrate, Lactobacillus Ferment,Streptococcus Thermophilus Ferment\n\n**filters :**\n\n* uvinul A Plus (UVA filter)\n* Tinosorb S (broad spectrum)\n\nthis deserves all the hype it gets on the net. my current and forever HG sunscreen (unless they change formulation). seriously this ticks all the boxes . no whitecast? check. great filters? check. doesn't make you face look like you rub pan grease on it? check. it absorbs so well and is more moisturizing than some of the moisturizers out there. obviously, wished we would get more quantity for the price paid but itna criticise karne ke baad bhi, brands toh behre hai 😔and on reapplication, doesnt feel like im doing the 100 layers challenge lol. plus , I don't feel regret when applying it these days, cuz no fear of sunscreen melting during winters (#rajailife) . *taareef karu kya uski, jisneee tujhe banayaaaa✨\\~*\n\n**rating :** 5/5 and forever HG\n\n* **Benton Mineral Sun Stick SPF50+ PA++++**\n\n**Mrp** : Rs. 1650 for 15g (haalat kharab biros). got it at 30% on beauty barn\n\n**For skin types** : normal and sensitive skin types\n\n**texture and appearance** : a white stick. that's it. kind of a really thick lotion like texture. unscented and smol. mineral sunstick.\n\n**ingredients list** :  Coco-caprylate/caprate, sunflower seed wax, propylene glycol dicaprylate, H-di/trimethylol hexyllactone cross polymer, C12-15 alkyl benzoate, titanium dioxide, dicaprylyl carbonate, Synthetic fluorphlogopite, vinyl dimethicone, microcrystalline wax, aluminum stearate, polyhydroxystearic acid, purslane extract, centella extract, sodium hyaluronate, hydrolyzed hyaluronic acid, sodium Acetylated hyaluronate, caprylic/capric triglyceride, polyglyceryl-4diisostearate/polyhydroxystearate/sebacate, silica, alumina, pentylene glycol, allantoin, panthenol, Glycerin, Madecassic Acid, Asiaticoside, Asiatic Acid, Xylyl Glucoside, Anhydroxylitol, Xylitol, Glucose, Glyceryl Caprylate, Triethoxycaprylylsilane, Stearic Acid, Tocopherol, Purified Water, 1, 2-hexanediol, ethylhexylglycerin\n\n**filters** :\n\n* titanium dioxide\n\nthis one came around the same time as the tocobo sunstick on beauty barn so being the ✨phisool kharchi wala baccha✨, I bought both of them. unfortunately , this one was a big letdown. how tf can a sunstick leave a whitecast? this one is a great example. first off, it requires a lot of pressing and dragging across the face to dispense , so not fond of that, especially when I have active acne. secondly, it legit looks like someone rubbed fair and lovely mixed with water on my face 💀. its not waterproof, expensive for the quantity you get and gives a disappointing finish and result. I'm not particularly sure about protection against sun on this one but oh well. also piddu si stick hai so kind of cute but lootne wala hai lmao\n\n**rating** : 2/5 and WNRP\n\n* **Tocobo** **Cotton Soft Airy Sun Stick SPF50 Pa++++**\n\n**Mrp** : Rs. 1550 for 20g (bought at 1100 from beauty barn)\n\n**For skin types** : oily, combination, acne prone skin.\n\n**texture and appearance** : pale blue long cylinderical like stick. has a really pleasant and soft floral fragrance . leaves a matte fininsh and doesnt feel greasy on apllication. hybrid sunscreen.\n\n**ingredients list :**  Water, Dibutyl Adipate, Propanediol, Ethylhexyl Triazone, Terephthalylidene Dicamphor Sulfonic Acid, Polyglyceryl-3 Distearate, Niacinamide, Tromethamine, Cetearyl Alcohol, 1,2-Hexanediol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Pentylene Glycol, Polysilicone-15, Vigna Radiata Seed Extract, Gossypium Herbaceum (cotton) Extract, Sophora Flavescens Root Extract, Rheum Palmatum Root/Stalk Extract, Scutellaria Baicalensis Root Extract, Phellodendron Amurense Bark Extract, Oenothera Biennis (evening primrose) Flower Extract, Ulmus Davidiana Root Extract, Pinus Palustris Leaf Extract, Pueraria Lobata Root Extract, Sodium Hyaluronate, Gossypium Herbaceum (cotton) Seed Oil, Polymethylsilsesquioxane, Sodium Polyacryloyldimethyl Taurate, Glyceryl Stearate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Potassium Cetyl Phosphate, Glycerin, Glyceryl Stearate Citrate, Inulin Lauryl Carbamate, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Ethylhexylglycerin, Adenosine, Butylene Glycol, Tocopherol, Fragrance\n\n**filters** :\n\n* octocrylene (UVB filter)\n* octinoxate (UVB filter)\n* octisalate (UVB filter)\n* Uvinul A Plus (UVA filter)\n* Tinosorb S (broad spectrum)\n* titanium dioxide (physical filter)\n\nprobably the only sun stick that comes even close to the isntree sun stick. this gives such a good matte finish without any greasy feel . plus has cute floral smell to it that doesn't transfer to your skin or anything. and damn what a bang for a buck. probably the closest dupe for the isntree one. the only con is that it kind of pills after the 3rd application and rubs of oily after a while. if you are a person who touches their face every once in a while (like my dumbass), you might find it a bit uncomfortable. that being said, most of the times I just blot the grease away after 3-4hrs of application and apply another layer afterwards. sun protection wise, it does a good job! my forehead is the area that is the most prone to getting tan and it looked quite even toned after 3 weeks of consecutive use. one of my most favorite sticks (😏)\n\n**rating** : 4.5/5 and lets seeee\n\n* **Neutrogena beach defense sun stick water + sun protection SPF 50+**\n\n**Mrp** : Rs 1260 for 42 g (got it at Rs. 900 from amazon)\n\n**for skin types** : honestly, none lmao. I used it as a body stick most of the time with how oily this was. but can be used by anyone ig\n\n**texture and appearance** : whitish yellow stick. has a fruity kind of smell. really oily and greasy on first application that doesn't absorb or goes away after a while.\n\n**ingredients list** :  Neopentyl Glycol Diethylhexanoate, Octyldodecyl Neopentanoate, Polyethylene, Isohexadecane, Butyloctyl Salicylate, Ozokerite, Paraffin, Synthetic Beeswax, C12-15 Alkyl Benzoate, VP/Eicosene Copolymer, Neopentyl Glycol Diisostearate, Dimethicone, Diethylhexyl 2,6-Naphthalate, Styrene/Acrylates Copolymer, Fragrance, BHT\n\n**filters** :\n\n* avobenzone (UVA filter)\n* octocrylene (UVB filter)\n* octisalate (UVB filter)\n* homosalate (UVB filter)\n\noof this was an impulse purchase that I regretted later on. mind you, this is a great sunstick for your body but definitely not for your face . not to mention its waterproof . but the tapti garmi really just melts everything in its way and this is no exception. bhai itna chip chipa lagta hai i dont even feel like putting this on just because of the MoIsT feeling it gives. unless you're going to a pool or beach (as it suggests duh) , if you're okay with feeling like [that peanut butter baby](https://www.google.com/url?sa=i&url=https%3A%2F%2Fwww.independent.ie%2Flife%2Ffamily%2Fthis-peanut-butter-baby-is-sure-to-brighten-up-your-day-31499579.html&psig=AOvVaw0Qc7SXcD436wP5Ywrn_yJv&ust=1678212392776000&source=images&cd=vfe&ved=0CBAQjRxqFwoTCIDzt77yx_0CFQAAAAAdAAAAABAE) , then you can give it a try. it  does provide a good amount of product for the price and is a solid waterproof one fosho. but nahi jhela jata for some reason 😣😣😫\n\n**rating** : 1/5 and WNRP\n\nme after buying and trying all of these to find my HG\n\n&#x200B;\n\nhttps://i.redd.it/zzjpjrbly9ma1.gif\n\nbut it was fun doing this in a span of a few years and I finally got one that fits all my boxes . the BOJ one is seriously godsent for me ✨✨~~lets just ignore that it makes my wallet cry every time I buy it .~~ But id rather spend more on stuff that works than just hit and trials lmao. also I've gone past my obsession on using sun sticks as a whole since they require quite a lot of pressing while applying and the application just irritates my acne a lot 😫 imma finish the ones I have but I have no intentions on buying anymore from any brands (even though the minimalist and earth rhythm ones look good 🤡)more reviews to come! ill be doing one on stuff my dad will be bringing from the U.S in the next few weeks so do let me know if you'd like a follow up on those too! (~~why do i treat my posts like a sitcom😭).~~  and as always, any other questions, comments are always welcomed and so are dms!\n\nbyeeee 💖💖",
    "flair_text": "Best of ISCA | March 2023",
    "flair_template_id": "d4113128-bbe3-11ed-9f57-aac7ffd03cff",
    "comments": [
      {
        "author": "chickenwingsandcoke",
        "body": "Automod needs to chill 💀",
        "score": 35,
        "is_top_level": true
      },
      {
        "author": "Puzzleheaded-Bee8279",
        "body": "Badi amir pratit hoti ho balika",
        "score": 30,
        "is_top_level": true
      },
      {
        "author": "chickenwingsandcoke",
        "body": "also my post exceeded the word limit so here's some more lmao :\n\n   \n\n* **Cetaphil Sun light gel \\[SPF      50+\\]**\n\n**Mrp** : Rs. 950 for 50 ml on amazon (bought from local pharma at a very low price . I don't remember how much but it was around 300 and way less than you find it online)\n\n**for skin types** : I don't even know. its that disappointing . but maybe for oily and combo skins. too drying for dry and heck no for sensitive skin.\n\n**texture and appearance** : off-white lotion-gel like consistency. white cast is so major you cant rub it away. fragrance free but I feel like it can irritate some skin types. chemical sunscreen.\n\n**ingredients list** : Ethylhexyl Methoxycinnamate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Ethylhexyl Triazone, Methylene-Bis-Benzotriazolyl, Tetramethylbutylphenol. (couldn't find the whole ingredients list. these are the IUPAC names of the filters mentioned below in order)\n\n**filters** :\n\n&#x200B;\n\n* octinoxate (UVB filter)\n* Tinosorb S (broad spectrum)\n* Uvinul A plus (UVA filter)\n* Uvinul T 150 (UVB filter)\n* Tinosorb M (broad spectrum)\n\nthis was so bad I stopped using after 5 tries 😖 such noticeable white cast! plus burning on top of that. the amount of filters it has is amazing but such disappointing performance ughh. I enjoy majority of the cetaphil products but this was just not it. maybe those with lighter skin types would like it but the whitecast is way too much for me. plus the grease and pilling could probably compare to re'equil orange tube. currently using it on my body. the good thing is that, it does prevent sun tanning but is gonna be over soon since its a 50ml tube. if you don't mind whitecast on your body, then this could be a good body ss. but for the face, its a hard no from my side.\n\n**rating**: 2/5 and WNRP\n\n   \n\n* **Dermaco. Ultra Matte      Sunscreen Gel \\[SPF 60 PA +++\\]**\n\n**Mrp** : Rs. 700 for 50ml (got it free with my first purchase with Dermaco.) from their website.\n\n**For skin types** : oily and acne-prone. but only this combo.\n\n**texture and appearance** : pale yellow. thick and balmy texture like any other sunscreen with silicone. has fragrance . *hybrid sunscreen.*\n\n**ingredients list**: Cyclopentasiloxane (and) Dimethicone Crosspolymer, Zinc Oxide, C12-15 Alkyl Benzoate, Caprylyl Methicone (and) PEG-12 Dimethicone/PPG-20 Crosspolymer, Aluminum Starch Octenylsuccinate, Isononyl Isononanoate, Polyhydroxystearic acid, Cyclopentasiloxane (and) Dimethiconol, VP/Eicosene Copolymer, Tocopheryl Acetate, Fragrance.\n\n**Filters** :\n\n&#x200B;\n\n* Tinosorb S (broad spectrum)\n* Uvinul A Plus (photostable      UVA filter)\n* Uvasorb (short spectrum UVB      filter)\n* PARSOL TX (inorganic UV      filter)\n* Titanium Dioxide ( UVB      mineral filter)\n\nI got it when dermaco had just launched and when they had like 4-5 products only. back then I had oily and acne-prone skin since I wasn't on retinoids. it literally melted like butter on skin (looks like too. makhan laga rahe hai-) and is incredibly mattifying. didn't break me out at all. I tried it again when my skin type changed to oily .But this is complete torture for dry skin! makes it even drier 🥲. that's why its better for oily and acne prone skin more! combo skins can try aswell. don't know it functionality as a makeup primer, but has a lot of silicon in it . in terms of sun protection, it does prevent sunburn! not sweat or water resistant tho :( . doesn't give white cast but can cause pilling if your routine is too congested! could be a nightmare to handle in sweltering heat!\n\n**rating** : 3/5 and WNRP since skin type change",
        "score": 27,
        "is_top_level": true
      },
      {
        "author": "Tcool14032001",
        "body": "Mad props for coming up with this. On a side note, is your papa looking to adopt another human?",
        "score": 24,
        "is_top_level": true
      },
      {
        "author": "Avaale",
        "body": "Fantastic post! imagine sitting on this gem lol. Thanks OP!",
        "score": 23,
        "is_top_level": true
      },
      {
        "author": "ExaminationFail25",
        "body": "You have done God's work .\nAppreciate it and best of luck for your boards",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Different-Cover-4300",
        "body": "BoJ is love ❤️",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Captain_MK13",
        "body": "isntree hyaluronic acid watery sun gel, it's the bomb 🔥\n\n6/5 from me",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "filtercoffe",
        "body": "Love this subs unhinged obsession with sunscreen. Can’t find people to relate with this IRL. God’s work OP!!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "no-cliche",
        "body": "I got the boj sunscreen for less than 1k from maccaron.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "BabblingPanther",
        "body": "What does WRP and WNRP mean?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Jolly-Ad8819",
        "body": "Reading this entire post felt like a loooong journey and I thoroughly enjoyed it🤩 This is the 3rd rave review I have seen for the CC spf in the past 1 week, well 3rd time is the charm and I'm getting it soon! Thank you for the reviews OP🧎‍♀️",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Extension-Snow2317",
        "body": "Loved reading it op. Great post and great writing skills too.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "PriyaSR26",
        "body": "It feels nice to see such a well written review post on this sub again. Thanks for the review, OP! 💜💜",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Sharp_Green5369",
        "body": "It would be nice if you could mark the ones that are fungal safe🥺🫶🏼",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "crybaby0102",
        "body": "I relate to your conclusion alot haha. I also tried many sunscreens before I found the ones that work for me. Posts like this were helpful when I was searching for a sunscreen to stick with.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Rumi2019",
        "body": "Regarding Conscious Chemist - it makes sense their sunscreen is good cz it's manufactured by Tvakh aka Anapure Biocos.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nirvana_paix",
        "body": "Hey. Did you faced any tanning while using dermaco ha sunscreen?!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "KiwiSenpai21",
        "body": "Is the La Roche Posay sunscreen good for humid weather oily skin? Like it is extremely humid where I live and all the sunscreen I've tried are really thick..? The only creams that work for me are gel types.\n\nI'm trying to decide between LRP and Vichy, very confused since there's not a lot of recommendations for either from high humidity locations",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AcronymTheSlayer",
        "body": "Lmao OP this  was such a fun and insightful post. I also loved the apieu sunscreen and if I remember it correctly you can get it for 550ish bucks on maccaron.   \n\n\nAlso, kudos to your dad for providing the cash!",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi there! Tretinoin is Schedule H drug in India and must be used with doctor's prescription only. Side Effects may include but not be limited to Dry skin, Peeling, Skin redness, Burning, Itching, Stinging sensation. Tretinoin is a Category C drug and IS CONSIDERED UNSAFE DURING PREGNANCY. Lactating/ breastfeeding women will have to consult their doctors.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "Altruistic_Buy7903",
        "body": "Does zinc oxide or titanium dioxide make the skin darker?",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "amy004",
        "body": "Conscious chemist sun drink hybrid gel sunscreen @699 for 2 on their website",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "Son_Fun_In_Mums_Bum",
        "body": ">https://i.redd.it/0cb7bo7kx9ma1.gif\n\n🤣🤣🤣🤣",
        "score": -1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 24,
      "top_level": 24,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "vgehme",
    "title": "More Sunscreen Reviews ☀️!",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/vgehme/more_sunscreen_reviews/",
    "score": 53,
    "num_comments": 35,
    "created": "2022-06-20T06:06:21+00:00",
    "body": "heyyy! I'm back with more sunscreen reviews! I was using these and testing them out while I was writing my previous sunscreen post , so I couldn't include these back then heheh. enjoy and I hope this helps you out!\n\n&#x200B;\n\n[previous post](https://www.reddit.com/r/IndianSkincareAddicts/comments/un9cxl/shelfie_sunscreens_more_info/?utm_medium=android_app&utm_source=share)\n\n&#x200B;\n\n**preliminary info**\n\n**F17**\n\n**skin type** : dry , dehydrated and acne-prone.\n\n**concerns** : PIH , pit scars, pores, blackheads and sebaceous filaments .\n\n**weather** : tapti garmi + humidity . dry winters.\n\n&#x200B;\n\nhttps://preview.redd.it/wvluy9fctp691.jpg?width=3000&format=pjpg&auto=webp&s=d3dc4f6ac986e712bf9b297f7f11882f59c62e78\n\n* **The Derma Co.**  **1% Hyaluronic Acid Sunscreen Serum**  \\[SPF 50 PA+++\\]\n\n**Mrp** : Rs. 500 for 30 ml (bought from amazon)\n\n**For skin type** : all!\n\n**texture and appearance** : white thin liquid. fragrance free. really watery and leaves a dewy-shiny finish. chemical sunscreen.\n\n&#x200B;\n\nhttps://preview.redd.it/rfsq89eetp691.jpg?width=2064&format=pjpg&auto=webp&s=44d6b8bae83040943583a5eb4b1167f006397a41\n\n&#x200B;\n\nhttps://preview.redd.it/gneguawetp691.jpg?width=2693&format=pjpg&auto=webp&s=310db1edebf494a6ddcbc27c6d5bd31261b1ee84\n\n**ingredient list** :  Purified Water, Glycerin, Avena Strigosa Seed Extract, Lecithin, Potassium Sorbate, Citric Acid, Hydrogenated Polyisobutene, Ethylhexyl Methoxycinnamate, Butyl Methoxydibenzoylmethane, Benzophenone-3, Phospholipids, 1,3 Butylene Glycol, Niacinamide, Silica, Sodium Hyaluronate, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Decyl Glucoside, Propylene Glycol, Xanthan Gum, Betaine, Phenoxyethanol, Ethylhexylglycerin, Polyacrylamide, C13-14 Isoparaffin, Laureth-7 & Disodium EDTA.\n\n**filters** :\n\n* octinoxate (UVB filter)\n* avobenzone (UVA filter)\n* oxybenzone (UVB filter)\n* Tinosorb M (broad spectrum)\n\nthis was....okay-ish? idk but I was really excited for this since their HA sun gel is one of my HGs. This is kind of enjoyable, I really liked the watery texture and it didn't pill my routine at all , even during re-application. the dropper wasn't that much of a hassle to handle and worked great. the finish is something I'm not a fan of . the dewy-ness makes me look oily and sweaty and I have a tendency to touch my face a lot (really bad ik) but it feels greasy when I do that. its not sweatproof but the good thing is that when you do sweat, it doesn't bead off as white, meaning it wouldn't look like you got milk thrown at your face lmao. it does a good job in preventing tan but again with frequent application . I feel like it made me sweat a little faster but that could just be me. also the quantity you get is really less 😖 if I was to apply this everyday with 4 re-applications , this would get over within 2 weeks. I used one whole dropper full on my face and neck btw. but being a liquid, I feel it spreads much better than a cream.\n\nrating : 3/5 and WNRP . you're better off with the gel formulation. I found this really mediocre.\n\n&#x200B;\n\n* **Axis-Y Complete No-Stress Physical Sunscreen \\[SPF 50+ PA++++\\]**\n\n**Mrp** : Rs. 1450 for 50ml (bought for Rs.999 from beauty barn)\n\n**For skin types** : oily combo skin types. those with dry skin like mine, might find it a bit more drying. good one for sensitive skins since it has a lot of calming ingredients as well!\n\n**texture and appearance** : thick white cream. fragrance free but has very strong ayurvedic smell. matte finish. physical sunscreen.\n\n&#x200B;\n\nhttps://preview.redd.it/0lmry60ntp691.jpg?width=2284&format=pjpg&auto=webp&s=87ba8e26163d69608b5908427942392e037340cf\n\n&#x200B;\n\nhttps://preview.redd.it/k16vk0tntp691.jpg?width=4000&format=pjpg&auto=webp&s=e5842c13a2344fb14bbe8cb6275e1b6355354b19\n\n**ingredients list** :  Water, Zinc Oxide, Propylheptyl Caprylate, Butyloctyl Salicylate, Propanediol, Titanium Dioxide, Butylene Glycol Dicaprylate/Dicaprate, Dicaprylyl Ether, Caprylyl Methicone, Polyglyceryl-4 Diisostearate/Polyhydroxystearate/Sebacate, Disiloxane, Niacinamide, Trimethylsiloxysilicate, Calendula Officinalis Flower Extract, Camellia Sinensis Leaf Extract, Artemisia Capillaris Flower Extract, Vitis Vinifera (Grape) Seed Extract, Juniperus Virginiana Oil, Cedrus Atlantica Bark Oil, Amyris Balsamifera Bark Oil, Pogostemon Cablin Oil, Chamomilla Recutita (Matricaria) Flower Water, Disteardimonium Hectorite, Magnesium Sulfate, Stearic Acid, Aluminum Hydroxide, Triethoxycaprylylsilane, Methyl Methacrylate Crosspolymer, Polyglyceryl-3 Polydimethylsiloxyethyl Dimethicone, 1,2-Hexanediol, Vinyl Dimethicone/Methicone Silsesquioxane Crosspolymer, Polymethylsilsesquioxane, Glyceryl Caprylate, Caprylyl Glycol, Ethylhexylglycerin, Adenosine, Copaifera Officinalis (Balsam Copaiba) Resin, Tocopherol, Squalane, Allantoin, Butylene Glycol, Glycerin, Palmitoyl Tripeptide-5\n\n**filters** :\n\n* zinc oxide (mineral filter)\n* titanium dioxide (mineral filter)\n\nthis had been on my 'to buy' list for such a long time! and I finally got it during a march beauty barn sale! when I first tried it, I was really skeptical since it gave me a pretty bad whitecast and smelt so weird. I'm still not fond of the smell as it smells like the corner of an ayurvedic shop 😭. but afterwards I let it set on my face a little longer, and the whitecast goes away! it takes a good 5-7 min for it go away and I still got whitecast around my mouth. looked like doodh ki moochi lol (also have pigmentation and have to colour correct with orange) . so a little bummed about that :( but then with mineral sunscreens, you're more prone to get a whitecast than a chemical one. it settles to a matte finish which I really liked! surprisingly I didn't really sweat with this on, maybe because I wore this inside my house more than outside so I'm not sure whether it will sweat off white or not. tanning and sun protection wise, cant say much (previous sentence). this was a bit drying for me and I had to apply 3 fingers worth to get some moisturization. I feel like I have to use this for a little longer to give a better review but for now I hope this helps.\n\nrating : 3.5/5 and MRP . on the edge of recommending this to people having medium-dark skin types (like mine) due to white cast.\n\n&#x200B;\n\n* **ISNTREE Hyaluronic Acid Watery Sun Gel \\[SPF 50 PA++++\\]**\n\n**Mrp** : Rs. 1650 for 50ml (bought for Rs.1400 from beauty barn)\n\n**For skin types** : all! although most people say its for oily-combo, I found this to work equally well for dry skin types as well.\n\n**texture and appearance** : white watery gel as the name suggests lol. fragrance free. dewy-matte finish. chemical sunscreen.\n\n&#x200B;\n\nhttps://preview.redd.it/uglx4tvptp691.jpg?width=3027&format=pjpg&auto=webp&s=1edc1b4cadce02af8a7cdc6b1c061b01ce3df5ce\n\n&#x200B;\n\nhttps://preview.redd.it/sjk70mlqtp691.jpg?width=3234&format=pjpg&auto=webp&s=9624dd3003686cc5cf39097b7f271e1643502dd5\n\n**ingredients list** :  Water, Butylene Glycol, Ethylhexyl Salicylate, Homosalate, Dibutyl Adipate, Niacinamide, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Cyclopentasiloxane, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Polysilicone-15, Diethylamino Hydroxybenzoyl Hexyl Benzoate, 1,2-Hexanediol, Pentylene Glycol, Pinus Pinaster Bark Extract, Ceramide NP, Centella Asiatica Extract, Glycerin, Portulaca Oleracea Extract, Houttuynia Cordata Extract, Olea Europaea (Olive) Fruit Oil, Ficus Carica (Fig) Fruit Extract, Sodium Hyaluronate, Ceteth-10, Hydrogenated Lecithin, Decyl Glucoside, Propanediol, Tocopherol, Astaxanthin, Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Ascorbyl Propyl Hyaluronate, Hydrolyzed Hyaluronic Acid, Hydroxypropyltrimonium Hyaluronate, Acrylates/​C10-30 Alkyl Acrylate Crosspolymer, Sodium Acetylated Hyaluronate, Hydrolyzed Sodium Hyaluronate, Adenosine, Xanthan Gum, Cetyl PEG/​PPG-10/​1 Dimethicone, Tromethamine, Carbomer, Propylene Glycol, Ethylhexylglycerin.\n\n**filters** :\n\n* Tinosorb M (broad spectrum)\n* Parsol SX (inorganic UV filter)\n* Uvinul A Plus (UVA filter)\n* octisalate (UVB filter)\n* homosalate (UVB filter)\n* Tinosorb S (broad spectrum)\n\nman people don't lie when they say its there HG cuz damn this one is 🔥🔥🔥. so worth the hype! lightweight, watery and absorbs really well! when I touch my face, it doesn't feel greasy and really hydrating as well. and those filters already make me drool 🤤 only one drawback is the dewy finish , which I'm not fond of. no whitecast and no sweating milk drops for sure!  in terms of sun burn and tanning prevention, this is gold! ughhhh it would be my HG if the price tag wasn't so hefty 😖 I use this only when I'm out for important outings aka bahar junk food khane jana lmao 😌 so you can guess I go out a lot heheh. I feel like this one is getting over sooner than others in my ss ki theli 😫 but either way, if you find a good deal on it, blindly add this to your cart and order it. you wont be dissappointed!\n\nrating : 5/5 and WRP on reduced mrp only.\n\n&#x200B;\n\nand that's all I have to share with you all today! there are so many other ss I want to try like the BOJ one and the Beplain nonnano one, but I want to finish my current stock before buying anymore! do feel free to ask any questions related in the comments and I hope you enjoyed reading these!",
    "flair_text": "Resource",
    "flair_template_id": "3fa43202-2ab0-11e8-91fe-0e96a0f831e2",
    "comments": [
      {
        "author": "CleanYourRoom007",
        "body": "Man I was using Lotus and VLCC till college! Great trajectory you have OP <3",
        "score": 28,
        "is_top_level": true
      },
      {
        "author": "Happily_introvert",
        "body": "Woah. Sunscreen at 17. When I was 17 the only products I used was ponds powder and vaseline 😂. Your skin is gonna thank you OP.",
        "score": 17,
        "is_top_level": true
      },
      {
        "author": "Salonisule411",
        "body": "I used Lotus ka matte gel sunscreen when I was in college and when I found about its true nature on this sub, Hoo boy was I mad at the garbage I slathered on my face in the name of \"sunscreen\". Good job OP on taking such good care of your skin and developing healthy skin habits early on.",
        "score": 17,
        "is_top_level": true
      },
      {
        "author": "cutiecatlover",
        "body": "You can get rid of the isntree dewy finish by applying some powder on top. Works for me.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Deepbluesea-1",
        "body": "Milk thrown at your face 😂😂this remark got me laughing.\nGood reviews . Was eyeing isntree one .",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SlowMo_Sush",
        "body": "This is so informative! Thanks!! I'm glad you've found your HG sunscreen",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "shrxxya",
        "body": "Lovely review OP, had always been curious about the Axis-Y physical sunscreen. I love physical sunscreens for indooors mainly due to the whitecast, I’ve been using the Neutrogena Sheer zinc for a while because it not only gives me a sun protection but also soothes my skin and reduces oil production. But the biggest drawback is it’s whitecast :/ and I totally get you when you mention the white cast around mouth. The Neutrogena one makes me looking like a ghost all day.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "everlastingcooki",
        "body": "Been using Neutrogena sun block spf 50 since high school. I have acne prone, combination skin and I never had issues with this brand.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "No-Attitude1314",
        "body": "Will be trying out the ISNTREE Hyaluronic Acid Watery Sun Gel \\[SPF 50 PA++++\\]✌",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "fresh_a_voca_doo",
        "body": "great review! the writing style reminded me of an older review of yours xD. So I have an unrelated to post question. I noticed you have a lot of hydration related products. do you feel like focusing on your moisture barrier is much better than going the treatment route? I've never had a huge dry skin issue on my face (everywhere else is frikking reptilian) so I haven't given it a huge thought. But now that my acne isn't as debilitating as before, I was thinking focusing on hydration might just finally get me that inner glowy skin.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "HurryLife",
        "body": "I have this gaddi (cushion) too in my home . The background lol 😂",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Luminousshrimpfrog",
        "body": "How do you remove the isntree sunscreen in the AM? Is an oil cleanser/oil based balm required to completely remove it or can I use my regular cleanser twice?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "skinyou",
        "body": "Try using WOW Sunscreen Matte Finish - SPF 55 PA+++ ...hoping for a review 🤞",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 14,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "1ays2t5",
    "title": "a lot of Reviews + some things i will be reviewing/ am currently trying",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/1ays2t5/a_lot_of_reviews_some_things_i_will_be_reviewing/",
    "score": 36,
    "num_comments": 6,
    "created": "2024-02-24T11:08:58+00:00",
    "body": "**Personal Info:**\n\nI live in nothern europe, so currently cold, windy and dry Climate. My Skintype is sahara desert dry, prone to closed comedones plus some light hormonal acne. Sadly im also super prone to hyperpigmentation. My main Goals are barrier health, hydration, acne & Hyperpigmentation management and getting rid of the damn stubborn CC\\`s... I also follow a kinda skincycling routine wich includes a non AB Retinal product.\n\nIn **Bold** will be the product name + how long i have been using it\n\nin *italic* will be the ingredients i liked\n\n\n\n**Axis-Y Sunday morning cleanser: (using for a month now)** *green tea extract, centella extract, allatonin*\n\nIngredients:\n\nWater, Glycerin, Sodium Cocoyl Isethionate, Sodium Methyl Cocoyl Taurate, Potassium Cocoyl Glycinate, Coco-Betaine, Butylene Glycol, Potassium Cocoate, Sodium Chloride, Potassium Benzoate, Polyquaternium-67, Xylitylglucoside, Citric Acid, Anhydroxylitol, Propanediol, Xylitol, Betula Platyphylla Japonica Juice, Glucose, Camellia Sinensis Leaf Extract, Disodium EDTA, Glycyrrhiza Glabra (Licorice) Root Extract, Agrimonia Eupatoria Extract, 1,2-Hexanediol, Centella Asiatica Extract, Dipropylene Glycol, Allantoin, Perilla Frutescens Leaf Extract, Saponaria Officinalis Extract, Sodium Acetate, Pentylene Glycol, Calendula Officinalis Flower Extract, Kigelia Africana Fruit Extract, Caprylyl Glycol, Natto Gum, Sodium Hyaluronate, Chamomilla Recutita (Matricaria) Flower Extract, Ethylhexylglycerin, Hydroxycinnamic Acid, Rutin\n\nTexture:\n\na balmy texture, foams up to a dense and soft foam\n\nExpirience:\n\nI picked this up because I wanted to change from my old clenaser to something that felt like it had a bit more cleansing power, yet was not stripping. As far as i can tell it seems to accomplish that. It foams up nicely, cleans well and doesent seem to strip my Skin. After washing it off it feels almost as if there is a slight layer on my Skin, but i dont mind it/ think that it contributes to the non stripping?\n\n(4/5)\n\n**Cosrx Propolis Toner: (about a month 1/2 of use)** *propolis, honey extract, panthenol*\n\nIngredients:\n\nPropolis Extract, Honey Extract, Butylene Glycol, 1,2-Hexanediol, Glycerin, Betaine, Cassia Obtusifolia Seed Extract, Panthenol, Polyglyceryl-10 Laurate, Polyglyceryl-10 Myristate, Ethylhexylglycerin, Sodium Hyaluronate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Caprylic/Capric Triglyceride\n\nTexture:\n\na waterlike texture, thats just a bit thicker\n\nExpirience:\n\nTo be honest im not overly impressed... its a nice hydrating toner for sure but i didnt notice anything outstanding that would have me choose it again. But it gets a pluspoint for being reasonably priced so i migth pick it up again to reach free shipping...\n\n(3/5)\n\n**Holika Holika Aloe Waterproof Sungel (3 Months of use)** *Aloe*\n\nIngredients:\n\nAqua, Dibutyl Adipate, Propanediol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Polymethylsilsesquioxane, Ethylhexyl Triazone, Niacinamide, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Coco-Caprylate/Caprate, Caprylyl Methicone, Diethylhexyl Butamido Triazone, Glycerin, Butylene Glycol, 1,2-Hexanediol, Hippophae Rhamnoides Fruit Extract, Daucus Carota Sativa (Carrot) Root Extract, Rosa Canina Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Aloe Ferox Leaf Extract, Artemisia Capillaris Extract, Prunus Armeniaca (Apricot) Juice, Hydrogenated Lecithin, Pentylene Glycol, Behenyl Alcohol, Poly C10-30 Alkyl Acrylate, Polyglyceryl-3 Methylglucose Distearate, Decyl Glucoside, Tromethamine, Carbomer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Stearoyl Glutamate, Polyacrylate Crosspolymer-6, Ethylhexylglycerin, Adenosine, Xanthan Gum, T-butyl Alcohol, Tocopherol, Ascorbic Acid, Moringa Oleifera Seed Oil, Ceramide Np, Phytosphingosine, Parfum\n\nTexture:\n\na thin cream Texture, not runny but almost there\n\nExpirience:\n\nIt comes in quite a big size for a Sunscreen, you can find 80 - 100 ml Tubes online for around 15-17 Euros! Wich honestly was the sole reason why i bougth it xD i figured my skin would be fine with the Ingredients and i just hate tiny sunscreens! And well... that was exactly what it is like, its decently moisturizing and doesnt irritate my Skin. But if you have sensitive Skin be careful, it does have Fragrance, smells kinda like very artificial Aloe. You can smell it but only upon first apllication, it doesnt linger. I have been using 1 bottle for 3 months and still have enough for another month at min. so a win!\n\n(3.5/5)\n\n**Purito Dermide Cica Barrier Sleeping Mask: (3 months of use)** *Squalane, Centella Extract, Jojoba oil, Panthenol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Ceramide*\n\nIngredients:\n\nWater, Centella Asiatica Extract(250,000Ppm), Caprylic/​Capric Triglyceride, Glycerin, Squalane, Simmondsia Chinensis (Jojoba) Seed Oil, Cetearyl Alcohol, Potassium Cetyl Phosphate, Helianthus Annuus (Sunflower) Seed Oil, Butylene Glycol, Polyglyceryl-3 Methylglucose Distearate, 1,2-Hexanediol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Panthenol, Ceramide NP(3,000Ppm), Sodium Hyaluronate, Hydroxyacetophenone, Sodium Carbomer, Hydrogenated Lecithin, Hydroxyethylcellulose, Camellia Sinensis Leaf Extract\n\nTexture:\n\nA thick Cream, feels quite emmolient\n\nExpirience:\n\nI love, love, loe this! Its the first moisturizer that i found that feels like it actually does its job well on my Skin. As a nigthtime moisturizer it keeps my Skin hydrated all through the Night and has my wake up nicely glowy. I love to use this when my Skin is irritated, it really soothes it quickly. Always have this on my Shelf, you would have to pry it out of my dead cold hands, to seperate me from it. One Bottle last me about 2 months.\n\nHG!\n\n(5/5)\n\n**Mary & May Blackberry Cream Essence: (4 months of use)** *Jojoba oil, ceramides, lotus water, centella*\n\nIngredients:\n\nWater, Nymphaea Caerulea Flower Water, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Poly(C6-14 Olefin), Rubus Fruticosus (Blackberry) Fruit Extract, 1,2-hexanediol, Methlypropanediol, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Hydrolyzed Gardenia Florida Extract, Sodium Hyaluronate, Hydrogenated Lecithin, Butylene Glycol, Glycerin, Trilaureth-4 Phoshate, Sodium Polyacrylate, Pvm/Ma Copolymer, Cyanocobalamin, Ceramide Np, Maltodextrin, Ethylhexylglycerin, Tocopherol\n\nTexture:\n\nthin, watery but creamy? (just realized i suck at describing textures haha)\n\nExpirience:\n\nA really nice hydrating and moisturizing Toner, feels like a great balance of the two. Acts nicely as a layer with other Skincare because it absorbs really well. I like it, a bottle lasts me about 2 months.\n\n(4/5)\n\n**Abib Quick Sunstick Protection Bar: ( 3 months of use)** *Aloe, Centella, Ceramides*\n\nIngredients:\n\nOctyldodecanol, Butylene Glycol Dicaprylate/Dicaprate, Ethylhexyl Methoxycinnamate, Dibutyl Ethylhexanoyl Glutamide, Dibutyl Lauroyl Glutamide, Diisostearyl Malate, Ethylhexyl Salicylate, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Dextrin Palmitate, Octocrylene, Camellia Sinensis Leaf Extract, Centella Asiatica Extract, Aloe Barbadensis Leaf Juice, Cucumis Sativus (Cucumber) Fruit Extract, Aloe Barbadensis Leaf Extract, Glycerin, Water, Butylene Glycol, Saccharide Isomerate, Maltodextrin, Hydrolyzed Vegetable Protein, Caprylic/Capric Triglyceride, Hydrogenated Lecithin, Ethyl Hexanediol, Ceramide NP, Citric Acid, Sodium Citrate, Ethylhexylglycerin, Phenoxyethanol\n\nTexture:\n\nA translucent stick, glides on smooth, feels a bit occlusive on skin\n\nExpirience:\n\nNicely moisturizing Sunstick, feels good on my Skin and well... does its Job xD I really like the curved shape of it, it relly helps with the application. I just use it for reapplication of my sunscreen, but also sometimes when my Skin gets really dry during the day ( tho its not the best for that)\n\n(3.5/5)\n\n**Numbuzin No.2 Protein 43% creamy Serum: ( 4 months of use)** *Oat protein, Ceramides, cholesterol, fatty acids, ferments, Rice protein*\n\nIngredients:\n\nAvena Sativa Protein Extract, Water, Cyclopentasiloxane, Butylene Glycol, Cetearyl Ethylhexanoate, Cyclohexasiloxane, Phenyl Trimethicone, Cetyl PEG/PPG-10/1 Dimethicone, Hydrogenated Poly C6-14 Olefin, Niacinamide, Panthenol, 1,2-Hexanediol, Glycerin, Erythritol, Limnanthes Alba Seed Oil, Sodium Chloride, Allantoin, Ethylhexylglycerin, Tocopheryl Acetate, Adenosine, Dextrin, Theobroma Cacao Extract, Pantolactone, Ceramide NP, Cholesterol, Palmitic Acid, Oryza Sativa Seed Protein Extract, Stearic Acid, Hydrolyzed Milk Protein, Lactobacillus Ferment, Glycine Soja Protein, Hydrolyzed Lupine Protein, Glucose, Hydrolyzed Corn Protein, Hydrolyzed Rice Protein, Hydrolyzed Soy Protein, Hydrolyzed Sweet Almond Protein, Hydrolyzed Vegetable Protein, Myristic Acid, Hydrolyzed Pea Protein, Arachidic Acid, Lauric Acid, Sodium Succinate, Disodium EDTA, Fragrance\n\nTexture:\n\nVery thick serum, really is creamy like the name says\n\nExpirience:\n\nSooo repairing and soothing, does wonders for my barrier. It really helps keep my Skin moisturized and helps keep my transepidermal waterloss in check. Love it so much! HG!\n\n(5/5)\n\n**Purito Aha Bha Refreshing Solution: (1 month of use)** *Glycolic acid, Salcylic Acid*\n\nIngredients:\n\nSalix Alba (Willow) Bark Water, Butylene Glycol, Dipropylene Glycol, Glycolic Acid (7%), Tromethamine, Water, Salicylic Acid(2%), 1,2-Hexanediol, Sodium Citrate, Arginine, Caprylyl Glycol, Citric Acid(0.28%), Hydroxyacetophenone, Pentylene Glycol, Allantoin, Dipotassium Glycyrrhizate, Disodium EDTA\n\nTexture:\n\nlike water, it put 2-3 drops on a thin cotton pad and swipe over my Face with it\n\nExpirience:\n\nSince it has only been a month i cannot say too much about how it has worked (and i feel its hard to tell what effects on my skin is retinal and whats from this product) but my comedones are reducing in size and developing into breakouts. But the effects of these ingredients are well studied in these concentrations so i would say its save to say it works. Its my first time using glycolic acid and i can say it packs a punch for sure! So be careful, its intense, so far im using it once a week on my exfoliation day and i dont think ill be moving up.... Might also be the fact that its a combo product, but i have been using salcylic acid and mandelic acid in combo before, and that felt less sensitizing. So im attributing that factor to the 7 percent glycolic acid, since it is the smallest molecule size of all Aha\\`s.\n\n(3.5/5)\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------\n\nNow lets move to quick first impressions of a few products i just started trying, wich i have seperated from the review portion because i just havent been using them long enough to really speak about the effects on my Skin: (these will also be shorter impressions with less info)\n\n\n\n**Neo:labs liquid enhancer Pycogenol:**\n\nIngredients:\n\nWater, Propanediol, Hydrogenated Poly C6-14 Olefin, 1.2-Hexanediol, Methylpropanediol, Glycerin, Chondrus Crispus Extract, Saccharum Officinarum Extract, Jojoba Esters, Melia Azadirachta Flower Extract, Salvia Sclarea Oil, Ocimum Sanctum Leaf Extract, Melia Azadirachta Leaf Extract, Curcuma Longa Root Extract, Anthemis Nobilis Flower Oil, Corallina Officinalis Extract, Theobroma Cacao Seed Extract, Melaleuca Altemifolia Extract, Centella Asiatica Extract, Melaleuca Alternifolia Leaf Oil, Pinus Pinaster Bark Extract, Caprylic/Capric Triglyceride, Glyceryl Stearate, C18-36 Acid Triglyceride, Coprylyl Glycol, Hydrogenated Lecithin, C12-18 Acid Triglyceride, Squalene, Sodium Polyacrylate, Tromethamine, Albatreus Contuena Extract, Paimitic Acid, Stearic Acid, Phytasteryl Macadamiate, Citric Acid, Phytosterol, Dextrin, Tocopherol, Butylene Glycol, 4-Terpineol, Pentylene Glycol, Octonediol, Ethylhexylglycerin, Cetearyl Alcohol, Carbomer, Xanthan Gum\n\nExpirience:\n\nBougth this because of the tea tree extract, oil and 4- terpineol for the antimicrobial and antiinflammatory benefits , plus it also promised balancing the water-oil contend of the skin. So far i have been using it for a week and it feels nicely moisturizing, but i cannot say if it has helped with my breakouts. Smells strongly like tea tree, wich i dont mind.\n\n**Isntree Spotsaver Mugwort Ampoule:**\n\nIngredients:\n\nArtemisia Princeps Extract, Glycerin, Butylene Glycol, Glycereth-26, Erythritol, Betaine, Glycyrrhiza Glabra (Licorice) Root Extract, Calendula Officinalis Flower Extract, Piper Methysticum Leaf/Root/Stem Extract, Panthenol, Propanediol, Beta-Glucan, Dipotassium Glycyrrhizate, Hydrogenated Lecithin, Ceramide NP, Allantoin, Carbomer, Tromethamine, 1,2-Hexanediol\n\nExpirience:\n\nThis i got because i heard amazing things about mugwort and it was on a 50 % Sale, so i got it for a steal! So far i like the simple ingredient list an it seems soothing and hydrating.\n\n**RNW Der.Ceramide Cream:**\n\nIngredients:\n\nWater, Butylene Glycol, Ceramide NP, Panthenol, Caprylyl Methicone, Glycerin, C12-16 Alcohols, 1,2-Hexanediol, Cetearyl Alcohol, Pentaerythrityl Tetraisostearate, Limnanthes Alba (Meadowfoam) Seed Oil, Cetyl Ethylhexanoate, Polyglyceryl-3 Distearate, Ceramide NS, Phytosphingosine, Cholesterol, Ceramide AS, Ceramide AP, Oligopeptide-1, Ceramide EOP, Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Hydrolyzed Hyaluronic Acid, Palmitic Acid, Hydrogenated Lecithin, Caprylic/Capric Triglyceride, Betaine, Arginine, Arachidyl Alcohol, Behenyl Alcohol, Glyceryl Stearate Citrate, Carbomer, Butyrospermum Parkii (Shea) Butter, Arachidyl Glucoside, Citrus Aurantium Dulcis (Orange) Peel Oil, Stearic Acid, Adenosine, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Cedrus Atlantica Bark Oil, Caprylyl Glycol, Sodium Phosphate, Disodium EDTA\n\nExpirience:\n\nIm really intriged by this brand an was debating between this and the Ceramide serum, but got this Cream. At first i was intimitaded by the essential oils and the strong smell it has (herbal, but to my nose very pleasant) so i patchtested it on my cheek. The Patchtests went fine and i have been using it on my whole face for 4 days now and i must say im impressed.\n\nIf you have oily skin i feel you could hate it but for my dry skin... the texture is amazing. Its a THIIICK cream, like an ointment, very balmy. Upon apllication it feels nice to spread it and it sinks in so well for the thick texture. The cream surprisingly dries down velvety and leaving a protective shield over the Skin. I also love that it has 3 % Panthenol, 3% ceramides and cholesterol and fatty acids.... so perfect ingrdients for skin barrier repair! Really a potential HG...\n\n\n\n",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "pollypetunia",
        "body": "I love the sound of the purito sleep mask! My skin sounds very similar to yours and I've been looking for a sleeping pack because I just can't deal with sheet masks. Does it have any kind of scent?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "ktli1",
        "body": "I think there's a typo, the propolis toner is made by cosrx. 😅\n\nUnless I've missed something and there's a new propolis toner by Purito. In that case, I'd be very interested in trying it as well 😍",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "5drzxb",
    "title": "Living in Japan, a curly hair care desert. I am seeking moisture! I need help with identifying what ingredients to avoid and which ones I need for my 3c hair (easily accessible).",
    "url": "https://www.reddit.com/r/curlyhair/comments/5drzxb/living_in_japan_a_curly_hair_care_desert_i_am/",
    "score": 34,
    "num_comments": 7,
    "created": "2016-11-19T11:01:22+00:00",
    "body": "My hair type is 3c maaaaaybe 4a. I am currently living in Japan and have very little access to curly hair care without having to ship stuff (which is quite expensive and not always possible). I cant even find coconut oil. I have found a Japanese conditioner which is all organic and doesn't seem to have anything bad in it but my hair is not responding AT ALL. I ordered some marshmallow root to help with slip but my hair is very dry and hard and frizzy and tangled and unhappy. So I am unhappy.\n\nI wash my hair twice a week. I put some conditioner in it and massage my scalp and cold rinse. I then use conditioner to detangle. After detangling I put a mixture of olive oil and honey on my hair with some Marc Anthony Curl cream (which I have to import and has evil ingredients too)\n\nIt takes over an hour to detangle (with my fingers). I want to know what I am doing so wrong so that I can keep on looking for a conditioner that works or some extra ingredients to import to mix with my current conditioner. I used to use Tressame Moisture Rich (which is also not available in Japan) but I noticed it had dimethicone in it so I stopped but my curls felt and looked soo much happier back then. I am so frustrated. \n\nThe conditioner I am using now has many emolients in the ingredients and not so many moisturizing components but I dont know what to add.\n\nTop 15 ingredients are: water, Behenyl\tSynthetic (rapeseed, etc.), \nBehenyl PG trimonium chloride, Alga near spinosa kernel oil, Macadamia nut oil, Damask rose flower oil, Atlas Cedar bark oil, Lavender oil, Jojoba seed oil, Olive oil, Broccoli seed oil, Almond oil, Rose hip oil, Sunflower seed oil \n\nThe website with detailed ingredients is below, google translate works very well (I am sorry):\nhttp://www.matsukiyo.co.jp/mkc/argelan/products/argan_treatment.html\n\nI washed my hair this morning. Let it air dry and the result is here --> http://imgur.com/8RjAeB7\nhttp://imgur.com/vaNdT4p",
    "flair_text": "help",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Wetshaving",
    "post_id": "bw3vrp",
    "title": "[Review] Helmsman Shave Cream",
    "url": "https://www.reddit.com/r/Wetshaving/comments/bw3vrp/review_helmsman_shave_cream/",
    "score": 23,
    "num_comments": 8,
    "created": "2019-06-02T23:37:48+00:00",
    "body": "[Video](https://youtu.be/gHJ0g9SmP-k)  \n\n&#x200B;\n\nHelmsman ([https://bethehelmsman.com/](https://bethehelmsman.com/)) is a company that specializes in brushless shaving cream. The company prides itself on having all aspects of production based in the US. From manufacturing from the chemist to the designers to the tube manufacturers, the product is 100% made in the U.S.A. Helmsman can be purchased direct from their site or on Amazon ([https://www.amazon.com/Helmsman-Mens-Shaving-Cream-Irritation/dp/B074W272LB/](https://www.amazon.com/Helmsman-Mens-Shaving-Cream-Irritation/dp/B074W272LB/)).\n\n&#x200B;\n\nHelmsman Original Scent is a light, refreshing scent that smell similar to many modern mens soaps and grooming products. This pleasant scent is hard to distinguish individual notes from. In general it is refreshing, clean and crisp. This scent is a nice divergence from complex scents and as such, Mrs. Ruds is neutral on this one. She cannot really smell it once I rinse it away, making it a great user if you want your post shave product or fragrance of the day to dominate. Scent strength is light to mid out of the container and remains that way through the shave. \n\n&#x200B;\n\nHelmsman brushless shave cream appears to be a vega based cream. Ingredients are listed as: Aloe Barbadensis Leaf Juice, Purified Water, Stearic Acid, Sodium Methyl, Cocoyl Taurate, Cetearyl Olivate, Sorbitan Olivate, Decyl Glucoside, Glycerin, Lauramidopropyl Betaine, Coco-Betaine, Sodium Cocoyl Isethionate, Phenoxyethanol, Caprylyl Glycol, Butylene Glycol, Hamamelis Virginiana, Bark/Leaf/Twig Extract, Caprylic/Capric Triglyceride, Argania Spinosa Kernel Oil, Tocopheryl Acetate, Xanthan Gum, Siloxanetriol Alginate, Caffeine, Helianthus Annuus Seed Oil, Glycine Soja Germ Extract, Boswellia Carterii Resin Extract, Silybum Marianum Fruit Extract, Glycyrrhiza Glabra Root Extract, Calophyllum Tacamahaca Seed Oil, Citrus Aurantium Bergamia Fruit Oil, Cedrus Atlantica Bark Oil, Oleic Acid, Sodium Gluconate, Ceramide, Sodium Chloride and Citric Acid. Being a brushless cream, this cream can be applied with your hand or a brush but does not require water. Primary and residual slickness are good. I am able to buff without visible lather with no fear of the razor skipping or dragging. Post shave is also good. I am not left dry or tight once rinsed away. The ShaveScore for Helmsman Shave Cream is an 82. For similar performance I suggest you check out: Castle Forbes.\n\n&#x200B;\n\n***Disclosure: All reviews and impressions must state how the product was acquired whether it be free, sponsored, promotional, purchased, or otherwise.***\n\n* Soap - Helmsman Shave Cream (promotional gift)\n* Brush - N/A\n* Razor - Rockwell 6S (purchased)\n* Post - Aqua Velva (purchased)",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "CanadaEh97",
        "body": "Off the top of my head from your cream reviews it seems like most are scoring and performing all in the same score range.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "NobleOtter",
        "body": "Id be interested to see how you score our tester base.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "BDR_MPB",
        "body": "I've got to share a hotel room with a stranger for about a week for work. Been looking for something so that I won't hog the sink in the morning or make a mess. For the price, this will work. Thanks, Ruds!",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7fgdlm",
    "title": "Thoughts on Son & Park's Beauty Water? [Product question]",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7fgdlm/thoughts_on_son_parks_beauty_water_product/",
    "score": 12,
    "num_comments": 13,
    "created": "2017-11-25T16:56:17+00:00",
    "body": "I keep seeing mixed reviews. One big issue people have with this product is that it contains alcohol, but the alcohols in this product are last in a very long list of ingredients. Does a small amount of alcohol really have that much of a negative impact on skin? How does everyone feel about Beauty Water?\n\nFull List of Ingredients\n\nWater, Rosa Damascena Flower Water, Hamamelis Virginiana (Witch Hazel) Water, Butylene Glycol,Propanediol, PEG-7 Caprylic/Capric Glycerides, Pentylene Glycol, Citrus Aurantium Dulcis (Orange) Fruit Extract, Xylitol, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Olea Europaea (Olive) Fruit Oil,Citrus Aurantium Dulcis (Orange) Oil, Citrus Grandis (Grapefruit) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Cedrus Atlantica Bark Oil, Pelargonium Graveolens Flower Oil, Carica Papaya (Papaya) Fruit Water, Jasminum Officinale (Jasmine) Oil, Illicium Verum (Anise) Fruit/Seed Oil, Artemisia Absinthium Extract, Rose Flower Oil, Ferula Galbaniflua (Galbanum) Resin Oil, Thuja Occidentalis Leaf Extract, Eucalyptus Globulus Leaf Extract, Lavandula Angustifolia (Laveder)Flower/Leaf/Stem Extract, Melaleuca Alternifolia (Tea Tree) Leaf Extract, Melissa Officinalis Leaf Extract, Mentha Piperita(Peppermint) Leaf Extract, Mentha Rotundifolia Leaf Extract, Mentha Spicata Flower/Leaf/Stem Extract, Origanum Majorana Leaf Extract, OriganumVulgare Leaf Extract, Pelargonium Graveolens Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Thymus Vulgaris (Thyme) Leaf Extract, Glycerin, Decyl Glucoside, 1,2-Hexanediol, PEG-40 Hydrogenated Castor Oil, PPG-26-Buteth-26, Sodium Chloride, Ethylhexylglycerin, Sodium Citrate, Citric Acid, Octanediol, Copaifera Officinalis (Balsam Copaiba) Resin, Protease, Alcohol Denat., Alcohol, Phenoxyethanol",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "PootMcGroot",
        "body": "I wouldn't panic about alcohol that far down the list.\n\nThere are an awful lot of herbal/fruit oils in that that could be irritating though (the citrus, for example).Overall, it has some excellent things in it, but it depends on your skin and how it is with those irritant oils.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Mommychoochoo",
        "body": "Did nothing for me. Very expensive too",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "missblonde",
        "body": "Alcohol is the least of the worries in this.It's atrocious!Peppermint, lavender ,grapefruit , orange, good God, the list is endless , eucalyptus yikes! AVOID!!!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "effexxor",
        "body": "A solid Meh, but then again, I have dry skin.  I just don't need it at all.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "MxUnicorn",
        "body": "Looks decent, especially if you like the bottle and scent.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "auborealis",
        "body": "I was pretty hesitant about this product too, seeing the mixed reviews and the inclusion of alcohol and oils in this list. I decided to try it anyway since I go through toner really fast and the giant bottle meant I wouldn't have to run out and buy another tube in 2-3 months. Honestly, while this toner worked fine in smoothing out my skin and keeping it hydrated, the results weren't enough to justify spending 30 bucks on it. The formula also left my skin a little tacky and just not as fresh as I wanted it to. There are better, cheaper formulas out there that are better than the Son&Park Beauty Water.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "catsidtrip",
        "body": "I bought this to replace my trusty Thayer's Rose Water toner, I find it meh, didn't really do anything to my skin. \nMy expectations were smaller pores, a little bit more moisture perhaps?\n\nToner is a product I will completely skip after I finish this bottle. My skin is not problematic or congested, it's relatively clear, not too oily, and using toner doesn't seem to make any difference now. Thayer's used to help me with my occasional acne (which would result in subsequent squeezing not just on the zit, but my blackheads as well), but now that my skin is much better, there's no need for it?\n\nEdit: Forgot to add this, I find Beauty Water to be a more watery [Sulwhasoo Essential Balancing Water EX](http://www.sulwhasoo.com/my/en/products/skin_care/essential_balancing_water.html). Possible dupe?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "uglymarshmallow",
        "body": "I really love the beauty water. It is on the pricy side, but it's gentle, removes makeup without irritation, and isn't drying. I would be a little cautious if you have had reactions to citrus or peppermint, but overall, I love it. I'm on my fourth bottle!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "bojybc",
    "title": "Sticky hair, hair loss and itchiness after co-washing.",
    "url": "https://www.reddit.com/r/NoPoo/comments/bojybc/sticky_hair_hair_loss_and_itchiness_after/",
    "score": 10,
    "num_comments": 7,
    "created": "2019-05-14T14:55:24+00:00",
    "body": "So far I co-washed two times.\n\nFirst time I did it the lush way - massage with water, put significant amount of conditioner on scalp, massage, wash, put significant amount of conditioner on hair from roots to ends, wait, wash. The hair was clean, I think it was too clean, there was more resistance when brushing vs after shampoo washing, there was significantly more hair left on my hands (and on the brush when brushing too I think) when applying the product. I think the hair was somewhat sticky and waxy, but not too much.\n\nThe second time I did it the easy way - massage with water, put significant amount of conditioner on scalp, massage (and in the process get a bit on the hair and ends too), wait, wash. The hair was clean enough (not shampoo-clean, but I think that's better for my hair and for my scalp's accomodation). There was more resistance when brushign vs after shampoo washing (and I think also vs the first co-wash). There too was significantly more hair left on my hands when applying the product, but because it was applied only once it was this much less hair loss. My hair is sticky, waxy. It looks good, but feels really bad, because of the stickiness.\n\nI used warm water.\n\nTo put this into perspective, if I brush my hair downwards while leaning down, the hair will literally stay in the air afterwards as if I gelled it or something. This effect is present to some extent after I shampoo-wash too, but not this extremely. It's also quite difficult to brush in the first place.\n\nThe conditioner somewhat sticks to the hair even while washing with it, the consistency of conditioner is gluey, sticky, it doesn't make my fingers run through my hair with conditioner applied run buttery smoothly, but rather the complete opposite, I'm scared of pulling my hair out this way... No hair loss when rinsing it off. \n\nMy scalp is also itchy as fuck now. My guess is the preservatives Methylchloroisothiazolinone and Methylisothiazolinone are to blame, but the thing is the shampoo has them too, so maybe not and the waxiness or whatever (co-washing in general) causes this?\n\nI'm pretty certain that the conditioner causes this. I didn't use any other product. When I wash with just shampoo from the same brand (it's SLES based, but it's the opposite of potent, I take few times more of it to achieve the same potency that normal SLS shampoos have, could be the conditioner is similarly \"potent\") and either don't use any other product or only few drops of oil it won't be like this and it's pretty much what I want.\n\nThe ingredients of the conditioner:\n> Aqua, Cetearyl Alcohol, Cetrimonium Chloride, Behentrimonium Chloride, Guar Hydroxypropyltrimonium Chloride, Propolis Extract, Inula Helenium Extract, Humulus Lupulus Flower Extract, Helianthus Annuus Hybrid Oil, Cera Alba, Cedrus Atlantica Bark Oil, Chamomilla Recutita Oil, Geranium Sibiricum Extract, Panax Ginseng Root Extract, PEG-12 Dimethicon, Pinus Sibirica Needle Extract, Pinus Sibirica Seed Oil, Pinus Sibirica Seed Oil Polyglyceryl-6 Esters, Xanthan Gum, Hydrolyzed Milk Protein, Panthenol, Niacinamid, Ceteareth-20, Citric Acid, Parfum, Methylchloroisothiazolinone, Methylisothiazolinone, CI 15985, CI 19140, CI 42090, CI 14720.\n\nNote that Cera Alba (Bees wax), Guar Hydroxypropyltrimonium Chloride (guar gum derivative) and PEG-12 Dimethicon (water-soluble sillicon) are in it. Could it be that the Bees wax is the problem? The two other ingredients are water soluble so shouldn't be... Cera Alba (Bees wax) is also in the shampoo, but probably in smaller quantity.\n\nIngredients of the shampoo:\n> Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamide DEA, Cocamidopropyl Betaine, Guar Hydroxypropyltrimonium Chloride, Propolis Extract*, Arctium Lappa Root Extract, Glycine Soja Oil, Urtica Dioica Extract*, Chamomilla Recutita Flower Water*, Althaea Officinalis Root Extract*, Salvia Officnalis Oil, Carum Carvi Fruit Oil, Mel*, Saponaria Officinalis Root Extract*, Cera Alba, Panthenol, Niacinamid, Citric Acid, Parfum, Methylchloroisothiazolinone, Methylisothiazolinone, Benzyl Salicylate, Hexyl Cinnamal, CI 15985, CI 19140, CI 42090, CI 14720.\n\nShould I buy another conditioner, keep on using this one or switch to non-harsh shampoo? If I should switch conditioner, what ingredients should I be looking for except no wax and sillicon? No oils? Other surfactants (glucosides instead of kationic chlorides)? Something more oily? Something very minimalistic (just kationic surfactans like cetrimonium chloride and humectants like cetearyl alcohol)? Something with more humectants?  I wouldn't be super happy buying another conditioner just to find out it's trash and I have nothing to do with it.\n\nEdit: My hair is ~5inch/13cm long.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "BungViper",
        "body": "I'm no expert and this is just personal experience over the past several years but I would try an SLS-free shampoo & silicon-/wax-free conditioner to see if that helps. It sounds more like an issue with the conditioner ingredients or other products sticking to your hair and scalp then not getting washed out with the co-wash so it builds up on your hair more and more. I tried many conditioners to co-wash and also water-only but neither worked for me. My hair ended up stringy, heavy and waxy though not as quickly as you have experienced. I have very hard water where I live which can also add to the problem.  You can also look into an apple cider vinegar rinse as an alternative (lots of info on the side-bar).\n\nI have had good success with SLS-free shampoo plus silicon-free conditioner every second wash or so. I only have to wash it once a week with water-only rinses as needed in between washes and my scalp is much less itchy and dry than when I was using regular shampoo or co-washing. When particularly dry and itchy, I use jojoba oil on my scalp as a mask/cleanse before I shower, massage it in well, leave it on for 5-10 minutes then wash out . This also helps with any build-up of product on my scalp.\n\nIt will probably take some trial and error to find out what works for you and a bit of time for your scalp to transition. You may also need to use a clarifying shampoo to get rid of all the build-up on your hair before starting over to give you a clean start but not everyone needs that step.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Jenifarr",
        "body": "I think you’re thinking too hard about the ingredients. The wax is probably the issue, but not necessarily. Low poo would be no products with silicone, sulfate, or parabens. Simple. \n\nIf you are switching to low poo products and just using those, I would say it’s probably a bit of waxiness from transition. That’s normal and just a matter of lifting the waxiness (apple sauce mask, egg, or a full-poo shampoo) and forging ahead.  If you’re still using full poo products (which it looks like you are, regardless of how you’re using them) it’s probably just a bad formulation for you and/or the water coming out of your tap.   Find something inexpensive to try.  Burt’s Bees, L’Oreal Paris Evercurl or Evercreme cleansing conditioners, Nature’s Gate, VO5 conditioners in the white bottles (if they’re still packaged the same as when this list was made) are all fairly widely-available and often fairly inexpensive options.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "thickumsthrow",
        "body": "I don’t follow this method but from personal experience bees wax builds up on my hair more than any other oil, silicone. It’s one of those things that can be washed out with a gentle shampoo, or sulphate shampoo depending on your preference/hair type",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "rez6tp",
    "title": "MIZON: Good Night Wrinkle Care Sleeping Mask VS Snail Wrinkle Care Sleeping Pack",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/rez6tp/mizon_good_night_wrinkle_care_sleeping_mask_vs/",
    "score": 10,
    "num_comments": 1,
    "created": "2021-12-12T21:48:43+00:00",
    "body": "Hello! So I was wondering if anyone has used these two products. They have descriptive similarities (snail extract in their product description, claim they help with wrinkles, from the same brand, and are overnight masks), but I imagine the experience and results are different. So if anyone has had used both or one of them, feel free to tell your skin type and results. Thank you!\n\n**Good Night Wrinkle Care Ingredients:** Water, Glycerin, Hydrogenated Polydecene, Octyldodecanol, Neopentyl Glycol Diheptanoate, Olea Europaea (Olive) Fruit Oil, Propanediol, Cetearyl Alcohol, Butyrospermum Parkii (Shea) Butter, 1,2-Hexanediol, Panthenol, Cetearyl Olivate, Palmitic Acid, Glyceryl Stearate, Ammonium Acryloyldimethyltaurate/VP Copolymer, Stearic Acid, Sorbitan Olivate, Carbomer, Tromethamine, Butylene Glycol, Xanthan Gum, Camellia Japonica Flower Extract, Ethylhexylglycerin, Adenosine, Disodium EDTA, Nelumbo Nucifera (Sacred Lotus) Flower Extract, Coptis Japonica Root Extract, Centella Asiatica (Gotu Kola) Extract, Propolis Extract, Hydrolyzed Collagen, Fragrance\n\n**Snail Wrinkle Care Ingredients:** Snail Secretion Filtrate, Glycerin, Water, Cetyl Ethylhexanoate, Butylene Glycol, Dipropylene Glycol, Cetearyl Alcohol, Cyclopentasiloxane, Citrus Limon (Lemon) Peel Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Dulcis (Orange) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cedrus Atlantica Bark Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Grandis (Grapefruit) Fruit Extract, Pinus Sylvestris Leaf Oil, Lavandula Angustifolia (Lavender) Extract, Salvia Sclarea (Clary) Oil, Aniba Rosodora (Rosewood) Wood Oil, Eucalyptus Globulus Leaf Oil, Citrus Aurantifolia (Lime) Oil, Coriandrum Sativum (Coriander) Fruit Oil, Salvia Officinalis (Sage) Oil, Artemisia Absinthium Extract, Chamomilla Recutita (Matricaria) Flower Extract, Butyrospermum Parkii (Shea) Butter, Caulerpa Lentillifera Extract, Glacier Water, Sea Water, Tremella Fuciformis (Mushroom) Extract, Saccharomyces Ferment Filtrate, Vanilla Planifolia Fruit Extract, Santalum Album (Sandalwood) Oil, Honey Extract, Aureobasidium Pullulans Ferment, Fomes Officinalis (Mushroom) Extract, Acacia Seyal Gum Extract, Glycine Max (Soybean) Seed Extract, Dioscorea Japonica Root Extract, Glyceryl Stearate, Hydrogenated Polydecene, Cyclohexasiloxane, Sodium Polyacrylate, Sorbitan Stearate, PEG-100 Stearate, Magnesium Aluminium Silicate, Polysorbate 80, Caprylyl Glycol, Dimethicone, Aminomethyl Propanol, Adenosine, Propylene Glycol, Pentylene Glycol, Ethyl Hexanediol, Glyceryl Caprylate, 1,2-Hexanediol, Ethylhexylglycerin, sh-Octapeptide-4, sh-Decapeptide-7, sh-Pentapeptide-19, sh-Oligopeptide-9, Carbomer, Xanthan Gum, Disodium EDTA, Phenoxyethanol, Potassium Sorbate",
    "flair_text": "Discussion",
    "flair_template_id": "f5703f4a-459e-11e4-bd43-12313b0e84f5",
    "comments": [
      {
        "author": "RedRedBettie",
        "body": "I use the snail one regularly and I like it a lot",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "wicked_edge",
    "post_id": "pjff87",
    "title": "Need help w/ finding alternative shave cream",
    "url": "https://www.reddit.com/r/wicked_edge/comments/pjff87/need_help_w_finding_alternative_shave_cream/",
    "score": 6,
    "num_comments": 7,
    "created": "2021-09-07T03:58:44+00:00",
    "body": "Hello, I need help with a specific item. One of my best shaves of all time was with the 'Avalon Organics Peppermint Shaving Cream'.  It was ridiculously moisturizing and made my legs feel extremely velvety and soft afterwards.  \n\n\nHowever, this item has been discontinued unfortunately :( I've found two stores that sell the item ([Option 1](https://good-earth.com/product/peppermint-shave-cream-8oz/) and [Option 2](https://liveorganic.blazonco.com/products/personal-care/hair-removal-shaving/avalon-organics-moisturizing-cream-shave-peppermint)) but I'm a bit worried buying from them, incase the item is fake, or they have a limited run of the products.\n\n  \nCan someone help me find an alternative shaving cream with similar product list?  (Or could anyone confirm these websites are legit or help me find a better store to get the creams?\n\nProduct list:  \nAloe Barbadensis Leaf Juice(1), Aqua (Water), Stearic Acid, Caprylic/Capric Triglyceride, Helianthus Annuus (Sunflower) Seed Oil(1), Cetyl Alcohol, Glycerin, Glyceryl Stearate SE, Butyrospermum Parkii (Shea) Butter(1), Avena Sativa (Oat) Bran, Calendula Officinalis Flower Extract(1), Camellia Sinensis Leaf Extract(1), Chamomilla Recutita (Matricaria) Flower Extract(1), Lavandula Angustifolia (Lavender) Flower/Leaf/Stem Extract(1), Mentha Piperita (Peppermint) Oil, Cedrus Atlantica Bark Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Geranium Maculatum Oil, Mentha Arvensis Leaf Oil, Canarium Luzonicum Gum Nonvolatiles, Beta-Glucan, Bisabolol, Inulin(1), Potassium Hydroxide, Tocopheryl Acetate, Alcohol(1), Benzyl Alcohol, Limonene.(1)Certified Organic Ingredient.",
    "flair_text": "Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "JEMColorado",
        "body": "Try Alba Botanica, it's great stuff.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Tryemall",
        "body": "The ingredients list makes it clear that that's a brushless shaving cream.\n\n[Try Cremo. They have these](https://cremocompany.com/women)\n\nThe ingredients are different, yet similar in function.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "4xq719",
    "title": "Review of Chica y Chico Suntana 5.0 (physical sunscreen)",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/4xq719/review_of_chica_y_chico_suntana_50_physical/",
    "score": 7,
    "num_comments": 6,
    "created": "2016-08-14T21:31:47+00:00",
    "body": "Hi, all. I know a lot of people on this reddit look for physical sunscreens due to sensitivity or maybe they use it on children, etc. The Innisfree eco safety waterproof one gets a lot of love on this reddit, but since that one was discontinued, I was looking for a new physical sunscreen. Memebox had the chica y chico Suntana for $15 instead of its usual $26, so I purchased it. \n\nI've tried this sunscreen for one week now. It is physical, spf 50, and uses zinc oxide and titanium dioxide. Full ingredients are below this paragraph. FYI, I have normal to dry skin in the summer and dry skin in the winter. I am not acne prone, but I have LOTS of freckles/hyperpigmentation, which is why I am vigilant about sunscreen. This sunscreen was not overly matte or dry on my skin when I applied it by itself. It didn't make oil production go crazy. And it looked ever so slightly dry in certain patches when I applied bb cream and powder over it. However, I have dry patches on my chin, forehead area even in the summer so that's something to keep in mind. Another thing of note is that I reapply sunscreen throughout the day, and when I took a cotton pad with micellar water, swiped it across my face and then reapplied this Suntana sunscreen over my face in the middle of the day, it did not look cakey even though it was over some of my makeup and it did not break me out. There is a slight white cast, but no worse than other mineral sunblocks. And I didn't mind it. I am asian, and prefer to look slightly paler anyway, so that was a plus in my book. In summary, I think this is a great mineral sunscreen for anyone looking for a new one. \n\nWater, Cyclopentasiloxane, Zinc Oxide, Cyclohexasiloxane, Titanium Dioxide, Dimethicone, PEG-10 Dimethicone, Glycerin, Ethylhexyl Palmitate, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Olea Europaea (Olive) Fruit Oil, Citrus Aurantium Dulcis (Orange Oil), Citrus Grandis (Grapefruit) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Cedrus Atlantica Bark Oil, Pelargonium Graveolens Flower Oil, Limonia Acidissima Extract, Jasminum Officinale (Jasmine) Oil, Mrytus Communis Oil, Artemisia Absinthium Extract, Rose Flower Water, Vanilla Planifolia Fruit Extract, Ferula Galbaniflua (Galbanum) Resin Oil, Aluminum Hydroxide, Butylene Glycol, Polyhydroxystearic Acid, Dimethicone/Methicone Copolymer, Stearic Acid, Glyceryl Caprylate, Caprylyl Glycol, Copaifera Officinalis (Balsam Copaiba) Resin, Disodium EDTA, Phenoxyethanol",
    "flair_text": "Reviews",
    "flair_template_id": null,
    "comments": [
      {
        "author": "vanityrex",
        "body": "YMMV but this left a really bad white cast on my skin. \n\nAlso, I emailed Wishtrend about this months ago and never got a response, but cedrus atlantica is a type of tree that is endangered, so unless I'm missing something it's pretty irresponsible for Chica y Chico to be using it in their products.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "katmar13",
        "body": "Thank you for the review! Was there a scent to it? I'm also curious if you've used other physical filter sunscreens (besides the discontinued Innisfree one) and how it compares if you have. \n\nRegarding the Innisfree sunscreens, it seems like they were reformulated/rebranded, and the new Perfect UV Protection Cream Triple Care is rather similar to the old Eco Safety Perfect Waterproof Sunblock. There was a post about the new sunscreens with ingredients and comparisons [here.] (https://www.reddit.com/r/AsianBeauty/comments/4p1p3t/innisfrees_new_sunscreens_an_overview_and/?) The changes look pretty minor to me, but I also know that sometimes a minor change can move a product from Great to Not Great.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "m1zqbr",
    "title": "[Skin Concerns] Help moisturiser made my face red",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/m1zqbr/skin_concerns_help_moisturiser_made_my_face_red/",
    "score": 3,
    "num_comments": 10,
    "created": "2021-03-10T15:15:31+00:00",
    "body": "Hi bought some Moisturizer for my dry face and it made my skin red after 10 mins I immediately removed it and washed my face. any idea how long if should take for the redness to subside.\n\nThe moisturiser contained Aqua (Water), Theobroma cacao (Cocoa) seed butter, Simmondsia chinensis (Jojoba) seed oil, Glycerin, Rosa canina fruit oil, Cera alba (Beeswax), Cetearyl olivate, Sorbitan olivate, Alcohol denat., Glyceryl stearate, Cetearyl alcohol, Cedrus atlantica bark oil, Xanthan gum, Sodium benzoate, Potassium sorbate, Citric acid, Butyrospermum parkii (Shea) butter, Aloe barbadensis leaf juice powder",
    "flair_text": "Skin Concerns",
    "flair_template_id": "658ed080-d0cd-11e3-bce4-12313b0a74a7",
    "comments": [
      {
        "author": "Beverlydriveghosts",
        "body": "Skin does this if the moisture barrier is damaged so that’s a possibility",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "_slightly",
        "body": "The most likely explanation is allergic contact dermatitis. Cedrus atlantica bark oil is a possible culprit. The redness could subside in anywhere from 10 minutes to a few days, but it will probably be gone within an hour. Do not use the product again, and apply a hydrocortisone cream if you have one. You will probably be fine.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Annihilator4U",
        "body": "Avoid denatured alcohol like in this and fragrance",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "chiquevoyage",
        "body": "The first part of the ingredients list look okay but then you get alcohol denat - cetearyl alcohol, sodium benzoate, potassium sorbate.. citric acid... lot's of salts and alcohols I feel.\n\nWhat I always try whenever I get red skin is literally baby products on my face. Like babies buttoms lotion ^^, it's really soothing. I hope it works for you!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SuitableGuarantee968",
        "body": "My son's skin turned red also after using a soap with coconut and jojoba ingredients as well. Stay away! If you want you can put on some hydrocortisone cream now (and in 24 hours from now if it's  still irritated but that's it no more). That should help keep it calm, especially  if it was red and burning.  See, natural ingredients  doesn't  always mean safe.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "wazzitooya",
        "body": "sounds like an allergic reaction, should go away within 24 hrs. i wouldn’t use it again!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "caffeinatedlackey",
        "body": "What moisturizer is this? I'm curious what brand would put denatured alcohol in a moisturizer. It seems so counterintuitive",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beardoil",
    "post_id": "bj3dpu",
    "title": "List of 18 new oils with the ingredients",
    "url": "https://www.reddit.com/r/beardoil/comments/bj3dpu/list_of_18_new_oils_with_the_ingredients/",
    "score": 3,
    "num_comments": 16,
    "created": "2019-04-30T13:35:02+00:00",
    "body": "[Here's](https://www.reddit.com/r/beardoil/comments/bfcnzh/im_so_excited_i_finally_found_a_shop_with_many/) the link to the first list with 8 oils and relative ingredients.\n\nI found other oils and collect all the ingredients to understand which one is the best and which one the worst. Any comment that could help in this is really appreciated.\n\nThese oils are the ones you can find in a shop or online and are not home made.\n\n&#x200B;\n\n**Oil 9**\n\nEthylhexyl Stearate\n\nOctyldodecanol\n\nHelianthus Annuus Seed Oil\n\nCoco-Caprylate/Caprate\n\nArgania Spinosa Kernel Oil\n\nPrunus Amygdalus Dulcis Oil\n\nSimmondsia Chinensis Seed Oil\n\nParfum\n\nTocopherol\n\nLinalool\n\nLimonene\n\nHexyl Cinnamal\n\n&#x200B;\n\n**Oil 10**\n\nIsopropyl Palmitate\n\nCaprylic/Capric Triglyceride\n\nPolybutene\n\nAlcohol Denat\n\nParfum / Fragrance\n\nCaprylyl Glycol\n\nBenzyl Salicylate\n\nPentaerythrityl Tetra-Di-Tbutylhydroxyhydrocinnamate\n\nButyrospermum Parkii Butter / Shea Butter\n\nBenzyl Alcohol\n\nLimonene\n\nCoumarin\n\nAlpha-Isomethyl Ionone\n\nCedrus Atlantica Bark Oil\n\nLinalool\n\nEugenol\n\nCinnamal\n\nEucalyptus Globulus Leaf Oil\n\nFusanus Spicatus Wood Oil\n\nCitronellol\n\nTocopherol\n\nCitric Acid\n\n&#x200B;\n\n**Oil 11 Natural**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nArgania Spinosa Kernel Oil\n\nPrunus Armeniaca (apricot) Kernel Oil\n\nTocopherol\n\n&#x200B;\n\n**Oil 11 Cocos**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nParfum (fragrance)\n\nCocos Nucifera (coconut) Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nCoumarin\n\nTocopherol\n\n&#x200B;\n\n**Oil 11 Old Wood**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nParfum (fragrance)\n\nBenzyl Benzoate\n\nOlea Europaea (olive) Fruit Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nRosa Moschatat (rosehip) Seed Oil\n\nLinalool\n\nButylphenyl Methylpropional\n\nTocopherol\n\nHydroxyisohexyl 3-Cyclohexene Carboxaldehyde\n\n&#x200B;\n\n**Oil 12**\n\nPrunus Amygdalus Dulcis Oil\n\nPersea Gratissima Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nMelaleuca Alternifolia Leaf Oil\n\nTocopherol\n\nCedrus Atlantica Bark Oil\n\nLimonene\n\nLinalool\n\n&#x200B;\n\n**Oil 13**\n\nHelianthus Annuus Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nCocos Nucifera Oil\n\nBorago Officinalis Seed Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nCamelina Sativa Seed Oil\n\nParfum\n\nLimonene\n\nCaprylic/Capric Triglyceride\n\nGlycine Soja Oil\n\nTocopherol\n\nEvernia Prunastri Extract\n\nLinalool\n\nCitronellol\n\nGeraniol\n\nAloe Barbadensis Leaf Extract\n\nCitral\n\nCamellia Sinensis Leaf Extract\n\n&#x200B;\n\n**Oil 14**\n\nSesamum Indicum Seed Oil\n\nRicinus Communis Seed Oil\n\nSimmondsia Chinensis Seed Oil\n\nParfum\n\nArgania Spinosa Kernel Oil\n\nLimonene\n\nIsopropyl Myristate\n\nLinalool\n\nP-Cymene\n\nCitral\n\nDipropylene Glycol\n\nEugenol\n\nCoumarin\n\nTriethyl Citrate\n\n&#x200B;\n\n**Oil 15**\n\nHelianthus Annuus (Sunflower) Seed Oil\n\nPersea Gratissima (Avocado) Oil\n\nMacadamia Ternifolia Seed Oil\n\nJuglans Regia (Walnut) Shell Extract\n\nEucalyptus Globulus Leaf Oil\n\nParfum (Fragrance)\n\nMenthol\n\nTocopheryl Acetate\n\nBht\n\nAlpha-Isomethyl Ionone\n\nLimonene\n\nCoumarin\n\n&#x200B;\n\n**Oil 16**\n\nCyclomethicone\n\nDimethiconol\n\nHelianthus Annuus Seed Oil\n\nSclerocarya Birrea Seed Oil\n\nArgania Spinosa Kernel Oil\n\nPrunus Armeniaca Kernel Oil\n\nMacadamia Ternifolia Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nOlea Europaea Fruit Oil\n\nSesamum Indicum Seed Oil\n\nOctocrylene\n\nParfum\n\nCitronellol\n\nLinalool\n\nHexyl Salicylate\n\nLimonene\n\nCi 40800\n\n&#x200B;\n\n**Oil 17**\n\nSimmondsia Chinensis Seed Oil\n\nHelianthus Annuus Seed Oil\n\nCaprylic/Capric Triglyceride\n\nCarthamus Tinctorius Seed Oil\n\nSesamum Indicum Seed Oil\n\nParfum\n\nTocopheryl Acetate\n\nTocopherol\n\nLinalool\n\nLimonene\n\nCitronellol\n\n&#x200B;\n\n**Oil 18**\n\nAloe Barbadensis Leaf Juice (ALOE Vera)\n\nCetearyl Alcohol\n\nAlcohol Denat\n\nPlukenetia Volubilis Seed Oil (SACHA Inchi)\n\nCannabis Sativa Seed Oil (HANF)\n\nArgania Spinosa Kernel Oil (ARGAN)\n\nAqua\n\nSodium Lactate\n\nBetaine\n\nPentaclethra Macroloba Seed Oil (PRACAXI)\n\nGlyceryl Stearate Citrate\n\nChondrus Crispus (CARRAGEENAN)\n\nButyrospermum Parkii Butter (SHEA Butter)\n\nXanthan Gum\n\nParfum\n\nGlycerin (PFLANZLICH)\n\nGlyceryl Caprylate\n\nTocopherol (VITAMIN E)\n\nSodium Phytate\n\nLactic Acid (PFLANZLICHE Milchsäure)\n\nLevulinic Acid\n\nP-Anisic Acid\n\nSodium Levulinate\n\nSodium Hydroxide\n\nLimonene\n\n&#x200B;\n\n**Oil 19**\n\nVitis Vinifera Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nDecyl Oleate\n\nArgania Spinosa Kernel Oil\n\nParfum\n\nTocopheryl Acetate\n\nPropyl Gallate\n\nHydroxycitronellal\n\nLimonene\n\nLinalool\n\nCitronellol\n\nGeraniol\n\nCitral\n\n&#x200B;\n\n**Oil 20**\n\nPrunus Dulcis (Almond) Oil\n\nButyrospermum Parkii (Shea Butter)\n\nRicinus Communis (Castor) Seed Oil\n\nParfum (Fragrance)\n\nOlea Europaea (Olive) Oil\n\nArgania Spinosa Kernel (Argan) Oil\n\nTocopheryl Acetate (Vitamin E)\n\nDimethicone\n\nLinalool\n\nLimonene\n\nButylphenyl Methylpropional\n\nBenzyl Salicylate\n\nCoumarin\n\n&#x200B;\n\n**Oil 21**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nVitis Vinifera (grape) Seed Oil\n\nPrunus Armeniaca (apricot) Kernel Oil\n\nTocopherol\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\n&#x200B;\n\n**Oil 22**\n\nPrunus Amygdalus Dulcis Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nTocopherol\n\nParfum\n\nLimonene\n\nLinalool\n\n&#x200B;\n\n**Oil 23**\n\nRicinus Communis Seed Oil\n\nVitis Vinifera Seed Oil\n\nPrunus Armeniaca Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nCrambe Abyssinica Seed Oil\n\nAdansonia Digitata Seed Oil\n\nArgania Spinosa Kernel Oil\n\nCannabis Sativa Seed Oil\n\nCitrus Limon Peel Oil\n\nMauritia Flexuosa Fruit Oil\n\nShea Butter Ethyl Esters\n\nSqualane\n\nTocopherol\n\nCitric Acid\n\nCitral\n\nGeraniol\n\nLimonene",
    "flair_text": "BEARDOIL",
    "flair_template_id": "24f86e72-e229-11e5-a702-0e910d110fab",
    "comments": [
      {
        "author": "HockeyBeard32",
        "body": "My apologies if I come across snappy, but your new list doesn’t seem to be a reflection of a single bit of advice you had received from your first list. There are still alcohols and synthetic components in these.\n\nYou’re starting from too complicated of a controlled perspective. You say you wish to determine what ingredients are subjectively preferred by yourself, and I doubt even the most oil-affluent human on the planet would be able to independently judge each of these 10 ingredients in each bottle. Too much combination happening at once. \n\nAdvice:\nIf you can’t pronounce an ingredient, don’t use it. If you were to use your own judgement system and be successful with finding the right oils, you’d be using natural stuff in the end. Save yourself the time now. \n\nIt was said before, but stay simple. Use your classic base oils, a little essential, and added vitamin E if you’d like. Parfume and Fragrance typically refers to alcohol-based, and you don’t want that on your skin or hair. \n\nSpend $50-75 on amazon and you’ll be able to make yourself quality beard oil for at least a few months.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "not_my_business",
        "body": "I think theses oils are the most natural (?) but I still not sure. Some of the listed ones looks more chemical, some other a lots of oils but maybe cheap oils?\n\n&#x200B;\n\noil 11\n\noil 12 \n\noil 13\n\noil 20 (?)\n\noil 21\n\noil 22",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "10j2f61",
    "title": "Product Request - Replacement for Origins Clean Energy Gentle Cleansing Oil?",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/10j2f61/product_request_replacement_for_origins_clean/",
    "score": 2,
    "num_comments": 11,
    "created": "2023-01-23T03:18:52+00:00",
    "body": "Hi everyone! 34 y/o gal with combination skin here - I just went to repurchase my HG daily face wash, Origins Clean Energy Gentle Cleansing Oil, only to find that it has been discontinued. I've been scouring Reddit for a replacement idea but every time I find one that's highly recommended, the ingredients aren't close to Origins. Key players: Olive, Safflower, Sesame, Sunflower & Grapeseed oils. Full ingredients list below. Any ideas?! The value was good for HG, I think it was about $40CAD and would last me the better part of a year with daily use! I also don't double cleanse, so the fact that you could just add water and it would emulsify and rinse clean was \\*chef's kiss\\* for me. Would really appreciate any reccos.\n\nOlea Europaea (Olive) Fruit Oil, Carthamus Tinctorius (Safflower) Seed Oil, Sesamum Indicum (Sesame) Seed Oil, Helianthus Annuus (Sunflower) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Peg-25 Glyceryl Trioleate, Macadamia Integrifolia Seed Oil, Aleurites Moluccana (Kukui) Seed Oil, Citrus Aurantium Dulcis (Orange) Peel Oil\\*, Lavandula Hybrida Oil\\*, Citrus Limon (Lemon) Peel Oil\\*, Citrus Aurantium Bergamia (Bergamot) Fruit Oil\\*, Citrus Grandis (Grapefruit) Peel Oil\\*, Cedrus Atlantica Bark Oil\\*, Pogostemon Cablin Oil\\*, Salvia Sclarea (Clary) Oil\\*, Rosmarinus Officinalis (Rosemary) Leaf Oil\\*, Pelargonium Graveolens Flower Oil\\*, Fusanus Spicatus Wood Oil\\*, Amyris Balsamifera Bark Oil\\*, Linalool, Limonene, Sorbitan Trioleate, Tocopheryl Acetate \\* Essential Oil <ILNILN39944>",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "KaraBoo723",
        "body": "I don't know if the ingredients in the Origins cleansing oil are all that special. Some of those essential oils, in fact, are irritating for a lot of people and are more likely to cause allergic reactions.\n\nThat being said, have you seen the P[aula's Choice Omega+ Cleansing Balm](https://www.paulaschoice.com/omegaand-complex-cleansing-balm/338.html)? I think some of the ingredients are very similar to the Origins one. I've used that and I think it's phenomenal.  The only thing I don't love is the price, I wish it was cheaper. But PC does run sales on their website quite frequently - in fact, it's on sale right now.\n\nI've seen a lot of recommendations for the [Inkey List Oat Cleansing Balm](https://www.sephora.com/product/the-inkey-list-oat-cleansing-balm-P455364) from people who work in skincare. I just recently bought it and using it. It works fine, but I really prefer the texture and the feel of the Paula's Choice one better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "PurpleWorking6815",
        "body": "I worked with origins for a while and that oil was one of my fave. Try their gone but not forgotten line at 1-800-216-7173. If they have any left in their warehouse they will sell it to you. Another cleansing oil that works well is the Biossance cleansing oil. A little bit goes a long way and it melts away all makeup.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "tacoandorange",
        "body": "Did you ever find a decent replacement? I was also hooked on Origins Clean Energy, and have not been able to find anything that Works nearly as well for me. Curious to hear what other Clean Energy fans use?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "are-you-my-mummy",
        "body": "Have you looked at Burts Bees?\n\nI've just decided against one of their cleansers because too many essential oils don't agree with me - but there are quite a few matching ingredients\n\nhttps://www.burtsbees.co.uk/soap-bark-and-chamomile-deep-cleansing-cream/10542785.html",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2i2es0",
    "title": "Can I please get an opinion on this AHA/BHA cleansing gel?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2i2es0/can_i_please_get_an_opinion_on_this_ahabha/",
    "score": 2,
    "num_comments": 3,
    "created": "2014-10-02T05:31:29+00:00",
    "body": "I found this [Swisse Olive Leaf Gel Cleanser](http://www.swisse.com/au/skin-care/face/273/swisse-olive-leaf-gel-cleanser) at the supermarket (Woolworths, Aus) and it seems to be clearing my face up quite well. I've searched AusSkincare and SkincareAddiction for reviews on Swisse products without any luck! Not sure if I've discovered something no-one has used before or if there is a Swisse product boycott I am unaware of...\n\nCan any experienced SCAs tell me if it seems good/bad/OMG don't use it your face will burn off? I've been using it nightly in the shower, followed by my usual moisturiser, with good results.\n\nThe ingredients list in in the link or as follows:\nAqueous Extract of Aloe Barbadensis (Aloe Vera) Leaf\nGlycerin\nCocamidopropyl Betaine\nSodium Cocoyl Glutamate\nXanthan Gum\nHamamelis Virginiana Flower Water\nAllantoin\nOlea Europaea (Olive) Leaf Extract\nEchinacea Angustifolia Extract\nCentipeda Cunninghamii (Plantolin) Extract\nCitrus Grandis (Grapefruit) Peel Oil\nCitrus Aurantium Bergamia (Bergamot) Fruit Oil\nFusanus Spicatus Wood Oil\nAnthemis Nobilis Flower Oil\nCedrus Atlantica Bark Oil\nPassiflora Incarnata Extract\nLinum Usitatissimum (Linseed) Seed Oil\n Vaccinium Myrtillus Fruit Extract\nSaccharum Officinarum (Sugar Cane) Extract\nCitrus Aurantium Dulcis (Orange) Fruit Extract\nCitrus Medica Limonum (Lemon) Fruit Extract\nAcer Saccharum (Sugar Maple) Extract\nSalicylic Acid\nSodium Glycolate\nSodium Citrate\nBenzyl Alcohol\nDehydroacetic Acid\n\nWhat we leave OUT:\nParabens\nSLS\nSLES\nSynthetic fragrances and colours\nPetrolatum\nSilicones\nMineral oils\nPEGS\nTEA\nDEA\nUrea\nPeroxide",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "bathinginreddit",
        "body": "Parabens, Petroleum, Silicones, Mineral Oil and Urea are all ingredients that are perfectly fine to be used in skincare products. That's complete marketing right there trying to take advantage of people.\n\nThat being said it's a mediocre cleanser. It contains a questionable amount of fragrant plant oils + extracts. Also they don't list the acid content, or the pH, so it's hard to tell if those acids are even doing anything. AHAs + BHAs are more beneficial when included in leave on products.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "elsyd",
        "body": "I've just started using this and have found my skin has improved. Would be interested in knowing more!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ButtBeaver",
        "body": "What moisturiser do you use with this?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "hh0h0i",
    "title": "So I found this eczema and troubled skin products but now I need someone to check it’s ingredients",
    "url": "https://www.reddit.com/r/eczema/comments/hh0h0i/so_i_found_this_eczema_and_troubled_skin_products/",
    "score": 2,
    "num_comments": 9,
    "created": "2020-06-27T20:07:05+00:00",
    "body": "Hi guys! \n\nSo I came across this product called Alloferon while searching for a cream on Instagram. \n\nOne of the user of this product said the followings after I asked if he/she could translate the information on the website. It’s in korean. (http://www.yesalloferon.co.kr/m/) The website seems to have good reviews. \n\n- alloferon is an immunomodulatory peptide primarily isolated from a hemolymph of bacteria challenged maggots of the blow fly Calliphora vicina\n\n- alloferon has been proved to enhance functional activity of human natural killer cell and induces endogenous synthesis of interferons and various cytokines, so that it demonstrates anti-viral, anti-tumoral, anti-allergic and anti-inflammatory effects through its immune modulating and immune correting properties\n\n- it's not only targeted towards the eczema. It strengthes skin immunity\n\nThe user’s whole family is using the cream and found it beneficial for their skin.\n\n#1. The cream’s ingredient list:\n\nWater, Glycerin,Caprylic/Capric Triglyceride, Butylene Glycol, Betaine,Butylene Glycol Dicaprylate/Dicaprate, Propanediol, Cetearyl Alcohol,Squalane, Stearate,\n1,2-Hexanediol, Glyceryl Stearate, Cyclomethicone, Polyglyceryl-10 Distearate, Palmitic Acid, Stearic Acid, Allantoin, Carbomer, Tromethamine,\nAlloferon-1, Ethylhexylglycerin, Citrus Paradisi (Grapefruit) Peel Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Sodium Hyaluronate, Citrus Limon (Lemon) Peel Oil,\nCitrus Aurantium Bergamia (Bergamot) Fruit Oil, Ceramide NP, Amyris Balsamifera Bark Oil, Lavandula Angustifolia (Lavender) Oil,Beta-Glucan,\nLavandula Hybrida Oil, Cupressus Sempervirens Leaf/Nut/Stem Oil, Eucalyptus Globulus Leaf Extract,Ocimum Basilicum (Basil) Oil,Centella Asiatica Extract,\nPelargonium Graveolens Flower Oil, Cedrus Atlantica Bark Oil, Anthemis Nobilis Flower Oil, Thymus Vulgaris (Thyme) Flower/Leaf Oil,Cymbopogon Martini Oil,\nSalvia Officinalis (Sage) Oil, Polygonum Cuspidatum Root Extract, Scutellaria Baicalensis Root Extra\n\n#2. The toner’s ingredient list:\n\nWater, Dipropylene Glycol, Propanediol, Glycerin, Glycereth-26, 1,2-Hexanediol, Ethylhexylglycerin, Disodium EDTA, \nAcrylates/C10-30 Alkyl Acrylate Crosspolymer, Arginine, Sodium Hyaluronate, Alloferon-1, Centella Asiatica Extract, Morinda Citrifolia Extract\n\nWhat do you think about this product? I wanna try it out but although I don’t have much idea about the ingredients and the brand itself, I’m a bit hesitant. So I wanna have some discussion.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "moon-drag0n",
        "body": "That is too many ingredients for a skin cream and a lot of them are known irritants to sensitive cream.\n\nIf you want to try a Korean brand for sensitive skin, try Atopalm. \n\nIf you want to discuss ingredients in skincare for our type of skin, I am happy to chat just DM me.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "kalikine4",
        "body": "Everyone's skin is different & most of us have different levels of eczema. IDK about urself, but my eczema is too severe to even attempt to try the product. However, I also have severe allergies. Keep in mind that not everyone w/eczema has the same sensitivities. For example, fish/seafood is supposed to be excellent for skin health, but i am life-threateningly allergic to every type of seafood, so i can't even be around it. I can tell u that a lot of the \"herbal\" ingredients listed help with inflammation.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "crypticandclueless",
        "body": "Citrus seems like a universally irritating ingredient, and lavender (afaik??) kills skin cells.\n\nThe toner contains Centella Asiatica Extract which is calming for a lot of people. But a safer bet for that ingredient would be Purito Centella Unscented Serum. Tbh just avoid looking for skincare advice on instagram in the future.\n\nUse https://incidecoder.com/ to interpret ingredients",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "calabacitas",
        "body": "I'd be way careful and do a test spot first. Any one of the listed plant extracts could cause a reaction on your skin, I know it would make mine angry angry. However, your skin is not my skin and it could be ok for you.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "hh0ftd",
    "title": "[Routine Help] Can anyone look into the ingredients of these eczema and troubled skin products?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/hh0ftd/routine_help_can_anyone_look_into_the_ingredients/",
    "score": 1,
    "num_comments": 5,
    "created": "2020-06-27T20:05:11+00:00",
    "body": "Hi guys! \n\nSo I came across this product called Alloferon while searching for a cream on Instagram. \n\nOne of the user of this product said the followings after I asked if he/she could translate the information on the website. It’s in korean. (http://www.yesalloferon.co.kr/m/) The website seems to have good reviews. \n\n- alloferon is an immunomodulatory peptide primarily isolated from a hemolymph of bacteria challenged maggots of the blow fly Calliphora vicina\n\n- alloferon has been proved to enhance functional activity of human natural killer cell and induces endogenous synthesis of interferons and various cytokines, so that it demonstrates anti-viral, anti-tumoral, anti-allergic and anti-inflammatory effects through its immune modulating and immune correting properties\n\n- it's not only targeted towards the eczema. It strengthes skin immunity\n\nThe user’s whole family is using the cream and found it beneficial for their skin.\n\n#1. The cream’s ingredient list:\n\nWater, Glycerin,Caprylic/Capric Triglyceride, Butylene Glycol, Betaine,Butylene Glycol Dicaprylate/Dicaprate, Propanediol, Cetearyl Alcohol,Squalane, Stearate,\n1,2-Hexanediol, Glyceryl Stearate, Cyclomethicone, Polyglyceryl-10 Distearate, Palmitic Acid, Stearic Acid, Allantoin, Carbomer, Tromethamine,\nAlloferon-1, Ethylhexylglycerin, Citrus Paradisi (Grapefruit) Peel Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Sodium Hyaluronate, Citrus Limon (Lemon) Peel Oil,\nCitrus Aurantium Bergamia (Bergamot) Fruit Oil, Ceramide NP, Amyris Balsamifera Bark Oil, Lavandula Angustifolia (Lavender) Oil,Beta-Glucan,\nLavandula Hybrida Oil, Cupressus Sempervirens Leaf/Nut/Stem Oil, Eucalyptus Globulus Leaf Extract,Ocimum Basilicum (Basil) Oil,Centella Asiatica Extract,\nPelargonium Graveolens Flower Oil, Cedrus Atlantica Bark Oil, Anthemis Nobilis Flower Oil, Thymus Vulgaris (Thyme) Flower/Leaf Oil,Cymbopogon Martini Oil,\nSalvia Officinalis (Sage) Oil, Polygonum Cuspidatum Root Extract, Scutellaria Baicalensis Root Extra\n\n#2. The toner’s ingredient list:\n\nWater, Dipropylene Glycol, Propanediol, Glycerin, Glycereth-26, 1,2-Hexanediol, Ethylhexylglycerin, Disodium EDTA, \nAcrylates/C10-30 Alkyl Acrylate Crosspolymer, Arginine, Sodium Hyaluronate, Alloferon-1, Centella Asiatica Extract, Morinda Citrifolia Extract\n\nWhat do you think about this product? I wanna try it out but although I don’t have much idea about the ingredients and the brand itself, I’m a bit hesitant. So I wanna have some discussion.",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "labellavita1985",
        "body": "I wouldn't use the cream, it contains way way way too many essential oils, orange, lemon, lavender, grapefruit, sage, etc.. the toner looks fine? But not that impressive.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/hgmsme/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "75u76k",
    "title": "[Routine Help] Adding Missha Super Aqua Cell Renew Snail Sleeping Mask to Routine.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/75u76k/routine_help_adding_missha_super_aqua_cell_renew/",
    "score": 1,
    "num_comments": 1,
    "created": "2017-10-12T02:53:06+00:00",
    "body": "I already use Mizon's Snail Wrinkle Care Sleeping Mask as my last step every night, and want to some extra hydration with the new Missha Super Aqua Cell Renew Snail Sleeping Mask.  Should I use the Mizon wrinkle care mask last or the Missha cell renew last? Any recommendations?  I don't see anything that jumps out as possibly harmful at all with interacting ingredients. \n\nIngredients are \n\nMissha Mask - Phytoncide Water, Snail Slime Extract, Glycerin, Butylene Glycol, Caprylic/Capric Glycerides, Behenyl Alcohol, Baobab Tree Extract, Cetearyl Alcohol, Tocopheryl Acetate, Centella Asiatica Meristem Cell Culture, Hydroxypropyl Cyclodextrin, Sucrose Polystearate, Sodium Polyacrylate, Caprylyl Glycol, Ethylhexylglycerin, Sorbitol, Hydrogenated Polyisobutene, Disodium EDTA, Xanthan Gum, Perfume\n\nMizon Mask - Snail Secretion Filtrate Glycerin Water Cetyl Ethylhexanoate Butylene Glycol Dipropylene Glycol Cetearyl Alcohol Cyclopentasiloxane Glyceryl Stearate Hydrogenated Polydecene Cyclohexasiloxane Sodium Polyacrylate Sorbitan Stearate Peg-100 Stearate Magnesium Aluminum Silicate Phenoxyethanol Carbomer Polysorbate 80 Caprylyl Glycol Dimethicone Xanthan Gum Aminomethyl Propanol Citrus Limon (lemon) Peel Oil Olea Europaea (olive) Fruit Oil Citrus Aurantium Dulcis (orange) Oil Adenosine Disodium Edta Citrus Aurantium Bergamia (bergamot) Fruit Oil Cedrus Atlantica Bark Oil Citrus Aurantium Dulcis (orange) Fruit Extract Citrus Grandis (grapefruit) Fruit Extract Pinus Sylvestris Leaf Oil Lavandula Angustifolia (lavender) Extract Salvia Sclarea (clary) Oil Aniba Rosaeodora (rosewood) Wood Oil Eucalyptus Globulus Leaf Oil Citrus Aurantifolia (lime) Oil Coriandrum Sativum (coriander) Fruit Oil Salvia Officinalis (sage) Oil Artemisia Absinthium Extract Chamomilla Recutita (matricaria) Flower Extract Butyrospermum Parkii (shea) Butter Caulerpa Lentillifera Extract Water Sea Water Tremella Fuciformis (mushroom) Extract Saccharomyces Ferment Filtrate Vanilla Planifolia Fruit Extract Santalum Album (sandalwood) Oil Propylene Glycol Honey Extract Aureobasidium Pullulans Ferment Fomes Officinalis (mushroom) Extract Acacia Seyal Gum Extract Pentylene Glycol Ethyl Hexanediol Glyceryl Caprylate Potassium Sorbate 1,2-hexanediol Glycine Max (soybean) Seed Extract Ethylhexylglycerin Dioscorea Japonica Root Extract Sh-octapeptide-4 Sh-decapeptide-7 Sh-pentapeptide-19 Sh-oligopeptide-9",
    "flair_text": "Routine Help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "ThorsHammerMewMEw",
        "body": "Use the thinner one before whichever one is thicker.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]