[
  {
    "subreddit": "Indiemakeupandmore",
    "post_id": "te3nl9",
    "title": "For Strange Women London Fog review",
    "url": "https://www.reddit.com/r/Indiemakeupandmore/comments/te3nl9/for_strange_women_london_fog_review/",
    "score": 48,
    "num_comments": 4,
    "created": "2022-03-14T18:03:34+00:00",
    "body": "This is the closest I've come to finding a perfume that smells like black tea and its instantly become one of my go to scents.\n\nTheir website describes the scent as \"A London Fog is a latte of black tea leaves soaked in bergamot peel oil (Earl Grey), then brewed in warm milk and sweetened with a shot of vanilla syrup.\"\n\nHonestly I find it heavenly! It captures the feeling of a cozying up with a warm cup of tea on a chilly day. I absolutely love it.",
    "flair_text": "Perfume - Purchased",
    "flair_template_id": "e65f512a-31f3-11e5-b829-0e09b4299f63",
    "comments": [
      {
        "author": "chicken_tendor",
        "body": "I guess I'm gonna have to break down and order from them one day! That sounds lovely, I've tried a couple earl grey scents that were pretty nice but they were all too... something lol",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "proper_ginger",
        "body": "Oh man, I love London Fogs and indie fragrance. I’ve never tried For Strange Women though. Did you order it straight from the brand? Was the experience okay?",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYfragrance",
    "post_id": "1lti295",
    "title": "How I Created My First Perfume, Vanilla Resin!",
    "url": "https://www.reddit.com/r/DIYfragrance/comments/1lti295/how_i_created_my_first_perfume_vanilla_resin/",
    "score": 32,
    "num_comments": 19,
    "created": "2025-07-07T01:48:36+00:00",
    "body": "After spending countless hours educating myself on perfumes, I've finally finished creating Vanilla Resin, my debut amber vanilla fragrance, featuring mostly natural ingredients!\n\nI've compiled all the steps I took to making my perfume!\n\n**MY EDUCATION:**\n\nI am self taught in perfumery. Early on I decided I would educate myself through books, Youtube videos, podcast interviews, and most importantly, looking at publicly available perfume recipes!\n\n**Here are the books I read:**\n\n*The Big Book Of Perfume for an Olfactory Culture* by Nez -This is a great book for understanding the context of the perfume world. What are the ingredients that go into making a perfume? What are the stages of developing a perfume? What is the manufacturing process like? How do perfumes get advertised and make a profit? If you're hoping to eventually sell a perfume and want to understand the bigger picture of perfumery.\n\n*Fragrant: The Secret Life of Scent* by Mandy Aftel -She is the queen of natural perfumery, and is one of the more well-known perfume writers! In this book she lists a bunch of perfume recipes you can make yourself for practice. She also talks about her appreciation of scent, and the philosophy of scent. I highly recommend this book, even if you plan to primarily work with synthetics.\n\n*Essence & Alchemy: A Natural History of Perfume* by Mandy Aftel -Another book by Mandy! This has a lot of interesting stories about perfume, like how it was used throughout the centuries through different cultures. However, if you are looking for the practical steps for making perfume, I would suggest skipping to the recipe sections of the book, even though the historical documentation is cool.\n\n*The Chemistry of Fragrances: From Perfumer to Consumer* by Charles Sell -This is a harder read, but if you can make it through, you'll be a certified perfume nerd. Understanding the methods of extraction for natural ingredients, the molecular structure of synthetic ingredients, and how the scientific discovery of new ingredients affected the styles of perfumes available throughout history is pretty important.\n\n**Here are the Youtube Videos I watched:**\n\n[How to Make Natural Perfume at Home (Made Easy)](https://www.youtube.com/watch?v=n0KCblSVME4&ab_channel=FragranceView) \\-This is great intro to learning about the necessary materials for making a perfume. Using a scale, your beakers, measuring out the weight of each ingredient, etc. Peter is good at explaining each step and giving some context to why things are done a certain way.\n\n**Publicly Available Perfume Ingredient Formulations:**\n\n[Tom Ford Amber Absolute formula](https://www.instagram.com/p/CLEs0bjBmUV/?igshid=16bcmt0nxq7p9&img_index=1) posted by Christophe Laudamiel. It includes the weight of each ingredient!\n\n[Heretic Parfums](https://hereticparfum.com/) has full ingredient transparency (although they do not list percentages)\n\n[Henry Rose](https://henryrose.com/) has full ingredient transparency (although they do not list percentages)\n\n[YSL Fragrances](https://www.yslbeauty.com/int/fragrances.html) reveal 95% of the ingredients in their fragrances. These include Libre, Black Opium, and Mon Paris, along with their colognes.\n\n[Skylar Perfumes](https://skylar.com/) has full ingredient transparency (although they do not list percentages)\n\n**DECIDING PERFUME INGREDIENTS:**\n\nMy favorite perfumes are amber perfumes and vanilla perfumes, like Labdanum 18 by Le Labo, Maison Francis Kurkdjian's Grand Soir, Byredo Vanille Antique, and Diptyque Eau Duelle. Based on this, I learned what materials typically make up an 'amber' fragrance (labdanum, benzoin, tonka bean, patchouli, and resins like frankincense or myrrh) along with the typical 'vanilla' fragrance (vanillin, ethyl vanillin, vanilla absolute). I then selected a few ingredients that would balance out those heavier notes (the amber and the vanilla). For example, the bergamot peel oil and the vetiver root extract added to the complexity/depth of the scent, giving it a slightly sharper feel.\n\n**BUYING THE MATERIALS:**\n\nI've created a chart showing each material I purchased, the cost, quantity, and source.\n\nhttps://preview.redd.it/fpot8xrwpdbf1.png?width=1282&format=png&auto=webp&s=d354b04d42143f5ffa366c9d3a8b944e91383e5e\n\nNow, you might feel shocked when you see the grand total. Almost $400 is a lot of money. That may seem like too much, but keep in mind that most of these materials were bought in bulk. There are enough glass bottles for 108 perfumes, enough alcohol for 23 perfumes, and enough sticker labels for 89 perfumes.\n\nPer perfume, the cost of materials came out to **$18.25**. This did not include the cost of packaging, shipping, or advertising, but when you consider that this is a high quality perfume, made of mostly natural ingredients, you could expect the typical markup to be around **$100.**\n\n**If you've made it this far, I hope the info and resources I've compiled has been helpful for you! Perfumery is a rewarding craft, and I feel so happy each time I take a whiff of my new fragrance! Being able to say that you made something yourself is a really great feeling.**\n\nAnd here is my perfume, [Vanilla Resin](https://www.etsy.com/listing/4314940099/vanilla-resin-eau-de-parfum-50ml?ref=shop_home_active_2&logging_key=78e0f88b09a1db93b020f2071f7270920ddcf63a%3A4314940099)! I am very proud of my baby, I spent a lot of time creating this fragrance! I've added the link to my Etsy store so you can see the final product :)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ProfessionalReturn51",
        "body": "I love your concept of transparency, congrats 🎉",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Zaltara_the_Red",
        "body": "Congratulations! I also love vanilla resin scents. I've bookmarked your post and will dive into it more. Thanks for sharing so much!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "toastaficionado",
        "body": "Thanks for sharing your resources! \n\nI’m hoping to begin my own journey, once I am able to. Your journey is such great reference.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ctchbrth",
        "body": "congrats!! this looks great :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "babemomlover",
        "body": "I am just looking to get into fragrance creation and vanilla + amber is my favorite combination of scents.  The Etsy site says not available but I plan on buying a bottle whenever it is available.  Thank you for putting time and effort into an informative post.  Do those links you posted for books have an affiliate associated with them?  If they do you deserve the money I will def buy those books!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "earth2lexxy",
        "body": "bet it smells great…love vanilla. what’s the longivity like?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "d5t_reddit",
        "body": "Congratulations! It feels great reading your post and sensing your zeal! Way to go..\n\nMy two cents - for your next batch consider bergamot FCF. I too made the same mistake and got the bergamot oil. Later learnt that it has some photo sensitive elements that may cause skin rashes. They easy workaround would be to suggest your users of this batch to spray it on clothes and avoid spraying on skin.. Just to be on the safe side.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "PlanktonMammoth",
        "body": "I just placed an order and can’t wait to get my nose on it. I love everything about the vibe and your ingredient choices, especially the heavy lean into naturals. \n\nHerod was my first scent love beyond Axe body spray, and I’ve been chasing that high ever since. Sadly, I get almost no projection or longevity from it, so I’ve been itching for something that is similar but sticks around. Here’s hoping Vanilla Resin becomes that signature I’ve been hunting for. Either way, I’m stoked to support a fellow indie perfumer doing it right.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "1gf08sz",
    "title": "Develop A New Hair Styling Cream",
    "url": "https://www.reddit.com/r/Hair/comments/1gf08sz/develop_a_new_hair_styling_cream/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-10-29T17:28:15+00:00",
    "body": "Hello, I'm at day 1 of developing my own hair styling cream, I've started doing some research and have some ideas on the different qualities I'm looking for.\n\nI'd like to develop something similar to Kevin.Murphy Free Hold Med\n\nI'd like for it to be paraben free, sulfates free, ideally no synthetic fragrances, it seems odd that you couldn't just get the right fragrance from these really great oils.\n\nFor instance in this one there's so many ingredients, intuitively it seems like too much, I think some of these could be substituted for Argan Oil, Jojoba Oil, Rosemary Oil, Lavendar Oil, or Castor Oil.\n\nI'd like to figure out \n\n1.) The ingredients to close in on \n\n2.) The ratios \n\n3.) Be really healthy for hair, hair growth, restoration, moisturizing, etc\n\n  \nWater (Aqua)  \n• Petrolatum  \n• Cetearyl Alcohol  \n• Lanolin Wax  \n• Bis-Diglyceryl Polyacyladipate-2  \n• VP/VA Copolymer  \n• PVP  \n• Carnauba Wax  \n• Ozokerite  \n• Propylene Glycol  \n• Ceteareth-25  \n• Diethylhexyl Maleate  \n• PEG-40 Hydrogenated Castor Oil  \n• Alcohol Denat.  \n• Yerba Mate Extract  \n• Bergamot Peel Oil  \n• Patchouli Oil  \n• Hydrogenated Polydecene  \n• Trideceth-10  \n• PEG-10 Soy Sterol  \n• Sodium Polyacryloyldimethyl Taurate  \n• Phenoxyethanol  \n• Ethylhexylglycerin  \n• Fragrance (Parfum)  \n• Treemoss Extract  \n• Limonene, Linalool.",
    "flair_text": "Question",
    "flair_template_id": "8ca8c0c4-19ec-11e8-a6e5-0ed094bb9d2e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskDocs",
    "post_id": "6p4kr3",
    "title": "Mouthwash in pregnancy",
    "url": "https://www.reddit.com/r/AskDocs/comments/6p4kr3/mouthwash_in_pregnancy/",
    "score": 0,
    "num_comments": 1,
    "created": "2017-07-23T23:11:00+00:00",
    "body": "Would this mouthwash be safe for pregnant women: Cannabis Sativa Seed Extract, Alcohol Denat., Aqua, Mentha Piperita Oil, Citrus Bergamia Peel Oil Expressed, Salvia Officinalis Oil, Stevia Rebaudiana Extract? It's a concentrate. You are supposed to out about 10 drops in 0.5 deciliters of water.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "orthostatic_htn",
        "body": "I would certainly not suggest it. Sounds like something that has not been studied in pregnancy.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]