[
  {
    "subreddit": "AdviceAnimals",
    "post_id": "meoeut",
    "title": "Cocamidopropyl betaine, tocopheryl acetate, panthenol, niacinamide, etc.",
    "url": "https://www.reddit.com/r/AdviceAnimals/comments/meoeut/cocamidopropyl_betaine_tocopheryl_acetate/",
    "score": 5763,
    "num_comments": 194,
    "created": "2021-03-27T22:35:25+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "irishmickguard",
        "body": "Does pepperige farm not remember how many books, magazines and newspapers used to be found in bathrooms back then?",
        "score": 344,
        "is_top_level": true
      },
      {
        "author": "Can_I_Read",
        "body": "*Reader’s Digest* to help you digest. I usually read the *TV Guide*, though.",
        "score": 83,
        "is_top_level": false
      },
      {
        "author": "Mrtnxzylpck",
        "body": "What about newspapers and magazines sometimes those were even used as toilet paper.",
        "score": 75,
        "is_top_level": true
      },
      {
        "author": "Bob_Abounds",
        "body": "Sodium Laureth Sulfate!",
        "score": 37,
        "is_top_level": true
      },
      {
        "author": "boxsterguy",
        "body": "I once dated a girl who had The Watchmen TPB in her bathroom. Definitely spent some time pooping there.",
        "score": 28,
        "is_top_level": false
      },
      {
        "author": "dusktilhon",
        "body": "I read the entire Far Side anthology that way as a teen.",
        "score": 27,
        "is_top_level": false
      },
      {
        "author": "sofakingWTD",
        "body": "methylchloroisothiazolinone",
        "score": 21,
        "is_top_level": true
      },
      {
        "author": "S4T4NICP4NIC",
        "body": "> I've read the entire Song of Ice and Fire on the toilet\n\nDamn, you must hemorrhoids like grapes",
        "score": 20,
        "is_top_level": false
      },
      {
        "author": "sentinelofdarkness",
        "body": "That, or comics/books",
        "score": 18,
        "is_top_level": false
      },
      {
        "author": "megustarita",
        "body": "Then it was time for no. 2",
        "score": 15,
        "is_top_level": false
      },
      {
        "author": "SilentJoe1986",
        "body": "As long as possible. Its the only place people leave me the fuck alone.",
        "score": 14,
        "is_top_level": false
      },
      {
        "author": "CeeApostropheD",
        "body": "That's the one I remember too, and we remember it because it was the longest one on the bottle!",
        "score": 14,
        "is_top_level": false
      },
      {
        "author": "RunningInSquares",
        "body": "Where's my Uncle John's Bathroom Reader gang at?",
        "score": 13,
        "is_top_level": false
      },
      {
        "author": "Jabronie88",
        "body": "Who had shampoo bottles next to the shitter? I remember having a magazine rack on the wall filled with reading material.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "andropogon09",
        "body": "If you were constipated you could get through the entire volume 1.",
        "score": 11,
        "is_top_level": false
      },
      {
        "author": "Lickingyourmomsanus",
        "body": "Readers Digest",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "yammez",
        "body": "Pooping professional right here.",
        "score": 10,
        "is_top_level": false
      },
      {
        "author": "Toomuchconfusion",
        "body": "I think you a word",
        "score": 9,
        "is_top_level": false
      },
      {
        "author": "LeToneRanger",
        "body": "At one point I had Paul Mitchell ingredients memorized!",
        "score": 9,
        "is_top_level": false
      },
      {
        "author": "Dr_Pattursnatch",
        "body": "No shit.",
        "score": 9,
        "is_top_level": false
      },
      {
        "author": "InfernalGriffon",
        "body": "Uncle John's Bathroom reader.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "angeliqu",
        "body": "I used to appreciate really nice toilet paper that was 3 ply with a pattern because I would peel it all carefully apart, one sheet at a time. Kept me occupied for the duration and I could use the little stack of single ply tp at the end, too.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "fordprefect294",
        "body": "Walter meme: Am I the only one around here who never used to read on the toilet before smartphones existed?",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "IronAchillesz",
        "body": "You heretic.",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "S4T4NICP4NIC",
        "body": "Gotta keep it as is. I kinda like that way it reads.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "S4T4NICP4NIC",
        "body": "You grab it before you assume the throne",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "korkidog",
        "body": "Cans of Air freshener too",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Nebakanezzer",
        "body": "Calvin and hobbes books in my house",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Hanginon",
        "body": "Am I the only one that still doesn't? Anybody?",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "reven80",
        "body": "The first one is some extract from coconut oil. I think the others are some form of vitamins.",
        "score": 7,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 11,
      "nested_replies": 19
    }
  },
  {
    "subreddit": "Philippines",
    "post_id": "132t1tj",
    "title": "\"Ano yung cocamidopropyl betaine?\"",
    "url": "https://www.reddit.com/r/Philippines/comments/132t1tj/ano_yung_cocamidopropyl_betaine/",
    "score": 278,
    "num_comments": 19,
    "created": "2023-04-29T13:33:15+00:00",
    "body": "",
    "flair_text": "Art",
    "flair_template_id": "1cedc8c6-62b0-11ed-bef9-0e0fdc9be828",
    "comments": [
      {
        "author": "Tehol_Beddict10",
        "body": "[Refrigerator](https://www.youtube.com/watch?v=jJKEkZL9qrM&pp=ygULc25sIHBhbnRlbmU%3D)\n\nlolz",
        "score": 19,
        "is_top_level": true
      },
      {
        "author": "MissionMistake3",
        "body": "Gayan ko nalaman na ang weird pala ng pagkaphotoshop sa babae sa lumang cream silk na [pink](https://imartgrocersph.com/wp-content/uploads/2020/09/Cream-Silk-Standout-Straight-11mL.jpg)",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "sleepysloppy",
        "body": "pre-mobile phone days, minsan magdadala ng tabloid na dyaryo or ung may xerex.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "boredcat_04",
        "body": "To use: wet hair, lather, rinse.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "God-of_all-Gods",
        "body": "\"Sino kaya to babaeng to sa shampoo? parang hindi kamukha ni Julia\"",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "stupidfanboyy",
        "body": "Alam ko dati 2000s(or even 2010s) shampoo commercials have edited hair na may issue with one commercial kasi badly edited yung buhok.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "AdamusMD",
        "body": "Ahhhhhh ang Albatross pala ay paradichlorobenzene.\n\nHahaha. Sa sobrang inip ko din while pooping, naka-imagine ako ng images sa mga marble tiles namin sa banyo 😅",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "emsds",
        "body": "ahh sodium lauryl sulfate... sabay drop ng pasabog hahaha",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Immediate-Dot8366",
        "body": "Derived from coconut, its technical name is {[3-(Dodecanoylamino)propyl](dimethyl)ammonio}acetate\n\nIt's kind of mouthful but it was made so that the key ingredients in coconut oil will interact effectively in stuff you want to wash from your hair such as oil and dirt",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "nomoremofo",
        "body": "Omg I just studied this for my boards 🙈 It’s a surfactant (SURFace-ACTive AgeNT). Basically, it removes natural oils/grease in your hair or on your skin. It has a hydrophobic tail (water-hating) and a hydrophilic head (water-loving). The hydrophobic tail binds to the oil in your hair (since oil is also hydrophobic) and when you wash it off with water, its hydrophilic head binds to the water, removing the oil/grease it’s bound to in the process. \n\nCocamidopropyl betaine is an amphoteric surfactant. SLS/sulfates, the most commonly used surfactants, are anionic surfactants. Anionic surfactants are harsher and can be irritating that’s why gentler surfactants are preferred by those who have sensitive skin. That’s why you’ll see SLS/sulfate-free shampoos or facial cleansers being sold in the market. They are usually marketed as “gentle” cleansers.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "rybeest",
        "body": "coca~~midopropyl beta~~ine",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "B-0226",
        "body": "Mga sangkap ng shampoo",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "TheMarsian",
        "body": "pa simpleng brag 😁",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "PantherCaroso",
        "body": "Mas makakatipid ka pa pag bote, kahit maliit ang bilin mo. Unless you're in a rush lugi ka pag sachet.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "spectre_1995",
        "body": "Sheeet, all this time I thought ako lang gumagawa niyan 🤣🤣🤣",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Typical_Ad_8815",
        "body": "Bt parang may mukha sa pader? 🤔",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "hokage_1602",
        "body": "Betaine is a secondary surfactant sa mga washes.  SLES and Betaine are the 2 primary surfactants (nagpapabula) sa mga shampoo, liquid hand soap, dishwashing liquid, car shampoo, pet shampoo. And sa final part ng mixing nila ay nilalagyan ng salt para lumapot ang product.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Aggressive-Baker2348",
        "body": "> pre-mobile phone days, minsan magdadala ng tabloid na dyaryo or ung may xerex.\n\nBefore smartphone (2008) or before [feature phone](https://en.wikipedia.org/wiki/Feature_phone) (1998)?",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 18,
      "top_level": 15,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1azglr5",
    "title": "Cocamidopropyl Betaine FREE",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1azglr5/cocamidopropyl_betaine_free/",
    "score": 26,
    "num_comments": 44,
    "created": "2024-02-25T05:56:21+00:00",
    "body": "I’m in the US and have a severe skin allergy to  Cocamidopropyl Betaine. It is in so many shampoos that I’m having a hard time finding quality products that are free of this ingredient. I have been using Desert Essence but it really dries my hair and I’ve used Attitude which is a brand out of Canada with all of their products being safe but I didn’t find one that I loved.\n\nDoes anyone have any suggestions? I’d really like to ask some companies to stop using it but I’m sure it would fall on deaf ears. ",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "skin_care_obsession",
        "body": "This website helps, you can filter by many ingredients: https://incidecoder.com/search/product?query=Shampoo&exclude=Cocamidopropyl+Betaine",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Unfair_Finger5531",
        "body": "Vanicream free and clear shampoo has none.  That said, plenty of shampoos are free of this ingredient.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "whatiwishihadknown",
        "body": "Can I ask what your symptoms are and how you narrowed it down to this ingredient?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "JustinaTimberlina",
        "body": "I did skin allergen testing because I was having severe blistering and dermatitis on my hands. My head was also always itchy and I thought it was just from dry skin but now that I don’t use it I don’t have the problems.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "coltpersuader",
        "body": "The Ordinary Sulphate Shampoo and Behentrimonium Chloride Conditioner don't contain it. I'm sensitive to it too (although not full on allergic - I can tolerate a bit on my skin infrequently, but too much or too often and my scalp is on fire). I'll be following for more options!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kiliki00",
        "body": "Hi! I’m allergic too and in Canada. There’s actually almost zero choices up here. I tried attitude too and although my scalp felt good my hair looked awful. I’ve switched back to Oribe and my scalp is thanking me",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "isiik",
        "body": "I have found that some solid shampoo bars are a good alternative. I’m currently using Viori citrus Yao solid shampoo and it smells great and works well. I used the vanicream free and clear shampoo for a while but my hair looked terrible",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ltl_lauren",
        "body": "I know it’s pricey, but Kevin Murphy maxi wash doesn’t have it. I use KM once a week and attitude shampoo the rest of the week as the maxi wash is a detox shampoo and really gets build up out!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ifailedpy205",
        "body": "I’m in the same boat! Just came to say it sucks",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Dforce7",
        "body": "I have a severe allergy to CAPB. \nMost baby shampoos are CAPB-free but don’t wash adult hair well. Unfortunately, most kids shampoos have CAPB and the only exception is L’Oréal kids shampoo. \nTarsum shampoo is another great product but doesn’t smell great so I use it only when I’m having an allergic reaction in my scalp (sometimes stress induced dermatitis as opposed to contact dermatitis to CAPB). Tarsum will calm things down immediately after single use. \n\nAs far as body wash, Dr. Bronner's Pure-Castile Hemp is the best thing ever. \n\nGood luck and please share what works for you. I’m looking to try new CAPB-free products",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Voldemortmalort",
        "body": "Hi! I was diagnosed through Northwestern University. I was  told if allergic to coco betaine to avoid dimethylamine/o as well. I have found myself to be sensitive to Coco hydrosultaine as well. I highly highly recommend shampoo bars. The best shampoo bars I have tried are the Viori beauty ones. Their products saved my hair and scalp after years of allergic reactions. My baby hairs even grew back! For liquid, I recommend The Ordinary brand shampoo.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "aggressive-teaspoon",
        "body": "Unfortunately, products get re-formulated a lot and a third party site based on user submissions just can't keep up with that. INCI Decoder at least includes time stamps of when an ingredients list was submitted and frequently a picture of the product packaging at that time, so you can get a general idea of how up to date it is. \n\nIt drives me up the wall that manufacturers don't always have ingredients lists on their websites...",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Simple-Penalty3427",
        "body": "I kept getting horrible outbreaks around my eyes, hairline and neck, itchy scalp etc.  I went to an allergist and had a 3-day testing panel done on my back.  Cocamidopropyl Betaine is the only thing that came back positive.  It was in practically every hand soap, shampoo, body wash in my house. I got rid of everything and had not had an outbreak since.  I stayed at a hotel a few weeks ago and forgot to bring my shampoo so I used theirs and the next morning my eyes were starting to burn and sure enough I looked at the shampoo and it had it in it.  The best thing to do is cut the ingredient out completely and see if you see a difference.  The allergy testing is kind of a pain not being able to shower, having this itchy stuff on your back, etc.  so if you can pinpoint the allergy without going through all that it's better but you have to completely eliminate the ingredient, see if you have an improvement and then use the ingredient once and you should see an almost immediate reaction. Then you'll know.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Bubbly-Attempt3760",
        "body": "If you have dandruff, Head & Shoulders Royal Oils Moisturizing Co-Wash is good as well H&S BARE.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "koolcat707",
        "body": "Could you pls let me knw which Oribe shampoo you are using...",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "kiliki00",
        "body": "Gold Lust I can use without an issue. I just don’t love it as a shampoo. Which is frustrating but at least it doesn’t cause me any irritation. \n\nI can also use Kiehls Amino Acid shampoo without an issue. And Redken all soft",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "JustinaTimberlina",
        "body": "I developed severe, blistering dermatitis on my hands. My nails were not growing correctly and nothing I did helped it. The ingredient is in so many products, especially ones that say they are natural  because it is derived from coconut. I had to do multiple rounds of methotrexate to get rid of it.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ubanoutfitters",
        "body": "Exederm Products!!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "goldennectar",
        "body": "Late to the game on this post but I also get a horribly itchy scalp using shampoos with cocamidopropyl betaine. If you can handle sodium laureth sulfate, try the shampoos by Mario Badescu. They’re affordable (the large bottles last me months) and all smell good! Normally fragrances bother me and my skin too but none of theirs do.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Bubbly-Attempt3760",
        "body": "Does anyone have an allergy to CAPB and have very coily (curly) hair?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Special-Win8276",
        "body": "I hear ya. I'm also highly contact sensitive to coco betaine and it's nearly impossible to search for shampoos that don't have it. Living Proof Perfect Hair Day works for me. Cocoamidopropyl Hydroxysultaine is an ingredient - though the first name is the same as Coco Betaine, this doesn't cause a reaction for me - and it's a great shampoo. I recently tried Kitsch Castor Oil Shampoo Bar and that didn't cause a reaction either. I also liked the results. My hair is fine and straight but I have a ton of it. Sorta like Jennifer Aniston's hair texture but more hair than her",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Odd_Election1833",
        "body": "Hi all!! I’ve been dealing with this for 8 years now. My go to shampoos are - AG care apple cider vinegar, Olaplex (surprisingly doesn’t have it), I also get dandruff so I use Nizoral sometimes, and lush shampoo bars also don’t have it. I will say to e fragrance in some of the lush bars irritate my skin but I’ve tried them all- soak & float and montalbano are my favorites. \n\nAs for any body wash- I tend to use Dr Bronners Castile and sugar soap! Hope it helps :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LoveGardenTime",
        "body": "Thank you for sharing this!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LoveGardenTime",
        "body": "Thank you for sharing this!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Sad_Day_989",
        "body": "I know it’s been a while since you posted this, but seriously thank you! I’ve been having an extremely hard time for over a year now to find the right shampoos that I wasn’t allergic to. Thank you for posting this website!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "skin_care_obsession",
        "body": "Glad I could help!! :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "rpoem",
        "body": "Initially loved that site -- BUT have already found two shampoos incorrectly listed there as not including Cocamidopropyl Betaine. I was about to buy the Kristin Ess Shampoo and looked at the ingredients listed on Amazon and then the manufacturer's own site, and both named CAPB as an ingredient. I've noticed that's also true for the Muji shampoo.  \n\nNot sure how widespread the issue is, but definitely would not trust that site without checking what the manufacturer says.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "pretty_repulsive",
        "body": "I found that the skinsafe app can be more accurate",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "JustinaTimberlina",
        "body": "This is an awesome site! Thank you!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "JustinaTimberlina",
        "body": "This is an awesome site! Thank you!",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 15,
      "nested_replies": 15
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "11xtd8r",
    "title": "Cocamidopropyl Betaine free products",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/11xtd8r/cocamidopropyl_betaine_free_products/",
    "score": 19,
    "num_comments": 31,
    "created": "2023-03-21T20:28:45+00:00",
    "body": "Hi all, my partner has become allergic to Cocamidopropyl Betaine and it's in a lot of products. We're having to find new soaps, shampoo, body wash, cleansers etc. I've got to be honest I don't know where to start and just wondered if anyone might know any websites or places to look for alternatives for these sorts of products? Or apps or anything that can help us weed it out? It's causing contact dermatitis, itchy rashes and he's having to use steroid creams to get things under control.",
    "flair_text": "Question",
    "flair_template_id": "939a0b98-06d8-11e4-89e1-12313b01142d",
    "comments": [
      {
        "author": "MajorVI",
        "body": "Eucerin shampoo might be a good option for him to try, it's aimed at dry itchy scalps and has no Cocamidopropyl Betaine. For body washes maybe go the eczema route and wash with emollients until the dermatitis is under control.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "valiantdistraction",
        "body": "I'm allergic to that as well as many other coconut-derived products... I just avoid them all now as I can't remember what else I'm allergic to. So this list is actually more restrictive than you need, but here's a post with my routine:\n\n[https://www.reddit.com/r/30PlusSkinCare/comments/x7iua3/anyone\\_else\\_allergic\\_to\\_coconutoilderived/](https://www.reddit.com/r/30PlusSkinCare/comments/x7iua3/anyone_else_allergic_to_coconutoilderived/)\n\nThat ingredient will be in soaps and shampoos but should not be in any lotions etc. Just read the back of ALL ingredients lists before buying. DO NOT look for things that are \"sulfate free\" because they replaced the sulfates with cocamidopropyl betaine, and you *want* the sulfates. If it says \"sulfate free\" on the package, it's almost guaranteed to have cocamidopropyl betaine. Generally \"vegan\" or \"natural\" products will also use cocamidopropyl betaine over sulfates.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Riovem",
        "body": "Try Cosmethics it's an app and I think you can flag ingredients you need to avoid. I've not used it though.\n\nHere's this list of products including it but it's not in one page and it's the inverse of what you've asked: https://incidecoder.com/ingredients/cocamidopropyl-betaine\n\nOther websites to look into :\n\n- Think Dirty\n- Beautypedia\n- CosDNA\n- SkinSafe\n- Skincarisma\n- Detoxm",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "WibblyBear",
        "body": "I really appreciate the reply. Thanks so much I'll definitely take a look and see what we need to switch out. Sorry you have to avoid it as well. Yeah I'm seeing that trend with the \"natural\" products. I tend to use more sulphates anyway because I have Seb Derm and need it for my scalp etc.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Necessary-Day-9946",
        "body": "I’m in Canada so I don’t have any suggestions on where to buy from but I will suggest downloading an ingredient scanner and look for natural products in store and you should have the most luck that way!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "WibblyBear",
        "body": "Will do. Yeah it's been quite tricky so far with things. Thanks so much for the response.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "stcrmyweather",
        "body": "SkinSort is good at dissecting ingredients on popular skincare (and shampoo by the looks of it): [https://skinsort.com/](https://skinsort.com/). \n\nHopefully it might be able to help you find products that don't have cocamidopropyl betaine in, as you can filter products that 'exclude' whatever ingredient you don't want.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "WibblyBear",
        "body": "Hi, I appreciate so much that you responded and thanks for the suggestion. I looked at the website, unfortunately it seems like the products I checked do seem to contain cocamidopropyl betaine. I'll check the rest tomorrow though and hopefully some will be free of it.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "valiantdistraction",
        "body": "Most things that are \"vegan skincare\" are still going to include cocamidopropyl betaine as it is a coconut-derived product",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "WibblyBear",
        "body": "My partner switched to Imperial Leather classic hand soap instead of hand wash. Imperial Leather Foamburst instead of his usual body wash. He's also using E45 shampoo. Since then he hasn't had the itchy outbreak on his hands. I hope you can find swaps for all your hair products. My partner doesn't use anything but shampoo that definitely made it easier.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "WibblyBear",
        "body": "Yes. My partner has been using E45 dry scalp shampoo without issue.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "WibblyBear",
        "body": "Thanks for the recommendation, shampoo is one of the ones we were struggling with. Will definitely see about checking that out.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "ummusername",
        "body": "Could you repost your list? I stumbled upon this comment when searching for shampoos that don’t contain cocamidopropyl betaine but I am also allergic to sodium lauryl sulfates and sodium laureth sulfate.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "WibblyBear",
        "body": "Thanks so much for your response I really appreciate it. I'll definitely check out the websites and app you've listed. Hopefully then we can make sure what we're buying is not going to irritate his skin.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Riovem",
        "body": "Some have barcode scanners so you can use them then search the ingredients.\n\nI'd recommend just locating a few basics for him and then branching out once he has essentials.\n\nIf his allergy is super severe patch test everything, even products he's used before just in case the formula changes etc.\n\nAlso consider that some websites may have the US formulation listed which might differ from the UK\n\nAlso, I'm sure you saw this already but I googled Cocamidopropyl Betaine allergy and this list came up :\n\nhttps://www.skinsafeproducts.com/search/products?products_by_ingredient=65964&includes_ingredient=false\n\nAnd this\n\nhttps://www.dandruffdeconstructed.com/best-cocamidopropyl-betaine-free-dandruff-shampoos/",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Millietree",
        "body": "You could try Moo Goo skincare.\nhttps://www.moogooskincare.co.uk",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Latter_Artist4561",
        "body": "I have just developed the same allergy. I’m finding all my hair products had Cocamidopropyl Betaine in them, 🤦‍♂️",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Latter_Artist4561",
        "body": "Thank you! I’ve just started my journey and this is helpful.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Junny_B_Jones",
        "body": "Found shampoo?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Millietree",
        "body": "Sorry, I've used their products in the past, but didn't get as far as checking the ingredients! I've used Face Theory products in the past which are a vegan skincare brand, Green People, Handmade Naturals which have a comprehensive ingredients list so hopefully you will find some skin care items that are suitable. Good luck with your search.",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 8,
      "nested_replies": 12
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "n0tg1h",
    "title": "Hi, I am at my wits end. I am needing help with all my hygiene products. Shampoo, conditioner, moisturizers, toothpaste and laundry detergent. I have allergies to cocamidopropyl betaine and decyl glucoside. Any suggestions.",
    "url": "https://www.reddit.com/r/Allergies/comments/n0tg1h/hi_i_am_at_my_wits_end_i_am_needing_help_with_all/",
    "score": 16,
    "num_comments": 23,
    "created": "2021-04-29T01:06:58+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Kook81",
        "body": "My allergist has a system where I tell them what products I want and they run it against my allergies and hand me a list of products safe for me to use. Maybe ask if your allergist has this or knows a way you can use it.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Illustrious_Viveyes",
        "body": "You should try Miracle II soap on amazon. It is pricey but good. I also use a bar soap for the face just basically made of oil and clay- like you can find anywhere. I never liked Toms of Maine as it was not strong enough. I use Boka toothpaste, pretty sure that is OK for you- works amazingly well. Laundry soap you might want to try Honest company?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "socialdistraction",
        "body": "I’m allergic to cocamidopropyl betaine and here are some products I can use: \n\n[Paul Mitchell Baby Don't Cry Shampoo](https://www.amazon.com/gp/aw/d/B0009OMNR0?psc=1&ref=ppx_pop_mob_b_asin_title)\n\n[Clean Kids Naturally  Tropical Orange Burst Shampoo](https://gabrielcosmeticsinc.com/collections/clean-kids-naturally/products/clean-kids-naturally-tropical-orange-burst-shampoo)\n\n[Aveeno Clarifying Apple Cider Vinegar InShower Hair Rinse](https://www.amazon.com/gp/aw/d/B07HMVMTN5?psc=1&ref=ppx_pop_mob_b_asin_title)\n\n[dpHUE Apple Cider Vinegar Hair Rinse](https://www.amazon.com/Apple-Cider-Vinegar-Hair-Rinse/dp/B01NAHOR2C)\n\n(Note - for the Apple cider vinegar products, I use the rinse, not the shampoo. Pretty sure both brands use coconut based ingredients in the shampoo). \n\n[Colgate Cavity Protection Regular Fluoride Toothpaste](https://www.amazon.com/gp/aw/d/B0195UTBKA?psc=1&ref=ppx_pop_mob_b_asin_title)\n\n[CETAPHIL Gentle Skin Cleanser ](https://www.amazon.com/gp/aw/d/B00N1QE76S?psc=1&ref=ppx_pop_mob_b_asin_title)\n\nThey seem to be free of decyl glucoside. There are two other shampoos I’ve tried but apparently they have the decyl in them. I try and avoid all coconut products even though I only tested positive for one. I had no idea decyl glucoside was a coconut derivative.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "CherishSlan",
        "body": "Can I help I’m allergic to coconut byproducts  and what you listed is one of them.  \nThis is what I use.  \n\nOnly the original \nGrandmas pure & Natural soap \nHere are the ingredients: food grade lard, water & lye (sodium hydroxide) .\n\nhttps://www.grandmaslyesoap.com\n\n1-800-345-3925 there phone number so you can double check with the company. I have called them they were very nice it was a few years ago. \n\n\n\nThis is another soap I have used \nZip, Nada, Nothing™ Natural Soap\nNatural Goat Milk Soap\n\nIngredients: goats milk and olive oil\n\nhttps://www.puresabao.com/product/zip-nada-nothing-natural-soap/\n\nOk Crystal body Deodorant \nI have only used the original \nStone one it’s safe it’s basically salt\nhttps://www.thecrystal.com\n\n\nI wash my clothing in backing soda and vinegar. \nhttps://www.realliving.com.ph/cleaning-organizing/home-care/can-you-use-baking-soda-to-wash-clothes-a1746-20200511\n\nThe webpage above  will tell you about how to use the baking soda to wash clothing. I add vinegar for germ killing. \n\nWish I could help more hope I helped at all this is just what I have found. I’m constantly looking for more products myself.  \n\nGood luck !",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Violet624",
        "body": "You can make soap bars pretty easily and cheaply! Brambleberry is a good website to check out. I do that because then I can have the most basic possible ingredients in a good quality soap. It's just lye, fat and whatever scent you want, if you even want a scent.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "2_bit_tango",
        "body": "Soaps are the worst to find ones you aren’t allergic to, can confirm. After a ton of trial and error, I’ve learned anything “hypoallergenic” is usually worse for me, but free and clear type products are usually OK. I currently use Tide free and clear. If you use fabric softener, Downey free and gentle works for me. As for bar soap, I use Dove’s basic white. For shampoo, I like Free & Clear shampoo, plus they have conditioner too, but I’ve never tried that. As for lotion, I like goldbond’s unscented or O’Keeffes. I’m lucky in that I can get away with Crest’s regular paste but almost nothing else for toothpaste. I also use dawn dishsoap. On a side note, I can’t use it because of bad reactions to vinegar, but if vinegar doesn’t bother you, 1 part dishsoap 1 part cleaning/white vinegar can be used to clean all kinds of things like the shower or sinks, and vinegar can be used for laundry soap. If it doesn’t bother you, definitely look up using vinegar for cleaning etc.\n\nEdit: forgot one, I use Aveeno ultra calming facewash for sensitive skin. Its unscented, and if you have oily skin, like me, you just leave it on longer before washing it off.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "aerosmithguy151",
        "body": "Try dr bronners, which can perform all those tasks mentioned.\n\nEdit: except as a moisturizer.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ineedlesssleep",
        "body": "Not sure if this can help but i make an app named Soosee (www.Soosee.app). You can fill in ingredients you’re allergic to and it will scan the ingredient label on packaging. You can add the ingredient you’re allergic to and maybe it will help 🙂 it’s free so let me know if you have any suggestions.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "KATEWOW",
        "body": "Maybe Google Nellie’s detergent soap for laundry and see if that’s ok. I use & like it but don’t know if it has what you’re allergic to in it. Also? It’s a powder (flaky?) so you’re paying for soap & not the water in detergent.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "financiallyanal",
        "body": "Unscented/undied detergent, dryer sheets... same for shampoo and conditioner. Dove sells an unscented body soap in bar or liquid form. Get rid of air fresheners etc. from your home. This includes potpourri, etc.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Illustrious_Viveyes",
        "body": "That is really cool.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "rodney_the_wabbit_",
        "body": "Cetaphil Gentle Skin Cleanser - 500 ml (4.1/20)\n\nhttps://incibeauty.com/en/produit/9318637069637",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "socialdistraction",
        "body": "The ingredients list on the website you posted seems to be incomplete. It substitutes ******s instead of some of the ingredients and says to see the missing ones to try their apps.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "rodney_the_wabbit_",
        "body": "The app is free and a real treat. I love it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Violet624",
        "body": "I use Seventh Generation and don't break out into hives with it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "lady-kdub",
        "body": "This is a little out of the box and depending on your opinion but have you looked into any of the hygiene products for hunters? I come from a family with very sensitive skin and these products have worked for us in the past. Also what about baby products? I or my family use these brands:\n\nScent Killer (there are other brands and I know there are product lines specifically for and from women), all free and clear, Tide free and gentle, Neutrogena, Clinique (also have a men's skin care line), Polo deodorant (only green coloring), Arm & Hammer (Church & Dwight) products, basic baking soda and vinegar. Good luck.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "rodney_the_wabbit_",
        "body": "https://thebestorganicskincare.com/oil-cleansing-method-101-everything-you-need-to-know/\n\nAleppo liquid soap: olive oil (moisturizing), laurel oil (cleansing), E525 and water (soap making).\n\nToothpaste: biorepair\n\nDeo: potassium alum on clean skin\n\nFor laundry, you may use soap nuts.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Working-Mistake-6700",
        "body": "Have you tried Lush? I don't know for sure that they don't use those but they have alot of natural options like shampoo bars and conditioners and toothpaste and deodorant. As for laundry detergent you can make your own it's not too hard.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 18,
      "top_level": 12,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "6rmbju",
    "title": "Sulfate- and cocamidopropyl betaine-free cleanser?",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/6rmbju/sulfate_and_cocamidopropyl_betainefree_cleanser/",
    "score": 12,
    "num_comments": 9,
    "created": "2017-08-04T18:08:25+00:00",
    "body": "After reading about these ingredients being problematic in toothpastes, I found and switched to a cheap toothpaste that is free of both (Wilkos sensitive - pink tube!)... only to realise that my (Simple foaming) cleanser actually contains both CB and SLS.\n\nSkincare addicts who're avoiding these ingredients, what cleansers are you using? I'm hoping for something cheap and readily-available. I have persistent CCs on my chin and I want to rule out these ingredients as the cause (or fix them forever!).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "shut-up-dana",
        "body": "I'm seeing some upvotes but no responses, so maybe this is something others would like to know? I had some spare time today so I had a look at the listed ingredients for various cleansers on Superdrug's website. I limited the cost to <£5 per unit, and looked at rinse-off products only. I eliminated anything that included sulfates, cocamidopropyl betaine, alcohol denat., or anything that sounded like it could be another name for cocamidopropyl betaine (coca-anything, anything-betaine) for good measure since I'm not actually 100% sure what that ingredient is.\n\nHere are the 3 products I have left:\n\n[**Clean & Clear Deep Action Cleansing Wash**](https://www.superdrug.com/Clean-%26-Clear/Clean-%26-Clear-Deep-Action-Cleansing-Wash-150ml/p/344358), £3.25 for 150 mL\n\nAqua, **Cetyl Alcohol**, PPG-15 Stearyl Ether, Salicylic Acid, Polysorbate 60, Steareth-21, **Myristyl Alcohol**, **Stearyl Alcohol**, Potassium Cetyl Phosphate, Xanthan Gum, Menthol, BHT, **Parfum**, Benzyl Salicylate, Hexyl Cinnamal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Linalool\n\n[**Nivea Daily Essentials Crème Care Cleansing Cream Wash**](https://www.superdrug.com/Skin/Cleansers-%26-Toners/Cleansing-Creams/Nivea-Daily-Essentials-Crème-Care-Cleansing-Cream-Wash-150ml/p/663507), currently on offer at £1.75 for 150 mL\n\nAqua, Isopropyl Palmitate, Glycerin, Paraffinum Liquidum, **Cetyl Alcohol**, Glyceryl Stearate Citrate, Methylpropanediol, Bis-Diglyceryl Polyacyladipate-2, Glyceryl Stearate, Panthenol, Cetyl Palmitate, **Lanolin Alcohol (Eucerit®) Octyldodecanol**, Decyl Glucoside, Sodium Carbomer, Phenoxyethanol, Methylparaben, Limonene, Linalool, Geraniol, Citronellol, BHT, **Parfum**\n\n[**Simply Pure Calming Cleanser**](https://www.superdrug.com/Simply-Pure/Simply-Pure-Calming-Cleanser-200ml/p/204286), £2.99 for 200 mL - this actually isn't rinse-off, but it is cheap and doesn't contain parfum\n\nAqua, Paraffinum Liquidum, **Cetearyl Alcohol**, **Cetyl Alcohol**, Ceteareth-20, Panthenol, Boswellia Serrata Gum, Dipropylene Glycol, Allantoin, Sodium Pca, Carbomer, Phenoxyethanol, Ethylhexylglycerin, Triethanolamine, Disodium Edta\n\nI have highlighted ingredients in each which stood out to me as \"maybe bad?\" - I'm new to ingredient interrogation so I don't know a huge deal, but I think denatured alcohol is generally considered more problematic than fatty alcohols (which I think are the ones I've highlighted) and also that fragrances can be a dealbreaker for some people, but not for all of us.\n\nIf anyone has any input on any of the other ingredients, or any other product recs, I'd love to hear your thoughts!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Kieran1845",
        "body": "I haven't heard before that Cocamidopropyl Betaine is bad thus far, I always assumed it's the better alternative to SLS/SLES based cleansers? Now I'm worried 😵 could you tell me more?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "shut-up-dana",
        "body": "I don't know much about it, but I've seen a couple of posts ~~around here and~~ [on the main SCA sub](https://www.reddit.com/r/SkincareAddiction/comments/1icdv4/for_those_of_you_with_persistent_chin_breakouts/) about avoiding it as an ingredient in toothpastes if you have persistent acne around the mouth. I think it's derived from coconut, so maybe it's similar to the way some people really struggle with coconut oil while others find it a miracle product?\n\nBut in my own experience looking for products that don't include it, I generally find that a product either contains cocamidopropyl betaine *and* SLS, or neither. I'm not seeing it often on its own so I don't think it's really being utilised as an alternative?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "shut-up-dana",
        "body": "Honestly I hadn't thought as far as looking for a specific better surfactant, I was just hoping to rule out SLS/CB as the problem with my CCs. I don't know enough about this stuff to really have a solid gameplan, there's so many factors at play :/",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "shut-up-dana",
        "body": "Oh I am so freaking stressed right now hahaha, but I can't do anything about that for a couple months so I was hoping to make some improvements with routine tweaks in the meantime. Maybe this is just my face for a while D:",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Kieran1845",
        "body": "Ah I see, I mean I know quite a lot of surfactants seem to come from coconut in one way or another which worries me but then other ingredients come from it too and I seem to be fine with it so I don't know, I mean I use the simple refreshing gel which is SLS free but has a cocamidopropyl base which I feel is so much less stripping and non acneogenic causing but I dunno, if not looking for a cocamidopropyl base then what surfactants are you thinking ? X",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Kieran1845",
        "body": "Ah, yeah cus I know what you mean about there being loads of having SLS and the CB but then now seems to be a more realisation that more people like SLS free stuff so seeing more CB which I had been looking for as I had seen it as being the better surfactant, and gotta remember there's other factors at play, hormones, stress, rest of your routine, I mean I know on holiday hadn't changed my routine at all and yet whole face was covered in CC's and still think that was due to it being so stressful 😵😂😭😭 but hope it clears up soon!",
        "score": 2,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 2,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "1c1ip57",
    "title": "Cocamidopropyl Betaine allergy ",
    "url": "https://www.reddit.com/r/eczema/comments/1c1ip57/cocamidopropyl_betaine_allergy/",
    "score": 9,
    "num_comments": 8,
    "created": "2024-04-11T15:59:17+00:00",
    "body": "I have recently learned through patch testing that I have an allergy to Cocamidopropyl Betaine. It was causing severe contact dermatitis on my eyelids.  I have been dealing with this for close to 10 years, so it was nice to have some answers. \n\nAnyway, this means that I can no longer use most hand soaps and will now have to bring my own wherever I go.  So I am wondering if anyone else has to do this and how do you deal with it? Right now I just have a chunk of bar soap in a baggie, but I'm wondering if there is a better way.  And any recommendations for soap?\n\nThanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Labbi85",
        "body": "I also have this allergy and one against propylene glycol which is in almost anything. \nI am using La Roche Lipikar body wash, which works well for me. So you could probably fill a body wash into a little travel bottle. \nI am usually taking wet wipes with me in my backpack to clean my hands.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Throwaway172892930",
        "body": "Would love recommendations for any other products you like as someone who also has a propylene glycol allergy! I am always told to doesn’t exist lol",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "FuzzyRodentNerd68",
        "body": "I have this as well as PG allergy. I use vanicream face wash for my hands. Cerave hydrating cleansing bar for body. Desert Essence tea tree shampoo. I also have sebderm but no more after tea tree.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "birdthings00",
        "body": "I use the SkinSAFE app, had this allergy and a few others with recommendations for la maison and 365 liquid hand soap by Whole Foods. I was able to out grow after years of avoiding it! Good luck",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "polkadotsci",
        "body": "Hand sanitizer is way easier to carry. Make sure you put lotion on after, though.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "starrynight179",
        "body": "I'm also allergic to cocamidopropyl betaine. I get dermatitis from it (and some other surfactants). I have zero issues with glucosides. I use The Ordinary glucoside foaming cleanser on my face, Now Baby lavender or fragrance-free gentle shampoo and wash on my hair. I can use most cleansers on my body and hands, fortunately. Some other brands that make products containing only glucosides are: Attitude, Baja Baby, Live Clean. You can also check the EWG website for glucoside cleansers by searching products containing decyl glucoside, coco glucoside, etc. Idk if you're allergic to glucosides, but it's worth trying.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Character_Location99",
        "body": "I had a similar issue where I would constantly have itchy rashes on my scalp, face, and in my ears. Eventually my eyes started swelling shut. Patch testing also indicated an allergy to CB. I've using Real Purity products for about 15 years now and although I still have the occasional itchy spot that requires use of Clobetasol (steroid foam) to 'right the ship', I at least no longer have eyes swelling shut. This is the product I use: [https://www.realpurity.com/products/nourishing-hair-repair-shampoo](https://www.realpurity.com/products/nourishing-hair-repair-shampoo)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 6,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "8oaaqn",
    "title": "Cocamidopropyl betaine allergy?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/8oaaqn/cocamidopropyl_betaine_allergy/",
    "score": 12,
    "num_comments": 6,
    "created": "2018-06-03T17:53:12+00:00",
    "body": "I'm struggling to find a shampoo that doesn't have this ingredient.\n\nThe only one I've found without it is very harsh on my hair.\n\nWhat shampoo\\(s\\) do other people with this allergy use?",
    "flair_text": "Product Question",
    "flair_template_id": "f0237a66-58bd-11e4-a1a9-12313b0e8234",
    "comments": [
      {
        "author": "Lolagoes18",
        "body": "I’m not sure if links are allowed here, but I react to everything and have been using this for about a month with no reaction. \n\nhttps://www.amazon.com/Vanicream-Clear-Shampoo-Sensitive-fragrance/dp/B0006FMK98#immersive-view_1528052446903",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "nowthatimfamous",
        "body": "I also have this allergy, and started using this shampoo! It's actually been really good for my hair. I have a lot less breakage, and I think my hair just looks way nicer. And also now I don't get swollen, puffy, blistery eyes anymore so that's neat.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "currypotnoodle",
        "body": "* 100% pure \n\n* Calia Natural\n\n* innersense\n\n* Desert Essence\n\n* Dr Bronners sugar soap\n\n* Sudsatorium",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Lolagoes18",
        "body": "You’re welcome, good luck!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "currypotnoodle",
        "body": "There are plants of natural shampoos without that ingredient. I'm not allergic to it but I avoid that ingredient",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 2,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "u3dym6",
    "title": "If my skin cannot take Cocamidopropyl Betaine, does it mean that I should avoid coconut derivates too?",
    "url": "https://www.reddit.com/r/Allergies/comments/u3dym6/if_my_skin_cannot_take_cocamidopropyl_betaine/",
    "score": 9,
    "num_comments": 3,
    "created": "2022-04-14T10:06:52+00:00",
    "body": "I haven't done any ingredients allergy test because in my city, there's nothing such except food allergy test. I just realized that I'm not just a person with acne-prone skin because I once developed contact dermatitis on and around my right armpit. The doctor suspected my new deodorant. Then recently, I've been feeling that the skin on my face is ANGRY. Like, it's not just acne, it's something else. It's red, dry, itchy, and new pimples keep appearing. It's painful.\n\nIt turns out that all the products my skin reacted too are:\n1. 3 different shower gels (2 have Cocamidopropyl Betaine, 1 contains lauric acid)\n2. 2 different facial gel cleansers (all have Cocamidopropyl Betaine)\n3. My current gel shampoo (contains Cocamidopropyl Betaine)\n4. My current gel-like serum (contains polysorbate-20 and Acrylate/C10-30 Alkyl Acrylate)\n5. My past roll-on gel deodorant (contains C12-15 Alkyl Benzoate)\n\nAll gels! Before diving into my real question, Do you think I wasn't really allergic to my past deodorant and was actually allergic to my shower gel instead? OR Is it possible that I'm also allergic to Acrylates that create the soft gel texture in personal care products? Because I am currently using a spray antiperspirant that also has Alumunium Chlorohydrate and I'm fine.\n\nAnd I think it's already clear that I'm allergic to Cocamidopropyl Betaine. My serum and 1 of my shower gel didn't contain it yet my skin becomes a sandpaper because of them. However, I heard that polysorbate-20 and lauric acid are coconut derivatives.\n\nSo, do you think I should avoid coconut derivatives too? I'm sorry for my long question. Thank you soooo much.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "bookwithoutpics",
        "body": "I'm allergic to cocoamidropropyl betaine, and for me that manifests as an eczema rash. From what I've read about it, the allergy might not be the CAPB itself, but rather a contaminant that's often a byproduct of the manufacturing process, which would make it different from an allergy to all coconut derivatives (although it's certainly possible to be allergic to more than one ingredient or type of ingredient, so I wouldn't rule it out). I'm not allergic to coconut or other coconut derivatives and many of the products I use include them. \n\nIt took me a while to figure out what was causing my reactions because I'd phase out one product but cocoamidropropyl betaine is so ubiquitous that it would be in other products I was still using. I'd phase out the hand soap but the dish soap or shampoo or body wash would still have me reacting. Once I figured it out it did take a week or two after eliminating it for the reaction to fully go away, although I noticed immediate improvement.\n\nI did have to make sure my partner phased out the ingredient as well, because touching his hair if he'd used shampoo with it would still be enough for the eczema to come back.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "bookwithoutpics",
        "body": "The Verb Reset clarifying shampoo and hair mask were what tipped me off that it was CAPB causing me problems, because I didn't react on the day I did my weekly clarifying/mask routine. (Note that some other Verb shampoos do have CAPB, just not this one.)\n\nFor everyday shampoo I like Desert Essence. I also tried NatureLab Tokyo, but that one doesn't work as well for my hair even though I'm not allergic to it.\n\nMrs. Meyers hand soap and dish soap don't have CAPB. They also have a body wash that I've tried, but bar soap is easier.\n\nIndie Lee Brightening Cleanser for a face wash.\n\nAnd I carry hand sanitizer so I don't have to use the soap in public restrooms (I'll wash with just water then sanitize after).\n\nEOS shaving cream.\n\nNot sure if any of those have cocoamide.\n\nOne other tip - if you live/sleep with a partner you may need to have them switch their products too. I had a few random reactions after switching products to residual face wash/shampoo in my partner's hair, and those reactions stopped as soon as he also switched to non-CAPB products.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "merelyinterested",
        "body": "can you share any of the products you use? Particularly shampoo/conditioner. I'm allergic to all coconut derivatives basically, and I really haven't been able to find anything without CAPB or cocamide.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "cleanbeauty",
    "post_id": "mfh4tt",
    "title": "Does anybody have a thorough understanding of Cocamidopropyl Betaine (a natural cleanser derived from coconut oil) and the fact that it might contain carcinogenic compounds? (It’s in most of my shampoos)",
    "url": "https://www.reddit.com/r/cleanbeauty/comments/mfh4tt/does_anybody_have_a_thorough_understanding_of/",
    "score": 7,
    "num_comments": 13,
    "created": "2021-03-29T03:53:41+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SailorSin77",
        "body": "I’d ask in r/HaircareScience :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LordVoldemoore",
        "body": "Thank you! Will do :)",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "One-Entrepreneur3624",
        "body": "Could you post the answer here? :)",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "Still sort of inconclusive really! I’m just limiting my use for now :)",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "One-Entrepreneur3624",
        "body": "I found this: http://chemicaloftheday.squarespace.com/todays-chemical/2013/8/12/cocamidopropyl-betaine.html\n\nIst says: „Because these chemicals are amines, they can, under certain conditions, create carcinogenic nitrosamines.  These nitrosamines not only can lace products, but can also form downstream, contaminating waste water with these carcinogens that are difficult to remove. However, to be fair, these nitrosamines are only formed when the product is heated to above 350 degrees, or when the pH is moderately acidic (3.5 or lower).“\n\nI think the pH of all shampoos and conditioners is above 3.5? So it should be safe?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "Would  shampoo get to/below 3.5 at any time during manufacturing though do you think? (Before it hits its final neutral pH!)",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "greenbeautytheory",
        "body": "Here is a great blog post that gives a little info on what it does in your products: [https://www.humblebeeandme.com/project/cocamidopropyl-betaine/](https://www.humblebeeandme.com/project/cocamidopropyl-betaine/)\n\nIn this situation, this ingredient is thought to contain impurities....that may be cancerous... however, not all sources may retain contamination...some brands may have done their own eval and etc... \n\nAlso, my rule of thumb is that rinse off products do not pose much of a hazard... so if you really like the cleanser that has it in there... I wouldn't worry to much",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "greenbeautytheory",
        "body": "Morrocco Method looks interesting! I ordered some samples!! What are you using from them? I love that the cleansing agent is Saponins. Flourish is another brand I have heard of that is super clean and gets good reviews",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "One-Entrepreneur3624",
        "body": "Oh, good question! I don‘t know :/ We have to ask a manufacturer I guess..",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "Thank you so much for linking all that information! :) I find my scalp seems to absorb things quite easily—at least I often get that phenomenon where I can “taste” what I’m putting on my head 😂\n\nI’ve switched to a more expensive shampoo (Morrocco Method), but if it doesn’t perform as well long-term, I might consider using my other shampoo every now and then!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "greenbeautytheory",
        "body": "Haha! Well, I was going to ask if it was a shampoo because in some sense that does change absorption. The hair shaft can easily absorb stuff. Sounds like a good plan tho to switch it up! Have you tried EvolvH? Or for the budget...Alaffia baby shampoo at target is super gentle and cleanses well. \n\nCheers!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "EvolvH still has cocamidopropyl betaine in there 😆 \n\nAlaffia doesn’t, though I’d probably look up Cocamidopropyl Hydroxysultaine, (and maybe Sodium Cocoyl lsethionate and Sodium Methyl Cocoyl Taurate) before I used it now that I know CB can be bad 😅\n\n‘Morrocco Method’ is probably the cleanest brand of shampoos I’ve ever seen in my life if you’re interested in checking out the ingredients! And there are four of them :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "I’m currently using the pine shale shampoo which I love! But I’ve also got the Earth Essence shampoo to try from them too! I’ve used the leave in Curl Power treatment, which definitely added moisture back in to my hair but made my roots a bit greasy, even after triple washing and rinsing with ACV like the instructions say 😂 I’ll probably just use it on my ends in future. Really good for fixing the dryness I had though.\nI have the Euro Oil to try too! I’ve just been using up an old elixir. \nI also bought the dry shampoo by them which is made up of soo many detoxifying ingredients!! You can make a mask out of it too apparently because it has the same ingredients as their detoxifying powder product. I’ll probably try it on Thursday!\n\nLiving Libations have a sea buckthorn shampoo that’s sooo popular and just as clean as MM, but the $/ml value is too expensive for me to consider buying at the moment!\n\nDo you happen to know anything about heat protectant that’s also clean? I read an article recently that that said you don’t actually need silicones for heat protection which really surprised me. I bought a silicone-free protectant from Bondi Boost but haven’t been brave enough to straighten my hair with it yet haha",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 13,
      "top_level": 2,
      "nested_replies": 11
    }
  },
  {
    "subreddit": "Blepharitis",
    "post_id": "pazkw0",
    "title": "Cocamidopropyl Betaine",
    "url": "https://www.reddit.com/r/Blepharitis/comments/pazkw0/cocamidopropyl_betaine/",
    "score": 7,
    "num_comments": 25,
    "created": "2021-08-25T00:01:14+00:00",
    "body": "I just learned I’m allergic to this substance, along with fragrance. I had blepharitis several months ago and Wet Ones, no makeup, and switching to daily contacts helped. Then I got eczema on my arms and legs and sought out patch testing. When I saw that eyelid issues were a symptom of this allergy I connected the dots. Now that I’m using only unscented Vanicream products on my hair/ body and use the Skin Safe app to make sure my makeup doesn’t have these ingredients, I can wear makeup again. Sharing in case this helps anyone since I know this condition is miserable and everyone wants to find their underlying cause, if there is one. If you can’t afford allergy testing or doc doesn’t recommend it, it can’t hurt to really strip down the substances that are coming in contact with your skin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "coffeeville",
        "body": "Damn, what are you using now instead? I did notice some “coca” ingredients and sometimes the shampoo burns my hands slightly but it’s so hard to tell if I’ll find anything less irritating or if it’s just irritated because I recently touched another allergen. (Also have allergies to rubber and some clothing dyes.)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Detroitar15",
        "body": "Did they patch test you for the substance? None of my allergist will patch test for any chemicals",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "coffeeville",
        "body": "Yes, they patch tested for like 120 substances! I don’t understand why an allergist would refuse that. Editing to add if you suspect a specific substance is a problem they said I could patch test myself on my arm, just put a little on there and cover it up for 3 days. It might not be as foolproof and I couldn’t really tell how big of a reaction they considered “truly allergic” vs “slight reaction” but it’s worth a try if you can’t get a full panel of tests done.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "coffeeville",
        "body": "My eye doctor didn’t have any ideas beyond what has been discussed on this sub (eyelid scrubs, switching to contacts for sensitive eyes, etc.) I went to a dermatologist since my skin had issues and they just wanted to give me steroids my PCP had already prescribed me. So I asked if they could try and get to the root of the problem and he said he’d refer me for patch testing. So you might start with your primary doc or a dermatologist and ask them to refer you for it. I haven’t seen an allergist specifically other than the doctors that did the patch test (I think technically they were also dermatologists) but I’m kind of interested to see one.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "I have similar symptoms! I took Benadryl but it didn’t do anything :( could it still be an allergy? What have you been trying to do to make the swelling go down? I’ve just been using lid wipes",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "Ahh I feeel you, my eyes are always puffy in the morning and looks like I’ve been crying too. Does the puffiness reduce throughout the day or stays the same? People on this sub also recommend using tea tree oil just in case it might be a dust mite problem!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "Hey, do you think maybe it has to do with some way that we’re sleeping? I noticed that if I sleep with my face on the side or partially facing down on my pillow, then the puffiness gets a lot worse when I wake up! So now I’ve been trying to sleep on my back more but it’s so hard :(",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "I tried sleeping on two pillows and I think it made the puffiness go down a little(?) but it definitely was not significant. I can’t tell if it’s something with my sheets/air or a chemical allergy but allergy test seems like the way to go! It’s just weird because I’ve stayed in my same room for the whole year and have been using the same products but it didn’t really become a problem until recently :/",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "Hey is it ok if we DM? I feel bad for always commenting on this thread hehe",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "super-panda-47",
        "body": "It says I’m unable to message your account :(",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Level_Ad_3544",
        "body": "Hi I’m dealing with the exact same thing. What has helped you?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Personal_Giraffe_934",
        "body": "once you discontinued cocamidopropyl Betaine how long did it take for your eye swelling to subside?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "coffeeville",
        "body": "A few weeks for my system to clear out. Since switching to only Vanicream soap/shampoo/body wash/ lotion/ hair gel/ whatever else they offer I’ve had no issues whatsoever. I can’t use their face specific lotion because it has niacinimide and I have sensitivity to that as well (not blepharitis but burning feeling on my skin.) I highly recommend trying this brand if you suspect you have a cocamidopropyl betaine allergy. I also use All Free and Clear detergent for laundry and wear disposable plastic gloves when washing dishes because of the dish soap and due to a rubber/ latex allergy.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Personal_Giraffe_934",
        "body": "Thank you so much for the feedback I will try this!!",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 1,
      "nested_replies": 13
    }
  },
  {
    "subreddit": "Actualshowerthoughts",
    "post_id": "3oe0em",
    "title": "Water (Aqua), Ammonium Lauryl Sulfate, Ammonium Laureth Sulfate, Cocamidopropyl Betaine, Cocamide MEA, Sodium Cocoyl Isethionate, Fragrance (Parfum), Sodium Methyl Cocoyl Taurate, Sodium Lauroamphoacetate, Ammonium Chloride, Guar Hydroxypropyltrimonium Chloride, Citric Acid, Propylene Glycol, Diprop",
    "url": "https://www.reddit.com/r/Actualshowerthoughts/comments/3oe0em/water_aqua_ammonium_lauryl_sulfate_ammonium/",
    "score": 7,
    "num_comments": 0,
    "created": "2015-10-11T23:43:34+00:00",
    "body": "ylene Glycol, DMDM Hydantoin, Tetrasodium EDTA, Bisamino PEG/PPG-41/3 Aminoethyl PG-Propyl Dimethicone, Quaternium-80, Phenethyl Benzoate, Butylphenyl Methylpropional, Sodium Xylenesulfonate, Limonene, Amyl Cinnamal, Linalool, PVP, VP/Methacrylamide/Vinyl Imidazole Copolymer, PEG-18 Glyceryl Oleate/Cocoate, Polyquaternium-7, Polysorbate 20, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Hydrolyzed Keratin, Hydrolyzed Silk, Soluble Collagen, Tocopheryl Acetate, Panthenol, Ascorbic Acid, Niacinamide, Biotin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dyshidrosis",
    "post_id": "w7t3az",
    "title": "cocamidopropyl betaine",
    "url": "https://www.reddit.com/r/Dyshidrosis/comments/w7t3az/cocamidopropyl_betaine/",
    "score": 6,
    "num_comments": 2,
    "created": "2022-07-25T16:18:16+00:00",
    "body": "Has anyone cut out cocamidopropyl betaine (found in things like toothpaste, shampoo, etc) and seen improvement?\n\nI switched to a toothpaste without this ingredient and my lips aren’t bumpy and dry anymore. I’m thinking this could be triggering the dyshidrosis on my hands.",
    "flair_text": "Possible trigger/cause ",
    "flair_template_id": "c0c142b0-2154-11eb-adff-0ead7a6e5301",
    "comments": [
      {
        "author": "Sufficient-Unit-5799",
        "body": "Yeah I’m working on getting a referral to do that but they’re all booked for months! I’m hoping this will help considering my lips got really bumpy almost like dyshidrosis but on my lips when I used crest toothpaste that had coco betaine",
        "score": 2,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 0,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "bx0ekn",
    "title": "Allergy to Cocamidopropyl Betaine(Foaming Agent)",
    "url": "https://www.reddit.com/r/eczema/comments/bx0ekn/allergy_to_cocamidopropyl_betainefoaming_agent/",
    "score": 6,
    "num_comments": 5,
    "created": "2019-06-05T08:54:53+00:00",
    "body": "I've just completed chemical patch testing and found the cause of my eczema, a foaming agent called Cocamidopropyl Betaine. Which seems to be in basically everything that foams (body wash, shampoo, etc) - it was even in my trusted QV!\n\nI'm just wondering if anyone else has had this allergy, and if so, what were you alternatives to standard body wash and hair care products? Thanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ImagineWhirldPeas888",
        "body": "HI, \n\nI suspect i have an allergy to this.... Cocamidopropyl betaine. Eczema affects my eyelids, neck and face.  I'm now on a year long wait list for testing (I live in Canada). My dermatologist gave me a list of safe products: \n\n&#x200B;\n\nHair Care  \nFree and Clear Shampoo & Conditioner    \n(Vanicream - available on [Amazon.ca](https://Amazon.ca)) \n\nSunscreen  \nCliniderm 45  \nAvene Light MIneral Lotion SPF 50+ or Mineral Lotion SPF 50+  \nAvene High Protection Tinted Compact SPF 50  \nLa Roche Posay Anthelios Mineral Lotion Face or Body SPF 50\n\nSunscree - acne prone skin  \nLa Roche Posay Anthelios XL Dry Touch SPD 60  \nVichy Ideal Soleil Dry Touch Lotion SPF 60  \n\n\nSunscreen -Chemical Blockers  \nLa Roche Posay Anthelios XL SPF 45, 60   \nOmbrelle SPF 45, 60  \nVichy XL SPF 45, 60  \nAvene High Protection SPF 50\n\nCleansers  \nDove for Sensitive Skin BAR  \nAveeno Moisturizing BAR  \n\n\nFacial Cleanser  \nDove for Sensitive Skin BAR  \nAveeno Moisturizing BAR  \nCetaphil Wash\n\nFacial Moisturizer  \nToleriane Ultra/Ultra Fluide (La Roche Posay)  \nCliniderm  \nCetaphil\n\nHand and Body Moisturizers  \n CreaVe CREAM  \nLipikar Baume AP + (La Roche Posay)  \nXeraCalm (Avene)\n\nHand Cream  \nCicaplast Mains (La RochePosay  \nCicalfate Hand (Avene)  \nNeutrogena Norwegian Formula   \nCetaphil barrier cream\n\n&#x200B;\n\nGood luck sufferers. I know how painful it can be.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "foxfayce",
        "body": "Have you looked into Free and Clear products? I believe their soaps, shampoos, and conditioners are betaine free. Vaniply/vanicream might be as well for moisture.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "chriswasmyboy",
        "body": "Im allergic to this too. About 5 or 10% of shampoos don't have it.  The Aubrey brand doesn't, Im pretty sure Burt's Bees doesn't either.  It's fairly easy to find soap bars without it.  I usually get my soap from Trader Joe's.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "crazynugget67",
        "body": "hi did u end up figuring out if this was the trigger?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "ImagineWhirldPeas888",
        "body": "Hi. I haven’t paid too much attention  to CB specifically. But nail polish is a major trigger for eye area, even if I use the toxic free stuff. Dairy is a big trigger. I should pay more attention to the CB stuff, but my skin has been quite good lately. \nAnything with fragrance is a major trigger , although it is for most people. \n\nThings that work for me:\nEat a wide variety of plant foods \ncreaVe cream\nNo dairy \nLimit brewers and bakers yeast -naturally ferment sourdough is ok\nAvoid yeast in general example kambocha drinks\nLimit or avoid eggs . I don’t buy eggs but if they are in baking it’s ok \n \nIt takes a lot of paying close attention to what your triggers might be, then avoiding it for a few months. If you really want to test it, then try it again and see how you react.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 3,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "u7bzv7",
    "title": "Has anyone tried powdered Cocamidopropyl Betaine (CAPB) before?",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/u7bzv7/has_anyone_tried_powdered_cocamidopropyl_betaine/",
    "score": 5,
    "num_comments": 2,
    "created": "2022-04-19T18:30:19+00:00",
    "body": "I'm very curious if anyone has tried Cocamidopropyl Betaine in powder form instead of its liquid form. And if so, if they have a recommended supplier for it? \n\nThe version of it I've seen is online and I haven't been able to find it from a supplier to try out for myself. I'm particularly interested in using it as a secondary surfactant (with SCI being the primary surfactant) in my dry formulations since it'd be a lot easier to incorporate as a dry powder than a liquid.\n\nEdit: words",
    "flair_text": "question - sourcing",
    "flair_template_id": "fc36a30c-dbeb-11ea-a899-0e6fafed8395",
    "comments": [
      {
        "author": "Ok_Act4491",
        "body": "I know this is an old thread, but I'm wondering if you ever found a source? I'm searching too.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FragranceFreeBeauty",
    "post_id": "1c8kblr",
    "title": "Cocamidopropyl Betaine and Amidoamine Allergy",
    "url": "https://www.reddit.com/r/FragranceFreeBeauty/comments/1c8kblr/cocamidopropyl_betaine_and_amidoamine_allergy/",
    "score": 6,
    "num_comments": 29,
    "created": "2024-04-20T07:45:40+00:00",
    "body": "Is anyone else here allergic or sensitive to cocamidopropyl betaine, and other amidoamines (chemicals with amido- in the first term and -amine in the second, like stearamidopropyl dimethylamine)? I feel like they are in literally EVERY single face or body cleanser, soap, and shampoo, and even some conditioners. Because despite being supposedly a common allergen and irritant, the whole sulfate free movement caused companies to jump to branding cocamidopropyl betaine as a gentle \"tear free\" cleanser/surfactant and now it's in everything. The only brand I know that avoids cocamidopropyl betaine altogether is Vanicream.\n\nIf anyone is also allergic or tends to avoid cocamidopropyl betaine, do you have any favorite products that don't contain it? They are just so hard to find. I end up just using things that contain it and then having to take five different types of antihistamines per day to control reactions, because it's in everything.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "raurra",
        "body": "Try the INCI decoder website at https://incidecoder.com its really helpful when you're trying to find products without specific ingredients.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "atschinkel",
        "body": "have you tried the clean kids naturally brand? i would not be able to live without their hair care products tbh https://gabrielcosmeticsinc.com/collections/clean-kids-naturally",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "CzeckeredBird",
        "body": "You could try some products with glucosides and other surfactants that are sulfate/amidoamine-free. I have tried Pipette baby shampoo/wash (the fragrance free one), Happy Cappy daily shampoo (but the medicated one has cocamidopropyl hydroxysultaine), Dermatica glycerin gel cleanser, As I Am shampoo/wash for babies and children, Mixed Chicks kids shampoo, and The Ordinary's glucosides cleanser. Oh, and for hand soap there is Attitude's unscented sensitive hand soap, and these very similar ones: the free and clear hand soaps by Seventh Generation and Everspring. I have a few more in my list to try, I'll comment them in a reply.  \n\nUpvote for the comment that INCI Decoder can help you find these products. You can enter your amidoamine-containing ingredients in the Must Not Contain list, that has helped me for years. I've also started using ChatGPT. But that's given me mixed results, sometimes suggesting products containing ingredients from my avoid list.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kerodon",
        "body": "Did you ever end up trying the niche lab urea face cleanser 👀?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "kerodon",
        "body": "Oh nooooo sorry most of them were a miss :( I didn't know 7th gen started making us ale products 👀 it does look decent.\n\n I've had my eye on a handful of stuff from ginger Lily in their Zeroderm line. I do hope they lather a little better though! Thanks for the update!",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "HimmelskeDanser",
        "body": "Thank you so much, I didn't know these tests were so detailed. Will ask my doc.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "I have never heard of that brand! Thank you so much for the recommendation!! I'm definitely going to have to try it!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "Thank you soo much!! This is amazingly helpful! I love Everspring's free and clear hand soap. I don't even miss the fragrance in their hand soaps, because for some reason, all their fragranced hand soaps smell terrible to me. I will try all of these! I didn't realize that INCI decoder could exclude things with amidoamine-containing ingredients! That's so helpful to know.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "CzeckeredBird",
        "body": "No, sorry not yet. But from that list I did try the Little Green bubble bath, that's gentle and didn't cause me itching. But not strong enough to remove buildup from sunscreen or seborrheic dermatitis I'm afraid. So I use it as a body wash.  \n\nThe Blueland hand soap unfortunately broke out my hands in hives. Which sucks because the box came with 3 tablets and I don't know what to do with them. Perhaps with enough water it can be converted to a multi-surface cleaner.  \n\nSo for hands I'm sticking with the Seventh Generation Free and Clear hand wash. Another non-irritating one I can recommend is Ginger Lily Farms Fragrance Free hand soap, but it takes a lot of effort to get it to lather.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "CzeckeredBird",
        "body": "From what I remember the Zero Derm and the Fragrance Free Conditioning have identical ingredients, so I'm hopeful the Zero Derm works out for you. The only difference I could find is the product description, Zero Derm said allergen free and safe for children to use. I suppose they could just have different concentrations of ingredients.  \n\nIn case you're interested, I've also tried the following CAPB-free hand washes:  \n\n-Rebel Green Unscented Hand Soap: this one's great. But I don't trust the label, every time I've bought it the ingredients list is different. Most recently, it was \"sulfate-free surfactant blend,\" which isn't good news for us CAPB-allergy sufferers 😞  \n\n-Mrs. Meyers Liquid Hand Soap: Lemon Verbena. I actually really enjoy the scent and bought the same in their multi-surface cleaner. Kinda drying on hands, so I wouldn't recommend for frequent hand washing. But it's in many stores, so it's a good fallback for emergencies. It comes out slippery like aloe vera gel, so you have to lather it/distribute it quickly before it falls out of your hands.  \n\n-Bath and Body Works Foaming Hand Soap (gifted to me, not my first choice due to the very strong fragrance): I think this brand is known for their fragrances, luckily they have many to choose from. But it seems gentle on my hands. Since it's a gift, I'll finish it but won't buy again.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "whatev2010",
        "body": "I also have an allergy to these things. Do you know if we can use a product if it contains essential oils?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "cdoogs13",
        "body": "I’ve found as far as skincare goes, Uncommon Beauty has been a godsend for me.  I use their face wash, which comes in a powder form, their pineapple peptide and their daily moisturizer.  I haven’t had an issue at all and my skin has never looked better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "DullWittedShitbird",
        "body": "Two weeks after a Pfizer BioNTech bivalent covid vaccine, I was brought to hospital in anaphylaxis. \n\n\nOver a period of 18 months in a health care system where I've been on a waitlist for a doctor for three years, I was on and off rash/angioedema/hives and there was no one to test me to find out why. \n\n\nI was using all the same stuff. \n\n\nI moved twice, gave up everything I owned twice, drove myself to the brink of poverty and homelessness and developed a full MCAS disorder as a result. \n\n\nI have to carry an EpiPen now. \n\n\n4 months ago I figured it out on my own. What I want to know is, who do I sue?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "HimmelskeDanser",
        "body": "How did you find out you are allergic to these specifically? I suspect I am, too, I found this thread when googling for specifics.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Character_Location99",
        "body": "This is what I've been using for about 12 years now: [https://www.realpurity.com/products/nourishing-hair-repair-shampoo](https://www.realpurity.com/products/nourishing-hair-repair-shampoo) To be honest, is does leave my hair feeling straw like and you have to use it twice in a row to get it to lather, but I condition really well and I'm happy my eyes are no longer swollen shut.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Technical-Pie-1802",
        "body": "I didn't know you could search for products WITHOUT specific ingredients in INCI decoder! Thank you SO much, wow!! Thanks so much for all these references, too!\n\nFor whatever reason, I've had severe allergic reactions to all of those shampoo bars you listed LOL. I don't know what it is about shampoo bars! But I haven't tried any of those other products so now I will!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "Of course!! I really hope you can get some specific answers!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "atschinkel",
        "body": "you’re so welcome. i hope you’re able to find some that work for you!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "CzeckeredBird",
        "body": "You're welcome!  \nFor INCI Decoder, actually you'd have to specify each ingredient. Luckily, it autocompletes with a drop-down list of matching suggestions as you type. So you can see others you weren't aware of yet. For example, I just typed \"amidopropyl\" and see in the drop-down many matches including \"Olivamidopropyl Betaine.\"",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "CzeckeredBird",
        "body": "Here are the others on my to-try list:  \nSkipper hand wash; Blueland hand soap, body wash, facial cleanser; Little Green bubble bath; New Dawn Organics shampoo/wash; Geek & Gorgeous Jelly Joker Cleanser; Niche Beauty Lab urea cleanser, Zitcalm cleanser, Zitclean cleanser; Malezia Hyaluronic Acid Cleanser; Bulk Apothecary Unscented Foaming Hand Soap Base.  \n\nI also remembered some more I've tried: Ceramedx's facial cleanser and body cleanser, Dr. Sam's Flawless Cleanser, Naturium Niacinamide Cleansing Gelée, TahNYC Gentle Everyday Cleanser, and Doctor Rogers Face Wash (note, the second time I bought this last one, I found mold inside after using it for a couple weeks or so. I suspect the less-than-ideal preservative they use is the problem).  \n\nHope you find some products you like! :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "I forgot about Cleure!! Thank you for reminding me. I really didn't like their leave-in conditioner, but I think I need to try their other products. I was meaning to try some of their other products, but somehow I forgot they existed so thanks!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "So that would depend on what you are allergic to! I can't use anything that contains essential oils, or fragrant plant extracts or I get severe allergic reactions. If you have fragrance allergies, which are super common, you shouldn't use things with essential oils. Even if you don't have actual allergies to fragrance, the fragrant compounds in essential oils can irritate your skin and cause contact dermatitis. They are skin sensitizing ingredients, so you can develop an allergy to them the more you're exposed to them. I personally don't think skincare products should contain essential oils, and I don't use anything that contains them! I've been safer that way. If you are able to get allergy testing done, they can tell you what specific fragrance ingredients you are allergic to, and that way maybe you can get away with using certain essential oils, and just avoiding the ones you are allergic to",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "Thank you for the recommendation! It looks like although their products don't contain fragrance outright, they do contain cocamidopropyl betaine and fragrant essential oils, unfortunately",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "I am so sorry!! The healthcare system has so much blood on its hands. It’s absolutely horrific that Covid causes MCAS, and the Covid vaccine (although to a lesser extent, I’m sure) sounds like it can, too. I hate everything to do with Covid and I’m so sorry. I have a mast cell disorder called chronic spontaneous urticaria with angioedema that I’ve had since I was a toddler, but I’ve been diagnosed with everything including Munchausen’s because of it. I also carry an epi pen! And my symptoms, which were relatively under control before with a combination of daily antihistamines, got much worse after I had Covid. I’m on a biologic now, too, but still constantly have itching/hives/rashes/angioedema. My little cousin developed MCAS after having Covid, too. \n\nAnd maybe I have MCAS, and not just a mast cell disorder, but doctors are still treating it like it’s rare even though it no longer is. \n\nI hate this so much! And I believe you that you had a negative reaction to the bivalent covid vaccine that resulted in MCAS. I definitely don’t agree with anti vaxxers that every disorder that has increased in prevalence since the pandemic began is a result of covid vaccines (when it’s much more likely that these conditions are brought about by the covid virus itself, and there is lots of evidence to support this.) But I’ve had adverse vaccine reactions before (not to any covid vaccines, though.) And I know quite a few people whose chronic illnesses were worsened by vaccines. I think we all just need to acknowledge that while vaccines play their part in preventing disease and are safe for the most part, people do have real and devastating adverse reactions! This is one reason I fully support wearing masks to prevent the spread of Covid (in addition to vaccines.) I still wear a mask in public, because I can’t take any more mast cell dysfunction and don’t think I could handle more chronic illnesses than I already have.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "DullWittedShitbird",
        "body": "I suspect there are human phenotypes whose already overfunctioning immune systems were kicked into overdrive by the mRNAs.\n\n\nBut I contend that if these adverse reactions are so rare, then it shouldn't be prohibitively costly to compensate us for now having to live in a bubble.\n\n\nThe fact that the pharmas continue to gaslight and lawyer up suggest to me that these issues are more widespread than is being admitted.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "I got allergy testing (specifically, patch testing) done by an allergist! I have a condition called chronic idiopathic urticaria with angioedema that causes random allergic reactions all the time. But testing for specific allergens has helped so much in avoiding skincare products that cause severe allergic reactions or make my eczema flare. They can tell you what you're allergic to, what you're sensitive to versus actually allergic, and how severe your reactions to each thing are, so you know what to avoid. If you have skin reactions like contact dermatitis, hives, or even eczema it can be very helpful.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Technical-Pie-1802",
        "body": "Thank you so much!! I need to try this. People don't understand how amazing it is to find something that doesn't make your eyes swell shut. I really hope one day we have better options that don't leave us to choose between our hair feeling like straw and allergic reactions",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "MausInYourHaus",
        "body": "The Bioderma Sensibio gel cleanser is betaine and amidoamine free. The pink bottle. It’s my safety gentlest cleanser go to.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 28,
      "top_level": 9,
      "nested_replies": 19
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "fget7n",
    "title": "[Routine Help] allergic to cocamidopropyl betaine and would love some advice!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/fget7n/routine_help_allergic_to_cocamidopropyl_betaine/",
    "score": 5,
    "num_comments": 15,
    "created": "2020-03-10T14:39:25+00:00",
    "body": "As you can guess from the title I found out that I have an allergy to the foaming part (Cocamidopropyl betaine) of a lot of skincare products but also toothpaste, mascara and some moisturizers. I’ve always had a hard time finding cleansers for my skin and at a certain point my face started swelling up so I went to get an allergy test. \n\nI’m having problems finding a skincare routine now and was wondering if anyone has some tips for me. My (32f) skin is pretty sensitive, a bit dry, some blackheads and some acne. \n\nMy current routine is:\n\nAM: TO marine hyaluronics, TO moisturizer (doesn’t seem to moisturize enough for me though), LRP Anthelios spf 50+\n\nPM: Lois Widmer micellar cleansing lotion, prescription tretinoid cream 0.025 (3x a week), TO moisturizer \n\nI also switched my shampoo to a shampoo bar from Lush but still get very slight irritation/eczema. So if anyone has a suggestion for a shampoo that would also be great!",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "CORNANDBEANS69",
        "body": "i’m also allergic! as well as to coco glucoside, which makes finding cleansers very difficult. i use the olay gentle skin oil free face wash. it doesn’t break me out at all and doesn’t have fragrance. it is very gentle.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "CORNANDBEANS69",
        "body": "as far as skin care i use cerave lotion, and it seems to be alright but i am trying to look for other options. i just worry about irritating my skin. but for shampoo, i have curly hair and i use suave clarifying shampoo weekly. it might be a bit drying if used daily! i believe shea moisture has options as well if you have curls too.",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "Dforce7",
        "body": "I can relate. My scalp became quite inflamed. I went to a really good dermatologist specialized in allergies. He did a patch testing for 60+ things and found out I’m severely allergic to Cocamidopropyl betaine (CAPB). \nThen I realized almost all shampoos use CAPB. \n\nMost baby shampoos are CAPB-free but don’t wash adult hair well. Unfortunately, most kids shampoos have CAPB and the only exception is L’Oréal kids shampoo. \n\nA couple of adult shampoo products to try:\n\nNEEM & REETHA ULTRA NOURISHING SHAMPOO by Ayurvita - this is my favorite right now. \n\nHairSulphate 4% Cleanser for Body and Hair by The Ordinary - this is scent-free\n\nTo calm the inflamed scalp:\nTarsum shampoo is another great product but doesn’t smell great so I use it only when I’m having an allergic reaction in my scalp (sometimes stress induced dermatitis as opposed to contact dermatitis to CAPB). Tarsum will calm things down immediately after single use and after a few days I go back to one of the above CAPB-Free shampoos. \n\nAs far as body wash, Dr. Bronner's Pure-Castile Hemp is the best I’ve found. \n\nGood luck and please share what works for you. I’m looking to try new CAPB-free products",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "pitiful_cherry",
        "body": "Hey sorry for the late reply! I did a patch test at the dermatologist",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "pitiful_cherry",
        "body": "I will try it out thanks!! Do you have any other products you recommend? And have you been able to find a good shampoo?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/fg80os/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "rxhols1521",
        "body": "I am allergic to this also (and possibly all it’s related synthetic compounds) so here is what I use: \n\nMy reaction to cocamidopropyl betaine was breakouts on my face and neck from using shampoo with it in there. So I’m having to be very strict on what shampoo and face products I use especially. \n\nBody wash: cetaphil pro restoraderm smoothing wash (does have cocamide mea in it) but this product does not irritate my skin. \n\nShampoo and conditioner: still working on this one. Currently using free and clear but honestly, it’s awful. Leaves you with a dry scalp and build up. Ordering Lush shampoo and conditioner today. I’ve been researching all kinds of brands.. but am nervous to order anything with coconut in it. \n\nHair care: it’s a 10 silk express miracle silk leave in \n\nFace: \nCetaphil gentle skin cleansing cloths\n\nMoisturizer for face and body: Pam’s back to nature at www.pamsbacktonature.com. The “soft as butter face moisturizer” is amazing! It’s actually the best face product I’ve used in a long time. Also, the “whipped creams hand and body lotion” is also great. \n\nI hope this helps a little bit!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "rxhols1521",
        "body": "Yes!! Lush products- specifically the Fairly Traded Honey Shampoo. It’s amazing and no coco stuff in it! I also use their Power conditioner (conditioners are safer, they don’t have the coco ingredient we are allergic to in them!) :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Junny_B_Jones",
        "body": "What body wash do you use?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "rxhols1521",
        "body": "I use stuff from lush- I am sure there is something without coco in it. I don’t have a particular one, but I search their products to find one since they have hair products without it in there.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Junny_B_Jones",
        "body": "I tried looking online but they all have that or something similar, I’ll go in person to check it out, thanks! :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Quiet-Yoghurt-3187",
        "body": "Hey I I'm allergic to that to and a whole bunch of other I use this app called ACDScamp it's basically an app where you can put things in that you're alerting to and then you can look stuff up or scan stuff and it tells you if you're allergic to it so then you don't always have to read the back of stuff. It also gives you things that you're not allergic to and things that you are allergic to. Though you have to get a code from The place that did the test to find out you're allergic to whatever you were allergic to.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SmokeSsignals",
        "body": "Did you just take a food allergy test to find this out or a different kind of allergy test?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SmokeSsignals",
        "body": "Thank you! What did the derm use to patch test? Sorry I’m just super curious because I’ve never heard of this before!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "pitiful_cherry",
        "body": "No problem! It was new for me too :) it’s been a while since they did it. They put certain products and ingredients in dots on my back and put a big clear sheet over it to see how my skin would react. I’m not sure anymore but I think I had to wear it for 3 days and wasn’t allowed to shower that part. When they removed the sheet they could see where my skin reacted to the ingredients. And basically almost everything I was using was causing allergic reactions so it makes sense my face just started to become swollen all the time. They saw that my skin reacted to this specific ingredient in three different locations.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 6,
      "nested_replies": 9
    }
  },
  {
    "subreddit": "VeganBeauty",
    "post_id": "b13353",
    "title": "Looking for a gentle shampoo with cocamidopropyl betaine as one of the first ingredients",
    "url": "https://www.reddit.com/r/VeganBeauty/comments/b13353/looking_for_a_gentle_shampoo_with_cocamidopropyl/",
    "score": 4,
    "num_comments": 5,
    "created": "2019-03-14T17:23:44+00:00",
    "body": "Does anyone here have a recommendation for a gentle, daily shampoo with cocamidopropyl betaine as one of the first ingredients? Something budget-friendly would be ideal. Thanks!!",
    "flair_text": "[Hair Care]",
    "flair_template_id": "a82ad418-e44e-11e3-86b7-12313d18e464",
    "comments": [
      {
        "author": "Bobloblaw878",
        "body": "Not sure why you'd want to use that.  Is it for an experiment?  I'm not being sarcastic but that stuff is about as bad as sulfates to use on your skin.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "hcgc",
        "body": "Thanks for the advice! I wasn’t aware that anything other than sulfates or cocamidopropyl betaine has the capability to remove silicones. The only silicone I tolerate in my products is amodimethicone, since I’ve heard that it’s easier to wash out than dimethicone and doesn’t build up as much. I don’t know if I see myself ever going totally silicone free though, as I flat iron my hair regularly and haven’t heard of any non-silicones that are actually capable of protecting your hair from higher temperatures. \n\nOff the top of your head, do you know of any ingredients that would serve as a good replacement for cocamidopropyl betaine, for their ability to deal with silicones?",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "hcgc",
        "body": "I’ve heard that it’s one of the gentler cleansing agents that can actually remove amodimethicone (which is in some of the products I use). Am I wrong on this?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Bobloblaw878",
        "body": "Ahh, well I don't know about hair protectants.  I know the shampoos above should be able to deal with your run of the mill silicones but other than that sorry.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Bobloblaw878",
        "body": "It's not technically a sulfate but it's sulfate adjacent.  It \\*might\\* be gentler.  It might be better to try a completely sulfate free shampoo - I've heard good things about Shea Moisture and True Botanicals, I've used JR Liggets (meh) and right now I'm using the ACV Herbal Shampoo Bar from Amazon(excellent).  These are gentler shampoos and should be able to deal with silicones.  You might not need the silicones after using them for a few months though, your hair will be healthier.  :-)",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 1,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1xn4w1",
    "title": "Cocamidopropyl betaine - does it always mean 'foaming'?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1xn4w1/cocamidopropyl_betaine_does_it_always_mean_foaming/",
    "score": 9,
    "num_comments": 6,
    "created": "2014-02-11T20:26:12+00:00",
    "body": "I was reading [this post](http://www.gh0stparties.com/2014/02/skincare-on-trial-2-cleanser-additions.html#.UvqFS_l_tdw) on the gh0stparties blog and came across this ingredient in a cleanser she speaks about. She mentions the [Sunday Riley Ceramic Slip Cleanser](http://uk.spacenk.com/ceramic-slip-cleanser/MUS300023213.html) and how foamy it is, and it reminded me of a post Caroline Hirons wrote in which she mentions she uses it but that [it doesn't foam](http://www.carolinehirons.com/2013/01/new-year-skincare-daily-beauty-am.html) and that the website description is wrong. \n\n\nI know she's very dismissive of foaming cleansers in general, and while I definitely don't take her word as gospel (I find there's a big emphasis on high-end stuff and a lot of anecdotal evidence) it got me curious about the ingredient. \n\n\nSo, does this always mean 'foaming'? 'Hydrophilic Thickener' also came up when I was searching on Cosdna but I'm a bit confused as to what that actually means. I Googled but the results are a bit too technical for my understanding after a long day!\n\nEdited for formatting.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ISwearImAGirl",
        "body": "I find cocoa betaine to produce a very very thick foam.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "sharpic",
        "body": "[Here](http://swiftcraftymonkey.blogspot.com/2010/04/surfactants-betaines.html) is an article giving an overview on CAPB. Stick with it past the first two technical paragraphs for the more practical, layman description of its uses and properties.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mysteries1984",
        "body": "Thanks, seems to be the overriding opinion.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "mysteries1984",
        "body": "Thank you!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "mysteries1984",
        "body": "Thanks, this was interesting and didn't show up in my search. I'll bookmark it for future as it looks like she has some more stuff I might be interested in.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 2,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "mfrwxb",
    "title": "Does anybody have a thorough understanding of Cocamidopropyl Betaine (a natural cleanser derived from coconut oil) and the fact that it might contain carcinogenic compounds? (It’s in most of my shampoos)",
    "url": "https://www.reddit.com/r/HaircareScience/comments/mfrwxb/does_anybody_have_a_thorough_understanding_of/",
    "score": 4,
    "num_comments": 9,
    "created": "2021-03-29T15:22:36+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SleepyQueer",
        "body": "So, I don't know what website is making this claim, but I'm automatically a little suspicious based on the Proposition 65 reference. Proposition 65 is a law in California that's notorious for being so incredibly cautious in its risk assessment that it winds up labelling essentially everything as potentially harmful, and thus becomes basically useless.   \n\n\nJust as an example, I bought a jar of \"all-natural\" (which I put in quotes because I kind of hate the term \"natural\", at least the way it's often used) bentonite clay a while ago. Like it's... pretty much dirt, got dug out of the ground somewhere, right? Well it's got a Proposition 65 label on it because clay (like basically all dirt, and basically the entire environment) has naturally-occurring traces of heavy metals and other potentially harmful substances. Which.... ok, I guess it's cool that I know that now. But putting warnings on products that just.... literally provide baseline environmental exposure to hazardous substances, because it's impossible to avoid all hazardous substances, isn't helpful. There's no magical alternative \"clean\" clay that you could even use. This is why Proposition 65 has been accused of being over-used and becoming meaningless. So whenever I see any kind of \"clean\" brand trying to drum up controversy over an ingredient and they only cite Prop 65, it's a bit of a red flag for me.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "snickerdoodledoooo",
        "body": "There are safe amounts to use of certain ingredients in hair care products and it wouldn’t benefit the company to put more in than is safe :) fda says [normal exposure ](https://www.fda.gov/drugs/drug-safety-and-availability/information-about-nitrosamine-impurities-medications) to nitrosamines are totally safe.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "LordVoldemoore",
        "body": "Haha, yeah, I got the lead warning on some bentonite clay too!! I suppose you might be able to have too much clay if you were using it to detox heavily? 🤷🏻‍♀️\n\nI am a bit concerned about the nitrosamines. I emailed one of the brands I use and they were pretty vague and said “we use well below the safe limit of cocamidopropyl betaine so it’s safe”, even though it was listed as the second ingredient after water lol. I’ve seen a (way more expensive) brand advertise the fact that they AVOID CB, so I’m wondering if nitrosamines are a well-known contaminant that I’ve been ignorant to!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "TheUnnecessaryLetter",
        "body": "I live in California and this prop 65 warning is everywhere and we basically just ignore it. I’ve seen it on kids toys, coffee, balsamic vinegar, literally _Disneyland_. It’s so broad that it’s useless.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ladygayblues",
        "body": "So I looked up a safety data sheet of cocomidopropyl betaine from making cosmetics (which supplies individual ingredients) which says in the toxicological information section:\n\n> Not listed as carcinogenic (IARC, NTP, & OSHA)\n\nhttps://www.makingcosmetics.com/msds/sds-cocamidopropyl-betaine.pdf\n\nIt's usage rate is safely up to 40% (although this ingredient is by this supplier and possibly others 70% water), so it can be the second ingredient in a product without necessarily being used in unsafe amounts. Hope that helps.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ChapterEight",
        "body": "People have also received clothing shipped from California with the proposition 65 warning label on them! seems excessive (I wish I could source this but I remember reading about it years ago)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "Thank you for that :)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "LordVoldemoore",
        "body": "I wasn’t so much concerned about it on its own being carcinogenic, just that it could be known to be contaminated by nitrosamines (I’m not sure when in the process it would be contaminated though!)\n\nThank you so much for linking that though, I’ll have a read!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Liliko-i",
        "body": "That is a synthetic form and can be very drying. Look only for the natural form from beets,  “Betaine” or “Natural Betaine” as ingredient, it is very good for shine and maintaining healthy hair shafts.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 4,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "5fdub9",
    "title": "[Routine Help] Dry skin and Keratosis Pilaris : my experience with SLS, cocamidopropyl betaine, Dr Bronner’s liquid Castille soap and soap bars.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/5fdub9/routine_help_dry_skin_and_keratosis_pilaris_my/",
    "score": 7,
    "num_comments": 1,
    "created": "2016-11-28T20:00:12+00:00",
    "body": "Hi,\nI’m trying to find a very ultra gentle body wash for my skin that is as moisturizing as my most successful attemps (the LiveClean Argan Oil body wash with CB), but without some problems I had (acne on my shoulders, Keratosis pilaris that developed on my forearms). I’m also somewhat interested in DIY/natural/zero waste, but in an intelligent way. \n\nBody wash History :\n\nI’ve made the most of my life until around 23 years old by cleaning my body and face with the most cheap milk & honey laureth sulfate soap in the store (they even sold it in dollar stores), and I had a very soft skin and not much completions, a zit here and there. I had absolutely no interest in skincare and was really minimalist, so only body/face wash without anything else. Then, at around 23, I developed super hyper dry skin and had to change it. \n\nI was in the no-SLS fad at that time with my shampoo, so I picked a body cleanser of the same brand (the LiveClean Argan Oil body wash) without SLS that in organic, filled with beneficial oils for the skin and based on cocamidopropyl betaine (Ingredients here : http://imgur.com/a/0p6P0 ). It was absolutely fantastic for my skin. I used it for two years, even on my face, and it made moisturizing optional. On the other hand, I developed keratosis pilaris on my forearms, had some zits here and there on my shoulders, and began to have some cystic acne problems on my face. I since changed to  a face cleanser on my face (Effaclar, then Marcelle Vitamin-C), but my cystic acnea seems to be hormonal. I took Epiduo last year and it worked fine, but I have a recrudescence now. \n\nAround that time I shortly used an almond oil soap bar (I think it was from «Le Petit Olivier» for my body, and it was also a really good choice for my skin. No squeaky or residus, no dryness. I returned to my Liveclean cleanser after my roommate stolen and finished my bar soap, and I couln’t find it again in pharmacies. \n\nRecently I decided to try Dr Bronner’s liquid castile soap, even as I knew about saponification process and read about the drying effect of it, since my roommate as severe eczema and is very content with hers. As I expected, it was as drying or even worse than my old cheap SLS product, I am feeling «squeaky clean» when using it and starded to see again patch of dried flacky skin on my legs. But, surprisingly, my keratosis pilaris almost disappeared in only 4 days. I had not that result with the almond oil soap bar. I also seems to have less zits on my shoulders, but I didn’t pay enough attention to be sure. \n\nMoisturiser:\n\nI usually don’t put any moisturiser since two years, except for my hands that need some heavy duty shea or hemp butter (The Body shop) in the winter. I used to apply this butter on my legs too before, when I was about to make the transition from SLS to the Live clean soap. \nIn my face I use the Earth Sourced from Paula’s Choice occasionally since 1 year, as I transitioned from my body wash to a face cleanser (Effaclar, then the Marcelle Vitamin-C), but I didn’t need it when I was using the argan oil body wash on my face. \n\nI don’t use anything else on my body as part of my routine. \n\nDo you think there's a way to dilute my Dr Bronner soap to make it more moisturizing and keeping it low on the irritating additives? I saw some interesting recipes that dilute it with almond or jojoba oil and raw honey : does it make some sense or is it another sketchy Pinterest recipe? I'm trying to make some balance between my desire to have a more minimalist and organic list of ingredients in my skincare products, and plain common sense. is there some brands that are more on the minimalist and natural side, but also with a good result on sensitive and seasonal combination skin?\n\nThanks!\n",
    "flair_text": "Routine Help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Complete_Ad6522",
        "body": "This has exactly been my experience. I developed kp when I switched to gentle cleanser, not just on my body, but also my face. Years of visiting dermatologists who asked me to use glycolic regularly to exfoliate. Worked for a while especially in hot weather, in winter my skin couldn’t handle the regular glycolic application. I also found my skin getting dry and itchy and bumpy when using gentle cleansers.long story short over the last few years the Kp on my face got worse. My bf at the time, now husband swears by Nivea cream soap , he showered with it. I would use my gentle body cleanser as recommended by my dermatologist. One day I ran out and decided to use his soap, especially cause he raves about it and refuses to use anything else. Nivea cream soap is like a Castile soap made of plant oils and lanolin. No detergents , just natural saponification to make the soap. I used it on my body for a couple of days and started noticing that my skin was peeling, so I used my shower glove to gently rub the dead skin away. Couple of weeks later mu eczema and kp gone, completely!! It was insane! Years of struggle gone in weeks. I searched Reddit to see if anyone had a similar experience and just found u. I am gonna switch my face cleanser to the soap and see ig it clears the kp on my cheeks. I feel brave enough to do it now. But yes , Castile soap had worked on my body, completely cleared the kp . I don’t like moisturising, I am one of those ppl who hates the way it feels on my skin. So I moisturise my legs only once in a while, but I have realised using silicone free moisturiser on wet skin is a game changer. Something about the feel of silicone I can’t stand. Long story short Castile soap has been the only thing that cleared my body and it’s cheap and cheerful. Hoping it will work it’s magic on my face too.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Perioral_Dermatitis_",
    "post_id": "1jzm85i",
    "title": "where I could get cocamidopropyl betaine and sls free shampoo and toothpaste?",
    "url": "https://www.reddit.com/r/Perioral_Dermatitis_/comments/1jzm85i/where_i_could_get_cocamidopropyl_betaine_and_sls/",
    "score": 6,
    "num_comments": 3,
    "created": "2025-04-15T07:52:33+00:00",
    "body": "Hi guys, I’ve posted on here previously about getting sore pimples only on my jawline. Well, after scrolling through several threads and some self reflection, I think it could be my toothpaste and/or shampoo. Specifically, because my shampoo contains both cocamidopropyl betaine and sls and my toothpaste contains just cocamidopropyl betaine. The reason I think these could be my culprit is when I wear my hair down, it touches the areas of my chin where I’m getting spots, and I sometimes get bumps on my hairline and upper back AFTER showering. So, my question to you lovely folk is, do you know where I could get cocamidopropyl betaine and sls free shampoo and toothpaste? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "bird-plane-superman",
        "body": "I have a coco betaine allergy. Lots of trial and error led me to the below which I have been using for about a year or more:\n\nToothpaste - fluoride, SLS, Coco betaine free: David's toothpaste https://a.co/d/6YMgrZ0\n\nShampoo - cheaper fragrance free option: vanicream. Does a better job than most SLS free options but I missed my shampoo having a nice fragrance\n\nShampoo - Pricey but feels/smells so much nicer (but still very subtle) and is the only \"normal\" shampoo I've found that is coco betaine free https://www.randco.com/products/dallas-biotin-thickening-shampoo",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "babybottlepopz",
        "body": "I use squiggle brand toothpaste. It’s SO hard to find coca betaine free products. I’m also allergic.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Thank you for posting on this sub. For more information on PD, you can check the helpful guide pinned at the top. You can also search the sub by typing the relevant keywords in the search bar\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Perioral_Dermatitis_) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FancyFollicles",
    "post_id": "2rsveh",
    "title": "Cocamidopropyl betaine",
    "url": "https://www.reddit.com/r/FancyFollicles/comments/2rsveh/cocamidopropyl_betaine/",
    "score": 2,
    "num_comments": 5,
    "created": "2015-01-09T00:11:21+00:00",
    "body": "Hi all!\n\nI've just had a skin test done and discovered I was allergic to coco betaine which unfortunately is in almost every shampoo. I'm really unsure of where to go from here so if anyone has any suggestions or experience of products without this ingredient that work for them it would be great!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Prettyundead",
        "body": "Look into co-washing. It will be a bit of a search for you to find shampoos, even cleansing conditioners, without that ingredient but if you transition to using strictly just conditioner to cleanse this will eliminate that need. Try doing more research in /r/curlyhair and /r/nopoo. \n\nI've been co-washing for over a year now and it is the best!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ruansa",
        "body": "Thanks so much for responding! I bought a shampoo and conditioner by pantene and am going to give them a try but if that fails I will definitely give co washing a try! I have medium thick, bleached, long, straight, sometimes oily hair so I don't know if it will be for me but it seems worth a try!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "VaughnJess",
        "body": "You can put product names into [Cosdna](http://cosdna.com/) and it will tell you the ingredients. You can also put the ingredient in the Ingredients tab and it comes up with a short list of products containing it, but I think you have to make an account to see the full list.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ruansa",
        "body": "Thanks so much this is a life saver!!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "mopers",
        "body": "I suspect I am allergic to coco betaine as well. I had two tests done at an allergist today (negative except for cats and dogs!) and am going back for a patch test in Feb. Yes, it's in many shampoos, but there are lots of shampoos without it, and they use other coconut-derived ingredients instead. If you cannot use any other coconut-derived ingredients either, the options get limited.\n\nThe vast majority of shampoos and conditioners contain coco betaine, including the ones that are sulfate-free, natural, organic, etc. There are a few that do not, plus a few methods of cleaning your hair that might work, which I'll list. If you're allergic to coconut-derived ingredients, you'll have to check the following carefully because some products are made with coconut oil, palm, or babassu, even when they're labeled as, for example, \"olive oil soap\".\n\n* Olive oil-based liquid shampoos and shampoo bars: I bought the Chagrin Valley Olive Oil & Babassu shampoo bar, though I haven't tried it yet. I assume there are also palm and babassu-based shampoos out there, too, but I haven't paid much attention.\n* I recently discovered [Eucerin Dermo Capillaire Calming Urea Shampoo ](http://www.amazon.com/Eucerin-Dermo-Capillaire-Calming-Shampoo/dp/B009P0V9UQ) has sulfates but doesn't have coco betaine, so it can be used to remove silicones from hair if you need. There are no other shampoos I've found that has sulfates but no coco betaine.\n* I tried [Clean Kids Naturally Shampoo](http://gabrielcosmeticsinc.com/shop/clean-kids-naturally-shampoo/). I thought it gave me acne but I might have been wrong. They also have a [hand soap](http://gabrielcosmeticsinc.com/shop/clean-kids-naturally-germ-busting-soap/).\n* I found [California Baby \nSuper Sensitive \nShampoo & Bodywash](http://www.californiababy.com/super-sensitive-shampoo-bodywash-8-5-oz.html) through Google recently (I think an allergy clinic somewhere recommended it). I haven't tried it.\n* [Face Naturals](https://facenaturals.com/product-category/body/organic-hair-care_1_2_3/organic-shampoos/) sells shampoos and other products with coconut but without coco betaine. They have an excellent (sourced) page about how coco betaine is an irritant and contact allergen.\n* Commercial dry shampoos haven't contained coco betaine, in my experience (because it lathers?). However, I've found that they tend to contain products that build up in hair. I was using Suave Professionals Dry Shampoo until I discovered it was causing me acne and contained silicones and silica! Bleh!\n* Arrowroot or cornstarch dry shampoo might work for you. I had planned on trying arrowroot after giving up on the cornstarch, but I just got tired of it all. Right now, I'm just doing water-only on my hair and it's going surprisingly well.\n* You can try making your own shampoo.\n\n* I do not co-wash because I haven't found a conditioner without coco betaine.\n* [Jane Carter Nourish & Shine](http://www.janecartersolution.com/Nourish-Shine-4oz.html) I have used as a leave-in conditioner a couple of times, but I wasn't sure if it was giving me acne and greasy hair so I stopped. It smells *amazing* and the problems were probably due to the Suave dry shampoo or my current laundry detergent, so I've kept it and will probably try it again in the future.\n\nOther names for coco betaine are Tegobetaine L7, Cocoyl amide propyldimethyl glycine, coconut oil amidopropyl betaine, N-cocamidopropyl-N, N-dimethlglycine hydroxide inner salt, and lauramidopropyl betaine. I saw yesterday in Sephora that Bumble and Bumble listed lauramidopropyl betaine in their ingredients :/\n\nAnd I know you didn't ask this, but remember to check your toothpaste and other products!!! Awhile back, I switched from Sensodyne (contains coco betaine) to [Hello](http://hello-products.com) (contains SLS) and it fixed so much stuff in my mouth!!\n\nedit: fixing a link",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 3,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "1ju3u7h",
    "title": "Cocamidopropyl Betaine Allergy",
    "url": "https://www.reddit.com/r/Allergies/comments/1ju3u7h/cocamidopropyl_betaine_allergy/",
    "score": 3,
    "num_comments": 7,
    "created": "2025-04-08T03:07:57+00:00",
    "body": "\nI have a very extreme cocamidopropyl betaine allergy and am also irritated by many coconut derivatives so I have done my best to cut out coconut from my routine. I struggled most to find a shampoo and conditioner and after a long search ended up finding “the ordinary” sulfate 4% cleanser for body and hair and the behentrimonium chloride 2% conditioner. The shampoo does not really sud and definitely takes some getting used to but it works and the conditioner is absolutely amazing. I have noticed my hair get much healthier since using these to that’s an extra plus. As far as soap I only use ivory bar soap. This does not have cocamidopropyl betaine in it but might have some coconut derivatives, it works for me might not work for you (open to any suggestions you may have for soap). I also only use soap on the areas I really need it. I have stopped using soap on my arms and legs and my skin has improved so much. For lotion I use CeraVe and the Working Hands body lotion. I also use Vaseline for breakout spots and lip balm. For checking products like makeup, hair care, and more I have found the SkinSAFE app to be extremely helpful. Just scan the barcode on products and it will show you what is and isn’t in the ingredients, if it is coconut free it will show something saying “COC FREE”. While I am still trying to figure out exactly what works for me this routine has helped my allergy breakouts immensely. Remember to keep it simple, when I first found my allergy I was using way too many products and cutting it down to just the basics also made a big difference for my skin. This allergy can be so frustrating and isolating and it can become really hard to remember that recovery and healing is possible. Keep pushing. ",
    "flair_text": "Advice",
    "flair_template_id": "53163732-7c85-11e3-be08-12313d224170",
    "comments": [
      {
        "author": "rvauofrsol",
        "body": "I love Vanicream products because they're free of Cocamidopropyl Betaine *and* BDS-friendly.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Rich_Hat6811",
        "body": "I’ll give them a shot! Thank you!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "wtfihavetonamemyself",
        "body": "Also have to avoid CB. Vanicream shampoo is great. \nBody soaps I currently a bar callled man bar. Previously used a cerave one, but wasn’t getting me clean enough. Tip I found, for supplementing sensitive skin body soaps that don’t do enough, I keep a small container of baking soda in the shower. That’s safe to put on skin and I get it a little wet, and put in frequent smelly areas. Let it sit while I clean others then wash with the soap too. \nNot sure of coconut content of all the above but thought it might help. \nI haven’t found anything besides Vanicream that’s safe for me ( I have to avoid plant oils too).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "KismaiAesthetics",
        "body": "I too am sensitized to betaine and use The Ordinary and Vanicream shampoos, but I’ve recently added the CeraVe dandruff shampoo and dandruff 2:1 in the mix.  I’m shocked how well I like them and how well they lather.  I especially like that I can get away with the 2:1 at the gym even with shoulder-length wavy-to-curly hair.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "KismaiAesthetics",
        "body": "TO shampoo is *really* dilute for an SLES formula.  I end up using a *lot* to get it to lather, or repeating, just to get to a little residual foam.   Foam isn’t necessary for a shampoo to work, but if it’s absolutely not foaming it means there’s still available oil after all the detergency has been used up.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Rich_Hat6811",
        "body": "I will try out the baking soda tip! Thank you for sharing your experience. Hoping for healing friend.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Rich_Hat6811",
        "body": "Thank you for this! I love the ordinary shampoo for the reason that it doesn’t make me break out but really have trouble getting my hair fully clean after a good workout. I will try the CeraVe!",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 3,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "1dcp5yi",
    "title": "Is there any shampoo without cocamidopropyl Betaine?",
    "url": "https://www.reddit.com/r/SebDerm/comments/1dcp5yi/is_there_any_shampoo_without_cocamidopropyl/",
    "score": 3,
    "num_comments": 12,
    "created": "2024-06-10T16:04:48+00:00",
    "body": "I think I possibly react to this ingredient because I break out even if said shampoo is “sebderm safe”, do you know of any shampoo without it? ",
    "flair_text": "Product Question",
    "flair_template_id": "9010acb6-e88b-11ea-b1b9-0ef3bc6b5891",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "pitathegreat",
        "body": "I’m allergic to CAPB too. I feel your pain. \n\nFree and Clear has been my default for years. The Ordinary shampoo is CAPB free, but I’m not sure about its status for sebderm. \n\nYou can try a variety of shampoo bars. CAPB is generally used in liquid soaps, not bars. It’ll take a lot of digging to find something seb-derm safe though.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Problematicen",
        "body": "I can’t find the shampoo in Sweden/europe or it’s really expensive unfortunately. :( but thank you! \n\nI am pondering on trying the eucerin urea schampoo but it’s not safe. It has 1-2 esters in it.\n\nI also read that the ordinarys schampoo is very drying, my hair is really dry and my scalp is producing so so so much oil.🙃 At this point I might aswell contact a business and collaborate on creating my own brand… but might be an option to try out anyway 🤔",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "pitathegreat",
        "body": "Can you get Pantene? Their 3 minute miracle is an awesome conditioner that is strong enough to offset the TO’s shampoo and is seb-derm safe.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Problematicen",
        "body": "Nope, only Pantene repair or classic is available. It sucks. ☹️",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "godolphinarabian",
        "body": "Use this search: https://incidecoder.com/search/product?query=Shampoo&exclude=Cocamidopropyl+Betaine\n\nMario Badescu shampoos have sulfates but not betaine",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Problematicen",
        "body": "Can’t get ahold of Mario’s shampoos. They seem good though!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Odd_Election1833",
        "body": "Try lush cosmetics shampoo bars. My favorites are soak & float and montalbano! Also olaplex, nizoral, AG care apple cider vinegar",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "First_Distance2095",
        "body": "I'd be SUPER cautious about Olaplex. It wrecked my hair (plus 17,000+ women and counting in the Facebook group I'm in) and gave me sores across my neck. And it wasn't some dupe bought off Amazon; I've only ever bought straight from Olaplex's website.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "eyeke1",
        "body": "Have you found anything? I found out this past week that I’m allergic to cocamidopropyl betaine and I’m also living in Europe, so I struggle to find a shampoo that doesn’t have this ingredient and can actually be shipped in my country 🥲",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Problematicen",
        "body": "Eucerin Urea Calming shampoo, bought it from Amazon. It contains 2 esters though that could potentially feed Malassezia. I don’t react on it luckily, but get oily scalp so fast… not entirely happy but it’s the best option I have tried so far.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 5,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "16udnli",
    "title": "[Routine Help] I'm allergic to \"Cocamidopropyl Betaine\", can I use products with \"Betaine\"?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/16udnli/routine_help_im_allergic_to_cocamidopropyl/",
    "score": 3,
    "num_comments": 2,
    "created": "2023-09-28T11:39:10+00:00",
    "body": "My skin has been sensitized (for titling purposes, it's just easier to say allergic lol) by cocamidopropyl betaine and I get contact dermatitis from it. I want to try some skincare products, but they contain \"Betaine\". I've heard that they're entirely different things, but I just need a lil confirmation from you guys🥺👉👈",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "dubberpuck",
        "body": "You can buy some betaine and patch test it. It's an edible supplement. It's normally sold by it's other name, Trimethylglycine. \n\nIf you find that it works fine but want to finish the product, if you bought the powder version, you can add some to your cleansing product when cleansing as a humectant. It has a slightly hydrating and soothing effect. Do store it in a dry location as it's very water absorbent.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "1jzm6p1",
    "title": "cocamidopropyl betaine and sls free shampoo and toothpaste",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/1jzm6p1/cocamidopropyl_betaine_and_sls_free_shampoo_and/",
    "score": 3,
    "num_comments": 3,
    "created": "2025-04-15T07:49:39+00:00",
    "body": "Hi guys, I’ve posted on here previously about getting sore pimples only on my jawline. Well, after scrolling through several threads and some self reflection, I think it could be my toothpaste and/or shampoo. Specifically, because my shampoo contains both cocamidopropyl betaine and sls and my toothpaste contains just cocamidopropyl betaine. The reason I think these could be my culprit is when I wear my hair down, it touches the areas of my chin where I’m getting spots, and I sometimes get bumps on my hairline and upper back AFTER showering. So, my question to you lovely folk is, do you know where I could get cocamidopropyl betaine and sls free shampoo and toothpaste? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "veglove",
        "body": "Not sure about shampoo, but I use the Lavera whitening toothpaste and it doesn't have either of those ingredients. Some of their toothpastes are flouride-free but not all, so just check the label to see if it has flouride, depending on your preference.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "veglove",
        "body": "The Ordinary's shampoo doesn't have cocamidopropyl betaine.\n\nI find [incidecoder.com](http://incidecoder.com) really helpful to find products with or without a specific ingredient.  Here's a search for you to use: [https://incidecoder.com/search/product?query=shampoo&exclude=Cocamidopropyl+Betaine](https://incidecoder.com/search/product?query=shampoo&exclude=Cocamidopropyl+Betaine)\n\nJust keep in mind that not all of these products are readily available in Europe, and that companies will change their formulas from time to time, so what's in this database may not accurately reflect the latest version of the formula.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Awkward-Noise-6348",
        "body": "Ahhh this is brilliant thank you!!",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 2,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "nkojll",
    "title": "Cocamidopropyl betaine",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/nkojll/cocamidopropyl_betaine/",
    "score": 3,
    "num_comments": 8,
    "created": "2021-05-25T12:28:06+00:00",
    "body": "I am looking for a face cleanser without this ingredient. I have a scalp allergy to this ingredient and as I’ve been going through products to avoid I’ve realised that Balea Med cleanser has it. \n\nIt’s probably why my face feels somewhat tight after using it, even though it’s not supposed to. \n\nThen I’ve checked LRP Toleriane cleanser and it also contains it. Does anyone know any other sensitive skin cleanser? Help!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ygreenb",
        "body": "The balea med cleansing milk doesnt have this Ingredient only the gel. I like the milk a lot.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ygreenb",
        "body": "Ah i answered the wrong i post it here to.\n\nI have acne prone skin too, most gels strip to much of my oils away. I use this cleanser since a year. In the morning i mixed it with a little bit from the facetheory clarifying cleanser, in the Evening i use it one time with sunscreen, two times when wearing make up. I have never broke out from it or found that it make anything worse. It also contains a little bit niacianamide which is nice. I always want to try new cleansers but i havent found something that i like so much and is so affordable. I prefer to use my skincare money for serums or creams haha",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Lululu5",
        "body": "Sounds great! I’ll check it out",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "exactreplica",
        "body": "Just checked my Clinique Take The Day Off Balm (I get here in France or in the US); it doesn’t have it. I also love Beauty Pie’s Japanfusion Pure Transforming Cleanser; it doesn’t have it either. Edit: Forgot to check my The Body Shop Aloe Cream Cleanser; it’s okay too.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Lululu5",
        "body": "Thank you! I’ll check them out",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Lululu5",
        "body": "Thanks! Do you think it’s suitable for acne prone skin? I’m always more concerned about milk formulations breaking me out",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 2,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "atn7aw",
    "title": "Looking for a conditioner/co-wash with either cetrimonium chloride or cocamidopropyl betaine high up in the ingredients list",
    "url": "https://www.reddit.com/r/curlyhair/comments/atn7aw/looking_for_a_conditionercowash_with_either/",
    "score": 3,
    "num_comments": 12,
    "created": "2019-02-22T21:36:40+00:00",
    "body": "No coconut oil or shea butter either please (these two ingredients always seem to be too heavy for my hair). I'm searching around for a conditioner/co-wash/cleansing conditioner that has either cetrimonium chloride or cocamidopropyl betaine high up in the ingredients list, as these seem to be the two most popular mild cleansing agents that can remove silicones (if not completely, then at least mostly). Any suggestions would be much appreciated! ",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "IncrediblePlatypus",
        "body": "Now you have made me sad because I'm from Europe too and can't get it.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Fyriia",
        "body": "Now, [this](https://www.sheamoisture.com/coconut-cactus-water-head-in-the-clouds-conditioner.html) does have shea butter but it's supposed to be very lightweight and cetrimonium chloride is right up there. You could always add a few drops of sulfate free shampoo to make it a bit more cleansing. \n\nWish I had access to it here from Europe, I've been eyeing that new (?) line.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Fyriia",
        "body": "Haha, sorry. I always get sad on here cause we have so few choices..\n\nLooking for a hard hold gel right now and there's just nothing I can find. :/",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "IncrediblePlatypus",
        "body": "Some of the ecco styler gels get hard, especially the pink one iirc. And they're available everywhere.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Fyriia",
        "body": "Damn you must live in a better area for cg products than me, there's no Ecco styler here. \n\nI actually just got the pink one off Amazon and used it for the first time today but no proper cast even though I used more than I normally do.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "IncrediblePlatypus",
        "body": "Well, I do get it via amazon too but its my native amazon so I count that as available ¯\\\\\\_(ツ)\\_/¯\n\n  \n\n\nWeird. I tend to get a cast from them unless I move a lot while my hair dries.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Fyriia",
        "body": "Fair enough.\n\nI didn't move much but when I applied it to my hair I immediately felt like something was off with the way the gel felt on my hair, so there's a chance it reacted badly with my leave in conditioner or something.\n\nBtw, maybe you could find some more local online shop that carries Shea Moisture products. There's some around me but with a very limited selection (not much more than Amazon), but maybe there's some specialty shop.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "IncrediblePlatypus",
        "body": "We have two online shops Afaik that are specially for curls and they're just as expensive as amazon with about the same stuff, sadly. I can get most shea moisture if I'm willing to shell out the money but new things always take a while to hit amazon around here.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "hcgc",
        "body": "This looks awesome! Not finding it on amazon, but maybe my local drugstore carries it.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "hcgc",
        "body": "Seems like the line is so new, it isn't offered on amazon yet - haven't had much luck finding it at my local drugstore either. Hopefully I can track it down or find something else that's similar!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Fyriia",
        "body": "what do you think of a sulfate free shampoo that has a silicone removing ingredient in the top 3? Shea Moisture has a whole bunch of those.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Fyriia",
        "body": "Actually, I did some research. They also have [this](https://www.sheamoisture.com/marshmallow-root-blueberries-kids-2-in-1-drama-free-shampoo-conditioner.html) 2 in 1 conditioner for kids, [these](https://www.sheamoisture.com/maracuja-shea-butter-smokey-manhattan-4in1-all-over-wash.html) slightly questionable all in one washes from the men's line and the [manuka honey & yoghurt conditioner](https://www.sheamoisture.com/manuka-honey-yogurt-hydrate-repair-conditioner-hydrate-repair.html) which all more or less fit the description.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 12,
      "top_level": 1,
      "nested_replies": 11
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "13xy72h",
    "title": "Cocamidopropyl betaine, oral lichen planus and shampoo: my odd journey + a request for more shampoo suggestions",
    "url": "https://www.reddit.com/r/Allergies/comments/13xy72h/cocamidopropyl_betaine_oral_lichen_planus_and/",
    "score": 3,
    "num_comments": 11,
    "created": "2023-06-02T00:30:01+00:00",
    "body": "Six months or so ago I was reading posts in an effort to figure out why the 'natural' shampoos I've always used for my sensitive scalp would work for a few days then trigger my eczema. I've been ultra careful to steer clear of SLS, parabens, etc etc for years, it made no sense to me.\n\n I happened to stumble on a post about cocamidopropyl betaine and my brain promptly exploded. I ran to my bathroom and read the ingredient list on all 6 bottles sitting in my shower - all 6 had CAPB listed in the top 4 ingredients. Leaving the bathroom, I saw my toothpaste and just stared at it for a minute. There...listed as number six, was the same ingredient.\n\nI was tentatively diagnosed with OLP in the summer of 2021 by my oral medicine doc - I have lacy white patches on my outer gums and inner cheeks which is the result of peeling skin. She sent a biopsy to the pathologist asking for a differential between OLP, MMP, or an allergy, and the pathologist said \"Yes\". The doc leans more towards an allergy, and after switching to a CAPB free toothpaste, I've seen some significant improvement with my gums!\n\nAnd! because I am always a little extra, I decided that maybe it's not just a CAPB allergy but a coconut allergy and went on the hunt for coco-free products. These are the products I found, it's by no means a definitive list but I hope it helps. Note: I am an every day washer and likely won't change, it's my preference. Some of these products may not work well for daily washing and it's not a knock to the product, it just doesn't work for me, so I am still on the hunt for my holy grail. Here is what I've tried so far and in order:\n\n* Clean Kids Naturally Tropical Orange Burst - Was really hopeful this was going to be the answer for me as it did not contain any coconut, but sadly my scalp still felt irritated and inflamed after using the third time. Taking a closer look, I think I may be sensitive to jojoba as well. Smelled amazing.\n* Chagrin Valley Olive Oil and Babassu bar - Eczema wise, this bar was pretty good until I realized it was leaving behind a very thick, waxy type residue. My scalp irritation went completely away but I did still have some minute patches above my ears. For the residue, it seems like this might be a common complaint as there are instructions on the site about how to use/getting used to a shampoo bar. I did all the recommended things: rinsed \\*extremely\\* well, used an ACV rinse, brush through my hair while rinsing but after a month it still felt like build up so I stopped using.\n* Exederm Exczema Care Daily Shampoo - definitely helped reduced any scalp inflammation and the spots above my ears healed up. However, it has a very chemical, man made smell and it made my hair feel very flat and sad.\n* Puracy Daily Shampoo - I wondered if I went overboard with the \"if I'm allergic to CAPB, maybe I\"m allergic to all things coconut\" so I tried this. Nope, my instinct was right - this made my scalp hurt as soon as I started washing my hair. \n* Alodia Nourish & Heal Black Soap Wash - A little went a long way, and again this poo did a good job until I noticed it too started to leave behind a residue. \n* Pectolite Harmony Shampoo - having learned my lesson, I bought a trial size and used all of it. The smell is interesting, you can smell the fermented quality to it. I plan to buy another trial size once I run out of the Ayurvita I've been using. I remember having some minimal spots above my ears but none of the intense itching I would have prior to this journey.\n* Ayurvita Ultra Nourishing Shampoo with Neem & Reetha - has a really nice spice smell and is only slightly irritating to the spots above my ears. I've consistently used this shampoo the most with the exception of the Exederm. Still not 100% perfect.\n\nBest thing about all of this experimentation I've done - I don't lose even 1/4 of the hair I used to. My hair is past my shoulders, almost to my bra line. I've always brushed/combed through my hair in the shower with conditioner and thought that the amount of hair that would come away in the brush was normal. Even dry, my hair was constantly shedding and every where. Now, I have a ton of regrowth  coming in and I haven't had a clogged drain in 6 months. \n\nIf you have any suggestions for coconut free shampoo/conditioner that aren't listed here, I'd love to hear about them so I can add to my list to try.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Crystalneko23",
        "body": "My sis is using a shea butter shampoo from body shop because that's all she could find for shampoo where we are that's coconut free. We literally have to sit there and read labels while shopping to make sure no food or soaps for her have ANY coconut.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Dforce7",
        "body": "I have a severe allergy to CAPB. \nMost baby shampoos are CAPB-free but don’t wash adult hair well. Unfortunately, most kids shampoos have CAPB and the only exception is L’Oréal kids shampoo. \nTarsum shampoo is another great product but doesn’t smell great so I use it only when I’m having an allergic reaction in my scalp (sometimes stress induced dermatitis as opposed to contact dermatitis to CAPB). Tarsum will calm things down immediately after single use. \n\nAs far as body wash, Dr. Bronner's Pure-Castile Hemp is the best thing ever. \n\nGood luck and please share what works for you. I’m looking to try new CAPB-free products",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Rhymes_with_Demon",
        "body": "Ive heard this but am not sure how to test the theory.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Rhymes_with_Demon",
        "body": "Thank you, I'll give them a try",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Intelbunny",
        "body": "Have you tried any Vanicream items? They have lotions, shampoos, conditioner ect.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Rhymes_with_Demon",
        "body": "I haven't yet. I've been hesitant since it's heavily coconut based but it would be worth a try.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Intelbunny",
        "body": "Sorry just went and read my shampoo and you are correct please don't try it",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "bookwithoutpics",
        "body": "I also have an allergy to CAPB, but not to coconut. Just an fyi, most allergies to CAPB aren't to the CAPB itself but a contaminant/byproduct that's produced in the refinement process.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "rpoem",
        "body": "Just learned today that I have this allergy too, which is odd to me, because I've been having the reaction on my face and neck, but have used a body wash for years that has CAPB in it and haven't had the reaction on the rest of my body. This makes me thinks that I am reaction to the contaminant/byproduct that is especially strong in a shampoo I was using, but not to the CAPB itself in the body wash.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "quiseangel",
        "body": "I also have an an aggressive CAPB allergy, among many others like fragrance. I use the SkinSafe App and found The Ordinary Sulphate 4% Shampoo to be best for me. \n\nhttps://theordinary.com/en-us/4-sulphate-cleanser-for-body-and-hair-shampoo-100399.html?dwvar_100399_size=240ml&quantity=1&gclid=CjwKCAjwqZSlBhBwEiwAfoZUIK2-Lam8t6GGv89ZI2b5C_K85K9xX2DqujxE0PxhtW2-1Yz5K--7sxoCJ1cQAvD_BwE&gclsrc=aw.ds",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 10,
      "top_level": 5,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "Soap",
    "post_id": "1i30qfe",
    "title": "Problems making bar with Cocamidopropyl Betaine",
    "url": "https://www.reddit.com/r/Soap/comments/1i30qfe/problems_making_bar_with_cocamidopropyl_betaine/",
    "score": 3,
    "num_comments": 6,
    "created": "2025-01-16T22:06:35+00:00",
    "body": "Hi All,\nI've delved into soap making for the first time and am loving the process at the moment. But I'm a bit disheartened with the progress so far. I'm trying to make an all natural (or as natural as possible) \"soap\" bar with Cocamidopropyl Betaine as the surfactant as I don't want to use sodium hydroxide. However, I have 2 issues:\n\n- The bar is soft (it hardens a bit when in the fridge, but when it comes out, it starts to melt)\n- I tried using it in the shower, and it doesn't foam/lather\n\nAny ideas? Here is the recipe I am using:\n\nQuantity for 150g\n\n\t\t- Beeswax pellets: 3 tsp\n\t\t\n\t\t- Coconut oil: 6 tsp\n\t\t- Shea butter: 3 tsp\n\t\t- Aloe vera butter: 2 tsp\n\t\t- Neem oil: ½ tsp\n\t\t- Honey: 1 tsp\n\t\t\n\t\t- Natural vegetable glycerin: 2 tsp\n\t\t- Water (distilled): 3 tsp\n\t\t- Cocamidopropyl Betaine: 3 tsp\n\t\t- Apple cider vinegar: ¼ tsp\n\t\t- Fresh lemon juice: ¼ tsp\n\t\t- Olive oil: 3 tsp\n\t\t\n\t\t- Oats (finely ground): 1 tsp\n\t\t- Pyrithione Zinc powder: ¼ tsp\n\t\t- Turmeric powder: ¼ tsp\n\t\t\n\t\t- Tea Tree Oil: 10 drops\n\t\t- Peppermint oil: 5 drops\n\t\t- Eucalyptus oil: 5 drops\n\t\t- Lavender oil: 10 drops",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SoaperPro",
        "body": "CAPB is not a substitute for sodium hydroxide, It’s a surfactant additive. There is no substitute for lye in soap making. Also, lye is still natural today as modern manufacturing processes it by electrolysis of salt and water. The reason why your soap melts is because it’s not saponified as it’s missing the emulsification of lye with the oil.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "SoaperPro",
        "body": "If made properly, a bar of soap contains no sodium hydroxide, which is why a proper INCI ingredient list will not list sodium hydroxide but the saponified names of the ingredients that react with it. A properly formulated bar will not strip all the oils from the skin. This Sanex product is not soap, as shower gels aren’t required to have soap as an ingredient. They only require a surfactant and preservatives. Shower gels are not as natural as soap in general. You can make shower gel with CAPB, but not soap.\n\nEdit: to avoid confusion, I meant that a properly made bar of soap contains no *remaining* lye. \nNothing else can substitute lye in soap making; not beeswax, or anything. I’d recommend trying a soap bar with 5-8% superfat. I had horrible skin conditions before I got into soap making. No medical grade soap or gel helped.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "storm4077",
        "body": "Can I make a shower gel solid bar with without soap?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "redheadedfruitcake",
        "body": "You can look into making syndet (synthetic detergent) bars. Not my thing so I don't know specifics. I'm sure there are you tube videos out there.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Gullible-Pilot-3994",
        "body": "CAPB won’t offer a hard bar no matter what. SCI noodles are used in syndet bars. \n\nI’ve had several people, men and women tell me that my bar soap has made their skin happy after years of using body wash making their skin unhappy. Bar soap has been used for centuries. \n\nPersonally, I’ll break out in hives using anything containing coconut oil or derived from coconut products.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "storm4077",
        "body": "My understanding is that sodium hydroxide strips the skin of oils, and my doctor told me not to use sodium hydroxide and use CAPB products instead (like Sanex 0% sensitive skin shower gel).\n\nIs there another way I can saponify/emulsify with a natural ingredient? Would this not work with beeswax?",
        "score": -1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 3,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "1feuqkd",
    "title": "Is Cocamidopropyl betaine (CAPB) a good substitute for LUMOROL K 5229?",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/1feuqkd/is_cocamidopropyl_betaine_capb_a_good_substitute/",
    "score": 2,
    "num_comments": 8,
    "created": "2024-09-12T05:05:46+00:00",
    "body": "Has anyone used some alternative for Lumorol K 5229? I tried cetyl Glucoside as a substitute but it created a cloudy color when mixed with my oil mixture, btw I am making a foaming shower oil just like L'Occitane's almond shower oil. I saw on YouTube that mixing lumorol makes a clear consistency, however, I cannot source lumorol in my country. Is there any good substitute for lumorol or any oil based surfactant that I can use? I really appreciate any help you can provide.",
    "flair_text": "question - sourcing",
    "flair_template_id": "fc36a30c-dbeb-11ea-a899-0e6fafed8395",
    "comments": [
      {
        "author": "ScullyNess",
        "body": "Absolutely not.  K-5229  doesn't have a substitute available on the diy market.  It's a very unique emulsifier.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ScullyNess",
        "body": "Not for what your looking to create dupe wise, you need k-5529 for that specific formula. I'm sorry I didn't have anything I can recommend other than that to make the l'occtaine dupe.   Hundreds of surfactants interact with oils but what you're looking to achieve is a very particular thing and lumerol is the best thing you can get for it.  Anything else that can support that high of a rate of oil is going to end up most likely cloudy and also creating something that's closer to a lotion when rinsed with water.  Most surfactants used for shampoo etc would fail to be cleansing with that higher rate of oil in the formula.  I'm sorry but the answer isn't changing to your question.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ScullyNess",
        "body": "Nope.  Different chemical and won't emulsify with oil in the same manner.  There really is no substitution for k 5229 that's available for diy. They'd have to pay to have it shipped to them in international mail if possible. Basf is just a co-surfactant meant for a standard oil in water emulsion for shampoo/body wash.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Consistent_One_9595",
        "body": "🙁 do you recommend any surfactant that mixes well with oil?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "kriebelrui",
        "body": "Which country you live in?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Strega_7965",
        "body": "Right now there is no substitute for Lumorol available for general purchase. There is no water based surfactant that will mix with oils that will give you the same result, as Lumorol is an anhydrous product.  If you live in the US, there’s only one supplier.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Consistent_One_9595",
        "body": "Thank you for your comment. I will stop looking for Lumorol for now, Is there any other anhydrous product I can use? I now don't care about the same result as Lumorol, I just want to have a surfactant that mixes well with my oil mixture.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "kriebelrui",
        "body": "Maybe Plantapon sf (BASF)?",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 3,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "Healthyhooha",
    "post_id": "1j6yf9p",
    "title": "Cocamidopropyl betaine (CAPB) allergy",
    "url": "https://www.reddit.com/r/Healthyhooha/comments/1j6yf9p/cocamidopropyl_betaine_capb_allergy/",
    "score": 2,
    "num_comments": 0,
    "created": "2025-03-09T03:17:45+00:00",
    "body": "I was wondering if anyone else has a skin allergy to cocamidopropyl betaine? It's in many personal care products like shampoos, liquid body wash and soaps. For a while I had really itchy skin or dermatitis which had developed after using Radox shower gel. Previously I was able to use any body wash. I tried so many sensitive skin body washes, feminine washes and also Dove soap but it still gave me itchy skin and an itchy vulva. Until I came across a sensitive skin soap that said it was cocamidopropyl betaine free and gave it a try and I was happy my skin didn't feel itchy anymore. I learnt that most bars of soaps don't contain cocamidopropyl betaine except for Dove soap but most liquid body washes do contain it. ",
    "flair_text": "Hygiene 🧼",
    "flair_template_id": "82d272ce-848b-11e9-a4d0-0eb4eb7f9102",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "6998rk",
    "title": "[product question] Cocamidopropyl betaine & SLS free toothpaste in the UK?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/6998rk/product_question_cocamidopropyl_betaine_sls_free/",
    "score": 2,
    "num_comments": 0,
    "created": "2017-05-04T18:13:35+00:00",
    "body": "Hey guys,\nI switched to an SLS free toothpaste (Sensodyne Pronamel) a few weeks ago but I still get my only breakouts in the mouth/chin area. I replaced my toothbrush today (maybe I still have leftover gunk in the toothbrush?) but I'm not too hopeful. Does anyone know where to buy toothpaste that's both SLS and cocamidopropyl betaine free in the UK?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "1f3a1oi",
    "title": "cocamidopropyl betaine substitute",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/1f3a1oi/cocamidopropyl_betaine_substitute/",
    "score": 2,
    "num_comments": 5,
    "created": "2024-08-28T13:21:42+00:00",
    "body": "Hi, I have an extreme sensitivity to cocamidopropyl betaine (probably the betaine part). I've been making shampoo bars for fine hair with Plantapon TF instead of CAPB, but discovered yesterday that it has been discontinued. Does anybody have any experience or opinions regarding Sodium laurylglucosides hydroxypropylsulfonate as a possible replacement? \n\nThis is my current formula:\n\nSodium cocoyl isethionate (SCI) Powder (32%)  \nPlantapon TF (18%)  \nSodium Lauryl Sulfoacetate (SLSa) (35%)  \nSodium lactate (5%)  \nHydrolyzed Oat Protein (1.5%)  \nPolyquat 7 (3%)  \nPropanediol 1,3 (3%)  \nFragrance (1%)  \nPanthenol (1%)  \nGermall Plus (.5%)\n\nAs an aside, I'm planning to reduce the SLSa by 3% and adding 3% cetyl alcohol to make the bars harder.\n\nThanks!\n\n# ",
    "flair_text": "question",
    "flair_template_id": "51c2fb6e-2823-11e4-b071-12313b0e52a2",
    "comments": [
      {
        "author": "MrsSeanTheSheep",
        "body": "Never used it but it looks like it will work. You could also look at Foaming Apple/Oat/ETC.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "CPhiltrus",
        "body": "A direct replacement would be decyl glucoside and polyglyceryl-10 laurate/myristate/oleate. Both are readily available. \n\nThe sulfonate will be more stripping than a betaine. And it probably isn't the betaine itself that's causing issues but byproducts like alkylamines that can be sensitizing. If you're not getting high quality CAPB, that can happen.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "CPhiltrus",
        "body": "Both betaines are synthesized using alkylamines, which are usually the cause of sensitization, not betaines themselves. Otherwise you'd be really allergic to beets along with most vegetables and fruits. \n\nDecyl glucoside doesn't have a pKa in the pH range of water. It's nonionic in water, meaning the pH will be determined by some byproducts within it, not the surfactant itself. \n\nPolyglyceryl oleate/laurate/whatever are surfactants. They're polyglyceryl esters of fatty acids. They'll be nonionic surfactants too. But the surfactant you mentioned is comprised of decyl glucoside and polyglyceryl-10 laurate.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "MissMew416",
        "body": "Thank you for your quick response. I've tested allergic to cocamidopropyl betaine which is why I started making my own shampoo. I had been getting my CAPB from Voyageur Soap & Candles or Windy Point in Canada (reputable suppliers). I have tried Babassumidapropyl betaine with the same reaction, hence the assumption. (I also had to switch out my toothpaste because of CAPB).\n\nI can find decyl glucoside but I'm concerned about the high pH. I don't under substituting with the polyglyceryl as they don't appear to be surfactants... What am I missing?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "MissMew416",
        "body": "Thank you. I'll buy some decyl glucoside and make a test batch.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 2,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1do0btq",
    "title": "Cocamidopropyl betaine allergy, any cowash recommendations?",
    "url": "https://www.reddit.com/r/curlyhair/comments/1do0btq/cocamidopropyl_betaine_allergy_any_cowash/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-06-25T07:37:53+00:00",
    "body": "Hello, everyone! I was recently diagnosed with a cocamidopropyl betaine allergy and am currently swapping out my curly hair products. I, however, have not been able to find a cowash or cleansing conditioner without cocamidopropyl betaine that is good for curly hair. I wanted to see if anyone here may have a recommendation for a product I could use in my 3B hair. Thank you!\n",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Simple-Penalty3427",
        "body": "I have this allergy and recently discovered Kitsch bar shampoo and conditioner. It may sound strange but it is amazing. So much better than anything I have tried to use. [https://www.mykitsch.com/products/coconut-oil-shampoo-conditioner-2pc-combo](https://www.mykitsch.com/products/coconut-oil-shampoo-conditioner-2pc-combo)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "fxfi2t",
    "title": "Cocamidopropyl Betaine ( Coconut oil)",
    "url": "https://www.reddit.com/r/SebDerm/comments/fxfi2t/cocamidopropyl_betaine_coconut_oil/",
    "score": 2,
    "num_comments": 1,
    "created": "2020-04-08T21:40:24+00:00",
    "body": "I bought a facial cleanser off Amazon called honeyskin organics [this](https://www.amazon.ca/dp/B00W87KH8S/ref=cm_sw_r_other_apa_i_JoKJEbCBND51V). It listed on its bottle for people who have seb derm, rosacea, eczema, psoriasis. I've been using it since January and i just found it the ingredient Cocamidopropyl Betaine is coconut oil and its in the cleanser. Has this been feeding my seb derm the whole time ive been using it? I also copy and pasted the ingredients into seiza.co and it showed up as nothing that feeds malsseiza so im confused.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ZG2047",
        "body": "Just use regular MCT oil nothing else research the best type of MCT oil that's good for SD and get that.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Fungalacne",
    "post_id": "fkcbm3",
    "title": "Guys, I just never feel like my skin is getting better , I looked through all my old routines and can’t help but feel it’s my cleanser!!! It has cocamidopropyl Betaine , which is derived from coconut oil! And the ingredient is supposed to be really stripping !",
    "url": "https://www.reddit.com/r/Fungalacne/comments/fkcbm3/guys_i_just_never_feel_like_my_skin_is_getting/",
    "score": 3,
    "num_comments": 4,
    "created": "2020-03-17T20:21:18+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "gstirk69",
        "body": "Yeah it is , have you used it ?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "nukle_osom",
        "body": "Cb can be triggering alergies. Be careful :)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1j7nn6v",
    "title": "Should ingredients like Cocamidopropyl Betaine & Sodium Cocoyl Isethionate (coconut oil derivatives) also be avoided if hair reacts bad to coconut oil?",
    "url": "https://www.reddit.com/r/curlyhair/comments/1j7nn6v/should_ingredients_like_cocamidopropyl_betaine/",
    "score": 1,
    "num_comments": 1,
    "created": "2025-03-10T01:47:33+00:00",
    "body": "Just a question. Still trying to figure out exactly which ingredients are ruining my hair\n\n  \nEdit: Also coconut water, sorry forgot to add that. I'm also avoiding that because I assume it would cause the same reaction as coconut oil?",
    "flair_text": "Discussion",
    "flair_template_id": "8a0f6380-21dd-11e6-9e78-0ead3f7791ed",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi there! I'm a bot, and I've been summoned to help.\n\n**If you have not seen our [WIKI](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/) yet:** Please check it out! It's nearly 100 pages full of curated information to help answer all of your curl-related questions. You can use the included Table of Contents (page 2), the side bar, or CTRL-F to search for keywords and help navigate the document.\n\n**Reminder:** [Curl type](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit?tab=t.0#bookmark=kix.e9uk1qyai8oh) is NOT your hair type! Whether you are wavy, curly, or coily - you have texture and you belong here. More than that, your curl type doesn't dictate how you care for your hair. To help your curls thrive, we recommend instead using the wiki link above to learn about your porosity, texture, and density.\n\n**If this is a photo submission:** Please include your detailed routine for your post to remain active! This MUST include the *brands* of ALL products used, *order* of application and *technique* used to apply them, how you dried your hair, and anything else that you might find useful for people to know.\n\n**If you received this message in error:** Please disregard this comment! I probably just picked up on a keyword in your title.\n\nThank you. Wishing you many happy, wonderfully curly hair days!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/curlyhair) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DentalHygiene",
    "post_id": "17vobro",
    "title": "Can anyone recommend a good toothpaste that doesn’t contain cocamidopropyl betaine or SLS?",
    "url": "https://www.reddit.com/r/DentalHygiene/comments/17vobro/can_anyone_recommend_a_good_toothpaste_that/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-11-15T07:23:49+00:00",
    "body": "Discovered CB and SLS irritate my skin, causing dermatitis. Cleure was what I was using before and now I’m using Lumineaux Whitening as they’ve been the only pastes that didn’t cause irritation. Any good recommendations for something even better if there is one?",
    "flair_text": "Homecare Routine",
    "flair_template_id": "e38594a6-31e5-11ed-95c4-e2a767458829",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "kc5uyj",
    "title": "Is Cocamidopropyl betaine OK?",
    "url": "https://www.reddit.com/r/curlyhair/comments/kc5uyj/is_cocamidopropyl_betaine_ok/",
    "score": 1,
    "num_comments": 1,
    "created": "2020-12-13T06:32:27+00:00",
    "body": "Ive seen the CGM post on this subreddit and im basically clear for all the chemicals except Cocamidopropyl betaine, So I was planning to throw away my \"CGM approved\" Shampoo (Fuckin false advertisement), but I saw a blog that mentioned Cocamidopropyl betaine as a mild chemical and is ok for use when doing the CGM, Is this true? Should i keep my shampoo or buy a new one? thanks.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "WeAreStarless",
        "body": "that's an approved cleanser! and i don't know what you're using to check your ingredients, but both [curlsbot](https://www.curlsbot.com/) and [isitcg](http://www.isitcg.com/) will tell you as much",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_pciplindia",
    "post_id": "12ei506",
    "title": "Leading Cocamidopropyl Betaine Manufacturers - Prakash Chemicals International",
    "url": "https://www.reddit.com/r/u_pciplindia/comments/12ei506/leading_cocamidopropyl_betaine_manufacturers/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-04-07T11:30:29+00:00",
    "body": "  Prakash Chemicals Internation is the leading[ **Cocamidopropyl betaine manufacturers**](https://pciplindia.com/product-detail/Cocamidopropyl-Betaine-)**.** It is available as a viscous pale yellow solution and it is used as a surfactant in personal care products. For more information, visit our website today!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DentalHygiene",
    "post_id": "1kb5iur",
    "title": "Toothpaste that is cocamidopropyl betaine free and sls free?",
    "url": "https://www.reddit.com/r/DentalHygiene/comments/1kb5iur/toothpaste_that_is_cocamidopropyl_betaine_free/",
    "score": 1,
    "num_comments": 9,
    "created": "2025-04-30T02:13:15+00:00",
    "body": "# Can anyone recommend a good toothpaste that doesn’t contain cocamidopropyl betaine or SLS?",
    "flair_text": "Product questions and reviews",
    "flair_template_id": "5c313346-7284-11ec-a406-16f853f979a8",
    "comments": [
      {
        "author": "ampharos995",
        "body": "I've been using Cleure but they're out of stock rn (probably because they had a big sale). I'd check local natural food stores like Whole Foods. The only thing is surfactant free toothpastes tend to be fluoride free as well.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Gemmie6",
        "body": "Splat! Amazing!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Gemmie6",
        "body": "I will take that back! bad reaction! gradual over 2 weeks , possibly the parabebs?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "FlakeyGirl",
        "body": "you reacted to cleure?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Rainbows_Hearts2024",
        "body": "Just found Verve with floride on Amazon. It's cocomidopropyl betaine and SLS free.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Gemmie6",
        "body": "it does have another ingredient I can’t tolerate which is sort of related to coconut",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Healthy_Plan7031",
        "body": "I'm also looking, my allergist recommended clueure (but it doesn't have fluoride) and Ojook. Both are SLS and CAPB. She also recommended David's hydroxy sensitive toothpaste and hellos natural whitening toothpaste. But those both have coconut derived ingredients.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Gemmie6",
        "body": "Yea there is nothing. It’s insane",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Healthy_Plan7031",
        "body": "I've been using the ojook one for a while, it's a bit expensive but it's seems to be helping my symptoms.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 3,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "u_jadejaaman",
    "post_id": "bcclv6",
    "title": "Cocamidopropyl Betaine Capb Market Share Industry Size Growth Forecast Report 2025",
    "url": "https://www.reddit.com/r/u_jadejaaman/comments/bcclv6/cocamidopropyl_betaine_capb_market_share_industry/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-04-12T11:47:48+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "uqh1nm",
    "title": "Probably Cocamidopropyl betaine allergy - what should I do?",
    "url": "https://www.reddit.com/r/curlyhair/comments/uqh1nm/probably_cocamidopropyl_betaine_allergy_what/",
    "score": 1,
    "num_comments": 1,
    "created": "2022-05-15T22:18:32+00:00",
    "body": "I tried a shampoo with CB for the first time and I can feel some (not too bad) itching and burning, there was also slightly bigger hairfall in the shower. I was also plopping so I think that made the thing worse.\n\nI'm kinda scared of hair loss. Of course I won't use the product again but is there anything else I can do? Should I wash my hair again? The only other thing I have is some very strong SLS shampoo. Or not use it so it doesn't irritate the scalp more?",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "gravityholding",
        "body": "Maybe wash it again if you think there's a chance any is still on your scalp. But given it's shampoo I assume you washed it all out properly and it is remnant itching from the reaction.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "1djm3p2",
    "title": "Cocamidopropyl Betaine Allergy",
    "url": "https://www.reddit.com/r/HairDye/comments/1djm3p2/cocamidopropyl_betaine_allergy/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-06-19T15:34:10+00:00",
    "body": "Hi there, I am looking for a permanent hair dye in the United States that does not contain Cocamidopropyl Betaine or DMAPA as I'm severely allergic. \n\nDoes anyone have one they love? Seeking dark brown and also purple or blue. ",
    "flair_text": ":txt: Question",
    "flair_template_id": "8e1f8a30-b3da-11e9-9adb-0efd305d1176",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddicts",
    "post_id": "1jzm765",
    "title": "where I could get cocamidopropyl betaine and sls free shampoo and toothpaste?",
    "url": "https://www.reddit.com/r/SkincareAddicts/comments/1jzm765/where_i_could_get_cocamidopropyl_betaine_and_sls/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-04-15T07:50:36+00:00",
    "body": "Hi guys, I’ve posted on here previously about getting sore pimples only on my jawline. Well, after scrolling through several threads and some self reflection, I think it could be my toothpaste and/or shampoo. Specifically, because my shampoo contains both cocamidopropyl betaine and sls and my toothpaste contains just cocamidopropyl betaine. The reason I think these could be my culprit is when I wear my hair down, it touches the areas of my chin where I’m getting spots, and I sometimes get bumps on my hairline and upper back AFTER showering. So, my question to you lovely folk is, do you know where I could get cocamidopropyl betaine and sls free shampoo and toothpaste? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "naturellecosmetics",
    "post_id": "6qrieg",
    "title": "What are the benefits of Cocamidopropyl betaine?",
    "url": "https://www.reddit.com/r/naturellecosmetics/comments/6qrieg/what_are_the_benefits_of_cocamidopropyl_betaine/",
    "score": 1,
    "num_comments": 0,
    "created": "2017-07-31T21:14:55+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "148mml7",
    "title": "shampoo/bar recommendations without sls, sles and cocamidopropyl Betaine",
    "url": "https://www.reddit.com/r/Allergies/comments/148mml7/shampoobar_recommendations_without_sls_sles_and/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-06-13T18:50:49+00:00",
    "body": "I'm at my wits end trying to find shampoo or shampoo bars without these ingredients, especially cocamidopropyl Betaine. I'll think I've found one but then it either makes my hair feel like straw or there's something else in it that causes irritation. I'm in the US but if there is nothing else I would be willing to order outside of the country.",
    "flair_text": "Question",
    "flair_template_id": "479b07f2-7c85-11e3-a97f-22000a0b8292",
    "comments": [
      {
        "author": "fidgety_sloth",
        "body": "Clean Kids Naturally, Tropical Orange Burst. Available on Amazon. \n\n\nAqua (Infusion Of Aloe Barbadensis Leaf Juice), Laminaria Japonica Extract, Glycerin, Urtica Dioica (Nettle) Extract, Pyrus Malus (Apple) Flower Extract, Citrus Aurantifolia (Lime) Peel, Citrus Grandis (Grapefruit) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citric Acid, Simmondsia Chinensis (Jojoba) Seed Oil, Lecithin, Calcium Pantothenate, Aloe Barbadensis Leaf Extract, Citrus Aurantium Dulcis (Sweet Orange) Flower Oil, Potassium Sorbate.\n\nBeware, the scent is STRONG. I'm only on wash 2 with this-- just got it the other day -- so I can't say just yet how good it is. But it's free of coconut and coconut derivatives!  I'm allergic to \"fragrance blend\" and mildly allergic to linalool.... all those flower extracts might be bad news for me but it's so hard to find anything coconut free that I was getting desperate.\n\nEDIT: I don't know how the glycerin is derived but the company's website specifically says this is coconut free.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ContributionOnly176",
    "post_id": "1jer35q",
    "title": "A list of products that are free of coconut oil, caprylic/capric triglycerides, cetearyl alcohol, and coconut alkanes and free of Cocamidopropyl betaine (CAPB)",
    "url": "https://www.reddit.com/r/u_ContributionOnly176/comments/1jer35q/a_list_of_products_that_are_free_of_coconut_oil/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-03-19T06:54:27+00:00",
    "body": "Hi! over a year ago i found out that i have an allergy to coconut oil and i wanted to share some coconut free skincare products that i like in case anyone else is looking. It took some time to compile because most companies use coconut derivatives, but these are great in my opinion. See list below with links (All coconut oil free). **Make sure to double check all ingredients before purchasing because ingredients might be changed by the companies over time**. Enjoy! and please feel free to recommend more products that are coconut free i am always looking for more to try. Right now i am looking for a good coconut free retinol serum. <3\n\n**1. Body wash:** Natural Body Wash for Sensitive & Dry Skin: [Link here](https://www.naturesustained.com/products/body-wash?variant=5264096460837)\n\n**2. Face soap:** Organic Face Wash & Cleanser: [Link here](https://juicebeauty.com/products/organic-facial-wash)\n\n**3 . Soap:** Gabriel Cosmetics Clean Kids Naturally Kiwi Soap: [Amazon link here](https://www.amazon.com/Clean-Kids-Naturally-Busting-Ounce/dp/B078H9SBN7/ref=sr_1_7?crid=11A0J0Y6N6WKG&dib=eyJ2IjoiMSJ9.WAbOdqIbM3IgLJHTPDlXeir8zy1yhZdSwAbcWoHj57_RmCXvYMGKORrypiQDq8WQ7_vpxVKBjyD72NFlCi5vwsOHLMr17T1KrAj3X8LhjUTtQmQhzGKRmkC8MejdkRqa1y44dWIkXJKcSTCRSWENSmm0I-uD1Xk3hmwHn7JM138K2Nnecwdnf5Cs32h27wmR1xs9pBUQJ7lZw4UX18Knn2f7U8XdHhtu2KY3FcExebR2TDKbdFPgGOmvsyg-7sgAc9phFNpagk7N4iBByaq-8CRth8EMADracu6GXHkuAOoz194zd55cr-_LQy5XpQG2FacKpR1BST2FmF6s5vsYTC9cnwNZN_ST9CX359UF1JZ-19nNCUnK09vE7GKEMB9_4l4jtQIKOwgDauA1P5QHk0a7NtyhpeOegjIPRqVDPPp0b_8bznRuR4BYTrbL1aW3.4fJ_VJ3Xc6fvO3ZY714boNaYtwhlSeBYsjwQh8iLVx8&dib_tag=se&keywords=clean%2Bkids&qid=1742363365&s=beauty&sprefix=clean%2Bkids%2Cbeauty%2C105&sr=1-7&th=1)\n\n**4. Body Lotion**: Gabriel Cosmetics Clean Kids Naturally Tahitian Vanilla Body Lotion: [Amazon link here](https://www.amazon.com/dp/B076888RVQ?ref=ppx_yo2ov_dt_b_fed_asin_title&th=1)\n\n\\- **Body oils:** Jojoba oil: [Amazon link here](https://www.amazon.com/dp/B00SGLZ23A/ref=sspa_dk_detail_5?psc=1&pd_rd_i=B00SGLZ23A&pd_rd_w=yElmh&content-id=amzn1.sym.8c2f9165-8e93-42a1-8313-73d3809141a2&pf_rd_p=8c2f9165-8e93-42a1-8313-73d3809141a2&pf_rd_r=4BEV1699F4A243R2N9EX&pd_rd_wg=HqJxg&pd_rd_r=bfdc3cbd-cb27-4ad9-802c-309c6bef78e2&sp_csd=d2lkZ2V0TmFtZT1zcF9kZXRhaWwPure) &  Rosehip oil [Amazon link here](https://www.amazon.com/PURA-DOR-Certified-Anti-Aging-Moisturizer/dp/B00KI3Z2UW/ref=sr_1_6?crid=3M437K0GT4TFJ&dib=eyJ2IjoiMSJ9.ktsXJqAeMr_Mh9uaVmh7QZmG2tOK4kQTp7JRE1BaY8usZUXdfn06abqJ0RWt2eji30wYw0mbiDFxula_4gTysDF8Cgs_zDrIopNLyWZax4MhL73PHlsdC8I_LfbB6778elMIa0G6qoMlTLD56QHa0DRr0gmzXpPW_6N1N1-9Ktqza5NOmwwlTOa-fPc5LuyvedpUQH3U-fCTrsA5hIarLJ7utSHmEujZaYw4mYrQR0GRkPb0aRibXQYtQji4tRXqCmHvsw88i_YREAP-2UO0DXiOw4tZAD2Y7kryQLnj2-kluRG1KNhhgfovyscPG78Ll9f4U6fp6KU1wLT-pVORG2_6uKqCD_4p_E4zX8RTj0do1MHHO5i7tzOGcNCj1lK7Z-9HlPpullRioeGkpUlF36oeEdDstiLh9EOliPUG_poRSCHS9rxQs9HhEv2eJOpS.0OH8Cxv9IfGQQ9h0ph6nc1H2hGZyDPFAY48z94Xe5Vk&dib_tag=se&keywords=rosehip%2Boil%2Bfor%2Bface%2Bwith%2Bpump&qid=1742365636&rdc=1&sprefix=rosehip%2Boil%2Bfor%2Bface%2Bwith%2Bpump%2Caps%2C99&sr=8-6&th=1)\n\n**5. Hair Conditioner:** Gabriel Cosmetics Clean Kids Naturally Banana Smoothie Conditioner: [Amazon link here](https://www.amazon.com/dp/B00AL6GIDG?ref=ppx_yo2ov_dt_b_fed_asin_title)\n\n**6. Hair Shampoo:** Natural Soapnut Shampoo: [Link here](https://www.naturesustained.com/products/natural-shampoo?pr_prod_strat=jac&pr_rec_id=62ae29e32&pr_rec_pid=378911195173&pr_ref_pid=479925600293&pr_seq=uniform&variant=44673198489761)\n\n**7. Sunscreen**: Raw Elements Face and Body Mineral Sunscreen SPF 30 Tube: [Amazon Link Here](https://www.amazon.com/dp/B0067LR21Q?ref=ppx_yo2ov_dt_b_fed_asin_title)\n\n**8. Lip oil**: Gisou infused lip oil (Lasts long and is one of my favorite lip products): [Link here](https://us.gisou.com/products/honey-infused-lip-oil?variant=47847726252379)\n\n**9. Face Moisturizer:** (My favorite product and smells amazing): Dr Hauschka Rose Day Cream: [Link here](https://www.drhauschka.com/face-moisturizer/rose-day-cream/)\n\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "b4kch7",
    "title": "Allergic to cocamidopropyl betaine. Need recommendations",
    "url": "https://www.reddit.com/r/Allergies/comments/b4kch7/allergic_to_cocamidopropyl_betaine_need/",
    "score": 1,
    "num_comments": 5,
    "created": "2019-03-23T15:26:10+00:00",
    "body": "I’ve just finished patch testing and found I’m allergic to cocamidopropyl betaine. \n\nI’m so glad we’ve finally discovered what has *most likely* been causing my eczema. \n\nProblem is, it’s in everything! \n\nI would be eternally grateful if anyone can please recommend: shampoo, body wash, soap and toothpaste which are cocamidopropyl betaine-free. \n\nBonus points if it’s readily available in Australia!",
    "flair_text": "Advice",
    "flair_template_id": "53163732-7c85-11e3-be08-12313d224170",
    "comments": [
      {
        "author": "CatBec",
        "body": "Thank you",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "clare826",
        "body": "Ecostore products have no cocomidopropyl betaine, available at woolworths (just the hand soap, body wash and shampoo i think) or bigger ranges online.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "clare826",
        "body": "PS if you come across a shampoo & conditioner without it that actually works let me know!!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "CatBec",
        "body": "I haven’t seen it in any conditioners yet, but the only shampoo I’ve found without it in the supermarket is one of the OrganicCare ones, but you have to check because some of their shampoos have it",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 3,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "Dyshidrosis",
    "post_id": "n7triu",
    "title": "cocamidopropyl betaine and nickel allergy",
    "url": "https://www.reddit.com/r/Dyshidrosis/comments/n7triu/cocamidopropyl_betaine_and_nickel_allergy/",
    "score": 1,
    "num_comments": 5,
    "created": "2021-05-08T17:12:38+00:00",
    "body": "I have been mostly clear for a month! But the bumps keep trying to come back, small spots on my fingers. I’m still using clobetasol sparingly, and Amlactin. My patch test said cocamidopropyl betaine and nickel. Any advice on something I could be missing? If anyone with those allergies found something they never would have thought of to avoid. I changed my soaps, any cosmetics. I don’t use much. My phone has a plastic case and screen protector.",
    "flair_text": "Looking for advice",
    "flair_template_id": "5c654dc8-1ec2-11eb-8518-0eebd878631f",
    "comments": [
      {
        "author": "bvusrnm",
        "body": "Search this subreddit for nickel allergy. Dyshidrosis can be triggered by nickel consumed orally... and it’s in a lot of foods. There are low nickel diets people have found success with, so best of luck!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Unlikely_Sun1445",
        "body": "for me my biggest exposure is keys!!!  I had no\nIdea until just recently! Car, house and mail key all tested positive for nickel. Also pens with metal tabs, makeup or paint brushes with metal, household tools like silver Allen wrenches or anything silver metal (handbag hardware, zippers) I would test with the nickel test kit.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "JEHflute",
        "body": "Thanks! I’m actually waiting on Amazon to send me some plastic key rings. I’m slowly working on using less metal things.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "JShell329",
        "body": "Wow just learning about the cocamidopropyl and how it’s in my dove sensitive bar soap… I’ve had a nickel allergy for years… wondering if there’s a cross sensitivity between the two",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "JEHflute",
        "body": "I’m not really sure. My allergist didn’t mention them being connected. Interestingly, my coca allergy seems to more severe than my nickel allergy. I think I’m having some success taking basic multivitamins and probiotics.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 3,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "askdentists",
    "post_id": "mhi3dr",
    "title": "Seeking recommendations for a toothpaste that doesn't contain cocamidopropyl betaine",
    "url": "https://www.reddit.com/r/askdentists/comments/mhi3dr/seeking_recommendations_for_a_toothpaste_that/",
    "score": 1,
    "num_comments": 3,
    "created": "2021-03-31T23:05:54+00:00",
    "body": "Hi all. I recently did a patch test and found out that I am allergic to dimethylaminopropylamine. As such, I have been advised not to continue using any products containing cocamidopropyl betaine. \n\nI'm currently using Sensodyne Repair and Protect Whitening Toothpaste, which unfortunately contains cocamidopropyl betaine. I have really sensitive teeth and I'm hoping to find a replacement that will be suitable for someone focused on sensitivity protection and enamel repair. I'd really appreciate any suggestions.\n\nThanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "potatosalad96",
        "body": "I'll check it out, thank you!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "Thank you for seeking advice from r/askdentists. **Please note that a response does not constitute a doctor-patient relationship.** While this is a place for advice, replies may not be medically accurate. Do not assume that what others on here say is correct in any way. Reddit is not a replacement for an in-person dental professional. \n\n  **Please abide by the following rules in order to get an accurate answer to your question:**\n      (1) Ensure you include a title of your dental problem.\n      (2) Include whether you drink, smoke or if you have any medical conditions relevant to your main concern.\n      (3) Include a photograph if the question relates to something you can see in your mouth, include x-rays if you have them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askdentists) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "HealthWellness121",
    "post_id": "ms34ki",
    "title": "Is Cocamidopropyl Betaine in Toothpaste Better Than Sodium Lauryl Sulfate",
    "url": "https://www.reddit.com/r/HealthWellness121/comments/ms34ki/is_cocamidopropyl_betaine_in_toothpaste_better/",
    "score": 1,
    "num_comments": 1,
    "created": "2021-04-16T13:27:13+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "1alh585",
    "title": "Friend with severe cocamidopropyl betaine allergy, and moderate fragrance allergy",
    "url": "https://www.reddit.com/r/Allergies/comments/1alh585/friend_with_severe_cocamidopropyl_betaine_allergy/",
    "score": 1,
    "num_comments": 3,
    "created": "2024-02-07T23:30:45+00:00",
    "body": "My friend has developed a severe allergy to cocamidopropyl betaine, and is also allergic to fragrance.  I and my other friends want to be able to hug her, and are working on changing up our products accordingly.  We've found a few things but I was wondering if anyone has a list of shampoos and conditioners that would fit the bill (I'm particularly interested in things for wavy/loosely curly hair - everything I can find has either fragrance or the Forbidden Chemical).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "bookwithoutpics",
        "body": "Vanicream for the elimination phase, but it isn't necessarily the best long-term if you have actual skin/hair/etc. concerns that you want your products to address.\n\nI use Desert Essence shanpoo/conditioner. I think they have a fragrance free version.\n\nMrs. Meyers hand soap and dish soap doesn't have cocoamidopropyl betaine, but it is scented, so you'd have to try that one out to see if it's a problem or not.\n\nBar soaps generally don't have coco betaine (with the exception of Dove), so bar soap rather than shower gel is helpful.\n\nEditing to add: products marketed for curly hair are more likely to have cocoamidopropyl betaine because it tends to make sulfate-free formulas foam more and behave like you'd expect shampoo to behave.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sophie-au",
        "body": "It’s worth asking in the r/Haircare and r/HaircareScience subreddits.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "5uaf13",
    "title": "[Product Question] Cocamidopropyl Betaine?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/5uaf13/product_question_cocamidopropyl_betaine/",
    "score": 0,
    "num_comments": 3,
    "created": "2017-02-15T21:29:28+00:00",
    "body": "*Sorry if not tagged correctly.*\n\nPaula's Choice says [Cocamidopropyl Betaine](http://www.paulaschoice.com/cosmetic-ingredient-dictionary/definition/cocamidopropyl-betaine) is too mild to clean human skin and hair. Is this true?\n\nI'm asking because I need a new cleanser and I was thinking about getting this [\nSimple Kind To Skin Refreshing Facial Wash Gel](http://www.cosdna.com/eng/cosmetic_f365243463.html).",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "aenflex",
        "body": "I use that wash maybe once or twice a week. Love it. Foams just a little, doesn't strip skin. \nDon't trust everything Paula's Choice/Beautypedia say. Seriously. \nCocomidopropyl Betaine is a gentle surfactant, a gentler alternative SLSs. She is not a scientist. She is not the end-all, be-all of skincare. \n\nTry it. If it works for you, there's your answer.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "xxSilver",
        "body": "Thank you so much xx",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "aenflex",
        "body": "You're quite welcome ;-)",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "beauty",
    "post_id": "1jzmazw",
    "title": "cocamidopropyl betaine and sls free shampoo and toothpaste?",
    "url": "https://www.reddit.com/r/beauty/comments/1jzmazw/cocamidopropyl_betaine_and_sls_free_shampoo_and/",
    "score": 0,
    "num_comments": 0,
    "created": "2025-04-15T07:58:04+00:00",
    "body": "Hi guys, I’ve posted on here previously about getting sore pimples only on my jawline. Well, after scrolling through several threads and some self reflection, I think it could be my toothpaste and/or shampoo. Specifically, because my shampoo contains both cocamidopropyl betaine and sls and my toothpaste contains just cocamidopropyl betaine. The reason I think these could be my culprit is when I wear my hair down, it touches the areas of my chin where I’m getting spots, and I sometimes get bumps on my hairline and upper back AFTER showering. So, my question to you lovely folk is, do you know where I could get cocamidopropyl betaine and sls free shampoo and toothpaste? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "1ex5hsw",
    "title": "Cocamidopropyl Betaine and Coconut allergy?",
    "url": "https://www.reddit.com/r/chemistry/comments/1ex5hsw/cocamidopropyl_betaine_and_coconut_allergy/",
    "score": 0,
    "num_comments": 4,
    "created": "2024-08-20T20:04:40+00:00",
    "body": "Hello, apologies if this post doesn’t quite fit here. I recently found out I have a coconut allergy. I was looking at a new hair product and saw it has cocamidopropyl betaine, which I learned is a coconut derivative. I don’t quite understand the derivation process, and was wondering if anyone could let me know if there would be any coconut protein (the allergen) left in the refined cocamidopropyl betaine. Thank you!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "KuriousKhemicals",
        "body": "It's actually possible for it to not even be from coconuts, but from palm oil. Generally speaking, oils are very low in protein content in the first place, and then it's treated with various chemicals which have a good chance of denaturing any residual proteins. So I would say the chance of any intact protein is quite low, but it's hard to know for sure. The Wikipedia article goes over the process and also has a comment on allergic/sensitivity reactions, which seem to be related to the post-treatments and not the oil feedstock.\n\n[Cocamidopropyl betaine - Wikipedia](https://en.wikipedia.org/wiki/Cocamidopropyl_betaine)\n\nIf your allergic reaction isn't anaphylactic, then my guess is you will have no issue but just stay on the lookout for any signs of irritation. If the allergy is very serious, you should double check the issue with your allergist and I might just avoid that ingredient to be safe.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "yeastysoaps",
        "body": "Nearly all shampoos and body washes contain cocamidopropyl betaine (CAPB). All that's used from the coconut are the fatty acids that are derived from the oil. I'd be really surprised if there's any coconut protein kicking around in there.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "unbreakablekango",
        "body": "If you are buying hair products from a reputable source, then there should not be any coconut proteins present, unless specified on the label.  Cocamidopropyl Betaine goes through a synthetic step and should be pretty clean.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Willing_Ad_867",
        "body": "Thank you for the reply!",
        "score": 0,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 3,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "soapmaking",
    "post_id": "z5ua5b",
    "title": "Adding Cocamidopropyl betaine (bubble up) to melt and pour soap",
    "url": "https://www.reddit.com/r/soapmaking/comments/z5ua5b/adding_cocamidopropyl_betaine_bubble_up_to_melt/",
    "score": 0,
    "num_comments": 7,
    "created": "2022-11-27T06:57:09+00:00",
    "body": "Does anyone have experience doing this and does it increase lather? I got a customer request to recreate a melt and pour soap (made into a shampoo bar), and I see that it contains Cocamidopropyl betaine. I read that 1% is a good usage rate, does that sound correct? I can't find very much info on it besides that.",
    "flair_text": "M&P",
    "flair_template_id": "c331c142-bd71-11ea-bbc8-0e31db05d783",
    "comments": [
      {
        "author": "afunkmomma",
        "body": "I would not recommend a melt and pour bar as a shampoo bar, unless you're using something like Stevenson's shampoo base.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Kamahido",
        "body": "I've not heard of adding Cocamidopropyl Betaine to a Melt and Pour base before. It's often added to liquid shampoo and bubble bars. If your shampoo project was going to be a liquid I would say that you could use up to 30% Cocamidopropyl Betaine. For bubble bars use up to 8%.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "reptilelover42",
        "body": "I agree, but this was a custom request from a coworkerer who has her mind set on the exact bar she saw another small business make on tiktok with an aloe base (for what it's worth that person has all positive reviews on this bar as a shampoo bar). My normal shampoo bars are syndet bars since I know the pH should be more neutral/closer to acidic rather than basic. The reason I was asking about the Cocamidopropyl betaine is that I don't want her to be disappointed if the lather doesn't look the same as in the video she sent me, since that creator adds it to the soap (she just didn't include exact amounts in her video).",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "afunkmomma",
        "body": "I've got no advice for that, I've never heard of it being added to mp, and I avoid additives as they can have negative outcomes. Hope you find your answer!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ResultLeft9600",
        "body": "Before you do this, please check the pH of the bar.  Hair has a VERY different pH than skin does!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hello and welcome to r/soapmaking. Please review the following rules for posting.\n\n1) Use \"Flairs\" when possible.\n\n2) Pictures should be accompanied by a post for context.\n\n3) When requesting help with a recipe or soaping mishap it is important that you include your full recipe by weight.\n\n4) No self-promotion or spam. Links to personal/professional social media accounts or online stores will be flagged and removed.\n\n5) Be kind in comments.\n\nFull rules can be found here... https://old.reddit.com/r/soapmaking/comments/jqf2ff/subreddit_rules/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/soapmaking) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ResolvableOwl",
        "body": "https://soapmakers-store.com/shop/soap-making-ingredients/melt-pour-soap-bases/melt-and-pour-soap-base-palm-free/\n\nhttps://candlemaking.com.au/products/transparent-natural-melt-and-pour-soap-sls-free\n\nhttps://www.velonainc.com/product-page/white-glycerin-melt-pour-soap-base-organic-pure-2lb-5lb-10lb-25lb-velona\n\nNot that difficult to find that cocamidopropyl betaine has its place in commercial M&P products. However, developing such a recipe is a labour-intensive process, and it is unlikely that someone without a profound understanding how soap in general and M&P in particular works, can improve some pre-mixed M&P formulation by adding some additional syndet. You can try it, of course, but don't be surprised if things don't behave as expected (wrt clarity, melting or hardening, stickiness, sweating, scent retention, solubility, lathering…).\n\nIf your current M&P stock isn't convincing, it is likely the easiest for you to just start with another M&P base.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 5,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "17qsn98",
    "title": "Sodium Laureth Sulfate and Cocamidopropyl betaine are in every shampoo",
    "url": "https://www.reddit.com/r/HaircareScience/comments/17qsn98/sodium_laureth_sulfate_and_cocamidopropyl_betaine/",
    "score": 0,
    "num_comments": 37,
    "created": "2023-11-08T18:53:42+00:00",
    "body": "A list of harmful ingredients in a shampoo mention the above two ingredients and they are present in EVERY shampoo. I can't seem to find one without it 😭. Can someone tell me shampoos without these ingredients? Or tell me the science behind it.",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "Littlebotweak",
        "body": "What makes you think they're harmful?",
        "score": 89,
        "is_top_level": true
      },
      {
        "author": "sassypants55",
        "body": "SLS isn’t harmful, just too stripping for some people, meaning it removes too much oil for some people with dry or sensitive scalps.\n\nThere are a lot of shampoos that don’t have it. Derma E has some SLS-free shampoos. I believe OGX doesn’t contain SLS either.",
        "score": 39,
        "is_top_level": true
      },
      {
        "author": "winwinnwinnie",
        "body": "They’re not harmful.",
        "score": 31,
        "is_top_level": true
      },
      {
        "author": "davideaglemann",
        "body": "What list is that",
        "score": 28,
        "is_top_level": false
      },
      {
        "author": "sassypants55",
        "body": "If it's an option for you, you might consider seeing a doctor about that. Shampoo can  theoretically cause hair loss, but there are also a lot of health problems that can cause hair loss, like anemia, vitamin deficiencies, thyroid disorders, or just being really stressed out. My mom lost a lot of hair when she got COVID, but it grew back.\n\nIf you cut out SLS, you may want to cut back on silicones, too. You need sulfates to prevent some silicones from building up.",
        "score": 19,
        "is_top_level": false
      },
      {
        "author": "HairHealthHaven",
        "body": "My hair is very sensitive to being stripped, so I only use sulfate-free shampoos... And there are literally hundreds of shampoos that don't use them. Sulfate-free free has become so popular in recent years that it's easier to find than shampoos with sulfates, so I have no idea where you are looking. \n\nSulfates aren't necessarily the demon some people think they are. Some people need them to fully cleanse their hair as a lot of sulfate-free shampoos can't break down silicones or other build-up. For others, like me, sulfates are too harsh for their hair.\n\nAs for Cocamidopropyl beltaine... It's on my list of HAPPY surfactants and is used in my absolute favorite shampoo. Where did you hear it's bad?",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "BouncyBellaVA",
        "body": "it might be because your scalp wasn’t getting clean. The follicle can only produce healthy hair if it’s not caked up in oil and debris etc\n\nIt happened to me too, esp w higher range shampoos that weren’t as concentrated in the SLS department \n\nDw i use Pantene volume, which is actually quite strong and my hair is doing very fine",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "kira82",
        "body": "I don't know about harmful but according to my allergist, I'm allergic to Coco Betaine and he said it's a very common alergy.\n\nIt's almost impossible to find shampoo without it.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Cooz78",
        "body": "herbal essence repair and smooth doesn’t have them\n\nbut i alternate between this and a sulfate shampoo and i legit see no difference",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "kienkhongngu",
        "body": "In fact, SLS is not as scary as many articles make it out to be. It helps us remove product buildup from our hair and scalp. However, if you have a dry scalp or have recently undergone a keratin hair treatment, you should avoid using shampoos with SLS regularly. You can look for herbal shampoos available in the market instead.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "likewtvrman",
        "body": "First of all, SLES is not the same as SLS. SLES is less stripping (though even SLS is not necessarily bad when in a properly formulated product). \n\nSecond, when you combine different surfactants together they form micelles that actually make them gentler than the individual surfactants on their own. The combination of SLES and cocamidopropyl betaine is known for being one of the mildest surfactant combos, which is why so many formulations use it. Whatever list you're reading is inaccurate and fear mongering.\n\n[This labmuffin blog post is an excellent explainer on surfactants.](https://labmuffin.com/how-to-choose-gentle-cleanser/)",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "xleucax",
        "body": "Can confirm I use sulfates on my curls and I get compliments often. 🤷🏻‍♀️",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Junny_B_Jones",
        "body": "What shampoo and conditioner are you using ?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "98stangs",
        "body": "For people who have dry or sensitive scalp, or dry, damaged or frizzy hair, try to avoid hair products that have either of the ingredients within the first five or six on the ingredient list. Oh and OGX and other shampoos with these ingredients made my fine dry hair really frizzy (caused snarls), static and even more dry. And made my scalp more dry and sensitive.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "98stangs",
        "body": "I forgot to add that Sodium Sulfonate is similar to Sodium Sulfate but milder. It does clean hair better but still makes your hair and scalp drier.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "kiliki00",
        "body": "Hi, I’m allergic to cocamidopropyl betaine and I agree - it’s shameful how few options there are. However I’ve switched to Oribe and haven’t had the sore scalp headache since",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "alongthewatchtower91",
        "body": "SLS free shampoos are easy to find. OGX, Palmer's and a lot of POC owned brands are all SLS free. \n\nSLS isn't necessarily harmful, they're just stripping of oils. If you have hair extensions it's advised to use SLS free shampoo but there's nothing inherently bad about them.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sno_kissed",
        "body": "Anyone remember about 25 years ago it was going around that SLS causes cancer?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": false
      },
      {
        "author": "anxietyandpizza",
        "body": "Pureology Strength Cure Shampoo",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": -1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you may be asking about about ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we don't spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": -3,
        "is_top_level": false
      },
      {
        "author": "shiny1988",
        "body": "Nothing wrong with sulfates unless you have curls. Or a keratin.",
        "score": -6,
        "is_top_level": true
      },
      {
        "author": "notshitveronica",
        "body": "Ogx made my hair fall like water from tap. I am currently so stressed because of it",
        "score": -9,
        "is_top_level": false
      },
      {
        "author": "notshitveronica",
        "body": "Oh it was just in the harmful ingredients to avoid list",
        "score": -25,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 29,
      "top_level": 13,
      "nested_replies": 16
    }
  }
]