[
  {
    "subreddit": "Health",
    "post_id": "1ligb8",
    "title": "Carcinogen Outlawed in Calif Found in 98 Shampoos, Soaps – Products sold by major retailers have cocamide DEA, a form of coconut oil. “Most believe products are tested for safety, but consumers need to know they could be doused with a cancer-causing chemical every time they shower or shampoo.”",
    "url": "https://www.reddit.com/r/Health/comments/1ligb8/carcinogen_outlawed_in_calif_found_in_98_shampoos/",
    "score": 190,
    "num_comments": 56,
    "created": "2013-09-01T11:25:54+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "vbullinger",
        "body": "A _form_ of coconut oil? http://en.wikipedia.org/wiki/Cocamide_DEA No. It's a nasty chemical made from derivatives of coconut oil. I use shampoo made from _actual_ coconut oil. It's edible. \n\nI'm still upvoting this. I just think you should rephrase the title",
        "score": 38,
        "is_top_level": true
      },
      {
        "author": "newtonium",
        "body": "[The list](http://www.ceh.org/making-news/press-releases/29-eliminating-toxics/663-lawsuit-launched-as-testing-finds-cancer-causing-chemical-in-nearly-100-hair-care-and-personal-care-products) of products.",
        "score": 37,
        "is_top_level": true
      },
      {
        "author": "Morophin3",
        "body": "Where's the data?",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "aidenator",
        "body": "Sometimes I feel like everything on earth is carcinogenic in some way and that we're all doomed.",
        "score": 19,
        "is_top_level": true
      },
      {
        "author": "sangjmoon",
        "body": "Keep in mind that you could do everything to avoid everything that could possibly be bad for you, and there still will be 90+ year olds who outlive you even though they smoke, drink and use every product you avoid.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "rmosler",
        "body": "California you say?  You mean the place where when you walk into a hospital you are greeted with at least these two signs:\n\n1. Tobacco Smoking prohibited\n2. This building contains substances known to the state of California to be carcinogens, including tobacco smoke.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Scuderia",
        "body": ">All things are poison, and nothing is without poison; only the dose permits something not to be poisonous.  \n  \n-Paracelsus",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Forbichoff",
        "body": "thankfully i went bald years ago!\n\nno but seriously, dr bronners people.  the bottle has some nutty stuff on it and he was pretty much insane, but he made good soap.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "dr_candycan",
        "body": "That would be great at [r/newshealth](http://www.reddit.com/r/newshealth/)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "laughingrrrl",
        "body": "Go no-poo.  Baking soda is all you'll ever need.  Been using it for years now and it's great: cheap, does the job, no weird chemicals.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 10,
      "top_level": 10,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "16c3gqc",
    "title": "[Misc] My skin is extremely dry, red, and irritated, and I don't know what to do 😭. Everything irritates my face, and I feel like giving up.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/16c3gqc/misc_my_skin_is_extremely_dry_red_and_irritated/",
    "score": 127,
    "num_comments": 117,
    "created": "2023-09-07T02:11:04+00:00",
    "body": "I've been dealing with some major skin issues for the past few months, and I'm feeling frustrated and hopeless. I wanted to reach out here for advice or suggestions that could help me out.  \n\nIt all started when I decided to try out the Round Lab Dokdo cleanser, and this product irritated THE HECK out of my skin. I immediately stopped using any skincare products for a few days, and yellow crust started to form on my skin. At that time, I also had eczema on my hands that oozed yellow pus, so when I mentioned this to my dermatologist, she believed my skin might have been infected while I was washing my face, so she prescribed mupirocin. However, it only worsened my skin, so when I stopped using the product, my skin suddenly returned to normal.  \n\nI went back to my dermatologist, and we performed a patch test on my back. The results indicated a possible allergy to cocamide DEA. However, none of the products I used contained this ingredient, leaving me confused and lost. I took a break from skincare for a month or two and noticed increased dryness and flakiness, as well as clogged pores/blackheads, since I wasn't washing my face or moisturizing my skin. Just FYI, my skin type is usually dry/combo and sensitive. \n\nI cautiously reintroduced some skincare products into my routine. I tried several different cleansers like the Torriden Low Hyaluronic Acid Cleanser, Haruharu Wonder Gel Cleanser, and the Etude House Soonjung 6.5 Whip Cleanser. Unfortunately, each one of them irritated my skin. My skin also stung whenever I applied moisturizer, specifically the Isntree hyaluronic acid aqua gel cream (dried out my skin and caused tightness) and the P.Calm cato cream (stung my skin and caused itchiness and redness). Additionally, I noticed that my skin would start burning while working out (probably due to the heat and sweat) and become overly dry and flaky after showering despite using only warm water.  \n\nI revisited my derm and explained my ongoing issues, but she couldn't pinpoint the exact cause of the irritation. She suggested that I try Vanicream, but by that point, I was too scared to introduce anything new because of my skin's extreme sensitivity.   \n\nI researched ways to repair the skin barrier when everything irritates it and saw that squalane oil was recommended. I then used the Purito plainet squalane oil last night, hoping that this would finally heal my skin, but I woke up with red marks on my face, assuming that I must've scratched myself throughout the night. I couldn't use any other moisturizer and desperately needed something to moisturize my dry skin, so I used the oil again this morning. My skin was a bit itchy throughout the day, but wasn't unbearable. Although I also notice some small bumps on my face, I'm unsure if they're related to the oil.  \n\nAt this point, I'm feeling overwhelmed and unsure of what to do next. Nothing seems to work to heal my skin and get it back to normal. If anyone has any advice or suggestions, I would be incredibly grateful.  \n\nThank you in advance for your help!",
    "flair_text": "Miscellaneous",
    "flair_template_id": "56f33ba0-35e0-11e5-9715-0ee61c357d3b",
    "comments": [
      {
        "author": "astralcat214",
        "body": "Stop everything. No cleanser and the most basic Vanicream moisturizer until your skin calms down and heals.",
        "score": 192,
        "is_top_level": true
      },
      {
        "author": "Unfair_Finger5531",
        "body": "I’m wondering if you need to repair with moisturizer with no ceramides right now.  It sounds like your skin is so broken it is actually sensitive to ceramides, which can happen.\n\nWhen all else fails me, I go for soon jung 2x barrier cream bc it repairs the barrier without ceramides.  \n\nYou might also want to try a super mild cleanser for a while that won’t disrupt your ph barrier.",
        "score": 62,
        "is_top_level": true
      },
      {
        "author": "helegg",
        "body": "I'd try the Vanicream as your derm suggested. It's known to be good for sensitive skin. I'm not familiar with all the products you used recently, but they might not have been designed for sensitive and dry skin. You could also try a cream cleanser instead of a gel/foaming one, which tend to be more drying. My favorite for my dry skin is the La Roche Posay Toleriane hydrating cleanser. Also, only cleansing once a day at night is enough.",
        "score": 60,
        "is_top_level": true
      },
      {
        "author": "salebleue",
        "body": "Immediately stop cleansing. Just splash your face with water. If you have makeup on at night double cleanse with JUST the oil. Dermalogica has a gentle cleansing oil - although its a bit pricey at 65.00. If you’re able start taking selenium and vitamin c & d do so. You’ll see your skin respond better. Next use a mild cream or vanicream as your derm suggested and lightly layer with aquafor at night. The tricky part is sunscreen so avoid the sun or use a very very gentle one during the day such as EltaMD",
        "score": 29,
        "is_top_level": true
      },
      {
        "author": "FluffyCatPantaloons",
        "body": "I would suggest ditching all K Beauty for now and go to Avene. You can find information and product suggestions on this [page](https://www.avene.com.au/all-families/face-care/skincare-for-hypersensitive-skin).",
        "score": 21,
        "is_top_level": true
      },
      {
        "author": "Critical_Impact",
        "body": "I'd suggest doing your own research but perhaps something with urea in it, it's possible your skins natural barrier is borked and urea is known to assist with that. 5% urea is where you'd want to start",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "nikkip_md",
        "body": "I think what you need to do first is let your skin barrier heal. I suggest just using water to cleanse your face followed by a moisturizer. Vanicream is a good one for sensitive skin but if you worry that you’re going to react to it as well, you can try petroleum jelly instead. I’ve prescribed that to babies with extremely sensitive skin.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "kletskopke",
        "body": "When my skin is very angry, I reach for La Roche Posay cicaplast B5 Baume or anything Eucerin has with urea.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Georgiapeach_20",
        "body": "Try Avene cicalfate!!",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Westbrook_Y",
        "body": "Buy products for sensible atopic skin with no irritating ingredients. I was recommended Lipikar from la roche posay, the balm and cleansing gel. It can be used on face and body.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "JealousLuck0",
        "body": "I've been there. my barrier was completely destroyed. Skin oily and slick, yet at the same time my skin was literally peeling off in some areas from dryness.\n\nI began mixing the Bioderma Intensive gel-cream and the URIAGE Insulating/repairing cream and spreading that liberally all over my face. it soaked in, and it took only a short time until the redness died down and only about a week before the oil/dryness began levelling out. It was extremely healing and worked very quickly.\n\nthe gel-cream was just a very neutral, very simple, glycerin-based gel and the repairing cream was this extremely thick cicaplast-ish ointment with healing zinc and panthenol in it that was very difficult to spread on its own... but together worked really well. \n\nthis worked for me, good luck to you OP :)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "nemicolopterus",
        "body": "I haven't seen anyone recommend this but if it is an allergic reaction you don't want to talk w a derm you want to see an allergist. They can do a more extensive patch test and also will have way better recommendations than derms for allergies. I have a ton of contact dermatitis allergies and derms were useless for years. Then I saw an allergist and my life changed! Definitely recommend seeing an allergist.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Lavalanche17",
        "body": "Whenever this happens I stop everything and just put on sudocrem. It's medical zinc cream. The only thing that ever helps.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "hurray4dolphins",
        "body": "When I could find NOTHING that worked when I had perioral dermatitis I found that zinc was an amazing, soothing, skin healer for me.\n\nMy dermatologist was like \"hmm..that's unusual\" when I told him it cured my perioral derm but honestly it has helped like at least  5 other people who I have told about it. So I don't think it's unusual I think it's just not studied. Also, oral zinc might help.\n\nI use Aveeno positively mineral sunscreen for faces, which is 20% zinc. The bad part is, zinc is not moisturizing. The good part is, after I did a couple weeks of just zinc sunscreen I was able to add in some hyaluronic acid (the ordinary) and then later added moisturizer (confidence in a cream-the old formula) and they didn't give me a rash or make me break out. Hurray! \n\nWhen I first started I put it on at least 3x/day.plus I took oral zinc supple.ents. Whenever I felt irritated I put the sunscreen on. I didn't use other products and didn't wash it off at night- I was scared of cleanser. The zinc made my perioral rash get kinda flaky but then the flakes fell off and it looked kind of better underneath. That flaky cycle happened 2-3 times then everything was looking and feeling a lot better.  After a couple weeks I went down to 1 application of zinc. It looked healed but I  continued the 1/day zinc application for a few months and also still use it occasionally or if any irritation comes up.\n\nI hope you find something that works for you!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "LaylaPawli",
        "body": "Does it itch. Could it be seborrheic dermatitis? I developed SD in my mid 30’s and had a terrible flare up after using a new cleanser. Prior to the flare up I knew something was going on, but it wasn’t that bad. After that first flare up my skin became extremely sensitive. I have to stick to a very basic skincare routine. Gentle cleanser, gentle moisturizer, sunblock (took me a while to find one that didn’t irritate my skin) in the morning and salicylic acid at night. Nizerol shampoo on my hair every other day to fight the SD and will occasionally put the shampoo on my face when I’m in the midst of a bad flare up. \n\nAnother thing that helps is avoiding sugar and gluten. The sugar feeds the yeast.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "pretty-late-machine",
        "body": "My miracle cure for a broken skin barrier is plain old Vaseline. I only need to use it for a couple of days, sometimes just one night, before my skin goes back to normal. I have extremely acne-prone skin, and I do begin to notice some clogged pores if I use it for an entire week. But just a couple of days does not hurt, and it's generally well tolerated, so I recommend you give it a try in addition to a minimal skincare approach others have recommended.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "krebstar4ever",
        "body": "Try Vanicream Moisturizing Ointment, maybe. Unlike the cream and lotion, there's no water in it. It's just an excellent occlusive barrier that people use after procedures like intense chemical peels.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "justasillygoofygirl",
        "body": "this happened to me at one point - my skin was bright red, i had cystic acne, and simultaneously the top layer of my skin was flaking off like a sunburn. even the most simple and “sensitive skin” products burned. i stopped literally everything except vanicream for a few months, then i added a rly basic cleanser. never add more than 1 product at a time and my personal advice is use it for 1 menstrual cycle before introducing another (bc then u can kno if it’s causing a breakout or if it’s pms). the person who gives me facials now (about a year after all this happened) has had me an an oil into my skin routine (i can find the brand if u like) and advised me to not add anything else for another few months for my skincare barrier to heal. \n\ntldr my non professional advice is to do as little as possible on ur skin product wise for a rly long time so u have a lot of time to heal. and maybe look into stress and autoimmune issues as well.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "thesilkywitch",
        "body": "Try the Vanicream cream or lotion, both are affordable. And cleanse your face with warm (not hot) water. Use a gentle cloth to dab the skin, don’t rub, and leave it a little damp when you apply moisturizer. \n\nHope this helps.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Camgirlbridge",
        "body": "I would also say, stop using sunscreen or make up whilst your skin heals. These things are both irritating to my skin when it's damaged",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "LaceyBloomers",
        "body": "Ok, it’s back to basics time. I highly recommend that you splash your face with plain, cool water, gently pat with a clean towel, and apply Aveeno Eczema Therapy Cream in the tube, not the one in the jar. You should see improvement within 2 days.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "9runswithscissors",
        "body": "Vanicream is one of the best products you can use for your skin. It’s not a popular product you’re likely to see on beauty videos but anyone in the sensitive skin community knows why it’s widely recommended by doctors. It’s got skin ingredients to rebuild your skin barrier. I feel your frustration: I have had rosacea flare ups that sound exactly as you describe, minus the pus on hands. (If that happens again, I suggest using one side of a washcloth against your face or wearing gloves when cleansing.) Flare ups left my skin peeling, burning and angry. Like you, sweat would sting, which to me, indicates no barrier or small openings in your skin.  \n\nLa Roche Posay is another amazing line… you can get from Ulta, Target, Amazon. \n\nWhen skin is irritated, think simple and basic. Nothing with color or scent. To repair my barrier took stripping down to absolute basics, included unscented laundry soap and keeping my hair away from my face… I swear my shampoo was irritating my skin at one point. \n\nDoctors will rarely suggest anything from beauty video, although many derms on You Tube make their own and suggest products. They usually suggest the most basic items, that anyone can get. I would stop the K beauty items immediately.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Lilly_G169",
        "body": "This is an old post, but I wanted to share my experience and help in case someone hops onto this thread searching for answers!\nSame thing as OP, everything burned or irritated my skin. My skin barrier was destroyed.\nSuch an underrated brand, but went to a new dermatologist to find answers. I won’t list out the diagnosis, but rather her recommendation. \nShe has me using Dermalogica oil to foam cleanser, ultra calming toner mist, and the stabilizing repair cream (all Dermalogica). My derm said anytime I feel my skin itchy or irritated through out the day, just spray the toner. First use, my skin didn’t burn for the first time when putting a product on. Two weeks in, my skin feels comfortable and is on its healing journey. \nThis may not work for everyone, but for me and my incredibly damaged skin barrier, it really helped me. I’ve had issues for 4 years and it’s the first time my face skin doesn’t hurt.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "eyewhycue2",
        "body": "Have you looked into barrier repair with castor oil? I would stop cleansing and just use water. Let your skin repair itself.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Camgirlbridge",
        "body": "For dry irritated skin I would not recommend anything with Hyaluronic acid. It can pull moisture from the skin and make everything worse. You need just medicated cream and no drug store products. When my skin is super dry and my skin moisture barrier is damaged, I cleanse with an emollient like epaderm ointment (I'm in the UK) and moisturise with a neutral cream like E45 or the epaderm cream. Maybe some shea butter or squalane oil for extra moisture. That's it. Water can be drying so I apply an oil before I shower too. It will feel like your skin isn't ever fully clean, but that's what you need whilst it heals. I'm suprised your derm hasn't recommended this.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "CrazyLush",
        "body": "My first thought was Seborrheic Dermatitis\n\nI had a look at one of your other comments about reacting to the Etude house cleanser, the ingredient you mentioned they added to the new formula can have a contact dermatitis reaction in some people (It may have caused no issue at all if you were putting it on healthy skin, but it was used on broken skin, which would have made things worse) I'm not sure what your timeline was with using those two products, but irritant contact dermatitis can get pretty unpleasant - including oozing and yellow crusting  \n\n\nEdit to add: When you had the allergy test done, were you tested for ingredients that are similar to cocamide DEA? Anything else with fatty acids from coconuts?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "iac12345",
        "body": "Vaseline - white petroleum jelly - and nothing else for a few days.  Just a very thin layer on damp skin, mix with a little water to help it spread if needed.  It's the gold standard of neutral occlusive (for example any medication that comes in ointment form).  It was the only thing I could use after laser resurfacing treatment for a couple weeks (they were a little too aggressive - I looked like a burn patient for a week).\n\nIt's not very elegant looking - does not pair well with makeup - but it will give your skin a chance to recover.  Once your skin is looking / feeling better, reintroduce products (any products - cleanser, toner, moisturizer, etc.) no more than one per week.  That will allow you to pinpoint which product is causing a reaction, if any occurs.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Sarah_1111",
        "body": "Try to see if your dermatologist can prescribe you Epicerm. It’s a barrier repair emulsion",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ecstatic-Drink-2603",
        "body": "i mixed acne treatment and after that my face broke out in redness and flakes and every time i adjust my mouth my whole face hurts. what should i do?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 30,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "thenetherlands",
    "post_id": "107xmnb",
    "title": "Wanhopig op zoek naar verzorgingsproducten zonder kokosschuimmiddelen",
    "url": "https://www.reddit.com/r/thenetherlands/comments/107xmnb/wanhopig_op_zoek_naar_verzorgingsproducten_zonder/",
    "score": 53,
    "num_comments": 72,
    "created": "2023-01-10T02:14:25+00:00",
    "body": "Hoi allemaal, ik ben een maand geleden gediagnosticeerd met een contactallergie voor ALLE schuimmiddelen op kokosnoot basis. Ja, echt ALLE. Ik heb álles geprobeerd wat ik kon vinden en heb mij laten testen bij de dermatoloog. Ik ben mij nu al ruim een maand lang beu aan het zoeken en ik kan simpelweg geen goede verzorgingsproducten zonder dit vinden! Ik krijg zeeën van onzin als ik probeer te zoeken naar producten zonder kokosschuimmiddelen. En het helpt ook niet dat veel websites gewoonweg geen ingrediënten neerzetten voor hun producten. Dus ik vroeg mij af of er hier iemand is die wél wat middeltjes kent.\n\nIk ben op zoek naar:\n\n* Vloeibare handzeep (het liefst mild i.v.m. eczeem)\n* Zeep voor huid onder de douche\n* Shampoo (haartype is droog, fijn, golvend, lage porositeit, niet geverfd of gebleekt)\n* Conditioners\n\nTandpasta heb ik godzijdank wel kunnen vinden (lang leve Oral-B!) Zeepblokken werken goed totdat ik deze ergens naartoe moet nemen waar kokosschuimmiddelen gebruikt worden. Dan breekt de eczeem op mijn handen weer los ivm kruisbesmetting, zelfs door kleine hoeveelheden restanten in de omgeving. En om nou iedereen die ik ken te vragen om over te stappen naar producten waar ík allergisch voor ben, vind ik nogal ver gaan.\n\nAlle hulp wordt zeer gewaardeerd!\n\nWat bekende kokosschuimmiddelen zijn:\n\n* Cocamidopropyl betaine (a.k.a. Tegobetaine L7, CAPB, Cocoyl amide propyldimethyl glycine, Coconut oil amidopropyl betaine, N-cocamidopropyl-N,N-dimethylglycine hydroxide inner salt)\n* Coco glucoside\n* Coco betaine\n* Cocamide DEA\n* Decyl glucoside\n* Cocamido sulfosuccinaat\n* Cocoamphoacetate",
    "flair_text": "Question",
    "flair_template_id": "4f3ff3fe-00d3-11e5-b17b-0e41ca822e81",
    "comments": [
      {
        "author": "Business_bunny",
        "body": "Aleppozeep. Dat is gemaakt van olijfolie. Het schijnt dat een hoog lauriergehalte goed is voor de onrustige huid. Je kan hier ook je haar mee wassen. Een spoeling van azijn (1 scheutje op een liter water) maakt daarna je haar zijdezacht.",
        "score": 70,
        "is_top_level": true
      },
      {
        "author": "visvis",
        "body": "TIL dat letterlijk alle cosmetica bij mij in huis kokos bevatten. Wat een vervelende allergie, hoop dat je een goede oplossing vindt!",
        "score": 49,
        "is_top_level": true
      },
      {
        "author": "Hrambert",
        "body": "Mijn ervaring is dat blokken zeep zoals Aleppozeep, shampoo bars, maar ook afwasmiddel blokken exact beschreven hebben wat erin zit. Ik gebruik al een paar jaar Aleppozeep en ben daar erg tevreden over.   \nBijkomend voordeel is dat je geen zeep met toegevoegd water in een plastic fles krijgt.",
        "score": 19,
        "is_top_level": true
      },
      {
        "author": "MnemosyneNL",
        "body": "vli dat zelfs \"sulfaatvrije\" shampoos nog sodium cocosulfaat bevatten en dus sulfaten. Wat een hoax!\n\nIk weet dat je liever geen blokzeep gebruikt maar als je de geur van mandarijnen lekker vind kan ik deze wel aanbevelen:\nhttps://www.thebodyshop.com/nl-nl/lichaam/zeep/satsuma-cleansing-face-body-bar/p/p108007\n\n\nVoor je haar zou ik hier eens kijken:\nhttps://www.hairstory.com/products/new-wash/\n\nHun ingrediëntenlijst is wat chaotisch maar ze zijn juist gericht op mensen die allergisch zijn voor deze schuimmiddelen.\n\nSucces!",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "druppel_",
        "body": "Weet geen van de producten helaas. Wat een irritant ding om allergisch voor te zijn, pff. Aan de andere kant fijn dat je weet waar je allergisch voor bent.\n\nMss weet je dit al, maar vergeet ook niet om je wasmiddel te checken. (vgm is neutral poeder wasmiddel okee, maar vloeibaar niet, dus mss heeft poeder minder vaak 🥥?).",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Wonderful-Call-9951",
        "body": "Ken je de app Inci beauty? Hier kan je per productsoort filteren, zien welke ingrediënten erin zitten en (met een premium account) ingrediënten uitsluiten. Zo kan je wellicht voor jezelf een overzicht maken van producten zonder de ongewenste ingrediënten. Hopelijk helpt het je!",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "aname94",
        "body": "Aleppo zeep is de enige zeep die ik ken die zonder kokos gemaakt is. Je zou eens verder kunnen zoeken naar zeep op basis van olijfolie. Als de ingrediënten er niet bij staan, misschien even de webshop mailen.\n\nWat betreft het meenemen van zeep bars snapte ik je probleem niet helemaal. Vind er kruisbesmetting plaats doordat je jouw zeep gebruikt op een plek waar zeep op basis van kokos gebruikt wordt? Als puur het meenemen een probleem is; er bestaan gewoon zeepbakjes om je zeep in mee te nemen. Jouw zeep hoeft dan niet in contact te komen met andere verzorgingsproducten.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "FaceEverything",
        "body": "Eucerin is voor zo ver ik kan zien “kokosvrij”, sowieso goed voor eczeem gevoelige huid, wel wat duur.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "7myzu81",
        "body": "Qua shampoo kan ik je helaas niet helpen, maar qua zeep onder de douche heeft Kneipp doucheolie geen van de namen op de fles staan. Het is een gele fles met \"Argan, Marula, wonderboom, Olijf\" er op. Prijzig maar vaak in een 2 voor 1 aanbieding te vinden. Mijn huid is heel droog en voor mij doet het wonderen. Succes!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ReleaseTheHouseTiger",
        "body": "Grahams is keiduur en op basis van havermout. Mijn dochter met eczeem gaat er wel heel goed op. Al 2 jaar een rustige huid.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "katzekatzekatz",
        "body": "Ik heb even in de badkamer gekeken, volgens mij gebruik een conditioner die vrij is van deze bestandsmiddelen: dr organic argan oil conditioner, vind ik ook fijn op mijn dunne, krullende haar. Bijbehorende shampoo is helaas wel met kokos. \n\nVoor de zekerheid wel even checken hoor, het zijn kleine lettertjes haha.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Old_Caramel339",
        "body": "Verdiep je eens in de verzorgingslijn van Zarqa.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Elynasedai",
        "body": "Holland & Barrett heeft veel en de ingrediënten zijn goed beschreven op de site. Misschien zit daar wat bij?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "LightsReflection",
        "body": "Herbelle heeft vloeibare Aleppo zeep die zowel voor hand en lichaam te gebruiken is.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "-Apocralypse-",
        "body": "Ik vind in mijn badkamerkastje een alu bus Etos shower foam Eucalyptus zonder de door jou genoemde allergenen.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SkittleDucks",
        "body": "Ik kan de producten van the ordinary aanraden! Qua conditioner, shampoo en body wash is er van elk maar één soort beschikbaar. Maar, ik zag geen van de genoemde ingrediënten staan in hun lijst :) Voor de rest kan ik alles wat onder Deciem valt zeker aanraden!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "9999lulu",
        "body": "[Deze conditioner](https://curlygirlfriendly.nl/products/shea-moisture-manuka-honey-yogurt-hydrate-repair-conditioner-305-ml) lijkt te voldoen. Gebruik em zelf, werkt prima.\nDiezelfde website heeft veel shampoos en bij alles duidelijk de ingrediënten staan. Veel voor krullen maar aangezien je zelf golvend haar hebt is het misschien een match.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Pret_",
        "body": "Kérastase Bain shampoo? Lijkt niet te hebben wat jij omschreven hebt. Zelf een liefhebber van deze shampoos",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "cravenravens",
        "body": "Mijn kinderen met eczeem gaan goed op deze douchelotion, ingrediënten lijken me kokosvrij als ik het zo zie: https://fagronderma.nl/product/licht-vettende-bad-douchelotion-groninger/\n\nMaar dat is dus niet iets in een vrolijke verpakking met een lekker geurtje oid.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "wausmaus3",
        "body": "Zoekopdracht: ''soap without coconut'' geeft me echt heel wat resultaten. \n\n[https://sensitiveskinoasis.com/all-coconut-free-personal-care-products/](https://sensitiveskinoasis.com/all-coconut-free-personal-care-products/)\n\nMisschien een rare vraag, maar heb je ook gezocht in het Engels?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "kelowana",
        "body": "Kijk bij lush, daar kan jij alle ingrediënten zien voor elke product. Een oude vriendin was ook allergisch tegen iets, zij heeft daar het meeste van haar verzorgingsproducten gehaald.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Jeansy12",
        "body": "Ik ben ook allergisch voor cocoamdropropyl betaine (samen met een aantal parfums zoals limonene), het zit echt in alles (vergeet niet je schoonmaakproducten te checken).\n\nIk ben zelf overgestapt of douche olie en heb 1specefieke vloeibare zeep van dettol die ik kan hebben.\n\nHet is even zoeken, maar zodra je je producten hebt gevonden is het een stuk minder frustrerend.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "DragonflyOk2876",
        "body": "Ik ben allergisch voor vloeibare zeep, uitsluitend harde zeep voor handen wassen werkt bij mij het best. Mijn favoriet is Werfzeep.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "diesSaturni",
        "body": "Of een [zelfmaak recept voor shampoo](https://doepserleven.nl/zelf-je-eigen-shampoo-maken/#:~:text=De%20basis%20van%20je%20eigen,geheel%20even%20afkoelen%20en%20klaar!)?   \nOoit mensen gezien die zo bescheiden mogelijk wilden leven, en wat je zelf kon maken dan ook niet in de winkel kochten.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MrMaverick82",
        "body": "Hier al eens gekeken? https://www.dr-jetskeultee-skincare.nl",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Eeeevee",
        "body": "Groene zeep? Heb wegens een allergie voor iets in zeep ook mogen experimenteren, en die doet het voor mij best oke als meeneembare handzeep, allesreiniger en handafwasmiddel. Extra bonus: goedkoop. Of ie mild is voor eczeem weet ik niet.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Qiwi3",
        "body": "Je zou zelf producten kunnen maken. Zeep is heel goed te doen. Ik maak vaak Castillezeep van 100% olijfolie. Duurt wel lang voor je zeep klaar is, als het sneller moet kan je ook naar andere soorten olie kijken. Je kan ook verschillende soorten olie gebruiken. \n\nIk heb zelf shampoo gemaakt met behulp van het boek 'Zeep' van Marta Tarallo en dat werkt super goed (en is wel snel klaar). [link](https://waar.shop/product/zeep-zelf-natuurlijke-zeep-shampoo-en-beautyproducten-maken/?gclid=Cj0KCQiAtvSdBhD0ARIsAPf8oNmys1koRxk6RLG6zsq9N7MNdyCQGJWx6CUBOPjkY3fAG4E7Jzj_FXEaAlorEALw_wcB)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "pindakaasbroodjes",
        "body": "mijn vader is ook allergisch voor kokos en parfum dingen: hij gebruikt neutral",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "simian_fold",
        "body": "De doucheolie van Nivea is zonder schuimmiddel, deze gebruikt mijn vrouw ook die een cocamidopropyl (wat dan ook) -betaine allergie heeft",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "TheOnsiteEngineer",
        "body": "Het is sowieso bedroevend hoeveel producten tegenwoordig enorme hoeveelheden kokosolie en daarop gebaseerde producten bevat. Zou voor de ontbossing en het milieu een stuk beter zijn als we dat ook eens flink zouden reduceren.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 30,
      "top_level": 30,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "th4u4s",
    "title": "[Review] Rejusure 2% Salicylic Acid Face Wash",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/th4u4s/review_rejusure_2_salicylic_acid_face_wash/",
    "score": 38,
    "num_comments": 12,
    "created": "2022-03-18T16:07:03+00:00",
    "body": "[Packaging and product texture shots](https://imgur.com/a/F6hqmpb) \n\n#Review type \nMixed overall - negative considering the exfoliating claims, but a good soothing cleanser 🤔 WRP. It does \"help to reduce the acne\", as they claim. Just not in the exfoliating _way_ they claim. Read on to find out why 😂\n\n#Skin type\nOily. Sensitive, malassezia (fungal acne) - prone, PIE/PIH-prone, mildly acne-prone\n\n🐳 Age: 30\n\n🐳 Current climate: Hot and dry-ish\n\n#Usage timeline\nStarted using it in April 2021, finished it in March 2022, so that's almost a year. Crazy, right? 😂 Used it twice or thrice a week, as I would any exfoliating cleanser\n\n🐳 Price: ₹350 \"retail\", always available for less. Currently ₹199 for 100 ml [on Amazon](https://www.amazon.in/gp/aw/d/B08XQRLX3K?psc=1&ref=ppx_pop_mob_b_asin_title) \n\n#Ingredients\nDecyl Glucoside, Lauryl Glucoside, Cocamidopropyl Betaine, Glycerin, Cocodiethanolamide (Cocamide Dea), Propylene Glycol, Gelpol Et-1/​ Acrypol Et-1(Carbomer), Fragrance, Salicylic Acid, Phenoxyethanol, Triethanolamine, Demineral Water\n \n(Had to get it off INCI decoder, the website lists \"Full ingredients list\" as: 2% salicylic acid, 5% glycerin 🙃) \n\n#User experience\nAs a general cleanser, a very nice experience that reminds me of the similarly affordable Clean & Clear Natural Bright face wash (the one with rosewater), that also has a good amount of glycerin. The Rejusure lathers slightly less, even. The Clean & Clear cleanser is one I currently use, and often repurchase, so this is a good thing. \n\nHowever.\n\nI used it up, over the year, and it did absolutely nothing beyond cleansing. No salicylic acid action. Yes, I tried leaving it on for a minute - nothing. \n\nWith the whole bottle over and the review to be written, I finally tested the pH of the stuff, and it's at a pH of 8-9. Before you're horrified, I then realised that face wash is applied on a wet face, and therefore, what my skin is exposed to is far more diluted and milder 🙃 So I tested that as well, [and here are the pH results](https://imgur.com/a/f9Bhg4p). A fine way to finish the bottle up! \n\nThe lathered up product tests at a nice 6.5 👍🏽 Not quite \"skin-identical\" 5.5, but not far off. I believe the mild alkalinity contributes to the good, medium strength cleansing action. \n\nBut here's what the [Paula's Choice website](https://www.paulaschoice.com/ingredients/ingredient-salicylic-acid.html) has to say about salicylic acid and pH:\n>Salicylic acids works most effectively as a leave-on treatment, ideally within a pH range between 3 and 4. Rinse-off salicylic acid cleansers typically have a higher pH, which likely won’t offer much of an exfoliation benefitnot to mention the contact time with skin is very brief - but the salicylic acid may at least offer skin-calming benefits in this form and can be included in amounts as low as 0.5% to achieve this benefit.\n\nThis face wash is literally basic. Alkaline. Which, hilariously, is what makes it a basic face wash 😂 No exfoliating action. But likely some skin-soothing effect! \n\nI started using an affordable 2% SA serum this month (to be disclosed and reviewed at a later date 👀), that's caused purging and everything. Tested at a pH of four. Very nice. I do know there's salicylic cleansers out there that are more exfoliating, at the right pH and what not, but I personally would get some kind of leave-on, if I'm really hoping to see an exfoliating impact from salicylic acid ☺\n\n#My thoughts\nIf you want a gentle face wash to use every day, sure. The bottle even says to use twice a day, which would be overexfoliating if their pH was at an effective level, but is just fine considering the active isn't gonna be active 🙃\n\nIt may work for acne in the soothing sense. We tend to underestimate the impact of anti-inflammatory treatments, and overestimate that of exfoliants - leading, as many of us have experienced, to over-exfoliation, barrier damage, and/or dehydration 😅 Hydration and soothing often go a very long way to healing acne and breaking the inflammatory cycle. I mean, the whole Korean skincare approach is based on that, and I've come to see that as a sustainable, practical relationship to have with my skin ❤ It works! \n\nI'm not personally super hung up on 5.5 pH balanced facewashes, because AFAIK, the skin reasserts its pH quite easily within a few minutes, since it's washed off so fast anyway, and I think 6-6.5 is the usual pH (will be testing some others to assuage my own curiosity, so I'll update this post if I learn otherwise). If you are very particular about that kind of thing, this isn't the cleanser for you. \n\n... The kicker is, I might repurchase it after all, as a gentle and soothing foaming cleanser. I'd like to see how soothing it really is, when used twice daily 🤔\n\nThe Clean & Clear one is sometimes hard to find, and doesn't have the added soothing benefit of salicylic acid... it's also possible I'll just move on to products that do exactly as they claim. Who knows what the future holds. Not I. \n\nHope this was helpful and/or interesting ☺❤ K, byee!",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "DismalArachnid9",
        "body": "Great review OP! Thanks for helping me take another thing off my wishlist xD\n\nI was looking for a replacement for my Kaya SA facewash and was leaning towards leave on products. The catch is I want it to also include GA (or another AHA), come in a spray bottle (or otherwise be easy to apply, none of those serums for me no sir), be reliable and cheaaap. Which seems to be a tall order, because the only things that meet at least 3/4th the criteria are wash off products 😭",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "jacoblab1",
        "body": "great review! I went ahead and submitted it to SkinSort as well: \nhttps://skinsort.com/products/rejusure/2-salicylic-acid-face-wash",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "The_one_who_is_high",
        "body": "Wowwww, Sucha detailed review. Thank you for sharing the PH info as well. Great work OP!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "__IKnowNothing",
        "body": "no way you're 30 WHAAAAAAATTTTTT",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Elegant-Reveal4650",
        "body": "in this post u mentioned how u were using a 2 percent SA serum that caused purging, would u mind telling me the experience u had with the serum and are u still using it",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AutoDetailing",
    "post_id": "1i59m2e",
    "title": "First Step in Rinseless ",
    "url": "https://www.reddit.com/r/AutoDetailing/comments/1i59m2e/first_step_in_rinseless/",
    "score": 34,
    "num_comments": 21,
    "created": "2025-01-19T21:28:48+00:00",
    "body": "\\*\\*\\*Disclaimer: This post is not an Ad, review. or discussion of technique. I'm a consumer.  I find researching the chemicals enjoyable and informative for my purchasing decisions. If company X has 'proprietary' chemical Y which is the most \"insane/GOAT/perfect\" thing ever good for them... but if they don't list their ingredients it's hard for me to determine if I want to spend my money trying the product.\n\nI care about the quality of surfactants and lubricants (am I paying Hagen-Daz prices for Hersey), the ability to concentrate them for greater cleaning/lubricity when needed, and safety for myself, my kids(even if accidentally) and my paint. Too much choice in the market to pick any harsh irritant or potential carcinogen.\n\nHope others can offer their own opinions/analysis.\n\nEdit: Updated with RRW, will update table as able. If anyone has SDS for Pheonix and Ethos feel free to share.\n\nEdit 2: RRW updated, I had the carwash SDS\n\nAlso just want to make sure I'm clear: I'm not suggesting products are unsafe for using certain surfactants/acids. Rather that its always best to know what's in your products so you can choose. We have a lot of choices in the market these days. Some of us use dawn to clean others use \"bio\" alternatives. Both great.\n\n# Rinseless Wash Chemical Analysis(SDS Sheet)\n\n|**Product**|**Surfactant System**|**Lubrication**|**Safety Concerns**|**Raw Material Quality**|**Synergy at Dilution**|**Key Observations**|\n|:-|:-|:-|:-|:-|:-|:-|\n|**DIY Rinseless**|\\- Anionic (SLES-type) plus Butoxyethanol|May rely on surfactant + solvent; No info on polymers used in SDS|Moderate eye/skin irritant; no carcinogens|Commodity (older tech)|Potential for streaking, can be harsh if concentrated|Cost-effective chemicals; stick to 256:1|\n|**Armour Detail Hero**|\\- Nonionic surfactant + Decamethylcyclopentasiloxane (D5)|D5 is premium silicone (slick, minimal residue)|Mild–medium irritant; no known carcinogens|Higher-end (specialty)|Performs consistently at various dilutions; forgiving formula|High quality, stronger when concentrated|\n|**Nemesis Rinseless**|\\- Anionic + Amphoteric, Cocamide DEA, PDMS silicone|PDMS silicone, slick less premium|Cocamide DEA = ?carcinogen, moderate–high irritant|Mixed commodity (older foam booster)|Effective cleaning synergy; PDMS for lubricant|Multi-chemical cleaning and lubrication; Prop 65 carcinogen concern?|\n|**ONR V5**|\\- Soy methyl esters, minimal classic surfactants|Bio-based esters|Generally mild; fragrance allergens (e.g., d-Limonene) can sensitize|“Green” approach, specialized|Likely synergistic at higher concentrations|Very different approach|\n|**ONR Hyperfoam**|\\- High-foam anionic blend (Sulfates), Cocamide MEA, CAPB|Foam-based lubrication|Irritating if concentrated; sensitizing preservatives|Commodity foam system|More foam, like a carwash soap|SDS almost identical to their car shampoo|\n|**Clean by Pan**|\\- High-level SLES-type (17–24%), fragrance, preservative|Surfactant; No info on polymers used in SDS|Skin/eye irritant (Cat. 2); no major carcinogen flags|Commodity|High Surfactant load at dilution|Concentrated SLES; stick to 256:1; avoid drying product on surface|\n|**Koch Chemie RRW**|\\- Nonionic surfactants (polymeric ethoxylates)|Nonionic surfactants provide, no silicone or polymers listed in SDS|Potential exposure to ethylene oxide, a carcinogen; generally mild; low skin/eye irritancy|High-end nonionic-based|Consistent lubricity and shine at dilution|Strong cleaning, protection, lubrication. ?carcinogen |",
    "flair_text": "Product Discussion",
    "flair_template_id": "8ca8bf66-482b-11ee-b16f-a68f0cb3d2cc",
    "comments": [
      {
        "author": "Atechwithnoname",
        "body": "We need more of this for all products.  Thank you.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "smackythefrog",
        "body": "I heard a lot of people raving about Armour Detail about a year ago. \n\nI may have to try them next. I'd been using ONR for years. It was good. Wanted something new. \n\nTried Pan's last month. Worked well and felt the same as ONR after the wash. I'll have to review pricing and see which is cheaper per ounce used compared to ONR. \n\nI'm gonna try Armour next. I didn't know Pan's Clean didn't have something for lubrication. I was planning on using a rinseless wash as lubrication for my first time using a clay towel next week and I thought Clean would do the trick. Maybe if I have some ONR laying around, I'll use that, otherwise I'll use Armour.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "janelgreo",
        "body": "Great information and of all the ones you listed Hero is my favorite. Would like to see info on my favorites: Phoenix EOD Hydra and Koch Chemie RRW.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "g77r7",
        "body": "They’re suppose to give California residents a list of all ingredients not just potentially hazardous ones but I’m not sure how they access that or how well it’s enforced",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "napkins34",
        "body": "Really makes you think, I don’t wear gloves on my weekly washes but if you were doing this for a living it would be beneficial to wear gloves",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "basroil",
        "body": "Just got a bottle of ONR hyper foam and I grabbed an ik foam sprayer. I used it as a pre soak for a regular onr wash I kind of like it. I’m not exactly sure if it’s better than when i just pre rinsed with regular onr but it looks cool and helps me identify spots I have missed with my brs. \n\nIt does feel different on my hands after I’m done though. Like I need to wash my hands after versus ONR where I may easily forget if my car wasn’t that dirty. Maybe I’ll start wearing gloves, wouldn’t be a terrible idea anyway",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "conkur_alvin",
        "body": "Phoenix Hydra sds I have, but for some reason I can’t link it. It is a file on my phone. Any other way to share link besides the url way?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "accountant-2312",
        "body": "Sorry folks updated RRW with the correct composition, of note the previous chemicals where in their re-activation shampoo",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Abu_Everett",
        "body": "See no reason to try the others beyond ONR. The original looks like a clear winner based on their SDS.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "3iai06",
    "title": "Do some people need sulfates for their hair type?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/3iai06/do_some_people_need_sulfates_for_their_hair_type/",
    "score": 30,
    "num_comments": 14,
    "created": "2015-08-25T03:54:09+00:00",
    "body": "I switched to an SLS free shampoo (say yes to carrots) about two years ago. I used their conditioner as well, and for a while, it made my hair nice and soft.  \n\nThen all of a sudden, my hair started to get extremely dry and tangled all the time. I am talking self dread locking, small animal around the nape of my neck tangled.  I first chalked it up to being winter and my jacket/scarf being the culprit, but as we moved into and through summer, same problem.\n\nI started changing conditioners, trying different ones, but nothing seemed to help.  I tried protien treatments and that seemed to help. Then I realized, it was not the protien treatment that was helping but the aphogee shampoo for damaged hair which had SLS in it. \n\n I have been experimenting with this theory and it appears that whenever I shampoo with the aphogee and my regular conditioner its fine.  If I use the SLS free shampoos I have, tangled, dry mess. I am thinking that the more natural shampoos just dont cut it (literally), I think there is junk left on my hair, which means that the moisture from my conditioner isn't penetrating in there and also that junk likes to stick to junk, causing tangling.\n\nIs there any rhyme to my reason or am I totally off base here? Is there another ingredient that may be causing this?\n\nApogee ingredients: Water, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Cocamide DEA, Sodium Lauroyl Sarcosinate, Oleamidopropyl PG-Dimonium Chloride, Glycol Distearate, Panthenol, Fragrance, Lecithin, Polyquaternium-10, Hydrolyzed Whole Wheat Protein, Hydrolyzed Soy Protein, Cocyl Hydrolyzed Collagen, Butyl Stearate, Oleoyl Sarcosinate, Sesame Oil, Lanolin Alcohol, Citric Acid, Sodium Chloride, Tetrasodium EDTA, DMDM Hydantoin, Methylparaben, FD&C Red #40.\n\n\nSY2C Shampoo ingredients: Water (Aqua), Lauryl Glucoside, Decyl Glucoside, Sodium Coco-Sulfate, Glyceryl Stearate SE, Daucus Carota Sativa (Carrot) Juice, Daucus Carota Sativa (Carrot) Seed Oil, Maris Aqua, Maris Limus Extract, Chamomilla Recutita (Matricaria) Flower Oil, Olea Europaea (Olive) Fruit Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Simmondsia Chinensis (Jojoba) Seed Oil*, Calendula Officinalis Seed Oil, Cucurbita Pepo (Pumpkin) Fruit Extract, Ipomoea Batatas Root Lees Extract, Cucumis Melo (Melon) Fruit Extract, Triticum Vulgare (Wheat) Germ Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Honey Extract, Punica Granatum Extract, Xanthan Gum, Citric Acid, Fragrance (Parfum), Sodium Benzoate, Potassium Sorbate \n\nSY2C conditioner ingredients: Water (Aqua), Cetearyl Alcohol, Glycerin, Cetyl Esters, Behentrimonium Chloride, Citrus Grandis Fruit (Grapefruit) Extract, Daucus Carota Sativa (Carrot) Seed Oil*, Aloe Barbadensis (Aloe) Leaf Juice, Punica Granatum (Pomegranate) Extract, Maris Water (Sea Water), Maris Limus (Sea Silt) Extract, Guar Hydroxypropyltrimonium Chloride, Tocopheryl Acetate, Sodium Hydroxide, Phenoxyethanol, Fragrance (Parfum). *Certified Organic Ingredient",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "RoosterCheese",
        "body": "Do you live in a hard water area?",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Panamoose",
        "body": "Okay, say Yes to Carrots still has sulfates, soo... Try an actual sulfate free shampoo?\n\nThe sulfate they use is supposed to be gentler, but the agreement here seems to be that it's not. It seems like it might actually be stronger than the other shampoo you were using, and is drying out your hair. I use it as a clarifying shampoo, myself.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "BizSib",
        "body": "Sulfate free shampoo makes my hair terribly limp and weighed down.",
        "score": 8,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "ccz7mc",
    "title": "I'm allergic to coconut and all coconut derived products. I have been really struggling finding a curlygirl friendly conditioner that has no coconut derived ingredients. Please help!",
    "url": "https://www.reddit.com/r/HaircareScience/comments/ccz7mc/im_allergic_to_coconut_and_all_coconut_derived/",
    "score": 27,
    "num_comments": 11,
    "created": "2019-07-14T05:02:02+00:00",
    "body": "Hi, I would really appreciate some advice and recommendations.\n\n\nAs said in the title, I'm really allergic to coconut and anything coconut derived. This includes the ever present coco-betaine, as well as coconut diethanolamide, cocamide sulfate, cocamide DEA, CDEA, and basically anything else with \"coco\" somewhere in the name. In addition, I'm very sensitive to SLS (sodium laureth sulfate). \n\n\nI didn't have this problem nearly as much years ago as there were a lot of products that relied on palm oils or hemp oils and such, but it seems that coco-betaine has really taken the haircare world by storm and I am really struggling now to find any haircare products that don't contain either coconut derived ingredients or that don't contain SLS and similar acne/itching inducing sulfates. All products I used to use from child to adulthood that my hair loved have now reformulated to use coconut based cleaners. Don't get me wrong- ethically and environmentally I support the move away from palm oil etc, but it puts me in a serious bind! \n\n\nThe extra injury to insult is that I was hit by a semi truck two years ago that left me with a traumatic brain injury and I'm still struggling to recover. One of the things I still really have trouble with is reading, and searching through long complicated ingredient lists for any and all of the many forms of coconut is a task that seems precisely calculated to be what I'm worst at. This means that I keep making mistakes and buying products that I think are safe, or, I've checked ingredients online and they check out but then I start having a reaction and realize that what I bought at the store has the same name but a different ingredient list than what I read about! My fiance has been an absolute saint helping me with so many daily tasks and with the medical and insurance paperwork that I've been overwhelmed with in addition to supporting us both since the accident that I feel terrible asking him to devote even more time to meticulously reading conditioner bottles when he has so much on his plate.\n\n\nSo, I'm hoping that the Reddit community might be willing to help me find a product that I can use and rely on! I really really appreciate your kindness in advance, I know it is an annoying task but I could really use your help.\n\n\n***\n\n\n**Hair type:** Thick, wavy probably 2A\n\n**Current Routine:** Trying to do co-wash only because a) my hair seemed to like it and b) I can't find a shampoo I can use anyway. Wash with conditioner every 3-4 days, squish to condish, rinse thoroughly (I still seem to break out on my back if I do any leave in)\n\n**Current product:** Shea Moisture raw Shea butter restorative conditioner\n\n**Current problems:** Although this conditioner miraculously doesn't contain anything I'm allergic to, I find that my scalp is really itchy and my hair is very dry and prone to tangling and breaking. It weirdly feels like I'm almost not even using conditioner it seems so rough and tangled even just after washing. I've also been having increasingly annoying dandruff and I don't know what I should do about it as I haven't had that problem before I had to switch from my last product when it started containing coco-betaine. I've also in the past used Garnier Whole Blends repairing conditioner \"honey treasures\" which is also ok allergy wise (at least, last I checked) but I found it left my hair fairly heavy and itchy too without using shampoo, and when I put it into the curly girl ingredient checker it says it's not very CG friendly.\n\nPlease let me know if you need any other information, I would very sincerely appreciate some help figuring out what to do!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "HerFabulousness",
        "body": "The one that I use (and the one my curly hair stylist swears by) is Long Hair Don’t Care.  I just read the list of ingredients and there’s no coconut anything in it, the only sulfate in it is behentrimonium methosulfate (which NaturallyCurly.com says is an ingredient that is safe for curly hair). The only place it’s sold (to my knowledge) is [here](https://www.etsy.com/shop/GoldiLochzShop), feel free to message the creator to see if he’s got any coming soon. It’s all handmade and I personally love it for my fine 2A type hair. Hope this helps!",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "rabdacasaurus",
        "body": "Not Your Mothers Tahitian Gardenia conditioner is what I use, its CG friendly and it doesn't weigh down my fine but curly hair. The conditioner seems to be OK for you, but stay away from the shampoo",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "fatbich",
        "body": "r/curlyhair might be helpful",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "beezusquinn",
        "body": "Try the Kristen Ess co wash and shampoo and conditioner. I think they either have parabens or sulfates but do surprisingly great for my waves and have no coconut. Also you may wanna go higher end and check out Redkens shampoos and conditioners I used to buy the liter bottles from Ulta’s liter sale and it was great for my damaged but curly hair. The Gold bottles so soft I think?",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "y7710a",
    "title": "Three Facewash I'll never Buy Again",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/y7710a/three_facewash_ill_never_buy_again/",
    "score": 28,
    "num_comments": 17,
    "created": "2022-10-18T13:25:23+00:00",
    "body": "Skin Type: Combination Skin\n\n**➡️Sage Apothecary Activated Charcoal & Tea Tree Face Wash**\n\n**MRP:** Rs. 549/- for 100 ml, but is always on discount on Amazon. Currently for Rs. 269/-. I had bought it as a trial from Smytten\n\n**Key Ingredients as per the brand:** Cherry Blossom, Charcoal Powder, Tea Tree, Aloe Vera leaf juice.\n\n**Ingredients:** Aqua\n Decyl Glucoside \nLauryl Sarcosinate\nCarbomer\nPhenoxyethanol\nSugar\nPropane Glycol\nGlycerine\nSodium Cocoamphoacetate\nDMDM Hydantoin\nPolyquat 10\nEDTA\nAloe Vera Leaf Juice\nActivated Charcoal Powder\nTea Tree essential oil\nPeppermint essential oil\nCherry blossom essential oil\n\n**Claims:** Paraben free, cruelty free, formulated with 100% natural ingredients\n\n**Texture:** Black liquid\n\n**Packaging:** Tube/Bottle\n\n**Usage:** For a few weeks\n\n**My Experience:** This was my first attempt at a charcoal based product. The idea that it removes blackheads & whiteheads from a mere face wash drew me in. But sadly, this didn’t do anything. \n\nI know that pores don’t open or close, but this facewash made me think as if they are opening wide. My skin looked weird. This facewash felt harsh, stinged my eyes that eventually I threw it away. \n\nI’ve gotta ask, Is it worth trying a charcoal based products or are they all farce?\n\n\n**➡️Plum Green Tea Pore Cleansing Wash**\n\n**MRP:** Rs. 495/- for 120 ml\n\n**Key Ingredients as per the brand:** Glycolic Acid, Green Tea Extracts, Natural Cellulose Beads\n\n**Ingredients:** Aqua (Water), Camellia Sinensis (Green Tea) Leaf Extract, Carbomer, Cellulose, Cocamide DEA, Cocamidopropyl Betaine, Ethylhexylglycerin, Fda Approved Colours, Fragrance, Glycerin, Glycolic Acid, Phenoxyethanol, Sodium Laureth Sulfate\n\n**Claims:** Free of parabens, SLS & mineral oil, vegan, cruelty free. Suited for oily, acne prone, combination skin\n\n**Texture:** Transparent liquid with green granules type beads\n\n**Packaging:** Tube\n\n**Usage:** A few times\n\n**My Experience:** It was pretty okay. I didn’t enjoy either the fragrance or the texture. It has tiny green granules, granules not beads that usually absorb into your skin on pressing between your fingers. Due to it, it has felt like a mild scrub than a facewash and I’m not comfortable using a scrub like product on my face daily.\n\nIt also felt mildly harsh on my skin, which is why after a few uses, I was easily turned off. \n\nI still have the product left, that I’m now using to clean makeup brushes. It might work on other skins, but not for me. \n\n**➡️Re’equil Fruit AHA Face Wash**\n\n**MRP:** Rs. 490/- for 200 ml\n\n**Key Ingredients as per the brand:** Fruit AHAs\n\n**Ingredients:** Aqua, Cocamidopropyl Betaine, Sodium Lauroyl Methyl Isethionate, Decyl Glucoside, Coco-Glucoside, Glyceryl Oleate, Aqua, Vaccinium Myrtillus Fruit/​Leaf Extract, Saccharum Officinarum (Sugarcane) Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Acer Saccharum (Sugar Maple) Extract, Betaine, PEG-120 Methyl Glucose Dioleate, Glycerin, Sodium Benzoate, Potassium Sorbate, Sodium Benzotriazolyl Butylphenol Sulfonate, Buteth-3, Tributyl Citrate, Disodium EDTA, Fragrance, Ci 19140, Ci 45100\n\n**Claims:** Free of parabens, sulphates, silicones & mineral oil.\n \n**Texture:** Yellow coloured fluid. (almost looks like Pee)\n\n**Fragrance:** No fragrance\n\n**Packaging:** Bottle\n\n**Usage:** A few times\n\n**My Experience:** This is the harshest facewash I’ve ever used in my life. The texture is so watery but generates foam easily after coming in contact with water. However, after every wash, my skin felt very tight, which  is why after a few washes, I stopped using it.\n\nSeeing as I still had some product left, I decided to use it instead of shower gel. Damn, My skin felt so smooth after first wash that since then, I’ve been using them as Shower gels for Bath. \n\nI wouldn’t recommend this facewash to anyone seeing how harsh it was compared to other facewash. So think before you buy.\n\n_________________\n\nThanks for reading 💕",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "MooseProfessional166",
        "body": "I dint like requill oil control facewash. I had more breakouts after using it. Plum facewash also dint suit me.",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "Fellow_Indian_",
        "body": "Same for Re'equil aha facewash. Thought it was really good the first time I used on face but actually realised it's drying out my skin like anything. Now I'm using it as an underarm aha wash",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Psychological_Major9",
        "body": "I have been using cetaphil oily cleanser so far the best it doest makes skin dry and cleans my pores a bit pricy but worth it",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Individual_Series173",
        "body": "I had opposite experience with Re’equil aha facewash. It was too mild and i felt it never cleansed my face properly so did not enjoy it",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Sandile95",
        "body": "What facewash are you using now?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Avaale",
        "body": "What's your skin type? Could you add it to the post?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "No-Staff-3168",
        "body": "I have used both the Re'equil face wash, the AHA and oil control one. I love both of them, skincare is so subjective.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1d3ewq",
    "title": "Finally found my holy grail cleanser for oily skin with large pores! Wanted to share.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1d3ewq/finally_found_my_holy_grail_cleanser_for_oily/",
    "score": 21,
    "num_comments": 30,
    "created": "2013-04-25T17:22:54+00:00",
    "body": "I ordered the SKin79 O2 BB Cleanser. It finally came in about 3 days ago. In the past three days of using it, I've already noticed drastic results. \n\nI'm normally *very* oily. I deal with large, clogged pores and lots of sebaceous filaments. Over the years I've tried innumerable cleansers and creams and treatments (some great, some terrible for my skin).  \n\nThis cleanser is pretty interesting and kind of fun to use. It comes out as a gel that you massage onto your dry face. For two minutes, while you leave it alone, it bubbles and foams by itself. It's pretty ticklish and entertaining. After 2 minutes, you massage it back down into your face, rinse with lukewarm water, and pat dry. \n\nI was a little skeptical that it would really cleanse off my makeup, but it actually does an amazing job. My skin feels clean and tight (but not in a bad way). In the past few days, I've noticed a remarkable reduction in oil production (I only have to blot once around midday and I *could* get away with skipping that and embracing the \"healthy glow\" if I wasn't so obsessed with a matte appearance) and my pores appear to be tightening back up, shrinking if you will. I've had no new irritations or breakouts and the ones that were healing appear to be healing a little faster than normal. I use it morning and night and for the first time in my life, when I wake up, my skin isn't oily. I'm all around astounded and I really just needed a place to gush (none of my guy friends really care all that much about the goos I put on my face). \n\nHave any of you tried this or any other Asian cleansers? How did it/they work out for you? Anything anyone knows that I should be worried about using this product (I'm always waiting for something awful to ruin the good things lol)? \n\nUpdate -\n\nIngredients: Water, Cocamidopropyl Betaine, Ammonium Lauryl Sulfate, Acrylates Copolymer, Cocamide DEA, Methyl Perfluorobutyl Ether, Methyl Perfluoroisobutyl Ether, Ethyl Perfluorobutyl Ether, Ethyl Perfluoroisobutyl Ether, Polyhydroxystearic Acid/Isononyl Isononanoate/Ethylhexyl Isononanoate/Sodium cocamidopropyl PG-Dimonium chloride Phosphate, PGE-7 Glyceryl Cocoate, Butelyn Glycol, Maackia Faureie Stem Extract, Acacia Senegal Gum Extract, Hamamelis Virginiana (Witch Hazel) Water, Vigna Radiata Seed Extract, Sodium Hyaluronate, Simmondsia Chinensis (jojoba) Seed Oil, Macadamia Integrifolia Seed Oil, Persea Graitssima (avocado) Oil, Camellia Japonica Seed Oil, Opuntia Ficus-India Extract, Sansevieria Trifasciata Leaf Extract, Punaca Granatum Fruit Extract, Ficus Carica (fig) Fruit Extract, Morus Alba Fruit Extract, Ginko Biloba Nut Extract, Lavandula Angustifolia (Lavender) Extract, Rosmarinus Officinalus (Rosemary) Extract, Origanum Vulgare Leaf Extract, Thymus Vulgaris (Thyme) Extract, Rose Canina Fruit Extract, Salvia Hispanica Seed Extract, Avena Sativa (Oat) Meal Extract, Phenoxyethanol, Fragrance, Xantham Gum \n\nI know a lot of people cry out against Lavender Oil because they heard it was cytotoxic (I was one of them until I started *reading* about the issue). I'm pretty certain the scare has to do with a misinterpretation of research. Lavender Oil was found to be cytotoxic *in vitro* to endothelium cells (lining the interior of blood vessels and lymphatic vessels) and fibroblasts. A 2005 study states: \"although it was recently reported that lavender oil, and its major constituent linalyl acetate, are toxic to human skin cells in vitro, contact dermatitis to lavender oil appears to occur at only a very low frequency. The relevance of this in vitro toxicity to dermatological application of Lavandula oils remains unclear.\" And in 2007 a team of European researchers testing photosensitivity in relation to lavender oil and sandalwood oil found: \"Lavender oil and sandalwood oil did not induce photohaemolysis in our test system. However, a few reports on photosensitivity reactions due to these substances have been published, e.g. one patient with persistent light reaction and a positive photo-patch test to sandalwood oil.\" So, please, spare me the diatribes about how \"terrible\" Lavender Oil is. I used to give them. And I was as misinformed as anyone else. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "valentinedoux",
        "body": "Can you post BB cleanser's ingredient list? I am not able to find anything on google.\n\nI'm skeptical with Skin79's products because it often claims that these are the main ingredients but when I received my products and the main ingredients are on the bottom after preservatives. It's kinda disappointing.\n\nFYI, any \"oxygen\" skincare products are just a marketing gimmick like Bliss and Dr. Brandt.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "laurililly",
        "body": "This may sound creepy, but are you by chance german or in Germany? I just ask because of your username. \nAnd if so, where do you get your products? :)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "red_wine_and_orchids",
        "body": "That's a fascinating ingredients list. Bit of a breakdown: \n\nCocamidoproyl betaine is a milder surfactant (detergent)\n\nammonium lauryl sulfate is a strong detergent\n\nAcrylates copolymer is a thickener\n\nCocoamide DEA is a foaming/emulsifying agent\n\nThe ethers might be the \"oxygen\" ingredients.  If you're interested more, I can dig into them, but they're fluorinated ethers, which seems..well..weird, off the bat.  They're usually used in industrial applications.  Digging around reveals that they are mild solvents good for solvating oils. \n\nButylene glycol would act as a humectant for your face to help combat that \"tight\" feeling from stripping off oils.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "yvva",
        "body": "Any kind of tight feeling after a cleanser means that it's stripping you, but if you love the cleanser keep using it, just add extra moisturizer. \n\n\nI love Missha Aqua Peeling Gel and Oslee Roship Hydra White Powder--neither give me a stripped feeling, both leave my skin very clean.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "valentinedoux",
        "body": "Thank you for the ingredient list. It kinda reminds me of [Murad Energizing Pomegranate Cleanser](http://www.murad.com/pomegranate-cleanser) but less ethers, extracts and oils.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ziakatt",
        "body": "I'm skeptical about any results observed after 3 days. (Well, other than allergic reactions, which can be quite fast, lol.)  If you are able to use this for a month and maintain the improvements/results I would very much be interested in another full review.  I am hopeful for you, OP!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "real-rainicorn",
        "body": "Is the cleanser still working for you? I can't deal with my shininess anymore, it's not even that warm yet :(",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "97qu6u",
    "title": "[Product Question] Care Cera Moisturizing Body Foam Wash",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/97qu6u/product_question_care_cera_moisturizing_body_foam/",
    "score": 19,
    "num_comments": 4,
    "created": "2018-08-16T09:33:39+00:00",
    "body": "I came across it while browsing the shelves at a supermarket and what caught my eye was the advertising.\n\nTaken from Mentholatum (Singapore)'s website:\n-Contains 7 Ceramides to provide deeper moisturisation to skin.\n-Dense and ultra-fine ceramide whip that cleanse skin gently.\n-Enriched with Tamburisutorikira leaf extract, Fuki leaf extract, chamomile flower extract\n-Skin feels instantly smooth and soft after cleansing\n-Weakly acidic and hypoallergenic.\n-Paraben-free.\n-Light floral scent to soothe your mind.\n\nAnd true enough, the ingredients includes ceramides (along with cholesterol and sphingosine):\nWater, PEG-80 Sorbitan Laurate, Sorbitol, Cocamide DEA, Disodium Cocoyl Glutamate, Sodium Taurine Cocoyl Methyltaurate, Sodium Cocoyl Glycinate, Cocamidopropyl Betaine, Cocamidopropyl Betaine, Sodium Chloride, Citric Acid, Fragrance, Phenoxyethanol, Phenoxyethanol, PPG-3 Caprylyl Ether, Disodium EDTA, Polyquaternium-7, Iodopropynyl Butylcarbamate, Dextrin, Ceteareth-25, Butylene Glycol, Glycerin, Cetyl Alcohol, Petasites Japonicus Leaf/Stem Extract, Tambourissa Trichophylla Leaf Extract, Behenic Acid, **Ceramide 3, Cholesterol, Ceramide 2**, Chamomilla Recutita (Matricaria) Flower Extract, **Ceramide EOS, Ceramide 6 II, Ceramide 1, Caprooyl Sphingosine, Caprooyl Phytosphingosine**.\n\nCeramides are quite a popular skincare ingredient- IIRC, it repairs the skin's barrier when it's compromised. It also seems to have gentle surfactants, which makes it even more promising for people with dry skin, like me haha. Has anyone tried it before?",
    "flair_text": "Discussion",
    "flair_template_id": "f5703f4a-459e-11e4-bd43-12313b0e84f5",
    "comments": [
      {
        "author": "doryfishy",
        "body": "I currently have this! \nHonestly I don't find this very moisturising. It's not too drying, but doesn't seem to do much for me :/ \nI probably wouldn't repurchase.  \n\nAlso I have doubts about the ceramides in the body wash, because I'm not sure how effective they will be when it's washed off in the shower.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Perioral_Dermatitis_",
    "post_id": "17om5l0",
    "title": "Hormonal acne AND Perioral Dermatitis: Ingredients to look out for!",
    "url": "https://www.reddit.com/r/Perioral_Dermatitis_/comments/17om5l0/hormonal_acne_and_perioral_dermatitis_ingredients/",
    "score": 12,
    "num_comments": 11,
    "created": "2023-11-05T21:25:57+00:00",
    "body": "I have been “blessed” with not one, but two skin issues… perioral dermatitis and hormonal cystic acne. Oh joy.\nI am 48 and now have the skin of a 12 year old boy who doesn’t bother with personal hygiene and lives on Snickers.\nAbout a year ago, this BS started. I’m not gonna bore anyone with this “journey” but there’s something I wanted to share with those who are going through this BS too… bc in the past year, I’ve researched everything it seems. First things first: see a dermatologist.\nSecond, there are things that may be making your skin even worse. Those who suffer from hormonal acne need to watch out for pore-clogging ingredients. Those who suffer from perioral dermatitis need to watch for irritants and allergens.\nI have compiled a list after reading a ton of medical crap that’s been put out there. Copy and paste in your notes and be on the look out. It’s difficult bc this s**t is literally in everything it seems…. so if you can’t avoid one or a couple, just make sure it’s at the bottom of the list!\nI even put it in alphabetical order for easy reference.🖤\n\nAcetylated (anything)\nAcrylic (anything)\nAmerchol L 101 (allergen)\nbenzaldehyde\nBenzyl alcohol (allergen)\nBismuth ocychloride\n2-Bromo-2-nitropropane (allergen)\nbutylparaben\nButyl stearate\nCetyl Acetate\nCetyl alcohol (fatty)\nCetyl alcohol (allergen)\nCetearyl alcohol AND Ceteareth 20\nChlorocresol (allergen)\nCocamide DEA (allergen)\nCocamidopropyl betaine (allergen)\nCocos Nucifera (coconut oil!)\nC12-15 Alkyl Benzoate\nD & C red dye 27 and 40, 9\nDecyl glucoside (allergen)\nDecyl oleate\nDenatured Alcohol\nDiazolidinyl urea (allergen)\nDimethylaminopropylamine(allergen)\nDMDM hydantoin (allergen)\nEthoxylated lanolin\nEthylhexyl Palmitate (pore-clogging)\nethylparaben\nGlyceryl 3 diisostearate\nGlyceryl Stearate SE (pore-clogging)\nIodoprop butylcarbamate (allergen)\nImidazolidinyl urea (allergen)\nIsocetyl alcohol\nIsocetyl stearate\nIsopropyl isostearate\nIsopropyl linolate\nIsopropyl Myristate (IPM)\nIsopropyl Palmitate (IPP)*\nIsostearic acid\nIsostearyl neopentanoate\nLanolin (allergen) \nLaureth-4\nLauric acid\nLauryl glucoside (allergen)\nmethylparaben\nMyristyl lactate\nMyristyl myristate\nMyristyl propionate (PPG-2)\nOctyl Palmitate (pore-clogging)\nOctyl stearate\nOleamidopropyl dimethyl(allergen)\nOleyl alcohol\nOliec acid\nParaffin wax\nPetrolatum\nPEG 16 lanolin \nPhenoxyethanol (allergen)\nPlethora-4\nPolyglyceryl-3-diisostearate\nPropolis (allergen)\nPropylene glycol (allergen)\nPropylene glycol-2\nPropylene glycol monosteara\npropylparaben\nSilicone\nSodium chloride\nSodium lauryl sulfate\nSodium metabisulphite (allergen)\nsolulan 16 (lanolin)\nSorbitan sesquiolate (allergen)\nstearyl alcohol (allergen)\nStearyl heptanoate \nTriethanolamine (allergen)\nTriethyl Citrate\nTriolein\nXylene",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "babybottlepopz",
        "body": "A lot of the ingredients you listed are derived from coconut and palm. You might have an allergy/sensitivity. \n\nCoconut and palm gives me cystic acne or hives.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "mama_bear999",
        "body": "It sounds like we have the same skin 🥲 what products are you using on your face? I have to avoid acrylates like the plague as well",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hey! Thank you for posting. If you have any doubts on perioral dermatitis or need products, please check out our wiki here: https://www.reddit.com/r/Perioral_Dermatitis_/wiki/index/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Perioral_Dermatitis_) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Impossible-Coat5104",
        "body": "About a month. Slow and steady won the race here. My skin’s been clear since then though. I reintroduced products about 2 months after. I did find that dairy brought on the same type of acne so I reduced my dairy intake too.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "xliocc",
    "title": "Dyshidrosis = allergy to soap ingredients?",
    "url": "https://www.reddit.com/r/eczema/comments/xliocc/dyshidrosis_allergy_to_soap_ingredients/",
    "score": 10,
    "num_comments": 8,
    "created": "2022-09-23T00:46:51+00:00",
    "body": "Hi all, I recently got patch tested for chemicals and found out I was allergic to an ingredient that makes hand soaps thick/foamy - cocamidopropyl betaine. I am also highly sensitive to its relatives (cocamide DEA, cocamidopropyl hydroxysultaine, anything with synthesized coconut). Lots of shampoo/soap brands you find in stores have these ingredients.\n\nIt’s been two months since I switched to hand soaps without *synthetic* coconut derivatives and my hands have never been so…healthy looking before. (I use Dr. Bronners soap now and feel great)\n\nCheck your hand soap ingredient list for these chemicals if you suffer from dyshidrosis (eczema on hands) and, if you can, see an allergist to confirm whether or not it is these ingredients that you are reacting to.\n\n** Don’t switch to new products without knowing what your skin can and cannot handle (I now know what soap I can use, my skin doesn’t react to Dr. Bronner’s liquid Castile soap - it has natural coconut oil, no synthetic coconut anything, and ingredient list has nothing i’m allergic to). Remember, what works for me may not work for you.\n\nIve been put on steroids (oral and topical) and yet I still had flareups due to using products I was unknowingly allergic to. Now that i eliminated this one thing I feel significantly better (i don’t think of “offing” myself anymore lol…)\n\nHope this helps!\n\nEdit: spelling. Also would like to add that these synthetic, coconut derived products were also in products marketed as sulfate free/vegan/paraben free/fragrance free, so keep that in mind as well!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fuurin",
        "body": "I found out through trial and error that I'm allergic to sulfate surfactants. After changing all my products to sulfate-free, life is so much better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "EconomicsFancy1150",
        "body": "I’m asking for a patch test next time I go to the derm. Is it something insurance will cover? And if you’re comfortable telling me a ballpark of how much it was I’d appreciate it!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Affectionate_Pie_752",
        "body": "Unfortunately my dyshydrosis is triggered by stress. The worse the stress the worse the flare. Dealing with two hands and a foot right now. Praying my other foot doesn’t break out.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Dazzling-Heron-8634",
        "body": "I believe this is my trigger. It wasn't included in my patch test, which gave me a couple answers of allergens, but none of them made sense to why my hands were bleeding and cracked and raw. Mostly on my fingertips. A couple weeks ago I accidentally showered without gloves on, and I had a major flareup about five days later. I looked in the ingredients and there it was Cocomidopropyl betaine, I've been free of it sense, and my hands are clearing up. Fingers crossed this is it, after a year of total hell.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "bojybc",
    "title": "Sticky hair, hair loss and itchiness after co-washing.",
    "url": "https://www.reddit.com/r/NoPoo/comments/bojybc/sticky_hair_hair_loss_and_itchiness_after/",
    "score": 9,
    "num_comments": 7,
    "created": "2019-05-14T14:55:24+00:00",
    "body": "So far I co-washed two times.\n\nFirst time I did it the lush way - massage with water, put significant amount of conditioner on scalp, massage, wash, put significant amount of conditioner on hair from roots to ends, wait, wash. The hair was clean, I think it was too clean, there was more resistance when brushing vs after shampoo washing, there was significantly more hair left on my hands (and on the brush when brushing too I think) when applying the product. I think the hair was somewhat sticky and waxy, but not too much.\n\nThe second time I did it the easy way - massage with water, put significant amount of conditioner on scalp, massage (and in the process get a bit on the hair and ends too), wait, wash. The hair was clean enough (not shampoo-clean, but I think that's better for my hair and for my scalp's accomodation). There was more resistance when brushign vs after shampoo washing (and I think also vs the first co-wash). There too was significantly more hair left on my hands when applying the product, but because it was applied only once it was this much less hair loss. My hair is sticky, waxy. It looks good, but feels really bad, because of the stickiness.\n\nI used warm water.\n\nTo put this into perspective, if I brush my hair downwards while leaning down, the hair will literally stay in the air afterwards as if I gelled it or something. This effect is present to some extent after I shampoo-wash too, but not this extremely. It's also quite difficult to brush in the first place.\n\nThe conditioner somewhat sticks to the hair even while washing with it, the consistency of conditioner is gluey, sticky, it doesn't make my fingers run through my hair with conditioner applied run buttery smoothly, but rather the complete opposite, I'm scared of pulling my hair out this way... No hair loss when rinsing it off. \n\nMy scalp is also itchy as fuck now. My guess is the preservatives Methylchloroisothiazolinone and Methylisothiazolinone are to blame, but the thing is the shampoo has them too, so maybe not and the waxiness or whatever (co-washing in general) causes this?\n\nI'm pretty certain that the conditioner causes this. I didn't use any other product. When I wash with just shampoo from the same brand (it's SLES based, but it's the opposite of potent, I take few times more of it to achieve the same potency that normal SLS shampoos have, could be the conditioner is similarly \"potent\") and either don't use any other product or only few drops of oil it won't be like this and it's pretty much what I want.\n\nThe ingredients of the conditioner:\n> Aqua, Cetearyl Alcohol, Cetrimonium Chloride, Behentrimonium Chloride, Guar Hydroxypropyltrimonium Chloride, Propolis Extract, Inula Helenium Extract, Humulus Lupulus Flower Extract, Helianthus Annuus Hybrid Oil, Cera Alba, Cedrus Atlantica Bark Oil, Chamomilla Recutita Oil, Geranium Sibiricum Extract, Panax Ginseng Root Extract, PEG-12 Dimethicon, Pinus Sibirica Needle Extract, Pinus Sibirica Seed Oil, Pinus Sibirica Seed Oil Polyglyceryl-6 Esters, Xanthan Gum, Hydrolyzed Milk Protein, Panthenol, Niacinamid, Ceteareth-20, Citric Acid, Parfum, Methylchloroisothiazolinone, Methylisothiazolinone, CI 15985, CI 19140, CI 42090, CI 14720.\n\nNote that Cera Alba (Bees wax), Guar Hydroxypropyltrimonium Chloride (guar gum derivative) and PEG-12 Dimethicon (water-soluble sillicon) are in it. Could it be that the Bees wax is the problem? The two other ingredients are water soluble so shouldn't be... Cera Alba (Bees wax) is also in the shampoo, but probably in smaller quantity.\n\nIngredients of the shampoo:\n> Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamide DEA, Cocamidopropyl Betaine, Guar Hydroxypropyltrimonium Chloride, Propolis Extract*, Arctium Lappa Root Extract, Glycine Soja Oil, Urtica Dioica Extract*, Chamomilla Recutita Flower Water*, Althaea Officinalis Root Extract*, Salvia Officnalis Oil, Carum Carvi Fruit Oil, Mel*, Saponaria Officinalis Root Extract*, Cera Alba, Panthenol, Niacinamid, Citric Acid, Parfum, Methylchloroisothiazolinone, Methylisothiazolinone, Benzyl Salicylate, Hexyl Cinnamal, CI 15985, CI 19140, CI 42090, CI 14720.\n\nShould I buy another conditioner, keep on using this one or switch to non-harsh shampoo? If I should switch conditioner, what ingredients should I be looking for except no wax and sillicon? No oils? Other surfactants (glucosides instead of kationic chlorides)? Something more oily? Something very minimalistic (just kationic surfactans like cetrimonium chloride and humectants like cetearyl alcohol)? Something with more humectants?  I wouldn't be super happy buying another conditioner just to find out it's trash and I have nothing to do with it.\n\nEdit: My hair is ~5inch/13cm long.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "BungViper",
        "body": "I'm no expert and this is just personal experience over the past several years but I would try an SLS-free shampoo & silicon-/wax-free conditioner to see if that helps. It sounds more like an issue with the conditioner ingredients or other products sticking to your hair and scalp then not getting washed out with the co-wash so it builds up on your hair more and more. I tried many conditioners to co-wash and also water-only but neither worked for me. My hair ended up stringy, heavy and waxy though not as quickly as you have experienced. I have very hard water where I live which can also add to the problem.  You can also look into an apple cider vinegar rinse as an alternative (lots of info on the side-bar).\n\nI have had good success with SLS-free shampoo plus silicon-free conditioner every second wash or so. I only have to wash it once a week with water-only rinses as needed in between washes and my scalp is much less itchy and dry than when I was using regular shampoo or co-washing. When particularly dry and itchy, I use jojoba oil on my scalp as a mask/cleanse before I shower, massage it in well, leave it on for 5-10 minutes then wash out . This also helps with any build-up of product on my scalp.\n\nIt will probably take some trial and error to find out what works for you and a bit of time for your scalp to transition. You may also need to use a clarifying shampoo to get rid of all the build-up on your hair before starting over to give you a clean start but not everyone needs that step.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Jenifarr",
        "body": "I think you’re thinking too hard about the ingredients. The wax is probably the issue, but not necessarily. Low poo would be no products with silicone, sulfate, or parabens. Simple. \n\nIf you are switching to low poo products and just using those, I would say it’s probably a bit of waxiness from transition. That’s normal and just a matter of lifting the waxiness (apple sauce mask, egg, or a full-poo shampoo) and forging ahead.  If you’re still using full poo products (which it looks like you are, regardless of how you’re using them) it’s probably just a bad formulation for you and/or the water coming out of your tap.   Find something inexpensive to try.  Burt’s Bees, L’Oreal Paris Evercurl or Evercreme cleansing conditioners, Nature’s Gate, VO5 conditioners in the white bottles (if they’re still packaged the same as when this list was made) are all fairly widely-available and often fairly inexpensive options.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "thickumsthrow",
        "body": "I don’t follow this method but from personal experience bees wax builds up on my hair more than any other oil, silicone. It’s one of those things that can be washed out with a gentle shampoo, or sulphate shampoo depending on your preference/hair type",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "2vjwax",
    "title": "I am looking for a similar shampoo by the ingredients",
    "url": "https://www.reddit.com/r/HaircareScience/comments/2vjwax/i_am_looking_for_a_similar_shampoo_by_the/",
    "score": 6,
    "num_comments": 0,
    "created": "2015-02-11T17:05:48+00:00",
    "body": "Hi guys!\n\nLast december I used a brazilian shampoo called \"Alta Moda e...\" by Alfaparf brand.\n\nI had the photon hair treatment and the specialist gave me this shampoo, this shampoo claims to be \"salt free\"; I finished the shampoo now so I want to know if there is a similar shampoo with this ingredients:\n\naqua, sodium laureth sulfate, cocamide dea, cocamidopropyl betaine, parfum, glycol, distearate, cocamide mea, citric acid, polyoquaternium-7m, hydrolyzed wheat protein, hydrolyzed corn protein, hydrolyzed soy protein, glycerin, linalool, limonene, magmesium nitrate, peg-8, methylchlorosothiazolinone, magnesium chloride, peg-8/SMDI copolymer, methylisothiazolinone, sodium polycryalate, palmitoyl myristyl serinate.\n\nThanks in advance!\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FragranceFreeBeauty",
    "post_id": "tizapn",
    "title": "Best and Worst Fragrance-Free Water-Based Cleansers I’ve tried (2022)",
    "url": "https://www.reddit.com/r/FragranceFreeBeauty/comments/tizapn/best_and_worst_fragrancefree_waterbased_cleansers/",
    "score": 6,
    "num_comments": 5,
    "created": "2022-03-21T00:40:56+00:00",
    "body": "For your reference, my skin type is sensitive and acne-prone. All the products I use and review here are completely fragrance free, contain no masking fragrance, no “natural” fragrances or essential oils, no photo-sensitizing plant oil/extracts (lavender, eucalyptus, citrus, etc ). So here we go: \n\n**BEST**: \n\n1. **Acne.org cleanser**: this is my HG face cleanser that I have repurchased so many times. No matter how many products I try over the years, I always come back to this because it’s cost effective, works well without drying out my skin, and does not leave a residue behind. It has a gel texture and come in a pump bottle which make it super convenient to use. \n\n**Ingredients:** Water, PEG-80 Sorbitan Laurate, Cocamidopropyl Betaine, Sodium Trideceth Sulfate, Glycerin, Sodium Lauroamphoacetate, PEG-150 Distearate, Sodium Laureth 13 Carboxylate, Disodium Cocamphodiacetate, Butylene Glycol, Sage Extract, Cucumber Extract, White Oak Bark Extract, Panthenol, Allantoin, Acrylates Copolymer, Methylgluceth-20, Polysorbate-20, Quaternium-15, DMDM Hydantoin, Disodium EDTA\n\n&#x200B;\n\n2. **First Aid Beauty Pure Skin Face Cleanser:** This cleanser is one of my recent discovery and I like it a lot. It’s a little more pricey than the [Acne.org](http://acne.org/) cleanser, but it works well and is gentle on the skin. It comes in a tube which makes it convenient for travel. \n\n**Ingredients:** Aqua/Water/Eau, Sodium Cocoyl Isethionate, Glycerin, Stearic Acid, Hydrogenated Coconut Acid, Sodium Isethionate, Stearyl Alcohol, Allantoin,  Chrysanthemum Parthenium (Feverfew) Extract, Camellia Sinensis Leaf Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Aloe Barbadensis Leaf Juice, Tocopherol, Hydrogenated Palm Glycerides Citrate, Phenoxyethanol, Disodium Cocoamphodiacetate, Sodium PCA, Hydroxypropyl Methylcellulose, Coco-Glucoside, Glyceryl Oleate, Sodium Chloride, Disodium EDTA, Citric Acid, Potassium Sorbate, Sodium Benzoate, Maltodextrin,  Tetrasodium EDTA.\n\n&#x200B;\n\n3. **Soon Jung pH 5.5 Foam Cleanser:** This is a Korean product. It comes in a tube and does cleanse well, doesn’t over dry, and leaves no residue behind. Overall, this is a good cleanser. If you are looking for a good Korean water based cleanser, I would recommend this one. This would be best for people with normal to oily skin, IMO.\n\n**Ingredients:** Water / Aqua / Eau, Sodium Cocoyl Isethionate, Glycerin, Coco -betaine, Potassium Benzoate, Sodium Chloride, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Citric Acid, Tromethamine, Disodium EDTA, Panthenol, Pentylene Glycol, Madecassoside\n\n&#x200B;\n\n**WORST**: \n\n1. **Hada Labo Goku-jyun Foaming Face Wash:** This is probably the worse cleanser out of everything I tried in a long time. I decided to purchase this product to try because I like the oil cleanser from Hada Labo, but this one is a total let down! This cleanser come in a pump bottle, which makes it easy to dispense the product, but that’s the only pro. Now the cons: This foam cleanser does not cleanse well. For me, It’s too gentle on the skin, leave a greasy residue on my skin and made me break out. I believe the greasy feeling is due to the Vaseline in the formula. I think this cleanser will only work for people with dry to very dry skin, but even if you have dry skin, there are so many other better cleansers out there. Those of you with oily, acne-prone or combo skin, this product will be a disaster! So stay away!\n\n**Ingredients:** Water, BG, Disodium Cocoyl Glutamate, PEG-8, Cocamidopropyl Betaine, Cocamide DEA, PEG-80 Sorbitan Laurate, Glycerin, Sorbitol, Sodium Taurine Cocoyl Methyltaurate, Sodium Acetylated Hyaluronate(Super Hyaluronic Acid), Hydroxypropyltrimonium Hyaluronate(Skin-adsorbed Hyaluronic Acid), **Vaseline**, Citric Acid, Polyquaternium-7, EDTA-2Na, BHT, Methylparaben\n\n&#x200B;\n\n**SO-SO:**\n\n1. **Rovectin Skin Essentials Conditioning Cleanser:** This is another Korean product. It comes in a pump bottle and is very convenient to use. However, this is a very average cleanser. It’s not the worst, but not the best either. It works and is gentle on the skin, but there’s nothing wow worthy about it. Also, there’s nothing it does that the other cleansers I mention above cannot do. I won’t be repurchasing this one. \n\n**Ingredients:**  Water, Disodium Cocoamphodiacetate, Decyl Glucoside, Glycerin, Sodium Chloride, Citric Acid, Hyaluronic Acid, Hydrolyzed Hyaluronic Acid, Sodium Hyaluronate, Centella Asiatica (Gotu Kola) Extract, Propanediol, Butylene Glycol, Hexylene Glycol, Disodium EDTA, Glycine, 1,2-Hexanediol, Serine, Glutamic Acid, Aspartic Acid, Protease, Leucine, Alanine, Lysine, Arginine, Tyrosine, Phenylalanine, Threonine, Proline, Valine, Isoleucine, Vitis Vinifera (Grape) Seed Extract, Histidine, Cysteine, Methionine, Ethylhexylglycerin, Leuconostoc/Radish Root Ferment Filtrate, Potassium Benzoate, PEG-120 Methyl Glucose Trioleate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Commercial_Poem_4623",
        "body": "I'm sensitive and not acne prone - dealing with dehydration and a little dryness generally. None of these leave my skin dry or tight. \n\n* **Simple Hydrating Cleansing Oil** - this is very nice for such a cheap product. My HG until I tried out fancier stuff. For drier and dehydrated skin that isn't acne prone, you could use this as a single cleanse. I have all winter. \n\n* **Clinique Take The Day Off Balm** - I got this as a sample pot and it's really cosmetically elegant. Lathers up beautifully. Very satisfying to use. Single cleanse works for me. \n\n* **Beauty of Joseon Radiance cleansing balm** - this is so fancy! Unlike the Clinique, it turns straight to an oil texture when you rub it in. I prefer that the Clinique is a slightly thicker texture when you rub it in personally but I'm trying a fermented skincare routine which is why I bought it. The packaging is amazing - it comes with a spatula in a little compartment in the lid! I'm not sure it emulsifies as well as the Clinique so I double cleanse my T-zone to be safe. \n\n* **Simple Refreshing Gel face wash** - very nice, good second cleanser. Cheap but effective. Also Fungal Acne safe according Folliculitis Scout but please check yourself. I use this as my second cleanser on my T-zone and my sole cleanser on my neck/upper chest.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "ttujh3",
    "title": "Cocamide DEA",
    "url": "https://www.reddit.com/r/Allergies/comments/ttujh3/cocamide_dea/",
    "score": 6,
    "num_comments": 7,
    "created": "2022-04-01T16:12:54+00:00",
    "body": "After getting patch tests, I found out am allergic to cocamide DEA. I was told to stop using products with this in it, however every shampoo and soap I find contains either cocamide DEA, cocamide MEA, cocoyl taurate, cocamidopropyl betaine, or coco-betaine.\n\nIs cocamide DEA the same as cocamide MEA, cocoyl taurate, cocamidopropyl betaine, or coco-betaine?\n\nDoes anyone know of any shampoos/conditioners and soaps that do not contain any of this?",
    "flair_text": "Question",
    "flair_template_id": "479b07f2-7c85-11e3-a97f-22000a0b8292",
    "comments": [
      {
        "author": "watchingfriendsfail",
        "body": "It's my understanding that cocamidopropyl betaine or cocoyl taurate are not the same as cocamide DEA. I am allergic to CAPB but not cocamide DEA. I also understand that cocamide DEA is a harsher substance for most. SkinSafe is the best website to figure out cross-reactivities and what you may or may not be allergic to. CAPB is more common and I also have a propylene glycol allergy, so I am limited to about 2 shampoos:\n\n\\- Babo Botanicals Sensitive Baby Shampoo and Wash\n\n\\- The Unscented Company - Shampoo Bar(both are at Whole Foods)\n\nSoaps:  \n\\- Ditch The Itch Bar\n\n\\- GladSkin eczema wash  \n\n\nHere is what I read on it (and it has some common names that are used for your allergen as well): [https://blog.mapleholistics.com/blog/cocamide-dea-in-shampoos-conditioners-and-beauty-products/#:\\~:text=Triethanolamine.-,Cocamide%20DEA%20Replaced%20by%20Cocamidopropyl%20betaine%20(CAPB),who%20are%20sensitive%20to%20it](https://blog.mapleholistics.com/blog/cocamide-dea-in-shampoos-conditioners-and-beauty-products/#:~:text=Triethanolamine.-,Cocamide%20DEA%20Replaced%20by%20Cocamidopropyl%20betaine%20(CAPB),who%20are%20sensitive%20to%20it).",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Jack-Campin",
        "body": "Natural olive oil soap (Aleppo soap) is available in most of Western Europe.  No coconut or coconut derivatives.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SphericalOrb",
        "body": "Not sure if you've looked into shampoo bars, but in my experience they have the simplest ingredient lists. I also like how long they last.\n\n[Lush](https://www.lushusa.com/hair/shampoo-bars/honey-i-washed-my-hair/9999905563.html) seems to make theirs with sodium laureth sulfate plus essential oils. \n\n[J.R. Liggett's](https://jrliggett.com/ingredients) seem to be the simplest you can get, saponified natural oils. \n\n[Shea Moisture](https://www.sheamoisture.com/100-virgin-coconut-oil-rhassoul-clay-shampoo-bar/764302227007.html) seems fine too.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rosacea",
    "post_id": "14g5whq",
    "title": "Asian skincare cleansers to reduce redness",
    "url": "https://www.reddit.com/r/Rosacea/comments/14g5whq/asian_skincare_cleansers_to_reduce_redness/",
    "score": 6,
    "num_comments": 1,
    "created": "2023-06-22T15:03:02+00:00",
    "body": "Hi all,\n\nI have rosace type 1 and my main concern is redness on my cheeks and nose.\n\nI want to start trying to incorporate more asian skincare into my routine, and right now I am looking for a very gentle, anti redness cleanser!\n\nI have done some research and the following cleansers seem promising (ranked from most to least promising):\n\n1. SKIN1004 Madagascar Centella Ampoule Foam\n2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel\n3. Beauty of Joseon - Green Plum Refreshing Cleanser\n4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam\n5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam \\*(more for like 1-2x a week)\\*\n6. B\\_LAB - Matcha Hydrating Foam Cleanser \\*(also for 1-2x a week)\\*\n\nI am very interested in hearing about your experiences and advice regarding these products!\n\nOfcourse, any other product suggestions are more than welcome!\n\n**Ingredient list:**\n\n**1. SKIN1004 Madagascar Centella Ampoule Foam**\n\nCentella Asiatica Extract, Sodium Cocoyl Isethionate, Glycerine, Purified Water, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Poteassium Cocoyl Glycinate, 1,2-Hexanediol, Sodium Chloride, Potassium Cocoate, Potassium Benzoate, Polyquaternium-67, Citric Acid, Dextrin, Sodium Bicarbonate, Cacao Extract, Disodium EDTA, Sodium Acetate, Butylene Glycol, Coptis Chinensis Root Extract, Sodium Hyaluronate, Eclipta Extact, Coccinia Indica Fruit Extract\n\n**2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel**\n\nWater, Glycerin, Coco-Betaine, Propanediol, Pentylene Glycol, Sodium Chloride, 1,2-Hexanediol, Xanthan Gum, Hydroxyethylcellulose, Potassium Cocoyl Glycinate, Potassium Cocoate, Oryza Sativa (Rice) Extract, Phyllostachys Pubescens Shoot Bark Extract, Panax Ginseng Root Extract, Aspergillus Ferment Extract Filtrate, Beta-Glucan, Butylene Glycol, Trehalose, Citric Acid, Cyclodextrin, Zanthoxylum Piperitum Fruit Extract, Pulsatilla Koreana Extract, Usnea Barbata (Lichen) Extract, Ethylhexylglycerin\n\n**3. Beauty of Joseon - Green Plum Refreshing Cleanser**\n\nWater, Prunus Mume Fruit Water, Cocamidopropyl Hydroxysultaine, Phaseolus Radiatus Seed Extract, Sodium Cocoyl Isethionate, Glycerin, Sodium Chloride, Camellia Sinensis Leaf Extract, Houttuynia Cordata Extract, Nelumbo Nucifera Flower Extract, Oryza Sativa (Rice) Extract, Prunus Mume Fruit Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Guar Hydroxypropyltrimonium Chloride, Coconut Acid, Ethylhexylglycerin, Caprylyl Glycol, Sodium Isethionate, Citric Acid, Butylene Glycol, 1,2-hexanediol, Punica Granatum Extract, Clitoria Ternatea Flower Extract, Garcinia Mangostana Peel Extract, Propylene Glycol Laurate, Sodium Citrate, Disodium EDTA\n\n**4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam**\n\nThere is vaseline in this, isnt that weird? Lol.\n\nWater, BG, Disodium Cocoyl Glutamate, PEG-8, Cocamidopropyl Betaine, Cocamide DEA, PEG-80 Sorbitan Laurate, Glycerin, Sorbitol, Sodium Taurine Cocoyl Methyltaurate, Sodium Acetylated Hyaluronate(Super Hyaluronic Acid), Hydroxypropyltrimonium Hyaluronate(Skin-adsorbed Hyaluronic Acid), Vaseline, Citric Acid, Polyquaternium-7, EDTA-2Na, BHT, Methylparaben\n\n**5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam (more for like 1-2x a week)**\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Coconut Acid, Polyquaternium-67, 1,2-Hexanediol, Sodium Isethionate, Sodium Methyl Cocoyl Taurate, Litsea Cubeba (May Chang) Oil, Sodium Chloride, Disodium EDTA, Ethylhexylglycerin, Sodium Acetate, Butylene Glycol, Centella Asiatica (Gotu Kola) Extract, Portulaca Oleracea (Green Purslane) Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hamamelis Virginiana (Witch Hazel) Extract, Sodium Hyaluronate, Beta-Glucan, Melaleuca Alternifolia (Tea Tree) Leaf Extract, Pentylene Glycol, Caprylyl Glycol, Diatomaceous Earth, Isopropyl Alcohol, Citric Acid, Vigna Angularis Seed Extract\n\n**6. B\\_LAB - Matcha Hydrating Foam Cleanser (also for 1-2x a week)**\n\nWater, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, 1,2-Hexanediol, Camellia Sinensis Leaf Extract, Betaine, Hydroxypropyl Starch Phosphate, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Laminaria Japonica Extract, Eclipta Prostrata Leaf Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Ulmus Davidiana Root Extract, Amaranthus Caudatus Seed Extract, Hydrogenated Lecithin, Lauryl Betaine, Camellia Sinensis Leaf Powder, Sodium Chloride, Polyquaternium-39, Decylene Glycol, Allantoin, Butylene Glycol, Fructan, Fructooligosaccharides, Beta-Glucan, Ceramide NP, Hydrolyzed Hyaluronic Acid, Hydroxyacetophenone, Ethylhexylglycerin",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "qualified_to_be",
        "body": "As someone with moderate T1 Rosacea, I love Asian skincare, that said, I haven’t tried any of these personally. If you’ve done your research, just try the first one! I’ve heard nothing but great things about Skin1004 as a whole.\n\nI’d share this with the r/AsianBeauty peeps as well. I’ve noticed a lot of eczema, psoriasis, and rosacea girlies there too.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "cd3db1",
    "title": "I'm allergic to coconut and all coconut derived products. I have been really struggling finding curlygirl friendly products with no coconut derived ingredients. Please help!",
    "url": "https://www.reddit.com/r/curlyhair/comments/cd3db1/im_allergic_to_coconut_and_all_coconut_derived/",
    "score": 5,
    "num_comments": 5,
    "created": "2019-07-14T14:05:49+00:00",
    "body": "Hi, I would really appreciate some advice and recommendations. It was suggested I cross post here from r/haircarescience, thank you!\n\n\nAs said in the title, I'm really allergic to coconut and anything coconut derived. This includes the ever present coco-betaine, as well as coconut diethanolamide, cocamide sulfate, cocamide DEA, CDEA, and basically anything else with \"coco\" somewhere in the name. In addition, I'm very sensitive to SLS (sodium laureth sulfate).\n\n\nI didn't have this problem nearly as much years ago as there were a lot of products that relied on palm oils or hemp oils and such, but it seems that coco-betaine has really taken the haircare world by storm and I am really struggling now to find any haircare products that don't contain either coconut derived ingredients or that don't contain SLS and similar acne/itching inducing sulfates. All products I used to use from child to adulthood that my hair loved have now reformulated to use coconut based cleaners. Don't get me wrong- ethically and environmentally I support the move away from palm oil etc, but it puts me in a serious bind!\n\n\nThe extra injury to insult is that I was hit by a semi truck two years ago that left me with a traumatic brain injury and I'm still struggling to recover. One of the things I still really have trouble with is reading, and searching through long complicated ingredient lists for any and all of the many forms of coconut is a task that seems precisely calculated to be what I'm worst at. This means that I keep making mistakes and buying products that I think are safe, or, I've checked ingredients online and they check out but then I start having a reaction and realize that what I bought at the store has the same name but a different ingredient list than what I read about! My fiance has been an absolute saint helping me with so many daily tasks and with the medical and insurance paperwork that I've been overwhelmed with in addition to supporting us both since the accident that I feel terrible asking him to devote even more time to meticulously reading conditioner bottles when he has so much on his plate.\n\n\nSo, I'm hoping that the reddit hair community might be willing to help me find a product that I can use and rely on! I really really appreciate your kindness in advance, I know it is an annoying task but I could really use your help.\n\n\n***\n\n\n**Hair type:** Thick, wavy probably 2A, but maybe 2c? \n\n\n**Current Routine:** Trying to do co-wash only because a) my hair seemed to like it and b) I can't find a shampoo I can use anyway. Wash with conditioner every 3-4 days, squish to condish, rinse thoroughly (I still seem to break out on my back if I do any leave in). Plop then air dry. I have done a beginner routine reset shampoo recently.\n\n\n**Current product:** Shea Moisture raw Shea butter restorative conditioner\n\n\n**Current problems:** Although this conditioner miraculously doesn't contain anything I'm allergic to, I find that my scalp is really itchy and my hair is very dry and prone to tangling and breaking. It weirdly feels like I'm almost not even using conditioner it seems so rough and tangled even just after washing. I've also been having increasingly annoying dandruff and I don't know what I should do about it as I haven't had that problem before I had to switch from my last product when it started containing coco-betaine. I've also in the past used Garnier Whole Blends repairing conditioner \"honey treasures\" which is also ok allergy wise (at least, last I checked) but I found it left my hair fairly heavy and itchy too without using shampoo, and when I put it into the curly girl ingredient checker it says it's not CG friendly.\n\n\nPlease let me know if you need any other information, I would very sincerely appreciate some help figuring out what to do!",
    "flair_text": "help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "luna-petunia",
        "body": "have you tried the Kinky Curly Knot Today conditioner? I don't see any coconut or coconut derived products in the ingredients list. I have 2b/2c hair and it's my favorite so far! Great for co-washing and also conditioning. \n\nAlso I hope you're healing up well from your accident! sending all kinds of healing vibes your way!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "educationliberation",
        "body": "Hey! I recently came across the website skinsafeproducts.com and they check products for allergens, and coconut/coconut derived ingredients is one of them. You could use it to look up products and easily check, or just search for curly hair products. Best of luck :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "sarseviera",
        "body": "I’m way late to finding this post, but I also have a coco-betaine allergy! Did you ever end up finding a good shampoo? And feel free to let me know if you want any other suggestions for body/face wash or anything else CB free!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "apry1z",
    "title": "Do you need to clarify after using oils?",
    "url": "https://www.reddit.com/r/curlyhair/comments/apry1z/do_you_need_to_clarify_after_using_oils/",
    "score": 5,
    "num_comments": 4,
    "created": "2019-02-12T10:20:07+00:00",
    "body": "Just started with CG today and washed my hair with a clarifying shampoo, hope I did it correctly.\n\n\nMy question is, I love using oils and silicones in my hair but will stop with the silicones and wondering, do I need to clarify when I use oils? How do you do?\n\nRight now I love using a mix of raw shea butter and almond oil. Now haven't put it into my hair but if I put it in my hair, do I need to clarify next time I shower? \nWill it build up into my hair?\n\n\nThe clarifying shampoo has:\nAqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamide DEA, Cocamidopropyl Betaine, Glycerin, Citric Acid, Parfum, Phenoxyethanol*, Benzoic Acid*, Dehydroacetic Acid* \n\nThen I used Curl Companys conditioner which is CG approved. Then I scrunched in pure Aloe vera gel and now have it in a plop.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "imsocool123",
        "body": "I do the CGM once or twice a week. Every third wash, I use castor oil. I find that if I use it too frequently, my hair does get a bit of a build up and is weighed down. I don’t have any issues if I just alternate when I use it. \n\nFor what I’ve read here, we aren’t supposed to use the clarifying shampoo again either once we’ve started CGM.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "guimarba",
        "body": "If you use pure oils and oils that don't have silicone in it you don't have to clarify.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1xdcoa",
    "title": "Question about new products.",
    "url": "https://www.reddit.com/r/curlyhair/comments/1xdcoa/question_about_new_products/",
    "score": 3,
    "num_comments": 2,
    "created": "2014-02-08T18:24:28+00:00",
    "body": "Before going shopping last week, I checked out \"Wonderful CG Friendly Drugstore Product List\" from the sidebar. The list declared that anything by Organix was CG friendly. Awesome! So I bought Smooth Hydration Argan Oil & Shea Butter shampoo, conditioner, and the curl enhancing yogurt. \n\nI love the smell, I love the texture, and I love my curls! My only problem is that the yogurt does not enhance my second day curls, and I'm noticing more frizz than when I previously co-washed with Tresseme products. \n\nUnfortunately, I can't get the \"Search ingredients - what do they do? Are they bad for my hair?\" link on the sidebar to work, and \"Search for product reviews, ingredients, etc\" does not have this particular formula. Has anyone else tried these products? Have you had success? Was it just not for you? This is only week one, so it may change, but I am slightly disappointed.\n\nRegimen:\n\nDay 1) Lightly shampoo\nThoroughly condition\nRinse gently, but leave some conditioner in, scrunch\nPlop while getting dressed/during skincare routine\nScrunch curl enhancing yogurt (previously just more conditioner) into hair\nLeave it alone to dry.\n\nDay 2) Correct part\nFinger-colmb some tangles\nScrunch in yogurt (previously conditioner)\nLeave alone.\n\nEdit; I forgot the ingredients!\n\nShampoo: DI Water, Disodium Laureth Sulfosuccinate, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocamidopropyl Hydroxysultaine, Dimethicone Copolyol, Cocamide DEA, Glycol Distearate, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Parfum, Coconut Oil (Cocos Nucifera), Avocado Oil (Parsea Gratissima), Aloe Leaf Extract (Aloe Baradensis), Panthenal, Polyquaternium-11, DMDM Hydantoin, Cetyl Alcohol, Guar Hydroxypropyltrimonium Chloride, PEG-23M, FD&C Yellow No.5, FD&C Red No. 40.\n\nConditioner: DI Water, Behentrimonium Chloride, Cetyl Alcohol, Glycol Stearate, Glycerin, Dimethicone, Ceteareth-20, Parfum, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Hydrolyzed Wheat Protein, Cocoa Butter (Theobroma Cacao), Parfum, Coconut Oil (Cocos Nucifera), Avocado Oil (Persea Gratissima), Aloe Leaf Extract (Aloe Baradensis), Panthenol, Tetrasodium EDTA, DMDM Hydanatoin, Methylchlorothiazolinone, Methylisothiazolinone, Red 40, Yellow 5.\n\nCurl Enhancing Yogurt: \nWater, Behentrimonium Chloride, Cetearyl Alcohol, Cetyl Alcohol, Dimethicone, Glycerin, Glyceryl, Stearate, Ceteareth-20, Cyclomethicone, Polyquaternium-11, Dimethiconol, Parfum, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Lanolin Oil, Jojoba Seed Oil (Simmondsia Chinensis), Panthenol, DMDM, Hydantoin, Tetrasodium EDTA, Methylchloroistothizaolinone, Methylisothiazolinone.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jollibhe",
        "body": "Unfortunately, that \"Wonderful CG Friendly Drugstore Product List\" isn't so wonderful anymore.  I don't think it's been updated for a while.  Two of those Organix products you listed have Dimethicone, which is a silicone.  Can't tell if the shampoo is ok but I have checked a few Organix shampoos at my local drugstore and I found a few with sulfates.  \n\nYes to Carrots Nourishing Shampoo is also listed there but has sulfates.  I found out after I've been using it for almost 2 months :(.  The YTC conditioner is ok though. There is also a Garnier Fructis that I made the mistake of buying but thankfully I verified the ingredients before using it.  \n\nThat \"search ingredients\" link is sadly another site that hasn't been maintained for a while :(\n\nIf you need product recommendations, try the pinned post at the top of this subreddit and scroll towards the bottom for the product recommendations.  There is also a product recommendation link at the sidebar in /r/haircarescience.  But before you buy, google the ingredients just in case the manufacturer changed ingredients",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "wicked_edge",
    "post_id": "2d60s4",
    "title": "[NEW] LEA \"Classic\" shaving products. Anyone tried them?",
    "url": "https://www.reddit.com/r/wicked_edge/comments/2d60s4/new_lea_classic_shaving_products_anyone_tried_them/",
    "score": 4,
    "num_comments": 5,
    "created": "2014-08-10T19:05:02+00:00",
    "body": "LEA released new \"classic\" line of shaving products that include a new shaving soap, shaving cream, and aftershave splash.\n\nBullgooseshaving has a good description:\n\n> Lea (Lascaray S.A.) has been producing shaving and cosmetic products in Spain since 1823. Recently, they have revived their \"Classic\" line -adopting their logo and design from the 1930's and updating their old formulas and fragrances to modern taste.  The Lea Classic Shave Soap is just that -an instant classic. It is a tallow based soap that lathers easily, is extra slick, and has an intoxicating but subtle scent of sandalwood and oak moss. It has been receiving rave reviews on the Spanish Shaving forums and it is now available to U.S. consumers.\n\nThe products are available at least from these vendors:\n\n* [Bullgooseshaving](http://www.bullgooseshaving.com/brands/Lea-Classic.html)\n* [Connaughtshaving](http://connaughtshaving.com/lea.html)\n* [Gifts&Care](http://www.giftsandcare.com/en/36_lea)\n\n\nQuick google search didn't find much on these products, except for one thread over at [Shavenook](http://shavenook.com/thread-new-classic-shaving-products-from-lea). Post [#16](http://shavenook.com/thread-new-classic-shaving-products-from-lea?pid=383207#pid383207) has pictures of the shaving soap and a short review. In facebook Joe from Italianbarber has commented that he prefers the new soap over the original LEA shaving stick. The original shaving stick has generally been well liked. [Here's a review of the original LEA shaving stick by /u/Palpz.](http://shavesoaps.wordpress.com/2014/03/20/lea-shaving-stick/)\n\nBelow is the ingredient list for the shaving soap.\n\n> potassium stearate, sodium stearate, potassium tallowate, potassium cocoate, aqua, sodium tallowate, sodium cocoate, parfum, glycerin, lanolin, allantoin, bisabolol, menthol, cocamide dea, titanium dioxide, potassium hydroxide, limonene, hydroxycitronellal, benzyl salicylate, coumarin, tetrasodium edta, tetrasodium etidronate, sodium hydroxide.\n\nI wasn't able to find ingredient list for the shaving cream.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "squarilyn",
        "body": "Well, looking at the soap ingredients, it's a combination of stearic acid, tallow, coconut oil saponified with potassium and sodium hydroxide, with additional lanolin and glycerine, which should make a pretty nice soap. It seems like it should be a solid soap - no olive oil or clay or anything. I like the sounds of it, but the smell seems a touch masculine for me.\n\nI hope that helps!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Leisureguy",
        "body": "Yeah, I've tried the shave stick and thought it quite good.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "toxicology",
    "post_id": "hkl6d6",
    "title": "How safe is cocamide MEA?",
    "url": "https://www.reddit.com/r/toxicology/comments/hkl6d6/how_safe_is_cocamide_mea/",
    "score": 4,
    "num_comments": 13,
    "created": "2020-07-03T15:36:17+00:00",
    "body": "I read [this report](https://journals.sagepub.com/doi/10.1177/109158189901800204) that deems it safe to be used in rinse off products, but I've also read that it can contain traces of cocamide DEA, which is regarded as a carcinogen, so does anyone know, how likely is any product with cocamide MEA in it to contain traces of cocamide DEA?\n\nAre cocamide MEA containing products safe to use, given this possibility that they would hold traces of cocamide DEA?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "FranBoo",
        "body": "Hi, i stumbled upon this reddit post because i learned that a facial cleanser i bought had cocamide DEA in it...so uh...should i keep using it..?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "1jawbho",
    "title": "need help/advice",
    "url": "https://www.reddit.com/r/eczema/comments/1jawbho/need_helpadvice/",
    "score": 5,
    "num_comments": 3,
    "created": "2025-03-14T05:01:31+00:00",
    "body": "Just got my patch results back and i am allergic to \n-Cocamide DEA \n-Ethyl Acrylate \n-Fragrance \n-Colophony \n-p-tert-butylphenol Formaldehyde Resin \n-Tea tree oil \n-Disperse blue mix (124/106) \n-Propolis (without fragrance) \nI’ve been using the ACDS camp and almost all my products (especially hair) are unsafe. Feeling super discouraged and overwhelmed. Not sure where to begin. I have family pictures and hoping to get proposed to within the next couple months plus some other big events this year. \nI got this testing because i get a really bad rash and huge swelling on my eyes. I’m scared to tru new products bc ive heard even “safe” products on the app people have had reactions to. (my really bad last flare was after using a product that’s in my “safe” products) so it’s hard for me to trust this app and know what’s fully going on. I’m also scared to try new products and have a flare and mess my face up for weeks. but i’m so sick of feeling ugly and insecure and want to be able to get ready and wear make up again. please help!! any advice or if you have the same allergies would love recommended products i basically have to throw everything out. thanks!!! ",
    "flair_text": "patch testing",
    "flair_template_id": "85305520-2e75-11e9-87f3-0e83b5482ce4",
    "comments": [
      {
        "author": "Rainydaylady78",
        "body": "Hi, so sorry you are dealing with so much stress. Has the Allergist done anything to reduce eye problem? I would think there would be a 'treatment protocol' in place from that professional? They can't just leave you hanging. \n\nI'm dealing with facial inflammation due to my eczema including swollen eyes, mouth sores (cellulitis). At first a round of anti-biotics took care of the face issue but it returned. \n\nI wish my help was better and maybe others will advise you but doesn't the Mayo Clinic main Website carry an app for SAFE products for exactly your issue? Worth a shot. \n\nI'm sure you will eventually get past this difficult phase. Do lots of research, 2nd opinions etc...What about anti-histimines, are you on any now?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Timely_Acadia_3196",
        "body": "Every single product can have a side effect that can scare you. The best product can cause a few people to react poorly. So you will have to decide if trying something is better than trying nothing and letting your eczema do what it is doing.\n\nNow, with a new product, you can \"patch-test\" it first. This means trying it on a small patch of skin (not the face) like your forearm and see if your skin does okay with it. Then you can try it on a small part of your eczema and see if it improves. Perhaps a websearch of \"patch tests\" will give better instructions, or others can chime in here.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Ayurveda",
    "post_id": "2ypr7y",
    "title": "Ayurvedic ingredients cleared tinea versicolor?",
    "url": "https://www.reddit.com/r/Ayurveda/comments/2ypr7y/ayurvedic_ingredients_cleared_tinea_versicolor/",
    "score": 5,
    "num_comments": 0,
    "created": "2015-03-11T20:08:57+00:00",
    "body": "I had tinea versicolor since my teens. Prescriptions like Lotrimin would clear it but the dermatologist-recommended follow-up with Selsun blue didn't keep it from returning. \n\nI was surprised a couple of months ago when, after years of leaving the tinea versicolor alone, it was gone.\n\nLast fall, I began using Auromere shampoo as a body wash because it was too drying for my hair. Is it possible the ayurvedic formula got rid of the tinea versicolor? \n\nHere are the ingredients: **Purified water with extracts of neem, reetha (indian filbert/soapnut), shikakai (acacia concinna), henna, amla (indian gooseberry), and methi (fenugreek); ammonium lauryl ether sulfate (from coconut oil), cocamidopropyl betaine (from coconut oil), cocamide DEA (from coconut oil), polyquaternium 7, phenoxyethanol, potassium sorbate, tulsi (holy basil) oil**\n\nThank you for any insight!\n\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "in8ans",
    "title": "Shampoo/bodywash causing flare ups",
    "url": "https://www.reddit.com/r/eczema/comments/in8ans/shampoobodywash_causing_flare_ups/",
    "score": 5,
    "num_comments": 5,
    "created": "2020-09-05T20:26:14+00:00",
    "body": "Hello all. I am on a biologic but my hands and face still flair up after showering getting itchy, red hive like bumps. I’m allergic to tocopherols   and cocamide DEA which seem to be in EVERYTHING. Anyone else have these struggles??",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Nkayelev",
        "body": "If I use anything with SLS in my skin will flare up but thankfully a lot of brands are now on the SLS free wagon so there are more affordable options than when I first realised this! It’s so frustrating though. I randomly discovered its in bloody toothpaste as well which has made the skin around my mouth so much calmer just 26 years too late.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "mcrouse427",
        "body": "I am also allergic to Cocamide DEA! (Sorry- I am slightly excited to find someone else who shares this allergy). I recently found this out after a 2+ year struggle. Turns out it was the first ingredient listed in the hand soap I use at work (I work in a hospital). I feel your pain- it is in EVERYTHING. I am also allergic to fragrance and several formaldehyde releasers. \n\nI have been using VMV Hypoallergenic’s Shampoo and Conditioner the last month and it seems to be working. Before I was using Lush products and every time I wore my hair down, my neck would break out. I am still getting flare ups on my hands/arms, but everything else has improved significantly (other flare ups included legs, back and hips). Hope this helps! It is quite the struggle finding products without cocamide DEA.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "i4233z",
    "title": "Very hard water with manganese, will shampoo with AMPS work as well as EDTA?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/i4233z/very_hard_water_with_manganese_will_shampoo_with/",
    "score": 3,
    "num_comments": 1,
    "created": "2020-08-05T09:18:16+00:00",
    "body": "So I live in an area with hard water that also has quite a bit of manganese in it. It leaves these gross brown stains on all my sinks that can only be removed with undiluted bleach (not even hydrochloric acid makes a dent in it so I'm sure it's MnO2 and not rust. And yes, I tried cleaning my bathroom with HCl). \nMy hair is dark (dark brown + some Henna) so I can't even see if it's on my hair too but I'd assume it has to be.\n\nIs it likely contributing to my mineral buildup symptoms (dry, brittle, dull hair without using any protein products for months, no amount of conditioner helps, deep conditioning didn't do anything either, vinegar did help a tiny bit but not enough) and can it be removed at all without giving my hair the sink treatment? \n\nFinally, I'm in Germany and don't have access to any of the US products everyone recommends, do you think this shampoo I found online could work instead? It says it removes hard water buildup. I don't see any EDTA in the ingredient list but there's AMPS which is chelating too but idk how it compares to EDTA. From what I remember EDTA complexes are *really* stable (as is MnO2 unfortunately) and I hope AMPS is not just a weaker substitute. \n\nIt's not particularly expensive but it has a ton of ingredients which I'm a bit wary of since I'm prone to contact dermatitis (but I won't use it daily anyway so who knows if it even matters) and I don't like to clutter my bathroom with products I don't use. I would have just bought and tried it otherwise. \n\nSwiss-o-Par Tiefenreinigung Shampoo\n\nAqua, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Sodium Chloride, Acrylic Acid/Acrylamidomethyl Propane Sulfonic Acid Copolymer, Cocamide DEA, Sodium Xylenesulfonate, Glycerin, Parfum, Hydroxypropyl Oxidized Starch PG- Trimonium Chloride, Starch Hydroxypropyltrimonium Chloride, Citrus Aurantifolia Fruit Extract, Sodium Sulfate, Benzophenone-4, Sodium Lactate, Limonene, Urea, Lactic Acid, Triethylene Glycol, Benzyl Alcohol, Propylene Glycol, Butylphenyl Methylpropional, Levulinic Acid, Potassium Sorbate, Sodium Benzoate, p-Anisic Acid, Methylchloroisothiazolinone, Methylisothiazolinone, Magnesium Chloride, Magnesium Nitrate, CI 47005, CI 42090, CI 16185",
    "flair_text": "Product Question",
    "flair_template_id": "f0237a66-58bd-11e4-a1a9-12313b0e8234",
    "comments": [
      {
        "author": "ftr-mmrs",
        "body": "I wouldn't be concerned about it being a weaker substitute, since this was supposedly formulated as a chelating shampoo. This ingredient is listed pretty high in the list. Presumably because it is weaker, so you need more. \n\nEven with EDTA, it is usually in very low concentration when in hair care products for other formulation reasons. So when you see EDTA in you average shampoo, you cannot count on it being able to remove moneral buildup. Unless it specifically says it is formulated for that.\n\nBut if you want to try one more DIY before you bite the bullet and buy another product, try doing a citric acid rinse. Use 1/8t citric acid for 1.5-2c distilled water. Saturate the hair, and leave for a few minutes with heat. For more info, I got this from the following article when I lived in a hard water area: http://science-yhairblog.blogspot.com/2016/03/hard-water-and-your-hair.html?m=1",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Soap",
    "post_id": "1l3ja3g",
    "title": "The Very Long List of Things Derived from Coconut and Palm",
    "url": "https://www.reddit.com/r/Soap/comments/1l3ja3g/the_very_long_list_of_things_derived_from_coconut/",
    "score": 4,
    "num_comments": 3,
    "created": "2025-06-04T22:37:18+00:00",
    "body": "Below is a list I have compiled of all of the chemicals used in industrial manufacturing of everything from food to hygiene products that are derived from coconut and/or palm. There are a lot of products on the market that contain a lot of chemicals, many of which have by now become familiar sights in ingredients lists. There are an awful lot of them derived from coconut and palm exclusively, but there are also a lot of them that can be derived from other sources. There isn't any regulation currently in place (at least in the United States, that I am aware of) that requires manufacturers to disclose the source of their chemicals, which can lead to a lot of companies falsely claiming that their products are coconut and/or palm free, when they are just the opposite. Some of the chemicals you will see are things like Vitamin A-palmitate. This one in particular can be tricky as it can be found naturally in beef fat, or it can be derived from coconut or palm plants. You see it a lot in milk, particularly milk that is 2% or less milk fat, which would make you think that it is derived from beef fat, but when you start digging, you find out that it is far more readily available (and therefore cheaper for dairies to buy in the quantities they use) to acquire a palm derived version. Now, devil's advocate here, it may be simply that the dairies do not actually know that they are adding a palm derived product into their milk, as they are likely going through a bulk supplier.\n\nI have also come to realize that there are a lot of companies who advertise things as being coconut and/or palm free and are completely unaware that the chemicals they use come from those sources. Be aware, it is a long list, and these are just the ones that I know of:\n\n\n\nPalm derivatives: \n\nPalm Kernel \n\nPalm Kernel Oil\n\nPalm Fruit Oil\n\nPalmate\n\nPalmitate\n\nPalm olein\n\nGlyceryl\n\nStearate\n\nStearic Acid\n\nElaeis Guineensis\n\nPalmitic Acid\n\nPalm Stearine\n\nPalmitoyl Oxostearamide\n\nPalmitoyl Tetrapeptide-3\n\nSodium Laureth Sulfate\n\nSodium Lauryl Sulfate\n\nSodium Kernelate\n\nSodium Palm Kernelate\n\nSodium Lauryl Lactylate/Sulphate\n\nHydrated Palm Glycerides\n\nEthyl Palmitate\n\nOctyl Palmitate\n\nPalmityl Alcohol\n\nLaureth-7\n\nSteareth-2\n\nCocamide MEA (fatty acid-derived) \n\nCocamide DEA (fatty acid derived)\n\nStearamidopropyldimethylamine\n\nCetyltrimethylammonium chloride\n\nIsopropyl myristate\n\nCaprylic/capric Triglyceride\n\nFatty Isethionates (SCI)\n\nAlkylpolyglycoside (APG)\n\nLaurylamine oxide\n\n\n\nCoconut derivatives:\n\n1,3-Butanediol\n\nAlkyl Benzoate\n\nAlkyl Polyglucoside\n\nAmmonium Lauryl Sulphate\n\nArachidyl Alcohol\n\nBenzoic Acid\n\nBis-Diglyceryl Polyacyladipate-2\n\nButylene Glycol Dicaprylate/Dicaprate\n\nC12-15 Alkyl Benzoate\n\nCalamide\n\nCapryl Glycol\n\nCaprylhydroxamic Acid\n\nCaprylic Acid\n\nCaprylic Glycol\n\nCaprylic/Capric\n\nCaprylic/Capric Triglyceride\n\nCaprylyl Glycol\n\nCaprylyl/capryl Glucoside\n\nCentrimonium Chloride\n\nCeramide 3\n\nCeteareth-20\n\nCeteareth-30\n\nCetearyl Alcohol\n\nCetearyl Glucoside\n\nCeteth-20 Phosphate\n\nCetrimonium Chloride\n\nCetyl Alcohol\n\nCetyl Esters\n\nCetyl Ethylhexanoate\n\nCetyl PEG/PPG-10/1 Dimethicone\n\nCocamide MEA\n\nCocamide Mipa\n\nCocamidopropyl Betaine\n\nCocamidopropyl Hydroxysultaine\n\nCoco Glucoside\n\nCoco-Caprylate\n\nCococaprylate/Caprate\n\nCocomide DEA\n\nCoconut Alkanes\n\nCoconut Diethanolamide (CDFA)\n\nCocos Nucifera Oil\n\nCocoyl Amide Propyldimethyl Glycine\n\nCocoyl Diethanolamide\n\nCoir\n\nDecanoic Acid\n\nDecyl Alcohol\n\nDecyl Glucoside\n\nDicaprylyl Carbonate\n\nDiisostearyl Malate\n\nDisodium Cocamphodiprop\n\nDisodium Cocoamphodiacetate\n\nDisodium Laureth Sulfosuccinate\n\nDisodium Lauryl Sulfosuccinate\n\nDisodium Stearoyl Glutamate\n\nDodecanol\n\nGlycerin/Glycerine/Glycerol\n\nGlyceryl Behenate \n\nGlyceryl Caprylate\n\nGlyceryl Cocoate\n\nGlyceryl Dibehenate\n\nGlyceryl Glucoside\n\nGlyceryl Monostearate\n\nGlyceryl Ricinoleate\n\nGlyceryl Stearate\n\nHexyl Laurate\n\nInulin Lauryl Carbamate\n\nIsoceteth\n\nIsoamyl Laurate\n\nIsocetyl Stearate\n\nIsodecyl Neopentanoate\n\nIsopropyl Myristate\n\nKinetin\n\nLauramide DEA\n\nLaureth-23\n\nLaureth-3\n\nLaureth-4\n\nLaureth-7\n\nLauric Acid\n\nLauryl Alcohol\n\nLauryl Glucoside\n\nLauryl Sarcosine\n\nLauryl/Myristyl Polyricinoleate\n\nLaurylglucoside Crosspolymer\n\nMagnesium Stearate\n\nMethylsulfonylmethane\n\nMyristic Acid\n\nMyristyl Glucoside\n\nNeopentyl Glycol Dicaprylate/dicaprate\n\nNinol COMF-N\n\nNylon 12\n\nOctanediol\n\nOctyldodecanol\n\nOlefin Sulfonate\n\nOptiphen\n\nPEG-100\n\nPEG-100 Stearate\n\nPEG-30 Glyceryl Cocoate\n\nPEG-7 Glyceryl Cocoate\n\nPEG-8 Dilaurate\n\nPhenoxyethanol\n\nPolyglyceryl-10 Laurate\n\nPolyglyceryl-2 Sesquiisostearate\n\nPolyglyceryl-2 Triisostearate\n\nPolyglyceryl-4 Caprate\n\nPolyglyceryl-6 Caprylate\n\nPolysorbate 80\n\nPolysorbate-20 \n\nPotassium Cetyl Phosphate\n\nPotassium Cocoate\n\nPotassium Cocoyl Glycinate\n\nPPG-2 Hydroxyethyl Cocamide\n\nSarkosyl\n\nSodium Cocoamphoacetate\n\nSodium Cocoate\n\nSodium Coco-Sulfate\n\nSodium Cocoyl Glutamate\n\nSodium Cocoyl Isethionate\n\nSodium Laureth Sulfate\n\nSodium Lauroamphoacetate\n\nSodium Lauroyl Glutamate\n\nSodium Lauroyl Lactylate\n\nSodium Lauroyl Methyl Isethionate\n\nSodium Lauroyl Sarcosinate\n\nSodium Lauryl Sulfate\n\nSodium Methyl Cocoyl Taurate\n\nSodium PCA\n\nSodium Stearate\n\nStearalkonium Chloride\n\nStearic Acid\n\nStearyl lAcohol\n\nSucrose Cocoate\n\nSucrose Stearate\n\nTEA Lauryl Sulfate\n\nTegobetaine L7\n\nTocopheryl Acetate\n\nTocotrienols\n\nTricaprylin\n\nUndecylenoyl glycine\n\nZinc Stearate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chucker173",
        "body": "I’m very new here, what is the problem with things derived from Coconut and palm? Is coconut oil (the virgin stuff used for cooking) also bad?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "quarterdecay",
        "body": "Cite your sources? at least 5 of these are certainly not from coconut/palm oil, and no I'm not going to tell you which ones.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ouraring",
    "post_id": "o1igty",
    "title": "Electrical burn from oura ring",
    "url": "https://www.reddit.com/r/ouraring/comments/o1igty/electrical_burn_from_oura_ring/",
    "score": 3,
    "num_comments": 7,
    "created": "2021-06-16T23:18:14+00:00",
    "body": "I've worn my ring for more than 2 years while doing dishes, taking a shower, cleaning the house with various cleaners.....  I don't use much for caustic cleaners or things that leave a lot of residue due to the number of pets we have so I rarely have to worry about damaging the ring and only occasionally take it off first.\n\nSomehow while giving the fluffy husky a bath I rather severely burnt my finger.  I don't have anything that can focus well enough to take a pic and my husband has not been interested in helping with his amazing quality phone camera.  The dog shampoo had not arrived yet so I used plain unscented dawn dish soap to get the worst dirt off and then human moisturizing shampoo and conditioner.  The problem happened before I applied the new dog specific after bath coat conditioner for helping her excess fluff slide out and that was a spray I didn't really get on myself so everything I used was the same as I have repeatedly in other situations.  \n\n\nInitially I thought the flexible plastic brush with it's hand strap and finger loop were merely pushing the bulky ring into my finger.  I have very small hands and this is the widest and sharpest edged ring I've ever worn.  So I assumed despite trying to keep my finger farther back and avoid pushing on the ring the occasional times it did were the reason for the mild discomfort and red line on the back of my finger.  \n\n\nThe next morning that red line was a huge raised red welt in a strip as wide a the ring with larger areas that matched the spacing of the electrodes.  I decided it was most definitely not just from the ring digging in.  I moved my ring to my other hand.  It's continued to work as normal.  By evening I had 3 large blisters that broke and scabbed over.  While those healed during the next several days little itchy blisters appeared along the edges of the still large raised red welt across the back of my finger.  I heal fast so it was slightly concerning that this wound showed practically no sign of improving.  \n\n\nFinally over a week later new blisters stopped forming, the raised area suddenly went down practically overnight, and the damaged skin is peeling off.  I've always had a tendency to find ways to burn myself while cooking, fireworks(even sparklers), and once I melted some fine copper wire strands to the side of my finger in a rewiring oopsy on a low voltage device.  I'm pretty sure I have never managed to get a burn this severe.    \n\n\nUnfortunately I can't really tell you what the catalyst was given I've used all the same products in other situations and rinsed each one off thoroughly before the next.  The only unique thing in this incident was dog fur.  Doing dishes for hours, taking long showers with soaps, scrubbing the dogs with dry shampoo spray or wipes, wiping off the kitchen counters with mild chlorine based disinfectant (not at all similar to bleach), dusting with pledge, and mopping the floor with an oura ring on has not resulted in any problems.    \n\n\nMaybe soap covered dog fur can short out an oura ring?  Don't know but of all the things you do while wearing an oura ring apparently don't wash the dog. :P   \n\n\n  \n\n\nShampoo and conditioner used:  \n OGX coconut milk nourishing shampoo- Active Ingredients: Aqua (Water); Disodium Laureth Sulfosuccinate;  Cocamidopropyl Betaine; Cocamidopropyl Hydroxysultaine; Parfum; Glycol  Distearate; Dimethicone Copolyol; Cetyl Alcohol; Cocamide DEA; Guar  Hydroxypropyltrimonium Chloride; Polyquaternium-11; DMDM Hydantoin;  Panthenol; Silk Amino Acids; Cocos Nucifera (Coconut) Extract; Albumen;  Cocos Nucifera (Coconut) Oil; Hydrolyzed Milk Protein; Tocopheryl  Acetate (Vitamin E); Coumarin \n\n&#x200B;\n\nogx coconut milk conditioner- Water (Aqua), Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride,  Glycerin, Cocos Nucifera (Coconut) Oil, Cocos Nucifera (Coconut) Fruit  Extract, Glycol Stearate, Glycol Distearate, Ceteareth-20, Isopropyl  Alcohol, Dimethicone, Cyclotetrasiloxane, Citric Acid,  Cyclopentasiloxane, Panthenol, Ovum (Egg Powder), Propylene Glycol,  Tetrasodium EDTA, DMDM Hydantoin, Methylchloroisothiazolinone,  Methylisothiazolinone, Fragrance (Parfum).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Oura_Ring",
        "body": "Hi u/Keighan, thank you for sharing this story and we hope you are okay; we have messaged you for more information! - The Oura Ring Team :)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "warmweatherbluesky",
        "body": "I've been wearing the ring now for about 6 months. I received it as a birthday gift. I woke up this morning with with a large, discolored welt on my finger, underneath one of the rings sensors. I almost could not remove the ring due to the swelling.\n\nI thought, perhaps, it was a spider bite but that didn't make sense, especially because no other \"bites\" were found on my exposed skin. \n\nI also believe that the ring burned me. Perhaps, in my sleep, the sensors twisted toward the top of my finger where the delicate skin is as opposed to staying positioned underneath on the palm side my hand.\n\n I seem to recall when I initially received the ring that the literature stated to keep the sensors on the under side of your hand. Is that because they know it has the potential to burn the sensitive skin on the top of your hand?\n\nThis is unfortunate. I love my ring.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "InexperiencedCoconut",
        "body": "I sure hope you contacted Oura!! Glad it's feeling better now",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ScoutyMonster",
        "body": "I have a burn as well and I didn't give my dog a bath. LOL I take it off to shower; so it must have happened over time while washing my hands or some such.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2aw8p3",
    "title": "Thoughts on Wright's Coal Tar Soap?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2aw8p3/thoughts_on_wrights_coal_tar_soap/",
    "score": 3,
    "num_comments": 0,
    "created": "2014-07-16T21:23:35+00:00",
    "body": "For around a year I used coal tar soap, and found it was brilliant for my acne problems, reducing redness and preventing spots from forming. I was just asking as I do feel a 'tightness' in my face after using it, and was worried that continued use could lead to wrinkles ect. \n\nSo what I ask of you skincare addiction, is it ok to use this soap as a daily pm face wash? \n\nIngredient list: Sodium Tallowate,Sodium Cocoate ,Aqua ,Sodium Palm Kernelate ,Cocamide DEA ,Parfum ,Sodium Chloride ,Glycerin ,Melaleuca Alternifolia Oil ,Tetrasodium EDTA ,Eugenol ,d-Limonene ,Etidronic Acid ,Amyl Cinnamal ,Cinnamal ,Coumarin ,CI 11680 ,CI 15510\n\nPurchase link: http://www.tesco.com/groceries/Product/Details/?id=255325749",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "igjem4",
    "title": "Patch testing results- new product help!",
    "url": "https://www.reddit.com/r/eczema/comments/igjem4/patch_testing_results_new_product_help/",
    "score": 3,
    "num_comments": 1,
    "created": "2020-08-25T19:39:24+00:00",
    "body": "I’ll try to make this short but here’s my backstory: I’ve been suffering from contact dermatitis for 2.5 years. Mostly on my hands, but within the last year I have had patches of eczema on my inner elbows, neck, back of knee, legs, hips and back. I work night shift as an RN and never had a problem before I started my job 3 years ago (other than dry skin- but not like this and only seasonal). \n\nAbout two months ago I had the patch testing done with my dermatologist. I found out my allergens are: \nNickel\nFragrance \nCocamide DEA\nDMDM Hydantoin \nQuaternium-15 \nTosylamide/Formaldehyde Resin\n\nAt the appointment, I got a steroid shot. It helped clear up my skin for about two weeks (I went on vacation at that time) but as soon as I got back to work, it flared up again. I have so far been able to eliminate majority of these ingredients, however I feel like I am missing something. Does anyone have any experience with any of these allergens? (Specifically the Cocamide DEA, that seems to give me the most trouble). \n\nI have been using the “safe list” from ACDS Camp, however when I look at the ingredients of some of the products, there are similar names (ex: quaternium-15 vs. quaternium-60). I was told by my dermatologist to avoid any similar sounding ingredient, which seems to leave my with very few products to use. \n\nHoping someone out there has similar allergens and could help me! And any words of encouragement are always welcome!",
    "flair_text": "patch testing",
    "flair_template_id": "85305520-2e75-11e9-87f3-0e83b5482ce4",
    "comments": [
      {
        "author": "Afflicted_By_Fiction",
        "body": "I’m getting patch testing done in a week, so if I learn anything useful I will be sure to share!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tattoo",
    "post_id": "a1wrlv",
    "title": "Soap for new tattoo",
    "url": "https://www.reddit.com/r/tattoo/comments/a1wrlv/soap_for_new_tattoo/",
    "score": 2,
    "num_comments": 9,
    "created": "2018-11-30T21:39:36+00:00",
    "body": "I can't seem to find frangrance free soaps in any of my stores. The only one I saw if this bar soap that's supposed to brighten the skin too. \n\nThe ingredients are: Triethanolamine, Stearic Acid Water, Myristic Acid, Glycerin, Sodium Hydroxide, Cocamide DEA, Mineral Oil, Tetrasodium EDTA, Sodium Metabisulfite, Arbutin, BHT, CI 77499.\n\nDoes anyone know if I can use this or not? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Grogtron",
        "body": "All my artists have been recommending liquid Dial Gold hand soap",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "TaylorAtYourLeasure",
        "body": "I would recommend not using a bar of soap. Most likely it’ll hurt like hell, and it’ll not be completely hygienic for multiple uses.\n\nMy tattoo artist said that if you use scented soap, just make sure it’s a gentle scent and antibacterial. Nothing from bath and body works or Victoria’s Secret. I used a foaming soap and it felt really nice and didn’t hurt to use it.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "NotDefinedByT1D",
        "body": "Softsoap® Crisp Clean Antibacterial Liquid Hand Soap is what used. Worked great, no issues.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Lyric-Girl",
        "body": "Aveeno",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Zlatehagoat",
        "body": "I actually use liquid soap personally I like  normal antibacterial soap  (protex hand soap). Works good for me .",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "floxies",
    "post_id": "11lr7d6",
    "title": "Can soap cause a flare ?",
    "url": "https://www.reddit.com/r/floxies/comments/11lr7d6/can_soap_cause_a_flare/",
    "score": 3,
    "num_comments": 5,
    "created": "2023-03-08T08:51:52+00:00",
    "body": "Hey everyone,\n\nIm 10.5 months out and feeling alright.\n\nI have dry skin on my hand and it has a few cracks here and there and they bleed just a little... so I washed my hands with some soap and I was just wondering if this could give me a flare ? Because soap got in contact with my blood (cracks). Washed them about 3-4 times yesterday didnt even realize.\n\nCould this give me long term problems ? or damage me further ?\n\nIm extremly anxious :(\n\nSoap contains:\n\n-Aqua\n\n-Sodium Laureth Sulfate\n\n-Sodium Chloride\n\n-Sodium Lauryl Sulfate\n\n-Cocamide DEA\n\n-Aloe barbadensis Leaf Extract\n\n-Citric Acid\n\n-Tetrasodium EDTA\n\n-Parfum\n\n-Methylisothiazolinone\n\n-Methylchloroisothiazolonine\n\n-Benzyl Alcohol\n\n-Styrene/Acrylates Copolymer\n\n-Hexyl Cinnamal\n\n-CI 19140\n\n-CI 42051\n\nHope someone can reply. tnx ❤️",
    "flair_text": "[TRIGGERS]",
    "flair_template_id": "fc101b2e-9f23-11ea-985a-0e2e0853ed5d",
    "comments": [
      {
        "author": "Mint_Crayon",
        "body": "If you had a reaction, it could be a sensitivity or allergy to fragrance chemicals.\nI went fragrance free in ALL products, fragrances make me very ill. \n\nSkin rashes, dryness, migraines, dizzy, more pain, more brain fog etc. It could be flaring my Floxxing, or simply making their own symptoms. Lots of people are reacting to fragrances, and not even knowing it. I've helped a few friends find that their \"mystery symptoms\" were actually from a fragrance sensitivity.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "vadroqvertical",
        "body": "very unlikely that soap can give you a flare,\n\ni am not saying it can't but if you feel alright after 10 months, i doubt it should flare you",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "betterweirdthandead6",
        "body": "I seriously doubt soap could flare you, I've never heard of anything like that. Try to do something to distract/calm yourself and forget all about it.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "b4cilr",
    "title": "Is this okay to use as a clarifying shampoo when needing to restart and clarify?",
    "url": "https://www.reddit.com/r/curlyhair/comments/b4cilr/is_this_okay_to_use_as_a_clarifying_shampoo_when/",
    "score": 3,
    "num_comments": 3,
    "created": "2019-03-23T00:10:48+00:00",
    "body": "Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamide DEA, Cocamidopropyl Betaine, Glycerin, Citric Acid, Parfum, Phenoxyethanol*, Benzoic Acid*, Dehydroacetic Acid* \n\nI know it has SLS but that's okay when using as a last time shampoo and doing the cg method only after? And to use this shampoo when I need to clarify completely every couple of months?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "peachygif",
        "body": "It’s good, you can use any shampoo with sulfates as a clarifying shampoo when you need to do a reset wash",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "HaveCourageToExist",
        "body": "Should work great for clarifying! I see sulfates and no silicones, you're good to go.",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rosacea",
    "post_id": "pehqkb",
    "title": "anyone in europe? what cleanser and moisturizer do you use?",
    "url": "https://www.reddit.com/r/Rosacea/comments/pehqkb/anyone_in_europe_what_cleanser_and_moisturizer_do/",
    "score": 2,
    "num_comments": 13,
    "created": "2021-08-30T13:08:09+00:00",
    "body": "i'm a student on a budget with **type 1 rosasea**. Derm gave me **anti redneess cream** and **sunscreen**. I genuinely doubt she would know a good moisturizer and cleanser that wouldnt aggravate rosacea so i figured i would ask people on the same boat as me who  probably  have  tried hundreds of products combined. \n\n Ive been googling ingredents all day and im just tired. \n\nI used a cheap moisturizer with **paraffin** in it and apparently thats a no no. \n\nAs for my cleanser its \"**Gel Pyzn**\" which im pretty sure isnt good for me either cause my face gets red afterwards. (**ingredients** for anyone curious:  Aqua, Sodium Laureth **Sulfate**, Lauryl Glucoside, Acrylates/Steareth 20, Methacrylate Copolymer, Zinc Pyrithione, Triethanolamine, Cocamide Dea, Laureth-2, Phenoxyethanol, Methylparaben, Ethylparaben, Propylparaben, Butylparaben, Edta, Parfum, Citral Hexyl Cinnamal, Limonene Linalool. )\n\n Thank you. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "-Kai-",
        "body": "I'm in northern Europe so my product availability varies a bit from the other countries, but in my experience the best has been to look for products with simple ingredients without a lot of fluff. \n\nNone of the Rosacea specific products I have tried have been very effective (Eucerin, Avene, La Roche Posay, ACO - which is a swedish pharmacy brand), they always contain some unnecessary ingredients that trigger my acne or irritate the skin. It's really annoying.\n\nOne of my safe fall-back products is \"Avène Tolerance Extreme Emulsion\". It's not miraculous, but it has minimal ingredients and is decently moisturizing, which makes it a good baseline for when you're trying to deal with rosacea. The sebamed face gel is another good simple moisturizer if you can get your hands on it. It's very difficult to find in Sweden but I know it's readily available in a lot of central european countries.\n\nAs for the cleanser, the one you listed looks quite bad. It has a lot of aggravating ingredients (perfume, limonene, SLS etc)\n\nThat said all of this varies a lot based on how your skin is. Personally I can't handle any heavy products with shea butter which rules out a lot of fantastic moisturizers. I have to make due with gel ones, but if your skin is on the dry side you may find yourself needing something heavier.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "dalidalix",
        "body": "Do all green sunscreens serve as foundation? Mine is also green. Yes im a guy no idea about this haha\n\nAlso ye i looked for all the main products recommended online and al its all unavailable but we certainly have bioderma so i ll look into that thank you",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ntinaras30",
        "body": "Cerave is classic I use the PM one every once in a while, next buy will.be with SPF protection for day use, I just use a tiny amount right after shower because its a little heavy, but it does moisturize well. About cleansers try to use a little amount, the ones with foam are more gentle, and dont over do it. Just dont suffocate your skin...stay away from heat and alcohol abuse, spicy food etc. Anything that flares you up is a no no.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "exactreplica",
        "body": "Clinique Take The Day Off balm is effective and doesn’t make my skin irritated at all. A tub lasts a long time; you don’t need to use much each time.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "silversilv",
        "body": "If your skin is very reactive, I'd definitely recommend (quite everything) from the Bioderma Sensibio AR series.\nI'm using this gel here: https://www.naos-store.co.uk/collections/bioderma/products/bioderma-sensibio-foaming-gel-200ml\n\nTheir products are available worldwide, they're just kind of an underdog somehow, but offer quite amazing stuff I've been using nearly exclusively the past 5 years now. \n\nThey also have a moisturizer, a tinted BB cream, the sunscreen of the Sensibio series is also amazing.\n\nI'm also extremely grateful for having discovered Deruba. It is a green tinted sunscreen that moisturizes and looks like a BB cream on your skin, so no need for layers of moisturizer, sunscreen and makeup anymore with that one.\n\nOh and I get all of that on Amazon.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "OrganicChemistry",
    "post_id": "u0t91p",
    "title": "What decides if a surfactant has a tendency to foam or not?",
    "url": "https://www.reddit.com/r/OrganicChemistry/comments/u0t91p/what_decides_if_a_surfactant_has_a_tendency_to/",
    "score": 3,
    "num_comments": 1,
    "created": "2022-04-10T22:53:39+00:00",
    "body": "Cocamidopropyl betaine and cocamide DEA are very strong foaming agents while long carbon chain surfactants tend to have low foaming activity.\n\nIf someone posted a link to a more detailed article that would be nice.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jthockey",
        "body": "A betaine is a fatty quat that is water soluble and forms excellent foam micelle structures. Long carbon chain surfactants is incredibly broad and can mean a lot of things. Nonionics will foam but not be stable, whereas quats make stable foams. \n\nI’m general as you increase carbon chain length for say the alcohol or acid you’ll decrease water solubility. This will make your compound more like a defoamer if it doesn’t mix with water. It should not be hard to find general foaming information for entry level surfactant books",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1u4r36",
    "title": "Questions on home laser hair removal and electric cleansers.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1u4r36/questions_on_home_laser_hair_removal_and_electric/",
    "score": 3,
    "num_comments": 11,
    "created": "2014-01-01T01:24:35+00:00",
    "body": "**Home laser hair removal:**\n\n\nI have been lasering my skin at a dermatologist's clinic for 5+ years (face, neck, arms, legs, pits, and privates). I haven't waxed my legs in years, I found the laser to be very effective. However, I have moved to the UK and feel the need to \"touch up\". The clinic next to me is ridiculously expensive and to be honest, I just need a touch up every now and then, not full sessions. Which home laser hair removal would you recommend? Having searched the subreddit, I found only one post mentioning home laser hair removal, and it said that the No!No! hair removal system was awful. Please feel free to recommend products that are not in the UK, my relative will be visiting me from home and can easily purchase most products.\n\n\n\n**Electric cleansers**\n\nI have sensitive acne-prone skin. I have been on Roaccutane, and it seemed to have worked..but now I find myself breaking out again. This could also be due to hormonal imbalances as my menstrual cycle has been out of whack and I had to go through 3 cycles in 1 month. I spoke with a doctor and was told that my skin would settle down with time.\n\nI am using baby oil for the Oil Cleansing Method. I started cleaning my face with oil last month. It seems ok. I don't notice any amazing mind-blowing results.  I use a foaming cleanser called [Simple](http://www.simple.co.uk/our-products/product/kind-to-skin-vital-vitamin-foaming-cleanser.html)--click on the \"Our special blend\" tab to see the ingredients. Please feel free to recommend a different cleanser (please keep in mind that I am a uni student):\n\n>Aqua, Sodium Laureth Sulfate, Cocamide DEA, Glycerin, PEG-7 Glyceryl Cocoate, Panthenol, Cocamidopropyl Betaine, Bis-PEG/PPG-20/20 Dimethicone, Sodium Methylparaben, Citric Acid, Sodium Chloride, Tocopheryl Acetate, Dipropylene Glycol, 2-Bromo-2-Nitropropane-1,3-Diol, Pantolactone, Anthemis Nobilis Oil, Pelargonium Graveolens Oil\n\n\n\nI apply a very thin layer of Adapelene (third-generation topical retinoid) on my face every other night. I do not apply it every night because it dries up my skin and causes flakiness.\n\nI have read a lot of online reviews as well as watched many, many YouTube tutorials that praise different types of facial cleansers. Which ones have you used? Would you recommend any particular brand and model? Are they good or bad for you in general?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "sirenita12",
        "body": "I was also on Accutane & currently oil cleanse. I use goat milk soap to take off the oil. Since you said roaccutane, I'm going to go ahead & assume UK. I don't know a good place for goat milk soap there, but I would highly recommend it- super gentle. \n\nIf you wind-up finding a good hair removal device, please please let me know. It's been about 6 years since Accutane, so I think it'd be okay to use now.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ospray",
        "body": "I didn't think there were any at-home laser treatments? Isn't No-No a thermal remover?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1u8zp4",
    "title": "Advice on Organix Thick and Full Biotin and Collagen Shampoo.",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1u8zp4/advice_on_organix_thick_and_full_biotin_and/",
    "score": 4,
    "num_comments": 4,
    "created": "2014-01-02T19:20:30+00:00",
    "body": "[This](http://www.amazon.com/gp/product/B00ADRH2OM/ref=ox_sc_act_title_1?ie=UTF8&psc=1&smid=ATVPDKIKX0DER) is what I'm thinking of getting. I have fine short hair and not a lot of it. I'm slowly moving to not shampooing everyday and its going well. I like the price and the ingredients list doesn't look too bad? \nThe ingredients list:\n> Dl Water, Disodium Laureth Sulfosuccinate, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocamidopropyl Hydroxysultaine, Dimethicone Copolyol, Cocamide DEA, Glycol Distearate, Biotin, Hydrolyzed Collagen, Hydrolyzed Wheat Protein, Cocoa Butter (Theobroma Cacao), Parfum,",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jewishvampire",
        "body": "your hair is dead tissue, and putting biotin or collagen or anything else on it isn't going to make it thicker. [this blog post](http://www.brightestbulbinthebox.com/2013/01/beauty-bullshit-keratin-and-split-ends.html) deals with keratin specifically, but the explanations of why it doesn't work would apply to biotin and collagen as well.\n\nhowever, if the shampoo is working fine for you otherwise, it's good! just don't expect it to actually thicken your hair. :) i personally found the ogranix shampoos to be really drying, but they are sulfate free, so it's just a matter of preference.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "MonicaG7",
        "body": "I can't say anything from a scientific viewpoint on the ingredients but I use this shampoo and conditioner and really like it. I have fine, color treated hair. The shampoo cleanses well and the conditioner makes my hair feel silky. It doesn't really make it look any thicker but it is very nice. The smell is also amazing.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "liamquips",
        "body": "I use it on my fine short hair and love it. I have way more volume than I did with my previous routine. I definitely recommend using a clarifying shampoo 1-2 x a week when you use this though, because it builds up in your hair.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "moderatelygranolamoms",
    "post_id": "1hisau3",
    "title": "Mollys Suds contains cocomide mea, whereas cocomide dea is a carcinogen on the prop 65 list that can cause cancer. Is cocomide mea really better/safer?  ",
    "url": "https://www.reddit.com/r/moderatelygranolamoms/comments/1hisau3/mollys_suds_contains_cocomide_mea_whereas/",
    "score": 4,
    "num_comments": 11,
    "created": "2024-12-20T19:59:53+00:00",
    "body": "From Google:  **C-MEA is a white and waxy substance and C-DEA is an often clear liquid**, but both are used by cosmetic and personal hygiene manufactures as a foaming or thickening agent in soaps and body wash, shampoos, and other cosmetics\n\n\"Cocamide DEA is on the Proposition 65 list because **it can cause cancer**. Exposure to cocamide DEA may increase the risk of cancer. Proposition 65 requires businesses to determine if they must provide a warning about significant exposure to listed chemicals.\"\n\nFrom another site \"It comes from coconut oil and is a foaming agent used to make bubbles and also acts as a thickener. But it is also a carcinogen — a cancer causing chemical.\" \n\nIs cocomide mea really safer? Its an ingredient in Mollys Suds. Are they substituting one toxic chemical with another? Or is it really better? ",
    "flair_text": "Cleaning+Laundry Recs",
    "flair_template_id": "7675ce56-51c0-11ef-af41-4e82c8e89bce",
    "comments": [
      {
        "author": "Internal_Armadillo62",
        "body": "https://www.ewg.org/skindeep/ingredients/701517-COCAMIDE_MEA/\n\n>Common concerns\n>See how this product scores for common concerns.\n\n>- Cancer LOW\n>- Allergies & Immunotoxicity LOW\n>- Developmental and Reproductive Toxicity LOW\n>- Use Restrictions HIGH\n\n>CONCERN\n>- Violation of industry recommendations - Restricted in cosmetics; use, concentration, or manufacturing restrictions - Unsafe in products left on skin and not rinsed off\n>- Determined safe for use in cosmetics, subject to concentration or use limitations - Safe for use in cosmetics with some qualifications\n\nSafer? Definitely.\n\nEdit: formatting",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Meaning_Green",
        "body": "I don't even see that as an ingredient, are you talking about the laundry powder?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "pnw-steve",
        "body": "The Mollys Suds website has an [ingredients page](https://mollyssuds.com/pages/ingredients-we-use) that mentions Cocamide MEA and says it's in their All Sport detergent. However, oddly, their all [sport detergent page](https://mollyssuds.com/products/all-sport-wash-active-wear-detergent?_pos=1&_sid=d822fefe7&_ss=r) doesn't have that in the ingredients. Maybe they reformulated?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Thanks for your post in r/moderatelygranolamoms! Our goal is to keep this sub a peaceful, respectful and tolerant place. Even if you've been here awhile already please take a minute to [READ THE RULES.](https://www.reddit.com/r/moderatelygranolamoms/about/rules) It only takes a few minutes and will make being here more enjoyable for everyone! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/moderatelygranolamoms) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "jsmith19977",
        "body": "FWIW I use attitude laundry products and they work great!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "avathedot",
        "body": "To be fair almost everything is marked prop 65 now. I worked in Ulta when that law passed that required that labeling and I remember having to go through the store and put a sign or sticker on things while the brands repackaged. It was so many products.\n\nThe goal I feel is to limit exposure where we can, and although I don’t use mollys suds, it’s sooooooo much better than like gain with all that fragrance.  But it get so frustrating looking at ingredients. The ewg helps but some brands don’t pay for the testing so they’re not on there\n\nEdit:typo",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MajesticBuffalo3989",
        "body": "Following",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "Suitable-Maximum-310",
        "body": "Following too",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "kfxo71",
    "title": "Looking for new Shampoo and Conditioner",
    "url": "https://www.reddit.com/r/Hair/comments/kfxo71/looking_for_new_shampoo_and_conditioner/",
    "score": 2,
    "num_comments": 1,
    "created": "2020-12-19T00:44:21+00:00",
    "body": "As the title suggests, I'm trying to find new shampoos and conditioners, as I guess the stuff I've been using isn't too healthy. My hair is wavy, and currently an inch or so under my jaw, but I'm planning on growing it to about my shoulder blades.\n\nI've found Rocky Mountain Barber Co and Blackwood, but I don't know anything about ingredients, so I came to ask if these are a good choice.\n\nThese are the daily variants of Blackwood shampoo/conditioner, but I'll only be using the shampoo 3 times a week, and I might not condition every day.\n\nBlackwood shampoo: Water, Cocamidopropyl Betaine, Fragrance, PG, Alcohol Denat., Sodium Laureth Sulfate, Cocamide DEA, Aloe Vera Extract, Tsubaki Oil, Licorice Root, Clove Flower Extract, Rehmannia Glutinosa Root Extract, Seaweed Extract, Panax Ginseng Root Extract, Peach Leaf Extract, Swertia Japonica Extract, Arbutin, Citric Acid, Menthol, Magnesium Ascorbyl Phosphate, Arginine, Hydrolyzed Silk, Sodium Hyaluronate, Glycerin, Sodium Cocoyl Glutamate, Potassium Cocoyl Glutamate, Sodium Lauroyl Methylaminopropionate, Polyquaternium-10, Cetyl-PG Hydroxyethyl Palmitamide, Piroctone Olamine, BG, Alcohol, Sodium Chloride, Tetrasodium EDTA\n\nBlackwood Conditioner: Water, Mineral Oil, Glycerin, Fragrance, Stearyl Alcohol, Cetyl Alcohol, Panax Ginseng Root Extract, Peach Leaf Extract, Clove Flower Extract, Rehmannia Glutinosa Root Extract, Seaweed Extract, Aloe Vera Extract, Tsubaki Oil, Licorice Root, Swertia Japonica Extract, Arginine, Citric Acid, Arbutin, Magnesium Ascorbyl Phosphate, Hydrolyzed Silk, Sodium Hyaluronate, Steartrimonium Chloride, Stearyl Propyltrimonium Chloride, Dimethicone, Cyclopentasiloxane, Trideceth-3, C12-14 Pareth-5, Polyquaternium-10, Cetyl-PG Hydroxyethyl Palmitamide, Ethylhexyl Methoxycinnamate, BG, Alcohol.\n\nAnd these are the ingredients for the Rocky Mountain:\n\nShampoo: Water, Ammonium Lauryl Sulphate, Ammonium Laureth Sulphate, Cocamidopropyl Betaine, Sodium Lauryl Sulfosuccinate, Glycerin, Polyquaternium 7, Phenoxyethanol, Ammonium chloride, Menthol, Cannabis Sativa (hemp seed) oil, Mentha Piperita ( Peppermint) Oil, Melaleuca Alternifolia (Tea Tree) Oil, Eucalyptus Globulus (Eucalyptus) Oil, Hydrolyzed Keratin, Citric Acid.\n\nConditioner: Water, Cetyl Alcohol, Polyquaternium 7, Glycerin, Cetrimonium Chloride, Amodimethicone (and) Trideceth-12 (and) Cetrimonium Chloride, Stearyl Alcohol, Phenoxyethanol, Menthol, Cannabis Sativa (hemp seed) oil, Mentha Piperita (Peppermint) Oil, Melaleuca Alternifolia (Tea Tree) Oil, Eucalyptus Globulus (Eucalyptus) Oil, Hydrolyzed Keratin, Guar Hydroxypropyltrimonium Chloride, Citric Acid.\n\nAt first glance the rocky mountain seems better, due to its shorter list, but I know next to nothing, other than that SLS (or from what I've heard at least over use of SLS) and Parabens are bad.\n\nSorry for the wall of text, but any help would be appreciated.",
    "flair_text": "Question",
    "flair_template_id": "8ca8c0c4-19ec-11e8-a6e5-0ed094bb9d2e",
    "comments": [
      {
        "author": "BvbblegvmBitch",
        "body": "There's a lot of *good* ingredients in these but it's kind of counter productive when they put sulphates and dimethicone in them as well as a handful of other not nice ingredients. \n\nIf you want to keep it cheap but have high quality ingredients go for either OGX, Shea Moisture, Maui Moisture, Live Clean or Costco's own brand which is just repackaged purology. \n\nKeep an eye out for words like moisturizing, hdyrating, repair, curls, etc on the labels. Those are better for wavy hair.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1b8yoc4",
    "title": "[Product request] Dry and cracked skin after a cleanser?!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1b8yoc4/product_request_dry_and_cracked_skin_after_a/",
    "score": 2,
    "num_comments": 4,
    "created": "2024-03-07T16:18:45+00:00",
    "body": " Hello! I'm new to skincare, and I recently started using some skincare products.\n\nI have a not-too-much oily skin, maybe also a bit dehydrated. I started some days ago with a few products, without any acid or strong active, and I'm quite sure that the culprit of my current situation is a normal, trivial cleanser.\n\nIts ingredients are: Aqua, Mea-Lauryl Sulfate, Cocamide Dea, Alcohol Denat., Phenoxyethanol, Sodium Dehydroacetate, Citric Acid, Sodium Benzoate, Parfum.\n\nI cleaned my face with it for three days, morning and night (at night I also used a chamomilla tonic and a hydrating cream), without anything bad happening. My skin looked so clean and happy. Then I woke up in the morning, used it (and only it, nothing else), and after an hour my skin started to feel a bit weird, some redness right under the eye-zone and near to the nose showed up, I had a bit of a burning feeling. Now, after two days from then, my skin is cracked, dry and peeled all around my lips and around my nose (also on the cheeks near the nose zone), and also on my chin. Still have a bit of redness under the eye contour.\n\nIn these two days I stopped using that cleanser (I'm using a gentle oil cleanser that I know my skin tolerates well), and I'm using a hyaluronic acid serum and a hydrating cream. But the situation doesn't improve. So my questions for you are:\n\n1) Could you suggest some products to solve this situation, or give me any advice?\n\n2) Why did the cleanser do that to my skin? It looks like a normal water-based cleanser with a strong Alcohol smell\n\nThank you in advance for your reply!",
    "flair_text": "Product Request",
    "flair_template_id": "8beab48a-f016-11ec-b297-8206d914d459",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Vegetable-Fix-4702",
        "body": "Straight Shea or mango butter.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "dubberpuck",
        "body": "Vaseline after your moisturizer for a few days. Your cleanser is too drying or striping for your skin.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "1g2kklg",
    "title": "Can the ingredients in a sebum-regulating shampoo induce hair diameter reduction?",
    "url": "https://www.reddit.com/r/tressless/comments/1g2kklg/can_the_ingredients_in_a_sebumregulating_shampoo/",
    "score": 2,
    "num_comments": 7,
    "created": "2024-10-13T07:46:43+00:00",
    "body": "Hi, I (21M) used to have high-density, thick hair and I've never done nothing particularly stressful to them. In 2022 I did perm and done it for a total of three times (Jul 2022, Nov 2022, Jul 2023) until July 2023. During the last perm I noticed my scalp to be much more drier to the point of continuous flaking and itching (everything started when I used a more natural shampoo), so in Oct 2023 I decided to cut my hair short, changed shampoo and started with biotin supplements and give them time to relax e regrowth. This helped a lot since I've never had problem until Jan 2024, when flaking reappeared, as well as the itching, stronger than the previous summer even though the shampoo I was using hadn't caused any problems from Oct to Dec. I didn't went to the dermatologist cause I didn't have much money.\n\nThe situation has stabilized until the flaking reappeared in may-jun of this year, so I finally went to a dermatologist that told me to buy a specific sebum-regulating shampoo. It helped a lot and everything disappeared, the only negative fact is that if this shampoo goes on my back or my shoulders, it causes redness and triggers pimples. Aside from this effect, everything went back to its original balance. \n\nNow that everything is pretty calm, since summer has ended and classes have restarted, I noticed that my hair are way more thin, but not dry or fragile, and fall more easily than what they used to and I don't know why. Is it proven that some ingredients in a shampoo may cause the reduction of hair diameter, considering what it may do to my back and shoulder? Or all shampoos can have this effect it they goes in a different place than the scalp? For the hair loss, maybe it's because it's autumn and it's normal to have more hair in their telogen phase. \n\nFor the history of hair loss in my family: from mother's side, my uncles has all their hair and they're thick and my grandpa only had only receding hairline that accentuated when he was old; from father's side, my dad lost his hair at 30/35, my uncle started when he turned 50 and my grandpa lost a part of them only because he did chemo, but still has dark gray hair. Based on the hair I had, I should hope to not lose them, since I took from my mother.\n\nThank you for your support!!\n\nPS: At the moment I'm not going to the dermatologist because it wasn't a good experience since she check me in less than three minutes and I don't have much money to go to an another private one because last time I paid for the visit myself.\n\n\n\nThese are the components of the shampoo the dermatologist suggested and I'm using: water, sodium myreth sulfate, disodium undecylenamido MEA-sulfosuccinate, sucrose laurate, cocamidopropyl betaine, cocamide DEA, propylene glycol, PEG-120 methyl glucose dioleate, Camellia sinensis leaf extract, pyridoxine HCl, panthenol, alcohol, phenoxyethanol, hydrolyzed collagen, sodium PCA, parfum, piroctone olamine, sodium chloride, glycerin, hydroxyacetophenone, sodium benzoate, disodium EDTA, hydrolyzed keratin, benzoic acid, biotin, ammyl cinnamal, linalool.",
    "flair_text": "Product",
    "flair_template_id": "406d510a-4ba1-11ea-8492-0e4320351cb3",
    "comments": [
      {
        "author": "Apart-Badger9394",
        "body": "I think it’s more likely that you are experiencing MPB. \n\nUsually, sebum-controlling products *help* hair diameter/hair loss. Sebum is correlated to hair loss. So shampoos like Ketoconazole shampoo helps sebum, and fungus, and can help hair thicken. Does your shampoo have Ketoconazole as an active ingredient? You could try this as a replacement shampoo. \n\nThen, you can wait a few months to see if it helps sebum issue and also restores hair. \n\nYou might want to start researching Finasteride and considering you might be experiencing MPB/AA hair loss",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "It looks like this post is about general **products**.\n\nBefore asking any questions,\n\n1. Learn about [different hair loss products](https://tressless.com/learn).\n\n2. [Search for products](https://tressless.com/products)\n\nIf this post is not about hair loss products, please downvote and report.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ZedOpenGG",
        "body": "I've had seborrheic dermatitis in the past and experienced a lot of hair loss due to that. I've tried ketoconazole shampoo and that didn't do anything besides ripping a hole in my wallet. I swapped to a pretty basic anti oily dandruff shampoo that cleans and hydrates the scalp to prevent sebum buildup a few months ago and haven't had any issues since then.\nFrom my experience the shampoo itself does not contribute to diameter reduction. \nThat is probably a result of the seborrheic dermatitis, as it can lead to scarring of the scalp.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Drugs_and_Devices",
    "post_id": "m1bs8u",
    "title": "Anyone know of a ketoconazole shampoo free of cocamide DEA or MEA?",
    "url": "https://www.reddit.com/r/Drugs_and_Devices/comments/m1bs8u/anyone_know_of_a_ketoconazole_shampoo_free_of/",
    "score": 2,
    "num_comments": 0,
    "created": "2021-03-09T17:42:10+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Drugs_and_Devices",
    "post_id": "k3bszp",
    "title": "Cocamide DEA/MEA-free ketoconazole shampoo - is there one?",
    "url": "https://www.reddit.com/r/Drugs_and_Devices/comments/k3bszp/cocamide_deameafree_ketoconazole_shampoo_is_there/",
    "score": 2,
    "num_comments": 1,
    "created": "2020-11-29T16:05:04+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "MarcDooms",
        "body": "Compound it yourself: [https://pubmed.ncbi.nlm.nih.gov/23350210/](https://pubmed.ncbi.nlm.nih.gov/23350210/)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "l33710",
    "title": "[Product Question] Hada Labo - Foaming Face Wash: USA vs Japan version",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/l33710/product_question_hada_labo_foaming_face_wash_usa/",
    "score": 2,
    "num_comments": 2,
    "created": "2021-01-23T02:30:18+00:00",
    "body": "[https://incidecoder.com/compare-products/hada-labo-goku-jyun-foaming-face-wash/hada-labo-gokujyn-hyaluronic-acid-cleansing-foam](https://incidecoder.com/compare-products/hada-labo-goku-jyun-foaming-face-wash/hada-labo-gokujyn-hyaluronic-acid-cleansing-foam)\n\nI have cheeks prone to getting dry and I'm wondering which version would be better suited for me. I've heard people say it can be drying, but not specifying which one; which leaves me confused. The Japan one *seems* more hydrating but has Cocamide DEA that I'm not sure about.\n\nThank you for any insight!!\n\n&#x200B;\n\nedit: There's a $10 difference between the two. I don't know if the more expensive one would be worth it, but I hope it is ",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "Amisamil",
        "body": "I didn’t know there was a US version. I’ve used the Japanese one and I didn’t find it drying. I have dry skin",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "acne",
    "post_id": "5xwtc4",
    "title": "Can't finish this battle (support needed)",
    "url": "https://www.reddit.com/r/acne/comments/5xwtc4/cant_finish_this_battle_support_needed/",
    "score": 2,
    "num_comments": 9,
    "created": "2017-03-06T23:30:33+00:00",
    "body": "I started to suffering from acne when I was around 14yo, there were hard times, but this was in the past. Now I still can't achieve a fully clean face. I'm testing 0.1% gel Differin now from two months, and I'm not sure if this even affects my acne. My acne just disappears in one place and materialize in another. It feels like lost fight, like tilting at windmills. Maybe I'm doing something wrong?\n\nI have habits of not touching my face, and my daily routine is: morning - face wash, cream if my face is dry or cream with sunscreen if going outside. At evening I face wash, wait around half an hour and use medicine, then after next half, I use cream if my face is dry. I try not to squeeze, and if it happens, I disinfect it. I'm eating very healthy; now paleo; mainly veggies and meat with little sweets, going vegan don't make any difference to my skin. I take supplements: zinc, vit d6, and creatine. \n\nI used: \n\n* adapalene - (now) little or not effective\n\n* azelaic acid gel - little or not effective \n\n* clindamycin gel - it was effective at the beginning then I got used to it(?) and stopped working\n\n* benzoyl peroxide cream - as above\n\n* zinc oxide cream - little or not effective\n\n* tetracycline pills - at my worst moment in my acne story, helped me a bit but taking antibiotic daily isn't good option\n\nIn a few months i tried few face cleaners:\n\n* la roche posay effaclar purifing foaming gel cleanser\n\n> Water • Sodium Laureth Sulfate • PEG-8 • Coco-Betaine • Hexylene Glycol • Sodium Chloride • PEG-120 Methyl Glucose Dioleate • Zinc PCA • Sodium Hydroxide • Citric Acid • Sodium Benzoate • Phenoxyethanol • Caprylyl Glycol • Parfum/Fragrance. \n\n* ziaja senstive skin creamy wash gel for face & body\n> Aqua (Water), Cocamidopropyl Betaine, Disodium Laureth Sulfosuccinate, Sodium Coco-Sulfate, Glycerin, Coco Glucoside, Panthenol, Propylene Glycol, Glycyrrhiza Glabra (Licorice) Root Extract, Cocamide DEA, Styrene/Acrylates Copolymer, Xanthan Gum, DMDM Hydantoin, Sodium Benzoate, Lactic Acid\n\n\n* himalaya herbals gentle exfoliating daily face wash\n> Aqua, Ammonium Lauryl Sulfate, Cocamidopropyl Betaine, Sodium Cocoyl Glutamate & Disodium Cocoyl Glutamate, Polyethylene, Aloe Barbadensis Leaf Extract, Glycerin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Citrus MedicaLimonum Peel Extract, Melia Azadirachta Leaf Extract, Sodium Hydroxide, Parfum, Phenoxyethanol, Prunus Armeniaca Seed Powder, Lens Culinaris Fruit Extract. Methylchloroisothiazolinone & Methylizothiazolinone, Carnauba wax D & C.\n\nAnd I feel like they all same.\nHelp please. \n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "pussgurka",
        "body": "Have you been to a dermatologist? How did that go? There still might be some medications you can try without having to go on accutane.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "pattern144",
        "body": "How long have you been going paleo? It takes a while",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "hypel0rd",
        "body": "I would recommend trying a healthy approach to treating your acne. Nobody wants to hear it, I know I didn't, because it sounded like it wouldn't work and was not effective. However, after burning my face with benzol peroxide, I'm talking red and extremely puffy for 3 days, I realized that all of these acids and what not are just terrible. I was looking on my moms Pinterest acct and YouTube and found tons of healthy ways to try getting rid of acne. Try minimizing to a very simple gentle face wash like cetaphil, something for non acne. Watch videos about apple cider vinegar for acne, it can possibly be a miracle worker. Also read about aloe Vera, also a miracle worker. A face mask I recommend is using an egg with cinnamon, it burns but is very effective if you face doesn't react bad to cinnamon. Just some tips :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "pattern144",
        "body": "Lol what",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskDocs",
    "post_id": "4s6daq",
    "title": "Are there health risks in using this liquid soap for everything? Contents inside.",
    "url": "https://www.reddit.com/r/AskDocs/comments/4s6daq/are_there_health_risks_in_using_this_liquid_soap/",
    "score": 2,
    "num_comments": 0,
    "created": "2016-07-10T17:19:04+00:00",
    "body": "Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamidopropyl Betaine, Cocamide DEA, Glycerin, Styrene/Acrylates Copolymer, Parfum, Tetrasodium EDTA, Benzophenone-4, Propylene Glycol, Citric acid, Pogostemon Cablin Leaf Extract, Butylphenyl Methylpropional, Methylchloroisothiazolinone, methylisothiazolinone, C.I.60730, C.I.45100\n\nI use this liquid soap for everything, because I'm broke and because it works. It's a well-known brand where I live.\n\nI use it for my hands, body and head (I have short hair). Also for washing the dishes and even doing the laundry (in a washing machine). It seems to be very effective at all of those of functions.\n\nI've seen the ingredients list in various shampoos and body soaps/milks/whaever. They look pretty similar.\n\nI have a couple of skin problems that could be soap-related.\n\n* I sometimes have unbearably dry hands and feet, especially at night. Other soaps make my whole skin dry right after showering, this one doesn't. I've had this condition for years before I started using this soap.\n* I have dead skin on my scalp, looks like dandruff when I try to get it off.\n\nShould I be worried about some of the ingredients? Should I start using a different soap/shampoo for some part of my body? Why?\n\n(I posted it on /r/soap 11 hours ago, but it's pretty dead over there.)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "haircareaddiction",
    "post_id": "15h0zt5",
    "title": "New to haircare need opinion",
    "url": "https://www.reddit.com/r/haircareaddiction/comments/15h0zt5/new_to_haircare_need_opinion/",
    "score": 2,
    "num_comments": 3,
    "created": "2023-08-03T11:01:34+00:00",
    "body": "Recently moved out and my mom gifted me a haircare set as a gift. Don’t know anything about products and want to see if any ingredients are alarming.\n\nShampoo: AQUA (WATER) SODIUM LAURETH SULFATE, COCAMIDE DEA SODIUM MYRETH SULFATE, DIMETHICONE, ARGANIA SPIROSA KERNEL OIL, POLYOLATERNIUM-10, COCAMIDOPROPYL BETAINE.\nNYOROLYZED KERATIN, C1-15 PARETH-9, STYRENE/ACRYLATES COPOLYMER, C12-13 PARETH-4, AMODIMETHICONE, CI-15 PARETHS CITRIC ACID, LACTIC ACID. C12-13 PARETH-23, SORB C ACID. BE vOIC LACID, AGE TIC ACID, SODIUM CHLORIDE, CAPRYLYL GLYCOL, DECKENS GLYCOL. BENZILALCOHOL, PHENOXYETHANOL, PARFUM (FRAGRANCE) LINALOL, LIMONENE, CITRONELLOL, COUMARIN.\n\nConditioner: AQUA (WATER), CETEARYL ALCOHOL, STEARTRIMONUM CHLORIDE: ARGANIA SPINOSA KERNEL OIL CYCLOPENTASILOKANE DINETHICONE, AYDROXYETHYLCELLULOSE, CITRIC ACID METHYLCHLORONSOTHIAZOLINONE, METHYLISOTHIAZOLINONE, PARFUN\n(FRAGRANCE).\n\nHair oil: Cyclopentasiloxane, Dimethicone, Cyclomethi Arganid Spinosa Kernel Oil, Linseed (Linum Usittise Cract. Parfum, CI 26100, CI 47000.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Luxsussy",
        "body": "I recommend the shampoo and conditioner called argania, strengthening the hair and the root and helping to prevent shedding. salt-free shampoo without SLS, which knows castor oil that stimulates root and hair regeneration, encourages hair growth, adds shine and enriches moisture",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareBR",
    "post_id": "1f5uf31",
    "title": "Cocamide DEA em skincare e produtos para cabelo.",
    "url": "https://www.reddit.com/r/SkincareBR/comments/1f5uf31/cocamide_dea_em_skincare_e_produtos_para_cabelo/",
    "score": 2,
    "num_comments": 4,
    "created": "2024-08-31T18:46:27+00:00",
    "body": "Descobri que a substancia é possivelmente cancerigena e é banida em estados dos EUA e Europa, mas por aqui a gente usa muito.\n\nEu estou entendendo direito ou essa substancia por aqui é diferente?",
    "flair_text": "Dúvida ",
    "flair_template_id": "24164626-6193-11ef-8bc0-661223ce3aa7",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "by4vzj",
    "title": "The mistery of the tumble dried poodle",
    "url": "https://www.reddit.com/r/curlyhair/comments/by4vzj/the_mistery_of_the_tumble_dried_poodle/",
    "score": 2,
    "num_comments": 2,
    "created": "2019-06-08T06:02:01+00:00",
    "body": "Hello all, I come to you to try to solve this problem that I don't know how to solve and I apologise for the extension of the text. \n\nI do CoWash and use *Pantene micellar detox and moisturize (50% water) as 1conditioner (ing: stearyl/alcohol, behentrimonium methosulfate, cetyl alcohol, fragance, isopropyl alcohol, benzyl alcohol, disodium EDTA, citric acid, histidine, panthenol, panthenyl etyl, ether, propylen glycol, mentha arvenis leaf oil, mentha peperina oil, menthol niacinamide, nymphaea odorata root extract, methylchloroisothiazolinone, methylisothiazolinone), *Beuty and planet with tea tre oil as 2 conditioner (ing: water, cetearyl alcohol, behentrimonium chloride, coconut oil, fragance, dipropylene glycol, 1,2-hexanediol, benzyl alcohol, disodium EDTA, acrylates/beheneth-25, methacrylate copolymer, tea tree leaf oil, vetiveria zizanoides root oil, sodium hydroxide, sodium benzoate, citric acid)\nI finish with 2 almonds of 1 conditioner on wet hair doing scrunch, flax seed gel praying hands and coconut oil doing scrunch but not much.\nWhen I do this combination above my hair is not only healthy but beautiful (pic A). \n\nI recently changed the hair treatment cream that I use for my chronogram for this one (rice milk hair treatment: aqua, cetearyl alcohol, cetyl alcohol, cetrimonium chloride, dihydrogenated tallow hydroxyethylmonium methosulfate, fragance, myristyl alcohol, ethyl alcohol, hydroxyethylcellulose, isopropyl alcohol, arachidyl alcohol, pentasodium pentate, methylchloroisothiazolinone, methylisothiazolinone, sodium hydroxide) And I ended up with the hair like picture B, I don't know what could it be because the main ingredients are the same as the 1c or the 2c. I changed back to my old cream treatment and the hair was instantly good again it only took me one shower. \n\nAlso one day I used this conditioner, *Naturals by Watson (ing: water, cetearyl alcohol, glycerin, cetrimonium chloride,  propylen glicol, isononyl isononanoate, hydroxyethylcellulose, parfum, dmdm hydantoin, behentrimonium chloride, tetrasodium EDTA, citric acid, isopropyl alcohol, sodium acetate, cellulose, grambe abyssinica, seed oil, argania spinosa kernel oil, niacinamide, panthenol, avocado oil, argan extract, wheat germ extract, malic acid, tartaric acid, sodium benzoate, hibiscus flower extract, rosa canina flower extract, salicylic acid, sweet violet flower extract, dlimonene, linalol) as first conditioner, 50% water and my regular beauty and planet as second conditioner and I woke up with hair like picture B. Again just took me one shower with my regular Pantene and my regular beauty and planet to get my hair back to normal. \n\nThis week I also started to do low poo, just to try, and I used this shampoo (aqua, polyquatermyum-7 sodium chloride, D-panthenol, menthol cocamidopropyl betaine, cocamide dea, Ci no 79140, fragance) and my Pantene as conditioner, the hair was good as always.\nBut last night I used the same shampoo with my second conditioner, the beauty and planet and Today my hair was back to pic B, sooo I'm again in this clueless situation, why if I always use my second conditioner I woke up like this? \n\nIf someone can help me solve this I will be forever thankful.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "VanillalcedCoffee",
        "body": "Maybe moisture overload? There’s a test on checking to see if you have that. It’s in the subreddit’s info, I think. If you do have it, try deep conditioning with protein.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MissDWatson",
        "body": "http://imgur.com/gallery/ceX0kw5",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "11yidg8",
    "title": "[Product Question] should I, male, avoid using a beardshampoo containing SLES in it if I have a sensitive skin?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/11yidg8/product_question_should_i_male_avoid_using_a/",
    "score": 2,
    "num_comments": 4,
    "created": "2023-03-22T12:58:01+00:00",
    "body": "Hello, first apologize if it's the wrong title tag.\n\nI'm growing a beard and am looking for some good beard shampoo and oil. Now I got a free gift from someone containing By My Beard shampoo and oil, but it has SLES in the shampoo and read that it can dry out your skin and since I have a sensitive skin I actually don't think I should use it.\n\nSo I was wondering if I should avoid using it. Last thing I want is a beard full of flaked skin which I already have atm. I have some flake around my noseline and chin under my beard hairs.\n\n&#x200B;\n\nbtw the ingredients are:\n\n Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamidopropyl Betaine, Glycerin, Cocamide DEA, Polyquaternium-7, Melaleuca Alternifolia Leaf Oil, Polyquaternium-10, Panthenol, Glycol Stearate,PEG-200 Hydrogenated Glyceryl Palmate, Parfum, Tocopheryl Acetate, Sodium Benzoate, PEG-7 Glyceryl Cocoate, Disodium EDTA, Citric Acid, Coumarin",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "kerodon",
        "body": "SLES isn't inherently an issue, though I'd still rarely suggest a product with it as your first choice. But perfume and tea tree is problematic. \n\nTry pipette baby wash and shampoo fragrance free as it's much gentler for all skin and hair, including face.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ReaLitTea",
        "body": "There’s no need to avoid SLES unless you know you have had personal irritations with it. \n\nIt really comes down to the formulation, not just one ingredient to see how the product interacts with your skin.\n\nI think since you already have it then it’s worth a try",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "dyou897",
        "body": "Yes as a general rule avoid SLS",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "acne",
    "post_id": "9d7q15",
    "title": "Which ingredient or mixture making mAh skin darker?",
    "url": "https://www.reddit.com/r/acne/comments/9d7q15/which_ingredient_or_mixture_making_mah_skin_darker/",
    "score": 1,
    "num_comments": 0,
    "created": "2018-09-05T15:40:40+00:00",
    "body": "I feel like something is making mAh skin darker...pls let me know\n\nIn the morning I use\n\nFace wash (fash x gel) : Aqua, Sodium Lauryl Sarcosinate, Decyl Glucoside, PEG-150 Distearate, Polysorbate 20, Cocamide DEA, Caprylol Glycine, Coco Betaine, Triethanolamine, DMDM Hydrantoin, Methylchloroisothiazolinone (and) Methylisothiazolinone, Perfume, CI 42051\n\n\nNeutregena moisturizer along with hemp seed oil: Water, cyclomethicone, cetyl ethylhexanoate, glycerin, cetyl ricinoleate, stearyl alcohol, glyceryl stearate, PEG-100 stearate, methyl methacrylate glycol dimethacrylate crosspolymer, lysine carboxymethyl cysteinate, lysine thiazolidine carboxylate, tocopherol, silica, xanthan gum, methylparaben, propylparaben, diazolidinyl urea, benzalkonium chloride\n\nBefore that I used to use: garneir men acno fight face wash",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "i8mdh1",
    "title": "Does this shampoo can be used as Reset Wash shampoo?",
    "url": "https://www.reddit.com/r/curlyhair/comments/i8mdh1/does_this_shampoo_can_be_used_as_reset_wash/",
    "score": 1,
    "num_comments": 4,
    "created": "2020-08-12T21:12:18+00:00",
    "body": "Hi guys, my medic , sent me this shampoo for treat the dandruff, I'm already verified the ingredientes in *isitcg* and *curlsbot.*The shampoo isn't cg aproved because  has sodium laureth sulfate.but i don't see any silicone. so, is this shampoo a good idea?\n\nMore ingredients:\n\naqua,sodium laureth sulfate,cocamide dea,zinc pyrithionate,polyquaternium-7,cocamidopropyl betaine,acrylates/c10-30 alkyl acrylate crosspolymer,panthenol,sodium chloride,PEG-150 distearate,triethanolamine,methylparaben,parfum,aloe barbadensis leaf extrac,mint,nitropropane,bromine,diol.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "taijiotter",
        "body": "I don’t see any of the “ones” (dimethicone and such) so I think it’ll be one",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "curlynyy",
        "body": "Looks good, the paraben tho :(",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2ik07o",
    "title": "OCM with this shower oil? (Need help from experts)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2ik07o/ocm_with_this_shower_oil_need_help_from_experts/",
    "score": 1,
    "num_comments": 10,
    "created": "2014-10-07T13:02:18+00:00",
    "body": "I got very sensitive skin and I plan to use this shower oil, maybe as in the OCM method, would it work? Are the ingredients good?\n\nGlycin Soja\nMIPA-Laureth Sulfate\nRicinus Communis \nLaureth-4\nCocamide DEA\nPoloxamer 101\nParfum\nPanthenol\nAqua\nLanolin Alcohol\nBisabolol\nCitric Acid\nDiammonium Citrate\nBHT\nPropyl Gallate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Please take a look at these links if you have questions concerning the oil cleansing method (OCM):\n\n* [OCM basics](http://www.reddit.com/r/SkincareAddiction/comments/1a1cj3/everything_you_wanted_to_know_about_ocm_the_oil/)\n* [Choosing the right oil\\(s\\)](http://www.reddit.com/r/SkincareAddiction/comments/1siu7c/protips_for_choosing_oils_for_ocm/)\n* [The benefits of mineral oil](http://www.reddit.com/r/SkincareAddiction/comments/1356nj/mineral_oil_and_its_benefits_for_skin_dont_be/)\n* [Mineral oil cleansing](http://www.reddit.com/r/SkincareAddiction/comments/1kqvdv/how_to_mineral_oil_massage/) \n\n\n*[I am a bot](/r/AutoModerator/comments/q11pu/what_is_automoderator/), and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose?to=%2Fr%2FSkincareAddiction) if you have any questions or concerns.*",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "831106",
        "body": "I put all the ingredients into CosDNA for you, [here's the link](http://imgur.com/DX7N730).  Nothing in your ingredient list strikes me as particularly irritating, but CosDNA seems to *really* dislike Laureth-4.  The research on the potential comedogenicity and irritation seems to be mixed, however, so I would say go ahead and use the shower oil and see how your skin reacts.  Good luck!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eczema",
    "post_id": "1aejdtj",
    "title": "Diagnosed with Dyshidrotic eczema",
    "url": "https://www.reddit.com/r/eczema/comments/1aejdtj/diagnosed_with_dyshidrotic_eczema/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-01-30T08:08:15+00:00",
    "body": "I have been suffering eczema my entire life but 2 years ago these small vesicles appeared. My occupation that time I worked in a food industry where I had frequent hand washing + nitrile/latex gloves on frequently. One thing I noticed is my hands sweat but not to the point of it dripping wet. I work in a fast hand environment.Started off on 1 finger then slowly spread to my entire hand on both hand. I went to see an allergist and did my patch testing and other allergy test. Discovered I was allergic to cocamide dea and chloroxylenol from patch test + other common allergens. As well as finding out Im a very allergic person IgE level > 3000\n\nBecause of the patch testing, I wore gloves when showering because of the fear of touching any soap preservatives/ chemicals. \n\nUntil I saw my dermatologist 2 months ago where he diagnosed me with dyshidrotic eczema. He told me the possibility of gloves being the trigger and told me specific routine such as keeping my hands from getting wet as that could be a trigger and using cetaphil gentle cleanser with no water to clean my hands from anytime my hands get dirty. Then using neutrogenia norweigan formula moisturizer to moisturize my hands. I was prescribed triamcinolone topical steroid to apply to blistered area as well as taking fexofenadine 180mg for itching.\n\n\nI thought that this would be the turning point to getting my hands better but my weekly flare ups occurred yet again. I was prescribed a stronger steroid betamethosone to see if that would clear up but still the same.\n\nThe dermatologist determined that upping the steroid potency would do me no good so a skin biopsy would need to be performed to find out the issue.\n\nMy dermatologist ruled out any contact dermatitis because it would be all over my hands by now. There is a possibility stress might be the issue. What do yall think? Do you think the skin biopsy can reveal the problem of the flare up?\n\nThings I have tried:\n\n- not getting my hands wet\n- using emollient lotion + cleanser",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "3wy3uy",
    "title": "question about organix/ogx renewing argan oil shampoo",
    "url": "https://www.reddit.com/r/curlyhair/comments/3wy3uy/question_about_organixogx_renewing_argan_oil/",
    "score": 1,
    "num_comments": 1,
    "created": "2015-12-15T15:12:17+00:00",
    "body": "Hi curlies! \n\nI've been playing around with the CG method for the last few weeks and I'm loving it. I'm aiming to be low-poo for the time being, as I am a bit of a shampoo addict. Microfibre towel and wide toothed comb have changed my life though, as has Lush's 'R'n'B' hair moisturiser.\n\nA number of forums and websites have recommended Organix Renewing Argan Oil Shampoo (OGX in the UK) as being CG-friendly. I've been using it followed by a no-cone conditioner (Superdrug extracts) and enjoying the results but I'm still unsure if it is truly suitable for a low-poo approach? Does anyone have any thoughts on this? \n\nI know some sulfates are less problematic than others and the one that sticks out on the ingredients list is Sodium C14-16 Olefin Sulfate. Full ingredients posted below. Any advice appreciated!\n\nAqua (Water)\nDisodium Laureth Sulfosuccinate\nSodium C14-16 Olefin Sulfonate\nCocamidopropyl Betaine\nCocamidopropyl Hydroxysultaine\nDimethicone Copolyol\nCocamide DEA\nGlycol Distearate\nArgania Spinoza (Argan) Kernel Oil\nTheobroma Cacao (Cocoa Butter) Extract\nParfum\nCocos Nucifera (Coconut) Oil\nPersea Gratissima (Avocado) Oil\nAloe Barbadensis (Aloe) Leaf Extract\nPanthenol\nPolyquaternium-11\nCetyl Alcohol\nGuar Hydroxypropyltrimonium Chloride\nPEG-23M\nDMDM Hydantoin\nCI 16035 (Red 40)\nCI 19140 (Yellow 5)\nBenzyl Benzoate\nLimonene\nLinalool\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "OfTheHawk",
        "body": "That's not a sulfate by name, but it is as harsh as any sulfate. So, it's not really CG.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Review",
    "post_id": "mh23lj",
    "title": "Cocamide DEA",
    "url": "https://www.reddit.com/r/Review/comments/mh23lj/cocamide_dea/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-03-31T09:10:07+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "xvln4w",
    "title": "Conscious Chemist Oil Cleanser",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/xvln4w/conscious_chemist_oil_cleanser/",
    "score": 1,
    "num_comments": 7,
    "created": "2022-10-04T17:48:03+00:00",
    "body": "Hi everyone,\n\nI recently came across the newly launched Oil Cleanser by Conscious Chemist. When I researched on ingredient list, I found  **Cocamide DEA.** This is an icky ingredient according to internet. What I don't understand is why the brand would use such a controversial ingredient. It would be really helpful if one could throw some light on this ingredient particularly or on this oil cleanser in general. TIA\n\n[link to product](https://consciouschemist.com/collections/all/products/daily-dissolve-cleansing-oil-ultra-light-gentle-foaming-oil-removes-waterproof-makeup-impurities) \n\nIngredient List -\n\n **CCTG (Capylic Capric Triglyceride), Helianthus Annuus (Sunflower) Seed Oil, Cocamide DEA, Polysorbate 20, Hexylene Glycol, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Olea Europaea (Olive) FruitOil, Tocopherol, BHT**\n\nFindings on Internet\nhttps://www.healio.com/news/hematology-oncology/20140609/hot0514shampoo_10_3928_1081_597x_20140501_12_1348283\n\nhttps://www.chagrinvalleysoapandsalve.com/blog/posts/is-it-safe-cocamide-dea-discovered-in-98-personal-care-products/\n\nhttps://cosmetics.specialchem.com/inci-ingredients/cocamide-dea#:~:text=Cocamide%20DEA%20(Cocamide%20Diethanolamine)%20is,prevents%20the%20ingredients%20from%20separating.\n\nhttps://www.p65warnings.ca.gov/fact-sheets/cocamide-diethanolamine-cocamide-dea-coconut-oil-diethanolamine-condensate",
    "flair_text": "Product Related Discussion",
    "flair_template_id": "20e907ba-0f7e-11eb-a26e-0ee57321ccbf",
    "comments": [
      {
        "author": "sriv_m",
        "body": "Why is it considered icky according to the Internet? Including your findings can help give context",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "TheBatmanfromMumbai",
        "body": "Hi...I guess now the ingredient is removed. Since it is not available in the attached link. Can you confirm please?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Skincare_Addiction",
    "post_id": "1b8y6l1",
    "title": "Dry and cracked skin after a cleanser?!",
    "url": "https://www.reddit.com/r/Skincare_Addiction/comments/1b8y6l1/dry_and_cracked_skin_after_a_cleanser/",
    "score": 1,
    "num_comments": 4,
    "created": "2024-03-07T15:58:23+00:00",
    "body": "Hello! I'm new to skincare, and I recently started using some skincare products.\n\nI have a not-too-much oily skin, maybe also a bit dehydrated. I started some days ago with a few products, without any acid or strong active, and I'm quite sure that the culprit of my current situation is a normal, trivial cleanser.\n\nIts ingredients are: Aqua, Mea-Lauryl Sulfate, Cocamide Dea, Alcohol Denat., Phenoxyethanol, Sodium Dehydroacetate, Citric Acid, Sodium Benzoate, Parfum.\n\nI cleaned my face with it for three days, morning and night (at night I also used a chamomilla tonic and a hydrating cream), without anything bad happening. My skin looked so clean and happy. Then I woke up in the morning, used it (and only it, nothing else), and after an hour my skin started to feel a bit weird, some redness right under the eye-zone and near to the nose showed up, I had a bit of a burning feeling. Now, after two days from then, my skin is cracked, dry and peeled all around my lips and around my nose (also on the cheeks near the nose zone), and also on my chin. Still have a bit of redness under the eye contour.\n\nIn these two days I stopped using that cleanser (I'm using a gentle oil cleanser that I know my skin tolerates well), and I'm using a hyaluronic acid serum and a hydrating cream. But the situation doesn't improve. So my questions for you are:\n\n1) Could you suggest some products to solve this situation, or give me any advice?\n\n2) Why did the cleanser do that to my skin? It looks like a normal water-based cleanser with a strong Alcohol smell.\n\nThank you in advance for your reply!",
    "flair_text": "Dryness",
    "flair_template_id": "788a5036-5364-11ea-88ba-0ed84a4ffe3b",
    "comments": [
      {
        "author": "borrowedurmumsvcard",
        "body": "It did that your skin because those ingredients are absolutely atrocious and should not be going on your face. Not your fault at all, I don’t know who on earth okayed those to be used in a cleanser. Literally anything would be better than that.   Alcohols and sulfates should not be in skincare. They’re so drying and stripping as you’ve already experienced. \n\nJust pile on the moisturizer and maybe go without a cleanser for a few days. Use something like Vaseline or Cetaphil healing ointment at night to help. Try a cleanser like Aveeno oat calming cleanser or just anything hydrating. Use skinsort.com to check your products before you buy them",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "17h33lv",
    "title": "[Misc] Would an allergy to Ceramide DEA also apply to MEA?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/17h33lv/misc_would_an_allergy_to_ceramide_dea_also_apply/",
    "score": 1,
    "num_comments": 3,
    "created": "2023-10-26T18:29:40+00:00",
    "body": " I tested positive on a patch test as allergic to Cocamide DEA. A couple of my shampoos have Cocamide MEA. I have seasonal random elbow rashes, SD on my scalp and eyebrows among other things. But it is so hard to find products. I am extremely clog prone and also allergic to all fragrance. Thanks if anyone knows!  \n ",
    "flair_text": "Miscellaneous",
    "flair_template_id": "56f33ba0-35e0-11e5-9715-0ee61c357d3b",
    "comments": [
      {
        "author": "C_Chrono",
        "body": "This question is best to ask your allergist (or someone in their office).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_HarryMarshel19",
    "post_id": "em8vpx",
    "title": "Cocamide DEA Market 2020 Global Industry Demand, Industry News, Business Updates by Size, Share, Sales Revenue Forecast by 2025 – Industry Research.co",
    "url": "https://www.reddit.com/r/u_HarryMarshel19/comments/em8vpx/cocamide_dea_market_2020_global_industry_demand/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-01-09T12:20:29+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_maylockhongkhiozone",
    "post_id": "y62npy",
    "title": "Dầu gội đầu và những bí mật ít ai biết",
    "url": "https://www.reddit.com/r/u_maylockhongkhiozone/comments/y62npy/dầu_gội_đầu_và_những_bí_mật_ít_ai_biết/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-10-17T05:37:44+00:00",
    "body": " \n\nDầu gội đầu và những bí mật ít ai biết\n\nMột chai dầu gội đầu bắt mắt chứa chất lỏng ánh nhũ cùng với lời quảng cáo \"lăng xê\" khiến nhiều chị em tin vào công năng kỳ diệu của sản phẩm mà [cân điện tử bán ở đâu tphcm](http://www.cantiendat.com/)nhiều khi bỏ qua tìm hiểu thành phần.\n\n📷\n\nNắm được tâm lý phái đẹp, các hãng mỹ phẩm tóc rất chú trọng đến hình thức sản phẩm làm đẹp. Trên [cân bàn điện tử 300kg](https://www.cantiendat.com/can-ban-dien-tu-300kg/) thực tế một chai dầu gội được chế từ những công thức hóa dược nào? Tóc mềm mượt nhờ thành phần gì?\n\nMời bạn cùng giải mã\n\n• Sulfate Ammonium lauryl / Laureth Sulfate Amoni / Sodium lauryl Sulfate: Những chất này có trong mỗi loại dầu gội, công dụng chính của nó là hòa tan các chất bẩn.\n\n‎• Cocamide DEA, MEA hoặc TEA / Cocamidopropyl Betaine: Nhờ nó dầu gội tạo bọt, giúp cho việc sử dụng dễ dàng hơn. Lưu ý: Dầu gội ít tạo bọt, sẽ có lượng kiềm thấp- đỡ hại tóc.\n\n‎• Sodium Citrate: Cung cấp độ pH hợp lý do đó, tóc sáng bóng và mượt.\n\n‎• Polyquaternium / Quaternium: Đây là thành phần tốt, hữu ích. Nó có trách nhiệm đảm bảo rằng dầu gội đầu dễ dàng có mặt trên từng sợi tóc. Hơn nữa, quaternium polyquaternium có tính chất giữ ẩm.\n\n‎• Dimethicone / Cyclomethicone: làm mềm da đầu và cho tóc độ bóng mượt, khiến tóc dễ chải hơn. Vì vậy, nếu tóc bạn đã bị hư sau uốn nhuộm sấy hãy tìm mua dầu gội có chứa những thành phần này.\n\n‎• Panthenol: Là một dạng của vitamin B giúp nuôi dưỡng tóc với độ ẩm, mà thêm độ bóng .\n\n‎• Cetyl / Oleyl / Stearyl rượu: Đừng sợ, rằng rượu gây khô tóc. Hoàn toàn ngược lại. Vì những hợp chất hóa học này giúp tóc bớt rối, dễ chải.\n\n‎ • Nut oils / Shea Butter: Là những thành phần tự nhiên có ảnh hưởng tích cực đến tóc. Nói chung, sự hiện diện của chất chiết xuất từ các loại dầu tự nhiên tăng chất lượng của dầu gội lên nhiều lần .\n\n‎• Octyl salicylat / PABA: Sự hiện diện của các thành phần này trong dầu gội giúp bảo vệ tóc khỏi tia UV. Thông thường, các chất này có thể được nhìn thấy trên nhãn của dầu gội đầu cho tóc nhuộm, đảm bảo màu nhuộm kéo dài lâu hơn.\n\n‎1- Bọt càng nhiều tóc càng sạch. Đây là cách nghĩ sai lầm khá phổ biển. Bọt được hình thành khi các hóa chất phản ứng với không khí và nước. Ví dụ: Loại dầu gội không chứa kiềm rất ít bọt nhưng vẫn làm sạch tóc. Lý tưởng nhất là chọn loại dầu chỉ có vừa đủ lượng bọt để việc bôi trơn tóc dễ dàng hơn.\n\n‎2- Nếu gội đầu đều mỗi ngày tóc sẽ chóng hỏng? Lời cảnh báo này không hoàn toàn đúng. Nếu bạn có mái tóc dầu, bạn cần gội sạch lớp nhờn để loại bỏ bụi bẩn ô nhiễm. Nếu bạn để quá vài ngày, tóc dầu bị bẩn sẽ tăng số lượng sợi rụng hơn hẳn so với mái tóc sạch. Tuy nhiên bạn cần chọn loại dầu dành riêng cho tóc nhờn trong đó phải có thành phần dưỡng ẩm như Panthenol+ bơ hạt mỡ. Đối với mái tóc khô bị xơ hỏng cũng cần gội mỗi ngày. Lưu ý: Với loại tóc nào thì khi gội cũng không nên gãi mạnh, xoa càng nhẹ càng giảm tổn thương.\n\n3- Dùng mãi một loại dầu gội, tóc sẽ bị quen, không còn tác dụng nữa. Cần đổi sang một nhãn hiệu khác? Đó là tư vấn được gây dựng nên bởi các nhà quảng cáo thập kỷ 90. Dầu gội không phải là thuốc kháng sinh để khiến cơ thể \"nhàm thuốc\". Nếu đã tìm thấy loại dầu thích hợp với tóc của mình bạn không nên từ bỏ nó.\n\n4-Dùng dầu gội trẻ em an toàn cho tóc người lớn và tóc sẽ mềm như tóc baby? Các nhà quảng cáo còn cố thuyết phục \"dầu gội baby thích hợp với da dầu nhạy cảm\". Trên thực tế nếu tóc bạn đang có hóa chất nhuộm, ép, uốn, gel, mousse… thì dầu gội trẻ em không đủ để làm sạch tóc. Nếu da đầu nhạy cảm thì nó có thể phản ứng ngay cả khi bạn gội với nước lã.\n\n5-Dầu gội đắt tiền sẽ khắc phục được mái tóc yếu. Dầu gội chỉ khiến mái tóc mềm mại và óng ả hơn thôi. Mái tóc yếu rụng của bạn cần bổ sung dinh dưỡng cả từ phía trong qua khẩu phần ăn và thuốc uống. Việc đắp mặt nạ và [cân treo điện tử giá rẻ](https://www.cantiendat.com/can-treo-dien-tu/)dưỡng có tác động đáng kể vào chân tóc. Giữ tóc trong môi trường sạch cũng là yếu tố quan trọng.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_botanikecza",
    "post_id": "j7va0f",
    "title": "Hairser At Kuyruğu Ekstreli Saç Bakım Şampuan",
    "url": "https://www.reddit.com/r/u_botanikecza/comments/j7va0f/hairser_at_kuyruğu_ekstreli_saç_bakım_şampuan/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-10-09T08:29:21+00:00",
    "body": "[**Hairser at kuyruğu ekstreli saç bakım şampuan**](https://www.botanikecza.com/hairser-sampuan) hakkında burada bulunan bilgiler sizin için yetersiz kalıyorsa çağrı merkezimizi arayarak ürün hakkında daha detaylı bilgi alabilirsiniz. Donanımlı ve size kolaylık sağlayacak ekibimize 444 4 996 numaralı çağrı merkezimizi arayarak ulaşabilirsiniz. Firmamız Botanik Ecza olarak “Satış Sonrası Müşterilerimizin Her Zaman Yanındayız.” ilkesini benimseyerek %100 müşteri memnuniyetini sağlamayı amaçlamaktayız.  \n\n\nFirmamız, bünyesinde olan ürünlerin topluma güvenli, etkili ve kaliteli bir şekilde ulaşmasını temin etme hususunda hassasiyetini en üst seviyede taşımaktadır. Ürünleri tanıtırken haksız rekabet ve tüketiciyi yanıltıcı tanıtımlara yer vermemektedir. Bilimsel çalışmaların sonuçlarıyla ürünün etkinliği hakkında ki iddiaların uyumuna sadakatle bağlıdır. “**Pharmaser**” markasına ait ürünü hemen satın alabilirsiniz. Birikim ve Tecrübesi ile 10 yılı aşın bir süredir sizlere hizmet veren firmamız kaliteden ödün vermeden sizlere sanal ortamda e-ticaret platformunda güvenli alışverişin en huzurlu ortamını uzman kadrosuyla sağlamaktadır.  \n\n\n**İçerik:**\n\n**Kullanımı**: Avuç içine aldığınız bir miktar şampuanı saçınıza masaj yaparak uygulayınız ve iyice durulayınız.   \n\n\n**Uyarılar**: Çocukların ulaşamayacağı yerlerde ve oda sıcaklığında muhafaza ediniz. Güneş ışığından koruyunuz.Aqua, Sodıum Lauryl Sulfate, Cocamidopropyl Betaine, Cellulose Gum, Equisetum Arvense Extract, Vitis Vinifera Seed Extract, Panicum Miliaceum Extract, Salvia Officinalis Extract, Urtica Dioica Extract, Chamomilla Recutita Extract, Camellia Sinensis Leaf Extract, Humulus Lupulus Extract, Pisum Sativum Extract, Tilia Platyphyllos Extract, Hydrolyzed Keratin, Panthenol, Tocopheryl Acetate, Cocamide DEA, Polyquaternium-7, Polysorbate-20, Glycol Distearate, Cocamide MEA, Laureth-10, Coco-Glucoside, Glyceryl Oleate, Glyceryl Stearate, Guar Hydroxypropyltrimonium Chloride, Amodimethicone, C11-15 Pareth-7, Laureth-9, Glycerin, Trideceth-12, Citric Acid, Amyl Cinnamal, Geraniol, Hexyl Cinnamal, Linalool, Magnesium Nitrate, Methylchloroisothiazolinone, 2-Methyl-2H-isothiazol-3-one.\n\n**Hairser şampuan fiyat** ile ilgili çok merak edilirken bu ürün cep yakmayan haliyle satış merkezimizdedir. Firmamız tedarikçi firmalarla yaptığı sıkı pazarlıklarla ürünleri sizlere en ucuz olarak sunmaktadır. En çok aranan ve talep gören ürünleri sizlerle buluşturmaya devam ediyoruz. Ürün fiyat ve kalite konusuna çok önem veren firmamızdan ürünü sepetinize ekleyerek online alışverişe başlayabilirsiniz.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "skincarephilippines",
    "post_id": "1lmmsny",
    "title": "Kojie san soap ban in europe",
    "url": "https://www.reddit.com/r/skincarephilippines/comments/1lmmsny/kojie_san_soap_ban_in_europe/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-06-28T13:26:34+00:00",
    "body": "The European countries r planning to ban cocamide DEA by July 2026 as its toxilogically unsafe, considering that the kojie san soap contains cocamide dea, will the company reformulate it so that it can legally be exported there? Does anyone know whether the company is planning to reformulate or not????\n\n\n\n\n\n#kojiesan #skinlightening #skinwhitening #phillippines #kojicacid #kojicacidsoap #bevi #europe #cocamidedea #dea #ban #skincare #makeup #kojic #kojiclovers #kojiesanphillippinss #kojiesanindonesia ",
    "flair_text": "[Face] Product Question",
    "flair_template_id": "16e4f17a-bb69-11ef-a37b-2e2eb26e89d6",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_botanikecza",
    "post_id": "k22v2f",
    "title": "Color Soin Organik Saç Boyası",
    "url": "https://www.reddit.com/r/u_botanikecza/comments/k22v2f/color_soin_organik_saç_boyası/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-11-27T15:12:35+00:00",
    "body": "[**Color soin organik saç boyası**](https://www.botanikecza.com/color-soin-sac-boyasi) hakkında bilgili ve donanımlı çağrı merkezi kadromuzdan da 444 4 996 numarasından bize ulaşarak, detaylı bilgi alabilirsiniz. Ayrıca firmamız “Satış Sonrası Müşterilerimizin Her Zaman Yanındayız.” ilkesini sadakatle benimsemiş olup, müşteri memnuniyetinin sağlanması için gerekli şartları yerine getirmekten gurur duymaktadır.\n\nFirmamız, bünyesinde olan ürünlerin topluma güvenli, etkili ve kaliteli bir şekilde ulaşmasını temin etme hususunda hassasiyetini en üst seviyede taşımaktadır. Ürünleri tanıtırken haksız rekabet ve tüketiciyi yanıltıcı tanıtımlara yer vermemektedir. Bilimsel çalışmaların sonuçlarıyla ürünün etkinliği hakkında ki iddiaların uyumuna sadakatle bağlıdır. **“Color soin”** markasına ait ürünü hemen satın alabilirsiniz.Birikim ve Tecrübesi ile 10 yılı aşın bir süredir sizlere hizmet veren firmamız kaliteden ödün vermeden sizlere sanal ortamda e-ticaret platformunda güvenli alışverişin en huzurlu ortamını uzman kadrosuyla sağlamaktadır.\n\n**İçeriği**  \nPeg-2 Oleamine. Aqua Purificata (Purified Water). Cocamide Dea. Alcohol Denat (Alcohol). Propylene Glycol. Oleic Acid. Ethanolamine. P-Phenylenediamine. Sodium Sulfite. Tetrasodium Edta. Hydrolyzed Vegetable Protein (Triticum Vulgare, Soy, Corn, Avena Sativa). Sodium Erythorbate. N, N-Bis(2-Hydroxyethyl)-P-Phenylenediamine Sulfate. 2-Amino-4-Hydroxyethylaminoanisole Sulfate. 4-Chlororesorcinol.\n\nBir kutu içerisinde: 60 ml bitki özlü saç boyası, 60 ml fiksatör, 15 ml balsam, 1 çift eldiven bulunmaktadır.\n\n**Kullanımı**  \nColor&Soin saç boyasını fiksatöre boşaltın ve homojen bir karışım elde edene kadar 2 dakika boyunca çalkalayarak iyice karıştırın.\n\nKarışımın tamamını kuru saçınıza uygulayın.\n\nAplikatör yardımıyla saçınızı ortadan ayırın ve saç diplerinize karışımı uygulayın.\n\nSaçınızın diğer bölümlerini de aynı şekilde aplikatör yardımı ile ayırarak boyayın.\n\nSaçınıza hafifçe masaj yaparak boyayı saçınızın tamamına uyguladığınızdan emin olun.\n\n20 dakika bekleyin. Kalın telli saçlar için 30 dakika, beyazlar için 40 dakika bekleyin.\n\nBiraz sıcak su ile saçınıza masaj yapın. İyice duruladıktan sonra yeni saç renginize uygun Color&Soin® şampuanınız ile saçınızı yıkayın.\n\nSaçınızı iyice duruladıktan sonra 2 dakika boyunca masaj yaparak balsamı uygulayın. İyice durulayın.\n\n**Color soin saç boyası** **fiyat** olarak tedarikçi firmalarla yaptığımız sıkı pazarlıkları neticesinde hesaplı alışverişin imkanlarını sizlere sunuyoruz. Botanikecza olarak %100 orijinal ürünlerin satışını yapmaya önem verdiğimiz gibi ürünlerin kalitesine de önem vermekteyiz. Sizlere bu ürünleri adınıza faturalı ve en ucuz fiyat ile gönderiyoruz.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "94v1gf",
    "title": "Is this suitable for a final shampoo?? It's by Simple (trying to identify silicones)",
    "url": "https://www.reddit.com/r/curlyhair/comments/94v1gf/is_this_suitable_for_a_final_shampoo_its_by/",
    "score": 1,
    "num_comments": 2,
    "created": "2018-08-05T20:44:04+00:00",
    "body": "Aqua, Sodium Laureth Sulfate, Cocamide DEA, Sodium chloride, Panthenol, Glycerin, Pantolactone, Anthemis Nobilis Flower Oil, Pelargonium Graveolens Flower Oil, Cocamidopropyl Betaine, Disodium Laureth Sulfosuccinate, Citric acid, Tetrasodium EDTA, Dipropylene Glycol, Sodium Hydroxymethylglycinate, Potassium sorbate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Curly_Edi",
        "body": "Yep it is fine for your final wash",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CleaningTips",
    "post_id": "17k8rql",
    "title": "replacement for a cleaning paste",
    "url": "https://www.reddit.com/r/CleaningTips/comments/17k8rql/replacement_for_a_cleaning_paste/",
    "score": 1,
    "num_comments": 6,
    "created": "2023-10-31T00:52:32+00:00",
    "body": "Hey, so it's a long shot, but does anybody know a cleaning paste very similar to the one with ingredients like this:  \nSilica Aqua Sodium C10-13 Alkyl Benzenesulfonate Cocamide Dea Oxalic Acid Cellulose Gum Trisodium Phosphate Perfum: Limonen Colorant  \nI can skip a colorant and parfum ;) I am not a chemist, so it's hard to find a replacement for me. It's a thick but very creamy, almost silky, paste with microscopic sandy things which melt, and it's used for cleaning burns, rust and scale deposits from metal, ceramic, porcelain, faience, enamelled, glazed surfaces, etc. I haven't seen anything like this in US, and it's not available here. Also, manufacturers don't really list ingredients of cleaning products here, so it's hard to find a replacement. I will appreciate some recommendations. I tried the thing for cleaning stove tops to use instead, but it's not as good as this is.",
    "flair_text": "General Cleaning",
    "flair_template_id": "461671b2-73e0-11ed-be49-8e4efc6dd4ac",
    "comments": [
      {
        "author": "NatureIsReturning",
        "body": "Oxalic acid is the active ingredient in barkeepers friend",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "limellama1",
        "body": "Just use a soap of your choice with course salt.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DermatologyQuestions",
    "post_id": "1glmcd7",
    "title": "Hair Fall or Breaking issue for the last 1 year for no clear reasons",
    "url": "https://www.reddit.com/r/DermatologyQuestions/comments/1glmcd7/hair_fall_or_breaking_issue_for_the_last_1_year/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-11-07T09:06:10+00:00",
    "body": "I'm M-30,\n\n\n\nFor the last year, I have seen my hair are breaking and there is no known cause for it, my diet is balanced no\n\nsugar intake, eat vegetables and fruits regularly and have been washing my hair with 2 day gap like:\n\n\n\nIf I wash my hair and shampoo on Monday then I will apply Shampoo and wash hair on Thursday.\n\n\n\nI do not use any hair gels or other styling products nor do I use hair dryer or straightener.\n\n\n\nThere is an Anti Dandruff shampoo which I am using for last 2 years which is controlling the Dandruff pretty\n\nwell, could that the reason for it?\n\n\n\nShampoo: Selsun Blue Moisturizing With Aloe Anti-Dandruff Shampoo\n\n\n\n**Ingredients**\n\n\n\nSelenium Sulfide 1%, Aloe,\n\n\n\nAmmonium Lauryl Sulfate, Citiric Acid, Cocamide Dea,\n\n\n\nDi (Hydrogenated) Tallow Phthalic Acid Amide, DMDM\n\n\n\nHydanlam, FD&C Blue No.1 Fragrance, Purified Water,\n\n\n\nSodium Isostearoyt Lactylate, Titanium Dioxide,\n\n\n\nBentonite, Glycol Distreate, Lauric Die Thano Lamine,\n\n\n\nPropylene GlycolVeegum K, Ammonium Lauryl Ether\n\n\n\nSulfate, Surfactant Monateric, Solulan R 98,\n\n\n\nTriethnolamine Lauryl Sulfate. Protect from heat & light.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "*Please keep in mind that this subreddit is not a replacement for seeing a board certified dermatologist. This subreddit is here for informal second opinions, and minor problems that you wouldn't go to the doctor for anyway.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/DermatologyQuestions) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "biology",
    "post_id": "11burl2",
    "title": "Problems with agar drying up",
    "url": "https://www.reddit.com/r/biology/comments/11burl2/problems_with_agar_drying_up/",
    "score": 0,
    "num_comments": 2,
    "created": "2023-02-25T20:26:01+00:00",
    "body": "Hi, \n\nI recently did an experiment involving the growth of bacteria.  \nWhile growing my bacteria in petri dishes i noticed that the agar in the petri dishes in which i added a small amount of hand soap that was mixed with water dried up.  \nWhat could cause the agar to dry up in my petri dish when i add the hand soap mixed with water?  \n\n\nHand soap ingredients :  Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamide DEA, Glycerin,  Cocamidopropyl Betaine, Parfum, Sodium Benzoate, Citric Acid, Sodium  Hydroxide.",
    "flair_text": "discussion",
    "flair_template_id": null,
    "comments": [
      {
        "author": "phytomanic",
        "body": "Decrease in surface tension of an aqueous solution by addition of a surfactant, such as soap, increases rate of evaporation.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "a9qpjt",
    "title": "[Product Question] Can anyone tell me if these products contain any harmful ingredients?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/a9qpjt/product_question_can_anyone_tell_me_if_these/",
    "score": 0,
    "num_comments": 5,
    "created": "2018-12-26T17:59:49+00:00",
    "body": "I've got a lot of ads from menskin.co on social networks recently. I've never used skin care products, but their marketing looks pretty slick. I've found the ingredients listed on their website (they're at the bottom of the support page, not the easiest place to find, but still).\n\n\n* **Moisturizing Balm**  \n*Water, Glycerin, Dipropylene Glycol, Caprylic/Capric Triglyceride, Meadowfoam Seed Oil, Hydrogenated Polyisobutene, Cyclopentasiloxane, Niacinamide, Polysorbate 60, Cyclohexasiloxane, Hydrogenated Polydecene, Cetyl Alcohol, Aloe Vera Gel, Sorbitan Sesquioleate, Shea Butter, Lecithin, Swiftlet Nest Extract, Black Oat Seed Extract, Sparassis Crispa Extract, Lactobacillus Extract, Mountain Yam Extract, Apple Extract, Algae/White Lupine Protein Ferment, Mushroom Extract, Tomato Extract, Milk Lipids, Myrothamnus Flabellifolia Extract, Chlorphenesin, Nacre Protein, Oligopeptide-1, Oligopeptide-2, Oligopeptide-3, Hexapeptide-11, Bacillus Extract, Folic Acid, Acetyl Glutamine, Sodium Hyaluronate, Acetyl Hexapeptide-8, Glyceryl Stearate, PEG-100 Stearate, Cetearyl Olivate, Sorbitan Olivate, Stearyl Alcohol, Licorice Root Extract, Ginger Root Extract, Magnolia Berry Extract, Japanese Goldthread Root Extract, Tea Tree Extract, Propolis Wax, Asiaticoside, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Hydroxypropyl Methylcellulose, Pullulan, Red Algae Extract, Sodium Polyacrylate, Ammonium Acryloyldimethyltaurate/VP Copolymer, Dimethicone/Vinyl Dimethicone Crosspolymer, Dimethicone, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Panthenol, Anemarrhena Asphodeloides Root Extract, Hydrogenated Lecithin, Propanediol, Pectin, Caprylyl Glycol, 1,2-Hexanediol, Myristyl Alcohol, Potassium Sorbate, Ascorbic Acid, Citric Acid, Butylene Glycol, Arginine, Disodium EDTA, Phenoxyethanol, Parfum*\n\n* **Charcoal Cleanser**   \n*Water, Myristic Acid, Butylene Glycol, Stearic Acid, Potassium Hydroxide, Glycerin, Cocamide DEA, 1,2-Hexanediol, Charcoal Powder, Potassium Cocoyl Glycinate, Potassium Cocoate, Shea Butter, Sorbitan Olivate, Bergamot Fruit Oil, Geranium Flower Oil, Lavender Oil, Lemon Peel Oil, Rose Flower Oil, Sandalwood Oil, Gingergrass Oil, BHT, Disodium EDTA, Centella Asiatica Extract, Japanese Knotweed Root Extract, Scutellaria Baicalensis Root Extract, Camellia Sinensis Leaf Extract, Licorice Root Extract, Matricaria Flower Extract, Rosemary Leaf Extract*\n\n* **Exfoliating Rub**   \n*Water, PEG-400, Cellulose, Glycerin, 1,2 – Hexanediol, Alcohol Denat, PEG–32, Arginine, Charcoal Powder, Carbomer, PEG-60 Hydrogenated Castor Oil, Betaine, Allantoin, Glyceryl Acrylate/Acrylic Acid Copoloymer, Fragrance, Disodium EDTA, Panthenol, Dipotassium Glycyrrhizate, Lactose, Cellulose, Hydroxypropyl Methylcellulose, Jojoba Esters, Iron Oxide Yellow, Tocopheryl Acetate, Ascorbyl Palmitate, Centella Asiatica Extract, Japanese Knotweed Root Extract, Chinese Scullcap Root Extract, Tea Tree Extract, Licorice Root Extract, Matricaria Flower Extract, Rosemary Leaf Extract*\n\n\n* **Anti-Wrinkle Serum**   \n*Water, Ascorbic Acid, Potassium Hydroxide, Propylene Glycol, Butylene Glycol, 1,2-Hexanediol, PEG-60 Hydrogenated Castor Oil, Carbomer, Hyaluronic Acid, Pomegranate Extract, Celery Extract, Rice Extract, Cabbage Extract, Turnip Extract, Tomato Extract, Carrot Extract, Broccoli Extract, Tea Tree Extract, Chaenomeles Sinensis Fruit Extract, Lime Fruit Extract, Orange Fruit Extract, Kelp Extract, Mushroom Extract, Lemon Extract, Caprylic/Capric Triglyceride, Glycerin, Hydrogenated Lecithin, Polysorbate 80, Ubiquinone, Tocopheryl acetate, Asparagine, Proline, Methionine, Serine, Isoleucine, Glutamine, Cysteine, Tryptophan, Ethylhexylglycerin, Disodium EDTA, Parfum*\n  \n* **Recovery Oil**   \n*Caprylic/Capric Triglyceride, Dicaprylyl Carbonate, Cetyl Ethylhexanoate, Squalane, Apricot Kernel Oil, Vegetable Oil, Tocopherol, Sunflower Seed Oil, Argan Oil, Jojoba Seed Oil, Macadamia Seed Oil, Olive Oil, Rosa Canina Fruit Oil, Camellia Sinensis Seed Oil, Sweet Almond Oil, Tocopheryl Acetate, Butyl Methoxydibenzoylmethane, Lavendar Oil, Grapefruit Peel Oil, Wild Geranium Oil, Bergamot Fruit Oil, Lemon Peel Oil, Orange Oil, Parfum*\n\n* **Dark Circle Defense**   \n*Water, Dipropylene Glycol, Glycerin, Butylene Glycol, Niacinamide, Ammonium Acryloyldimethyltaurate/VP Copolymer, Betaine, PEG-60 Hydrogenated Castor Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Caffeine, Kojic Acid, Polyacrylate-13, Myrothamnus Flabellifolia Extract, Licorice Root Extract, Ginger Root Extract, Magnolia Berry Fruit Extract, Coptis Japonica Root Extract, Tea Tree Extract, Lemon Peel Ferment Extract, Lemon Extract, Lactobacillus Extract, Mountain Yam Root Extract, Mushroom Extract, Nacre Protein, Sodium Hyaluronate, Hydrogenated Polydecene, Anemarrhena Asphodeloides Root Extract, Sorghum Extract, Aspergillus Ferment, Hydrolyzed Collagen, Acetyl Hexapeptide-8, Propolis Wax, Asiaticoside, Propanediol, Phenoxyethanol,1, 2-Hexanediol, Caprylyl Glycol, Polyisobutene, Polysorbate 20, Ethylhexylglycerin, Asparagine, Proline, Methionine, Serine, Isoleucine, Glutamine, Cysteine, Tryptophan, Sorbitan Isostearate, Ascorbic Acid, Citric Acid, Arginine, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Chlorphenesin, Disodium EDTA, Parfum*\n\n\nEDIT: formatting\n\n",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "DarrenFromFinance",
        "body": "\"Harmful\" is a relative term, but every one of those products has fragrance in them, which is not needed in skincare and is a possible sensitizer/allergen. All but one of them contain \"parfum\" or \"fragrance\", which probably indicate synthetic fragrances (not that there's anything wrong with that), and all of them contain things that are there only for their scent, such as grapefruit, lemon, and bergamot oils, none of which you need on your skin.\n\nI don't know what to make of the grocery-basket list of things like the anti-wrinkle serum's \"Pomegranate Extract, Celery Extract, Rice Extract, Cabbage Extract, Turnip Extract, Tomato Extract, Carrot Extract, Broccoli Extract, Tea Tree Extract, Chaenomeles Sinensis \\[quince\\] Fruit Extract, Lime Fruit Extract, Orange Fruit Extract, Kelp Extract, Mushroom Extract, Lemon Extract\". That's just weird. It's a bunch of stuff thrown in because it's cheap and probably harmless and sounds natural. But I can't imagine what those things are supposed to do for you: they're not going to reduce your wrinkles, that's for sure.\n\nAlso, all their products are in jars or roller bottles. This is bad: not *as* bad for cleansers and exfoliators, but for products that sit on your skin, very bad indeed. Every time you open the jar, you're exposing the product to oxygen, and when you dip your fingers in, you're shoving bacteria in there: when you use a roller bottle, the roller is carrying bacteria and dead skin cells up into the product. If a product isn't in a tube or a pump bottle, you ought to steer clear of it, or at the very least transfer a small amount to a smaller jar (like half an ounce or less, the smaller the better) with a clean spoon.\n\nThe prices are okay but the ingredients lists are ridiculous and the packaging is terrible. I wouldn't if I were you.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "rbecca08",
        "body": "There's a lot of really good database sites that breakdown chemicals and ingredients found in cosmetics. \n\n[EWG Cosmetic Database](https://www.ewg.org/skindeep/) has a \"Hazard score key\" that will let you know whether or not a product should even be used on your skin. It'll explain the score and break down the health concerns of the ingredient.\n\n[Cos DNA](http://cosdna.com/) has an extensive product list. Same kind of system where it will rate the safety of each ingredient. This one doesn't go into too much detail with toxicity, but it'll point out whether an ingredient is known to cause acne or considered an irritant.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "gypsyloren",
        "body": "get the app “think dirty” to find toxin free things and to see on a scale how good or bad certain skin care products are for you!",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "hmvsyi",
    "title": "Is there a keto shampoo that doesn't contain cocamide DEA/MEA or essential oils?",
    "url": "https://www.reddit.com/r/tressless/comments/hmvsyi/is_there_a_keto_shampoo_that_doesnt_contain/",
    "score": 0,
    "num_comments": 0,
    "created": "2020-07-07T14:42:37+00:00",
    "body": "The reason I'm looking for one without cocamide DEA is that it's a carcinogen and cocamide MEA, on the other hand, contains traces of DEA ([more on this](https://www.mapleholistics.com/blog/cocamide-dea-in-shampoos-conditioners-and-beauty-products/)) and the reason I don't want essential oils is because they're androgen disruptors.",
    "flair_text": "Ketoconazole",
    "flair_template_id": "fa35f500-59fc-11e6-b27e-0e5cf70f3833",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "ghs3gt",
    "title": "[Routine Help] I mostly need help with the order and how to apply things.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/ghs3gt/routine_help_i_mostly_need_help_with_the_order/",
    "score": 0,
    "num_comments": 3,
    "created": "2020-05-11T17:29:38+00:00",
    "body": "AM: \n1) Wash face with cerave cream cleanser or vanicream gentle cleanser\n\n2) Apply 3 pea size amounts? of ketoconazole. I’m not sure how much I should be applying. Wait 20 minutes.\n\n3) Apply sunscreen over fungal cream(I’m not sure if I should be washing it off)\n\n4) Apply Cerave lotion mixed with cerave cream\n\nPM:\n\n1) Wash face with SAL3 bar (3% salicylic acid 10% sulfur) Inactive ingredients: saponified palm and palm kernal oils, glycerin, lanolin, cocamide DEA, ethanol, titanium dioxide.\n\n2) Then wash face with cerave cream cleanser or vanicream gentle cleanser? I’m assuming the SAL3 doesn’t really wash that well\n\n3) Apply thin layer of cerave lotion and wait 20 minutes to dry\n\n4) Apply (chickpea or green pea size amount?) or tretinoin 0.01% gel over entire face. Then wait 20 more minutes to settle in?\n\n5) Apply fungal safe HADALABO Gokujun Hyaluronic Lotion\n\n6) Apply cerave lotion then cerave cream\n\n7) then apply Vaseline maybe??\n\n\n***One thing I’m missing is that I was told to apply ketoconazole twice daily in the morning and evening. So idk if I should apply it in the evening over my lotion that I had already been wearing most of the day then it just gets washed off later at night with my PM routine or if I’m supposed to incorporate it somewhere into the PM routine? \n\nPlease give me any advice on how I should apply things better, the order, amount, waiting times? Thank you.",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/ghhp6f/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "pxppyjd",
        "body": "**AM:**\n\n-  vanicream gentle cleanser/ cerave cream cleanser\n\n- Ketoconazole\n\n- Cerave lotion/ cerave cream\n\n- Sunscreen\n\n\n**PM:**\n\n- Vanicream gentle cleanser/ cerave cream cleanser\n\n- SAL3 bar\n\n- Ketoconazole\n\n- Hada labo gokujyun \n\n- Cerave lotion\n\n- **wait 20-30 mins** \n\n- Tretinoin\n\n- Cerave cream",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Soap",
    "post_id": "4s4889",
    "title": "Are there health risks in using this liquid soap for everything? Contents inside.",
    "url": "https://www.reddit.com/r/Soap/comments/4s4889/are_there_health_risks_in_using_this_liquid_soap/",
    "score": 0,
    "num_comments": 2,
    "created": "2016-07-10T05:37:27+00:00",
    "body": "Aqua, Sodium Laureth Sulfate, Sodium Chloride, Cocamidopropyl Betaine, Cocamide DEA, Glycerin, Styrene/Acrylates Copolymer, Parfum, Tetrasodium EDTA, Benzophenone-4, Propylene Glycol, Citric acid, Pogostemon Cablin Leaf Extract, Butylphenyl Methylpropional, Methylchloroisothiazolinone, methylisothiazolinone, C.I.60730, C.I.45100\n\nI use this liquid soap for everything, because I'm broke and because it works. It's a well-known brand where I live.\n\nI use it for my hands, body and head (I have short hair). Also for washing the dishes and even doing the laundry (in a washing machine). It seems to be very effective at all of those of functions.\n\nI've seen the ingredients list in various shampoos and body soaps/milks/whaever. They look pretty similar.\n\nI have a couple of skin problems that could be soap-related.\n\n* I sometimes have unbearably dry hands and feet, especially at night. Other soaps make my whole skin dry right after showering, this one doesn't. I've had this condition for years before I started using this soap.\n* I have dead skin on my scalp, looks like dandruff when I try to get it off. \n\n\nShould I be worried about some of the ingredients? Should I start using a different soap/shampoo for some part of my body? Why?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Bae1fire",
        "body": "This sub is more for the soap making hobbyist/professionals.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "1durjzj",
    "title": "Struggling with toilet cistern block cleaner formulation",
    "url": "https://www.reddit.com/r/chemistry/comments/1durjzj/struggling_with_toilet_cistern_block_cleaner/",
    "score": 0,
    "num_comments": 2,
    "created": "2024-07-03T22:46:07+00:00",
    "body": "Hello guys,\n\nI'm trying to make a toilet block cleaner the one we place in the toilet cistern and I'm struggling with the final result, the problem is that at the resulting block is not compact it breaks when i manipulate it with my hands and transform into powder (sorry for my bad english), so here is the formula i used for 1 kilo : \n\nSulfonic acid - 100 grams/\nSodium carbonate - 300 grams/\nSodium sulfate - 300 grams/\nSodium lauryl ether sulfate - 80 grams/\nSodium bicarbonate - 50 grams/\nHpmc - 50 grams/\nCocamide dea - 50 grams/\nPerfume - 40 grams/\nBlue dye - 30 grams/\n\nIf someone can help me it will be very kind thank you in advance ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Indemnity4",
        "body": "Add more binder.\n\nCheap trick is adding a few drops of water just before pressing.  Spray a mist into the mold.  The HMPC will swell up and form a tough outer layer that is still easily dissolved.\n\nIf you find your solid reagents are reacting, pre-wet the HPMC.  Just a little tiny bit.\n\nYou can blend in a small amount of PVA / PVOH too.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]