[
  {
    "subreddit": "HaircareScience",
    "post_id": "rcyunx",
    "title": "Inspired by a recent post- I would also like to share my experience with Prose.",
    "url": "https://www.reddit.com/r/HaircareScience/comments/rcyunx/inspired_by_a_recent_post_i_would_also_like_to/",
    "score": 53,
    "num_comments": 18,
    "created": "2021-12-10T03:20:41+00:00",
    "body": "After seeing [this post](https://www.reddit.com/r/HaircareScience/comments/r613jf/my_experience_with_prose_finethin_curlywavy_hair/) on here, I was inspired to share my thoughts about my experience with Prose.\n\n**My hair:** 2A, fine-medium strands and medium density. It's at about mid/upper back in length, and the only color I have is very very grown out highlights that are near the ends. I'm pretty oily at the roots, I wash my hair every 2 days or so, and cannot go longer than that despite my many attempts to try the hair training myth.\n\n**The goals I set with my subscription:** Oil Control, shine, volume, moisture\n\n**The “factors” they included based on my zip code:** UV protection, humidity, water hardness, pollution, wind. (who knows how much of this they actually factor in but whatever lol.)\n\n**Full Ingredients lists:**\n\n*Shampoo:*  Water, Sodium Lauroyl Methyl Isethionate, Polyglyceryl-4 Caprate, Cocamidopropyl Betaine, Decyl- Glucoside, Acrylates/Beheneth-25 Methacrylate Copolymer, Sodium Methyl Oleoyl Taurate, Sodium Lauroyl Sarcosinate, Glycerin, Sodium Cocoyl Isethionate, Jasmin Flower Water, Propanediol Dicaprylate, Fragrance, 1,2-Hexanediol, Caprylyl Glycol, Guar Hydroxypropyltrimonium Chloride, Propylene Glycol, Sodium Benzoate, Trisodium Ethylenediamine Disuccinate, Tocopherol, PPG-Caprylyl Ether, Pyridoxine, Panthenol, Jujube Bark Extract, Peppermint Leaf Extract, Dipotassium Glycyrrhizate, Polyquaternium-10, Tropolone, Hydrolyzed Quinoa, Kale Leaf Extract, Citric Acid, Spirulina Extract, Potassium Sorbate, Hydrolyzed Pea Protein, Yucca Stem Extract, Arginine, Cannabidiol, Cocamidopropyl PG- dimonium Chloride, Grape Seed Extract\n\n*Conditioner:* Water, Cetearyl Alcohol, Glycerin, Octyldodecanol, Caprylic/Capric Triglyceride, Behentrimonium Chloride, Hydroxyethylcellulose, Fragrance, Cetrimonium Chloride, Birch Juice, Caprylyl Glycol, 1,2-Hexanediol, Guar Hydroxypropyltrimonium Chloride, PEG-7 Dimethicone, Cetyl Alcohol, Laureth-7, Polyquaternium-10, Tocopherol, Polysorbate 20, Poppy Seed Oil, Plum Seed Oil, Citric Acid, Sodium Benzoate, Cocamidopropyl PG-dimonium Chloride, Potassium Sorbate\n\n**(These lists look pretty basic to me. But I am curious on your thoughts on them.)**\n\n**The story:** I received the first order of Prose a few months ago. I genuinely liked the idea of customized haircare, so I was hopeful. Like many other people, they were *all over* my fucking IG ads, and this annoyed me but I (unfortunately) love trying new products way too much to ignore them 🙄. The set was good. I loved the scent, I loved how my hair looked, and it felt healthy & clean with each wash. It was spring at the time, and there was enough humidity in the air for my hair to have some volume in addition to these other perks. As the weather got cooler, I noticed that the formula seemed almost too conditioning for winter where humidity was much lower. This lead me to believe they did not in fact update it based on the weather in my area. My hair was very flat and limp, and occasionally felt weighed down. There was absolutely no help with the sebum control, but that was to be expected.\n\n**Flash forward to yesterday's post-** I read that the OP had very similar experiences to me *but* experienced more shedding with this product. Andddd I got to thinking. ***I, in fact, was noticing a lot more shedding than I was used to.*** I can't really recall when this increase in shedding started, because my hair was shorter when I first started using it (tiny past shoulder length)- so less hair showed in my shower drain cover. Now, my ponytail just feels a bit less thick. I can't see any bald spots or anything like that, and it is not something very severe- but the combo of seeing a lot of shedding in the shower and this less dense feeling in my ponytail made me feel just a little off. Like something just wasn't quite right. \n\nToday I decided to wash my hair with a different shampoo, a higher end drugstore one from Target called “Odele Volumizing Shampoo” which I used before Prose. And yall… The shedding was much less. Like, MUCH less. I am still shocked.\n\n\\***Let me just say\\*:**\n\n* ***I know that it is not common that a product alone causes more hairfall, and that usually there is a different or underlying reason.***\n* ***I recently had bloods and a physical and all is well with my health***\n* I highly doubt this product is actually harmful, so I am guessing that it simply caused more breakage to happen and that’s what I was seeing in the shower. But I will never really know.\n* ***This product caused no irritation or visible signs of it not agreeing with me, or I would have stopped using it.***\n* I normally would not jump to conclusions, but after seeing such a consistent amount of hairfall each time, it was too different of a result for me to not take into account. I am going to continue to use the regular shampoo and see if anything changes.\n\n**What's my point?:** Prose is ultimately a gimmick. They have very convincing ads that pray on people's fears about cosmetics and their hair health. My hair *looks* great with it, but I shed more for whatever reason and I'm not into that. I'm not sure I trust they are real chemists, either. \n\nThank you for reading!",
    "flair_text": "Experience Review",
    "flair_template_id": "d4b74438-924a-11eb-9b71-0e6aebf31459",
    "comments": [
      {
        "author": "doctorpotterhead",
        "body": "I had the same results with function of beauty",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "LilSisterThickness",
        "body": "Thanks for the post, I’ve been using prose bc I am allergic to pretty much all fragrances and they’re the only brand I know of that I can request to omit the fragrance. I am not happy with my hair though. I have been shedding excessively as well, and also my hair is coarse and rough at the ends. Sometimes when I sleep on it it stays bent in the position I was laying on it and it won’t brush out, almost like I haven’t washed it for a week. I just don’t like the texture of my hair right now. I wish it were softer and shinier and I really would like to switch products but it’s really frustrating with the fragrance thing.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "IDK_AnderBeauBeau",
        "body": "You know what? I’ve been suspicious that I’m shedding more than I should too! It’s been over 25 years since I’ve had longer hair (always had chin length curly bob or a pixie cut) so I figured it was just more noticeable because I’ve been wearing a bun for the first time in so long. I know that’s part of it… and also because I have curly hair and everything comes out in the shower. I still had this… suspicion. I’m going to try what you did and switch up from my Prose for a bit.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "official_koda_",
        "body": "I used function of beauty as my only hair products for two years. In the last few months I was using it I noticed some serious hair loss. I’m not saying all of their formulas cause hair loss, but I think the last one I was using definitely has some bad ingredient in it. Others have said the same thing.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "do_mika",
        "body": "I know this post is old but I’m wondering if the company has been hit with supply chain issues with their ingredients and have switched to something of less quality in order to keep their profits high?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "icedoatmilklatte7",
        "body": "Hi! It caused a lot of hair loss for me",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "crowarray",
        "body": "I had this exact experience with Prose. I complained and they sent me another set, but it was the exact same.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "1ays2t5",
    "title": "a lot of Reviews + some things i will be reviewing/ am currently trying",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/1ays2t5/a_lot_of_reviews_some_things_i_will_be_reviewing/",
    "score": 34,
    "num_comments": 6,
    "created": "2024-02-24T11:08:58+00:00",
    "body": "**Personal Info:**\n\nI live in nothern europe, so currently cold, windy and dry Climate. My Skintype is sahara desert dry, prone to closed comedones plus some light hormonal acne. Sadly im also super prone to hyperpigmentation. My main Goals are barrier health, hydration, acne & Hyperpigmentation management and getting rid of the damn stubborn CC\\`s... I also follow a kinda skincycling routine wich includes a non AB Retinal product.\n\nIn **Bold** will be the product name + how long i have been using it\n\nin *italic* will be the ingredients i liked\n\n\n\n**Axis-Y Sunday morning cleanser: (using for a month now)** *green tea extract, centella extract, allatonin*\n\nIngredients:\n\nWater, Glycerin, Sodium Cocoyl Isethionate, Sodium Methyl Cocoyl Taurate, Potassium Cocoyl Glycinate, Coco-Betaine, Butylene Glycol, Potassium Cocoate, Sodium Chloride, Potassium Benzoate, Polyquaternium-67, Xylitylglucoside, Citric Acid, Anhydroxylitol, Propanediol, Xylitol, Betula Platyphylla Japonica Juice, Glucose, Camellia Sinensis Leaf Extract, Disodium EDTA, Glycyrrhiza Glabra (Licorice) Root Extract, Agrimonia Eupatoria Extract, 1,2-Hexanediol, Centella Asiatica Extract, Dipropylene Glycol, Allantoin, Perilla Frutescens Leaf Extract, Saponaria Officinalis Extract, Sodium Acetate, Pentylene Glycol, Calendula Officinalis Flower Extract, Kigelia Africana Fruit Extract, Caprylyl Glycol, Natto Gum, Sodium Hyaluronate, Chamomilla Recutita (Matricaria) Flower Extract, Ethylhexylglycerin, Hydroxycinnamic Acid, Rutin\n\nTexture:\n\na balmy texture, foams up to a dense and soft foam\n\nExpirience:\n\nI picked this up because I wanted to change from my old clenaser to something that felt like it had a bit more cleansing power, yet was not stripping. As far as i can tell it seems to accomplish that. It foams up nicely, cleans well and doesent seem to strip my Skin. After washing it off it feels almost as if there is a slight layer on my Skin, but i dont mind it/ think that it contributes to the non stripping?\n\n(4/5)\n\n**Cosrx Propolis Toner: (about a month 1/2 of use)** *propolis, honey extract, panthenol*\n\nIngredients:\n\nPropolis Extract, Honey Extract, Butylene Glycol, 1,2-Hexanediol, Glycerin, Betaine, Cassia Obtusifolia Seed Extract, Panthenol, Polyglyceryl-10 Laurate, Polyglyceryl-10 Myristate, Ethylhexylglycerin, Sodium Hyaluronate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Caprylic/Capric Triglyceride\n\nTexture:\n\na waterlike texture, thats just a bit thicker\n\nExpirience:\n\nTo be honest im not overly impressed... its a nice hydrating toner for sure but i didnt notice anything outstanding that would have me choose it again. But it gets a pluspoint for being reasonably priced so i migth pick it up again to reach free shipping...\n\n(3/5)\n\n**Holika Holika Aloe Waterproof Sungel (3 Months of use)** *Aloe*\n\nIngredients:\n\nAqua, Dibutyl Adipate, Propanediol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Polymethylsilsesquioxane, Ethylhexyl Triazone, Niacinamide, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Coco-Caprylate/Caprate, Caprylyl Methicone, Diethylhexyl Butamido Triazone, Glycerin, Butylene Glycol, 1,2-Hexanediol, Hippophae Rhamnoides Fruit Extract, Daucus Carota Sativa (Carrot) Root Extract, Rosa Canina Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Aloe Ferox Leaf Extract, Artemisia Capillaris Extract, Prunus Armeniaca (Apricot) Juice, Hydrogenated Lecithin, Pentylene Glycol, Behenyl Alcohol, Poly C10-30 Alkyl Acrylate, Polyglyceryl-3 Methylglucose Distearate, Decyl Glucoside, Tromethamine, Carbomer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Stearoyl Glutamate, Polyacrylate Crosspolymer-6, Ethylhexylglycerin, Adenosine, Xanthan Gum, T-butyl Alcohol, Tocopherol, Ascorbic Acid, Moringa Oleifera Seed Oil, Ceramide Np, Phytosphingosine, Parfum\n\nTexture:\n\na thin cream Texture, not runny but almost there\n\nExpirience:\n\nIt comes in quite a big size for a Sunscreen, you can find 80 - 100 ml Tubes online for around 15-17 Euros! Wich honestly was the sole reason why i bougth it xD i figured my skin would be fine with the Ingredients and i just hate tiny sunscreens! And well... that was exactly what it is like, its decently moisturizing and doesnt irritate my Skin. But if you have sensitive Skin be careful, it does have Fragrance, smells kinda like very artificial Aloe. You can smell it but only upon first apllication, it doesnt linger. I have been using 1 bottle for 3 months and still have enough for another month at min. so a win!\n\n(3.5/5)\n\n**Purito Dermide Cica Barrier Sleeping Mask: (3 months of use)** *Squalane, Centella Extract, Jojoba oil, Panthenol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Ceramide*\n\nIngredients:\n\nWater, Centella Asiatica Extract(250,000Ppm), Caprylic/​Capric Triglyceride, Glycerin, Squalane, Simmondsia Chinensis (Jojoba) Seed Oil, Cetearyl Alcohol, Potassium Cetyl Phosphate, Helianthus Annuus (Sunflower) Seed Oil, Butylene Glycol, Polyglyceryl-3 Methylglucose Distearate, 1,2-Hexanediol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Panthenol, Ceramide NP(3,000Ppm), Sodium Hyaluronate, Hydroxyacetophenone, Sodium Carbomer, Hydrogenated Lecithin, Hydroxyethylcellulose, Camellia Sinensis Leaf Extract\n\nTexture:\n\nA thick Cream, feels quite emmolient\n\nExpirience:\n\nI love, love, loe this! Its the first moisturizer that i found that feels like it actually does its job well on my Skin. As a nigthtime moisturizer it keeps my Skin hydrated all through the Night and has my wake up nicely glowy. I love to use this when my Skin is irritated, it really soothes it quickly. Always have this on my Shelf, you would have to pry it out of my dead cold hands, to seperate me from it. One Bottle last me about 2 months.\n\nHG!\n\n(5/5)\n\n**Mary & May Blackberry Cream Essence: (4 months of use)** *Jojoba oil, ceramides, lotus water, centella*\n\nIngredients:\n\nWater, Nymphaea Caerulea Flower Water, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Poly(C6-14 Olefin), Rubus Fruticosus (Blackberry) Fruit Extract, 1,2-hexanediol, Methlypropanediol, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Hydrolyzed Gardenia Florida Extract, Sodium Hyaluronate, Hydrogenated Lecithin, Butylene Glycol, Glycerin, Trilaureth-4 Phoshate, Sodium Polyacrylate, Pvm/Ma Copolymer, Cyanocobalamin, Ceramide Np, Maltodextrin, Ethylhexylglycerin, Tocopherol\n\nTexture:\n\nthin, watery but creamy? (just realized i suck at describing textures haha)\n\nExpirience:\n\nA really nice hydrating and moisturizing Toner, feels like a great balance of the two. Acts nicely as a layer with other Skincare because it absorbs really well. I like it, a bottle lasts me about 2 months.\n\n(4/5)\n\n**Abib Quick Sunstick Protection Bar: ( 3 months of use)** *Aloe, Centella, Ceramides*\n\nIngredients:\n\nOctyldodecanol, Butylene Glycol Dicaprylate/Dicaprate, Ethylhexyl Methoxycinnamate, Dibutyl Ethylhexanoyl Glutamide, Dibutyl Lauroyl Glutamide, Diisostearyl Malate, Ethylhexyl Salicylate, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Dextrin Palmitate, Octocrylene, Camellia Sinensis Leaf Extract, Centella Asiatica Extract, Aloe Barbadensis Leaf Juice, Cucumis Sativus (Cucumber) Fruit Extract, Aloe Barbadensis Leaf Extract, Glycerin, Water, Butylene Glycol, Saccharide Isomerate, Maltodextrin, Hydrolyzed Vegetable Protein, Caprylic/Capric Triglyceride, Hydrogenated Lecithin, Ethyl Hexanediol, Ceramide NP, Citric Acid, Sodium Citrate, Ethylhexylglycerin, Phenoxyethanol\n\nTexture:\n\nA translucent stick, glides on smooth, feels a bit occlusive on skin\n\nExpirience:\n\nNicely moisturizing Sunstick, feels good on my Skin and well... does its Job xD I really like the curved shape of it, it relly helps with the application. I just use it for reapplication of my sunscreen, but also sometimes when my Skin gets really dry during the day ( tho its not the best for that)\n\n(3.5/5)\n\n**Numbuzin No.2 Protein 43% creamy Serum: ( 4 months of use)** *Oat protein, Ceramides, cholesterol, fatty acids, ferments, Rice protein*\n\nIngredients:\n\nAvena Sativa Protein Extract, Water, Cyclopentasiloxane, Butylene Glycol, Cetearyl Ethylhexanoate, Cyclohexasiloxane, Phenyl Trimethicone, Cetyl PEG/PPG-10/1 Dimethicone, Hydrogenated Poly C6-14 Olefin, Niacinamide, Panthenol, 1,2-Hexanediol, Glycerin, Erythritol, Limnanthes Alba Seed Oil, Sodium Chloride, Allantoin, Ethylhexylglycerin, Tocopheryl Acetate, Adenosine, Dextrin, Theobroma Cacao Extract, Pantolactone, Ceramide NP, Cholesterol, Palmitic Acid, Oryza Sativa Seed Protein Extract, Stearic Acid, Hydrolyzed Milk Protein, Lactobacillus Ferment, Glycine Soja Protein, Hydrolyzed Lupine Protein, Glucose, Hydrolyzed Corn Protein, Hydrolyzed Rice Protein, Hydrolyzed Soy Protein, Hydrolyzed Sweet Almond Protein, Hydrolyzed Vegetable Protein, Myristic Acid, Hydrolyzed Pea Protein, Arachidic Acid, Lauric Acid, Sodium Succinate, Disodium EDTA, Fragrance\n\nTexture:\n\nVery thick serum, really is creamy like the name says\n\nExpirience:\n\nSooo repairing and soothing, does wonders for my barrier. It really helps keep my Skin moisturized and helps keep my transepidermal waterloss in check. Love it so much! HG!\n\n(5/5)\n\n**Purito Aha Bha Refreshing Solution: (1 month of use)** *Glycolic acid, Salcylic Acid*\n\nIngredients:\n\nSalix Alba (Willow) Bark Water, Butylene Glycol, Dipropylene Glycol, Glycolic Acid (7%), Tromethamine, Water, Salicylic Acid(2%), 1,2-Hexanediol, Sodium Citrate, Arginine, Caprylyl Glycol, Citric Acid(0.28%), Hydroxyacetophenone, Pentylene Glycol, Allantoin, Dipotassium Glycyrrhizate, Disodium EDTA\n\nTexture:\n\nlike water, it put 2-3 drops on a thin cotton pad and swipe over my Face with it\n\nExpirience:\n\nSince it has only been a month i cannot say too much about how it has worked (and i feel its hard to tell what effects on my skin is retinal and whats from this product) but my comedones are reducing in size and developing into breakouts. But the effects of these ingredients are well studied in these concentrations so i would say its save to say it works. Its my first time using glycolic acid and i can say it packs a punch for sure! So be careful, its intense, so far im using it once a week on my exfoliation day and i dont think ill be moving up.... Might also be the fact that its a combo product, but i have been using salcylic acid and mandelic acid in combo before, and that felt less sensitizing. So im attributing that factor to the 7 percent glycolic acid, since it is the smallest molecule size of all Aha\\`s.\n\n(3.5/5)\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------\n\nNow lets move to quick first impressions of a few products i just started trying, wich i have seperated from the review portion because i just havent been using them long enough to really speak about the effects on my Skin: (these will also be shorter impressions with less info)\n\n\n\n**Neo:labs liquid enhancer Pycogenol:**\n\nIngredients:\n\nWater, Propanediol, Hydrogenated Poly C6-14 Olefin, 1.2-Hexanediol, Methylpropanediol, Glycerin, Chondrus Crispus Extract, Saccharum Officinarum Extract, Jojoba Esters, Melia Azadirachta Flower Extract, Salvia Sclarea Oil, Ocimum Sanctum Leaf Extract, Melia Azadirachta Leaf Extract, Curcuma Longa Root Extract, Anthemis Nobilis Flower Oil, Corallina Officinalis Extract, Theobroma Cacao Seed Extract, Melaleuca Altemifolia Extract, Centella Asiatica Extract, Melaleuca Alternifolia Leaf Oil, Pinus Pinaster Bark Extract, Caprylic/Capric Triglyceride, Glyceryl Stearate, C18-36 Acid Triglyceride, Coprylyl Glycol, Hydrogenated Lecithin, C12-18 Acid Triglyceride, Squalene, Sodium Polyacrylate, Tromethamine, Albatreus Contuena Extract, Paimitic Acid, Stearic Acid, Phytasteryl Macadamiate, Citric Acid, Phytosterol, Dextrin, Tocopherol, Butylene Glycol, 4-Terpineol, Pentylene Glycol, Octonediol, Ethylhexylglycerin, Cetearyl Alcohol, Carbomer, Xanthan Gum\n\nExpirience:\n\nBougth this because of the tea tree extract, oil and 4- terpineol for the antimicrobial and antiinflammatory benefits , plus it also promised balancing the water-oil contend of the skin. So far i have been using it for a week and it feels nicely moisturizing, but i cannot say if it has helped with my breakouts. Smells strongly like tea tree, wich i dont mind.\n\n**Isntree Spotsaver Mugwort Ampoule:**\n\nIngredients:\n\nArtemisia Princeps Extract, Glycerin, Butylene Glycol, Glycereth-26, Erythritol, Betaine, Glycyrrhiza Glabra (Licorice) Root Extract, Calendula Officinalis Flower Extract, Piper Methysticum Leaf/Root/Stem Extract, Panthenol, Propanediol, Beta-Glucan, Dipotassium Glycyrrhizate, Hydrogenated Lecithin, Ceramide NP, Allantoin, Carbomer, Tromethamine, 1,2-Hexanediol\n\nExpirience:\n\nThis i got because i heard amazing things about mugwort and it was on a 50 % Sale, so i got it for a steal! So far i like the simple ingredient list an it seems soothing and hydrating.\n\n**RNW Der.Ceramide Cream:**\n\nIngredients:\n\nWater, Butylene Glycol, Ceramide NP, Panthenol, Caprylyl Methicone, Glycerin, C12-16 Alcohols, 1,2-Hexanediol, Cetearyl Alcohol, Pentaerythrityl Tetraisostearate, Limnanthes Alba (Meadowfoam) Seed Oil, Cetyl Ethylhexanoate, Polyglyceryl-3 Distearate, Ceramide NS, Phytosphingosine, Cholesterol, Ceramide AS, Ceramide AP, Oligopeptide-1, Ceramide EOP, Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Hydrolyzed Hyaluronic Acid, Palmitic Acid, Hydrogenated Lecithin, Caprylic/Capric Triglyceride, Betaine, Arginine, Arachidyl Alcohol, Behenyl Alcohol, Glyceryl Stearate Citrate, Carbomer, Butyrospermum Parkii (Shea) Butter, Arachidyl Glucoside, Citrus Aurantium Dulcis (Orange) Peel Oil, Stearic Acid, Adenosine, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Cedrus Atlantica Bark Oil, Caprylyl Glycol, Sodium Phosphate, Disodium EDTA\n\nExpirience:\n\nIm really intriged by this brand an was debating between this and the Ceramide serum, but got this Cream. At first i was intimitaded by the essential oils and the strong smell it has (herbal, but to my nose very pleasant) so i patchtested it on my cheek. The Patchtests went fine and i have been using it on my whole face for 4 days now and i must say im impressed.\n\nIf you have oily skin i feel you could hate it but for my dry skin... the texture is amazing. Its a THIIICK cream, like an ointment, very balmy. Upon apllication it feels nice to spread it and it sinks in so well for the thick texture. The cream surprisingly dries down velvety and leaving a protective shield over the Skin. I also love that it has 3 % Panthenol, 3% ceramides and cholesterol and fatty acids.... so perfect ingrdients for skin barrier repair! Really a potential HG...\n\n\n\n",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "pollypetunia",
        "body": "I love the sound of the purito sleep mask! My skin sounds very similar to yours and I've been looking for a sleeping pack because I just can't deal with sheet masks. Does it have any kind of scent?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "ktli1",
        "body": "I think there's a typo, the propolis toner is made by cosrx. 😅\n\nUnless I've missed something and there's a new propolis toner by Purito. In that case, I'd be very interested in trying it as well 😍",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "9ygd0i",
    "title": "New Releases and Interesting Finds",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/9ygd0i/new_releases_and_interesting_finds/",
    "score": 30,
    "num_comments": 8,
    "created": "2018-11-19T12:34:03+00:00",
    "body": "**New Releases**\n\n**Missha:** has a new cleansing water: [Medical Cica Cleansing Water](http://missha.beautynet.co.kr/goods.detail.do?goodsNumber=80558).\n\n**Holika Holika:** has some new makeup out part of their holiday collection: [Everyday Is My Birthday Piece Matching Eye Shadow Palette](http://www.holikaholika.co.kr/FrontStore/iGoodsViewT1.phtml?iGoodsId=20014897&iCategoryIdMain=192&iCategoryId=0#!-D), [Everyday Is My Birthday Foil Shock Shdow](http://www.holikaholika.co.kr/FrontStore/iGoodsViewT1.phtml?iGoodsId=20014892-2&iCategoryIdMain=190&iCategoryId=0).\n\n**It's Skin:** their *Cera Line* has a new product: [Milk Solution](http://www.itsskin.com/shop/view.asp?P_IDX=3503).\n\n**Etude House:** their *Play 101 Pencil* has some new shades: [26,19,11,05,13](https://www.etudehouse.com/kr/ko/product/detail?onlineProdSn=21639).\n\n**Elizavecca:** has a new cream out: [Moisture Hyaluronic Acid Memory Cream](http://www.elizavecca.com/shop/goods/goods_view.php?goodsno=940&category=014).\n\n**Clio:** their holiday collection is out: [Professional Layering Eye Palette](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201811073342&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Kill Cover Ampoule Cushion](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201811071969&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Veil Tint Balm](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201811076725&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Pro Play Mini Brush Set](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201811076799&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined), [Hydro Makeup Sponge](http://www.clubclio.co.kr/product/product_view.asp?product_cd=P201811078840&sh_cate1=undefined&sh_cate2=undefined&sh_cate3=undefined).\n\n**Innisfree:** their holiday collection is out and it can be seen [here](http://www.innisfree.com/kr/ko/event/greenchristmas2018/index.jsp) and [here](http://www.innisfree.com/kr/ko/Product.do?tp=2&catCd01=SD).\n\n**Nature Republic:** has some new haircare:[Black Bean Anti Hair Loss Shampoo](https://www.naturerepublic.com/shop/goods_view.php?id=0000012047), [Black Bean Anti Hair Loss Treatment.](https://www.naturerepublic.com/shop/goods_view.php?id=0000012048)\n\n**TonyMoly:** has some new skincare out: [Wonder Moisturizing Hand Lotion](http://www.etonymoly.com/html/ItemDetail.asp?guid=5783&cate=176), [Vital Vita 12 Essence Moisture Mask](http://www.etonymoly.com/html/ItemDetail.asp?guid=5812&cate=157) and some new holiday makeup and pouches: [Liptone Get It Tint No 11 Love Trio](http://www.etonymoly.com/html/ItemDetail.asp?guid=5762&cate=239), [BCDation Moisture Cover Cushion](http://www.etonymoly.com/html/ItemDetail.asp?guid=5761&cate=162), [Perfect Lips Shocking Lip No 11 Rose Shocking](http://www.etonymoly.com/html/ItemDetail.asp?guid=5760&cate=239), Holiday Pouch [Red](http://www.etonymoly.com/html/ItemDetail.asp?guid=5771&cate=245)/[Black](http://www.etonymoly.com/html/ItemDetail.asp?guid=5772&cate=245).\n\n**Labelyoung:** has some holiday editions out: [Soju Skin](http://labelyoung.com/product/detail.html?product_no=571&cate_no=81&display_group=1), [Foot Bath Essence](http://labelyoung.com/product/detail.html?product_no=573&cate_no=81&display_group=1), [Mayonnaise Hair Pack](http://labelyoung.com/product/detail.html?product_no=572&cate_no=81&display_group=1), [Toner](http://labelyoung.com/product/detail.html?product_no=574&cate_no=81&display_group=1).\n\n**Sidmool:** has a new cream out: [Ectoin Derma 5% Cream](http://www.sidmool.com/shop/shopdetail.html?branduid=77172&xcode=003&mcode=007&scode=&special=1&GfDT=aW13UQ%3D%3D).\n\n**Majolica Majorca:** will be coming out with some new products this week on the 21st and they can all be seen [here](https://www.shiseido.co.jp/mj/release/).\n\n**Integrate:** will be releasing some new makeup this week on the 21st: [Professional Finish Foundation Special Set III](http://www.shiseido.co.jp/sw/products/SWFG070410.seam?online_shohin_ctlg_kbn=1&shohin_pl_c_cd=E03501), [Silky Matt Lip](http://www.shiseido.co.jp/sw/products/SWFG070410.seam?online_shohin_ctlg_kbn=1&shohin_pl_c_cd=E03401).\n\n**Interesting Finds**\n\n*Lululun* will be releasing some new *One Night* masks on the 1st of december: [AC](https://lululun.com/rescue/otonahoshitsu/), [AG](https://lululun.com/rescue/otonaharitsuya/), [AR](https://lululun.com/rescue/otonaoff/).\n\nA look at *TFS's* holiday collab: [TFS X Little Friends](https://www.powderroom.co.kr/campaigns/48760647)(sadly I don't know when this will be released).\n\n*Jill Stuart* will be releasing a fragrance and some eyeshadows on the 7th of december: [Point Makeup Collection](http://www.jillstuart-beauty.com/ja-jp/new-item/2018/1116_point_makeup_collection/), [Crystal Bloom Moonlight Magic LE Fragrance](http://www.jillstuart-beauty.com/ja-jp/new-item/2018/1116_fragrance_limited_items/).\n\n*Cle De Peau's* Holiday Collection is out and can be seen [here](https://www.cledepeau-beaute.com/jp/holiday2018/).\n\n\\-----------------------------------------------------------------------------------------\n\n*Baron* has some nice looking haircare:\n\n• [Moringa Repair Shampoo Premium Edition(SLS,SLES free)](http://www.gsshop.com/prd/prd.gs?prdid=16041667&kwd=%EB%B0%94%EB%A1%A0&ab=df&gsid=srcheshop-result&lseq=395029), a look at some of the ingredients:  *Methylsulfonylmethane (MSM), Betaine,  Moringa Oleifera Leaf Extract(10,000ppm), Biotin, Niacinamide, Argan Oil, Olive Oil, Hydrolyzed Silk,  Hydrolyzed Collagen,  Hydrolyzed Keratin,  Scutellaria Baicalensis Root Extract,  Portulaca Oleracea  Extract,  Lettuce Extract,  Celery Extract,  Ginseng Extract,  Thuja Occidentalis Leaf Extract,  Morus Alba Root Extract,  Chrysanthemum Sibiricum Extract,  Lycium Chinense Fruit Extract,  Acorus Gramineus Root/Stem Extract, Cocklebur Fruit Extract,  Licorice Extract,  Monarda Didyma Leaf Extract, Chamomilla Recutita (Matricaria) Flower Extract, Aminoacids,* *Acetyl Hexapeptide-22, Acetyl Hexapeptide-8,  Oligopeptide-28,* *SH-octapeptide-4*\\*,  sh-Pentapeptide-19,  Caffeoyl Tripeptide-1,  sh-Decapeptide-7.\\*\n\n• [Moringa Hair Treatment Premium Edition](http://www.gsshop.com/prd/prd.gs?prdid=16041707&kwd=%EB%B0%94%EB%A1%A0&ab=df&gsid=srcheshop-result&lseq=395029), a look at some of the ingredients: *Moringa Oleifera Leaf Extract(10,000ppm), Camellia Oil, Argan Oil, Olive Oil, Hydrolyzed Collagen,  Hydrolyzed Keratin, Scutellaria Baicalensis Root Extract,  Portulaca Oleracea  Extract,  Lettuce Extract,  Celery Extract, Panthenol, Ginseng Extract,  Thuja Occidentalis Leaf Extract,  Morus Alba Root Extract,Chrysanthemum Sibiricum Extract,  Lycium Chinense Fruit Extract,  Acorus Gramineus Root/Stem Extract, Cocklebur Fruit Extract, Licorice Extract,Chamomilla Recutita (Matricaria) Flower Extract, Aminoacids,* *Acetyl Hexapeptide-22, Acetyl Hexapeptide-8,  Oligopeptide-28,* *SH-octapeptide-4*,  sh-Pentapeptide-19,  Caffeoyl Tripeptide-1,  sh-Decapeptide-7,  Tocopheryl Acetate.\n\n\\-----------------------------------------------------------------------------------------\n\n*Chakan Factory* has some nice looking haircare:\n\n• [Coffee Bomb Treatment](http://www.chakanfactory.com/shop/shopdetail.html?branduid=1345035&xcode=001&mcode=000&scode=&type=O&sort=manual&cur_code=001&GfDT=bmh%2FW11E), a look at some of the ingredients:  *Coffee bean Extract(90,000ppb), Coffee Flour(90,000ppb), Caffeine,* *Mulberry Root Extract,  Polygonum Multiflorum Root Extract, Ginseng Extract, Angelica Gigas Root Extract,  Artemisia Vulgaris Extract,  Hydrolyzed Silk,  Hydrolyzed Collagen,  Hydrolyzed Keratin,  Hydrolyzed Barley Protein,  Hydrolyzed Corn Protein,  Hydrolyzed Potato Protein,  Hydrolyzed Rice Protein, Hydrolyzed Rice Bran Protein,  Hydrolyzed Soy Protein, Hydrolyzed Oat Protein,  Hydrolyzed Pea Protein,  Hydrolyzed Wheat Protein,  Hydrolyzed Amaranth Protein, Hydrolyzed Sweet Almond Protein.*\n\n• [Milk Protein Treatment](http://www.chakanfactory.com/shop/shopdetail.html?branduid=14&xcode=001&mcode=000&scode=&type=O&sort=manual&cur_code=001&GfDT=bGl3Ug%3D%3D), a look at some of the ingredients: *Milk protein Extract (90,000 ppb Hydrolyzed Milk Protein),  Hydrolyzed Silk,  Hydrolyzed Wheat Protein,  Phytantriol, Panthenol,  Horse Fat, Betaine, Camellia Oil, Avocado Oil, Argan Oil, Olive Oil, Ceramide NP,  Hydrolyzed Keratin,  Hydrolyzed Collagen, Fibroin, Arginine, Threonine.*\n\n• [Milk Protein Shampoo(SLS,SLES free)](http://www.chakanfactory.com/shop/shopdetail.html?branduid=1343039&xcode=001&mcode=000&scode=&type=O&sort=manual&cur_code=001&GfDT=Zmh3UFg%3D), a look at some of the ingredients: *Milk protein Extract (90,000 ppb Hydrolyzed Milk Protein), Hydrolyzed Silk, Hydrolyzed Collagen, Hydrolyzed Keratin,   Hydrolyzed Wheat Protein, Panthenol, Argan Oil, Olive Oil, Phytantriol, Avocado Oil, Arginine, Threonine.*",
    "flair_text": "FOUND",
    "flair_template_id": "c89bc5b4-45e8-11e7-826e-0e49a8a0253c",
    "comments": [
      {
        "author": "campfmsc",
        "body": "ahaha LOVE that texture demo video for the elizavecca cream! pudding? NO! slime? NO!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Sister_Grimm",
        "body": "I'm sure I've said this a million times before,  but DANG,  how so much new every week?!?!?    I also fully realize that AB has spoiled me forever.   Western brands are so cute when they get ONE good ingredient.   Like they JUST discovered hydrolyzed collagen and it's cutting edge science and totes worth a bajillion dollars!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mrshobutt",
        "body": "Not gonna lie, I want that Holika Holika collection just because of the name! (The links lead to the Moringa products for me, btw)  \n  \nI hope the setting spray from Majolica Majorca isn't full of alcohol like the last one, might actually be worth a look!  \n  \nI love the Lululun Rescue masks, I'm so glad they decided to extend the range!!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "9eme5h",
    "title": "New Releases and Interesting Finds",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/9eme5h/new_releases_and_interesting_finds/",
    "score": 29,
    "num_comments": 9,
    "created": "2018-09-10T11:52:15+00:00",
    "body": "**New Releases**\n\n**Apieu:** has some new makeup: the *Tail Brow Pencil* has [new shades](http://apieu.beautynet.co.kr/goods.list.exhibition.do?ebtNo=4554), the *Wild Matte Lipstick* has [new shades](http://apieu.beautynet.co.kr/goods.list.exhibition.do?ebtNo=4567)( the new shade names are in the product presentation banner on top on the right side) and you can now get the *Madecassoside Cica Gel* in a [Big Size](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=80226).\n\n**Missha:** has some new makeup: [Volume Boost Cara](http://missha.beautynet.co.kr/goods.detail.do?goodsNumber=80235), [Lenght Boost Cara](http://missha.beautynet.co.kr/goods.detail.do?goodsNumber=80236), [Wishstone Tint Oil](http://missha.beautynet.co.kr/searchResult.do?sort=best&filterList=&searchFlag=&paging.currentPage=1&brandNo=1&searchItem=1&searchStr=%EC%9C%84%EC%8B%9C%EC%8A%A4%ED%86%A4+%ED%8B%B4%ED%8A%B8+%EC%98%A4%EC%9D%BC) and a new cleanser called [Homemade Pack Foam Cleanser](http://missha.beautynet.co.kr/searchResult.do?sort=best&filterList=&searchFlag=&paging.currentPage=1&brandNo=1&searchItem=1&searchStr=%ED%99%88+%EB%A9%94%EC%9D%B4%EB%93%9C+%ED%8C%A9%ED%8F%BC+%ED%81%B4%EB%A0%8C%EC%A0%80).\n\n**Labiotte:** has a new  tint called  [Flomace Lip Color Shine](http://labiotte.com/shop/shopbrand.html?xcode=016&type=O).\n\n**TonyMoly:** has a new collab [Samyang X TonyMoly](http://www.etonymoly.com/html/eventmall.asp?uid=1722). And here's a look at it from naver: [1](http://blog.naver.com/PostView.nhn?blogId=mirang1227&logNo=221351694972&categoryNo=43&parentCategoryNo=128&viewDate=&currentPage=&postListTopCurrentPage=&isAfterWrite=true), [2](https://m.blog.naver.com/PostView.nhn?blogId=essr0502&logNo=221351154746&categoryNo=15&proxyReferer=&proxyReferer=https%3A%2F%2Fwww.google.ro%2F).\n\n**Holika Holika:** has a new fdt [Hard Cover Glow Foundation](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20014124) and some new skincare: [Good Cera ATO Relief Oil Lotion](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20010817), [Good Cera ATO Relief Oil Wash](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20010818),[V-Line Lifting Mesh Mask](http://www.holikaholika.co.kr/FrontStore/iGoodsView.phtml?iGoodsId=20013289).\n\n**Elizavecca:** has a new essence: [Milky Piggy Hell-Pore Gold Essence](http://www.elizavecca.com/shop/goods/goods_view.php?goodsno=928&category=014).\n\n**The Saem:** has some new skincare: [Urban Eco Harakeke Mist](http://www.thesaemcosmetic.com/page/product/detail/10455),  [Active Source All Renew Ampoule](http://www.thesaemcosmetic.com/page/product/detail/16616),  [Active Source Vita Ampoule](http://www.thesaemcosmetic.com/page/product/detail/16614),  [Active Source Peeling Ampoule](http://www.thesaemcosmetic.com/page/product/detail/16615),  [Active Source Hyaluron Ampoule](http://www.thesaemcosmetic.com/page/product/detail/16613).\n\n**Laneige:** has a new moisturizing toner that will be officially launched on 1st of october but they no have a [sample event](http://www.aritaum.com/event/ev/event_ev_event_view.do?i_sEventcd=EVT1809CREAMSKIN) for it right now and the product is called  [Cream Skin Refiner](http://www.aritaum.com/shop/pr/shop_pr_product_view.do?i_sTmType=PC_HIS_BAK&i_sProductcd=P0000000000000042788).\n\n**Etude House:** has some new skincare: [Modern Homme Boosting Toner](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=108001057&sapCd=110090231), [Modern Homme Multi-Caring Emulsion](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=108001058&sapCd=110090232).\n\nThey also have a new fiber brow product called [Brow Volumizer](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=101004090&sapCd=) and some new accessories: [Microfiber Cleansing Pad](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=110007410&sapCd=650001855), [Peach Cleansing Puff](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=110002059&sapCd=650001856), [Cushion](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=120010026&sapCd=650001902), [Hairband](https://www.etudehouse.com/kr/ko/product.do?method=view&prdCd=120010027&sapCd=).\n\n**Nature Republic:** their F/W collection is out: [18 F/W Rosish Collection](https://www.naturerepublic.com/event/goods_event.php?event_ix=64).\n\n**Saborino:** came out today with two LE masks: [Premium White Strawberry](https://www.bcl-brand.jp/product/product-20397/),  [Premium Blue Mandarin Orange](https://www.bcl-brand.jp/product/product-20402/).\n\n**Scinic:** has added a new product to their *The Simple Line*: [Cica Balm](http://www.scinicmall.com/shop/shopdetail.html?branduid=1053080&special=3&GfDT=aG53UQ%3D%3D).\n\n&#x200B;\n\n**Interesting Finds**\n\n*I'm From* will be releasing a [Rice Toner](https://www.powderroom.co.kr/campaigns/45218939) from the looks of it sometime soon.\n\nReservations for the [Sailor Moon Powder 2019 LE](https://www.creerbeaute.co.jp/sailormoon/face/shiningmoon-powder/) have started on the 6th of september.From my understanding they start delivering it in december.\n\n[Here's](https://www.cosme.net/feature/coffret2018_matome1) a look at some holiday collections from cosme.\n\n\\-----------------------------------------------------------------------------\n\nHere are some nice looking mineral water moisturizers from *Apieu*:\n\n• [Cicative Magnesium Cream](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=77239&displayCategoryNumber=115015007004), a look at some of the ingredients: *Mineral Water(58%), Coconut Oil,  Sunflower Oil, Macadamia Seed Oil,  Japanese Camellia Oil, Niacinamide,  Buriti Oil,   Grifola Frondosa Fruiting Body Extract,  Cocoa Extract, Panthenol,  Adenosine,* *Magnesium Ascorbyl Phosphate*\\*(100ppm),  Magnesium Sulfate(100ppm),  Tocopherol,  Hydrolyzed Collagen ,  Hyaluronic Acid.\\*\n\n• [Cicative Calcium Cream](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=77238&displayCategoryNumber=120000000572), a look at some of the ingredients: *Mineral Water(68%), Niacinamide, Cocoa Seed Butter, Shea Butter,  Cocoa Extract, Cotton Seed Extract, Squalane, Betaine, Panthenol,  Calcium Chloride(1000ppm),  Dipotassium Glycyrrhizate, Adenosine, Ceramide NP, Gluconolactone,  Calcium Gluconate.*\n\n• [Cicative Zinc Cream](http://apieu.beautynet.co.kr/goods.detail.do?goodsNumber=77237&displayCategoryNumber=115015007004), a look at some of the ingredients: *Mineral Water(51%), Zinc Oxide(7%), Shea Butter,  Japanese Camellia Oil, Niacinamide, Panthenol, Macadamia Seed Oil,   Zinc PCA(2000ppm), Adenosine, Allantoin,  Madecassoside,  Tocopherol.*\n\nAnd for anyone interested in how they look and what texture/consistency they have maybe these could help: [1](http://blog.naver.com/PostView.nhn?blogId=byby181&logNo=221155801200&categoryNo=11&parentCategoryNo=0), [2](https://m.blog.naver.com/PostView.nhn?blogId=shyhjin&logNo=221156083890&proxyReferer=https%3A%2F%2Fwww.google.ro%2F), [3](https://m.blog.naver.com/PostView.nhn?blogId=peach_yc&logNo=221155372343&proxyReferer=https%3A%2F%2Fwww.google.ro%2F).\n\n\\-------------------------------------------------------------------------\n\n*Milk Baobab* has two nice looking toners:\n\n• [Coconut 90 Toner](http://www.tnshop.kr/product/detail.html?product_no=133&cate_no=59&display_group=1), a look at some of the ingredients: *Coconut Water 90%(300,000mg), Niacinamide,  Milk Protein Extract(340mg),  Adansonia Digitata Fruit Extract(340mg), Sodium Hyaluronate, Sodium Hyaluronate Crosspolymer, Hydrolyzed Hyaluronic Acid,  Hyaluronic Acid, Hydrolyzed Sodium Hyaluronate.*\n\n• [Centella 90 Toner](http://www.tnshop.kr/product/detail.html?product_no=127&cate_no=59&display_group=1), a look at some of the ingredients:  *Centella Asiatica Leaf Water 90%(300,000mg), Niacinamide, Milk Protein Extract(340mg),  Adansonia Digitata Fruit Extract(340mg), Sodium Hyaluronate, Sodium Hyaluronate Crosspolymer, Hydrolyzed Hyaluronic Acid,  Hyaluronic Acid, Hydrolyzed Sodium Hyaluronate, Allantoin.*\n\n\\------------------------------------------------------------------------\n\nIf you guys remember there was a collagen cream trend a while back well *The Saem* still has one  called [Care Plus Baobab Collagen Cream](http://www.thesaemcosmetic.com/page/product/detail/2411?categoryKey=001001005). And here's a look at some of the ingredients:  *Hydrolyzed Collagen Extract (30%), Coconut Oil, Hydrolyzed  Adansonia Digitata Extract (1000ppm),  Portulaca Oleracea Extract.*\n\n*Eunyul* has a nice looking [Mayu Cream](http://www.gsshop.com/prd/prd.gs?prdid=18175693&kwd=eunyul&ab=b&gsid=srcheshop-result&lseq=395029) and here's a look at some of the ingredients: *Shea Butter, Beeswax, Niacinamide, Horse Fat, Jojoba Seed Oil,  Hydrolyzed Pea Protein, Phytosterol, Olive Oil, Squalane, Ceramide 3,   Camellia Sinensis Leaf Extract, Centella Asiatica Extract, Licorice Extract,  Chamomilla Recutita (Matricaria) Flower Extract,  Polygonum Cuspidatum Root Extract,   Rosemary Leaf Extract,  Scutellaria Baicalensis Root Extract, Trehalose, Panthenol, Sodium Hyaluronate, Betaine, Vit E, EGF, Aloe Vera Leaf Water,  Snail Secretion Filtrate, Adenosine, Mulberry Root Extract,  Panax Ginseng Root Extract,  Magnesium Ascorbyl Phosphate, Haematococcus Pluvialis Extract.*\n\n&#x200B;\n\n&#x200B;",
    "flair_text": "FOUND",
    "flair_template_id": "c89bc5b4-45e8-11e7-826e-0e49a8a0253c",
    "comments": [
      {
        "author": "blackcats666",
        "body": "LOVE YOUR WORK\n\n&#x200B;\n\nDo I dare click the link for the sneak peek of holiday collections....this could be dangerous",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "chloe_rue",
        "body": "That Rosish palette from Nature Republic is pretty! \n\nEdit: lol, thanks :D",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "campfmsc",
        "body": "yay for new cica stuff! the rice toner also looks nice- cool to have more options for those who like milky toners",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SurfingRaichu",
        "body": "Guhhhhh... They really outdid themselves on the Sailor Moon packaging this year. That looks gorgeous.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Sister_Grimm",
        "body": "Stop having such awesome ingredients, horse cream!!  You're supposed to be grossing me out!!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "jmhsmd",
    "title": "Vilvah Goat Milk Shampoo",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/jmhsmd/vilvah_goat_milk_shampoo/",
    "score": 22,
    "num_comments": 9,
    "created": "2020-11-02T05:26:01+00:00",
    "body": "I am always on the lookout for a mild shampoo which will not cause hairfall as I shampoo my hair thrice a week. I've been using The Body Shop Strawberry Clearly Glossing Shampoo for the past couple of years without any complaints. However, with the lockdown all theTBS stores I know of were closed and I could not get my hands on this particular one even from their website, so I decided to try out something else. I chose the Vilvah Goat Milk Shampoo instead. And below is my experience of using the product.\n\nHair type and basic hair care routine- Female-28. I have type 1C hair, with moderately oily scalp and normal strands. Since I live in a highly polluted city, my scalp and the hair shafts become greasy if I go too long without a shampoo. I do not oil my hair except for the three winter-months, and that too not very regularly. I don't have a dandruff issue, and have shoulder length, non-chemically treated hair which I let air-dry. The only hair related problem I face is the occasional increase in hairfall ( I don't sleep well and take a lot of stress) and the coarseness of the hair making it look frizzy. You can literally thread a needle with a  strand of my hair.\n\nIngredients: Aqua, jasmine flower water, goatmilk, disodium cocoyl glutamate, cocamidopropyl hydroxysultaine, sodium Lauryl sarcosinate, xanthan gum, hydrolyzed pea protein, potassium sorbate and sodium benzonate, Lemon peel oil, Jasmine oil, Peru Balsam oil, Ethylene Glycol Mono Stearate, sodium gluconate.\nThe shampoo claims to be pH balanced, I haven't tested it, it also claims to contain Ecocert approved safe preservatives.\n\nProduct details- I got the 500ml bottle which comes with a pump dispenser and is made of steel. It retails for Rs. 1380, but I paid around 1200 including shipping because I got it on a discount and directly from their website. \nThe texture is slightly wobbly and pearly white in colour with a strong jasmine fragrance.\n\nMy experience with the product- I used it along with TBS Rainforest conditioner/ Plum olive and macadamia conditioner. It adequately cleansed my scalp and worked really well with both the conditioners. It lathers pretty well even with hard water. My needle-point ends were softer, and frizz was tamed for at least a couple of days. My hair was glossy, glossier than when I used TBS shampoo, and it did not cause additional hair fall.\nThe strong jasmine smell was a bother because I simply don't like floral aroma in my products, but it does not last long in my hair. \n\nMy verdict on the product-  I feel it's a bit overpriced even for the quantity and the eco-friendly packaging, and I couldn't really find any reliable source/study to justify it's liberal use of jasmine water and oil. It did work for my hair and I will repurchase if I do not find a more inexpensive alternative in the mild everyday- use kind of shampoo category.\n\nPS- this is the first review I've posted in the sub, I don't know if I've missed anything. I really wanted to include a photo but could not figure out how to do it from my phone, my laptop has conked out.",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "Micdrop74",
        "body": "You can look at Dove dryness care shampoo. I wash my hair every alternate day and it works well for me. I have frizzy hair too. You can try a smaller size first and it's not very expensive either.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "riyalisation",
        "body": "Hey, where did you buy tbs rainforest conditioner? Can’t find it for the life of me.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "MUAontheCheap",
    "post_id": "sevmjt",
    "title": "Milk Makeup, New: Bionic Glow Liquid Highlighter in 2 Luminous Shades: Peach or Bronze, 0.91oz/$34",
    "url": "https://www.reddit.com/r/MUAontheCheap/comments/sevmjt/milk_makeup_new_bionic_glow_liquid_highlighter_in/",
    "score": 15,
    "num_comments": 4,
    "created": "2022-01-28T17:15:11+00:00",
    "body": "https://milkmakeup.com/products/bionic-glow\n\n❄️ __What It Is__\n\nA 90% natural, weightless liquid illuminator with skincare benefits that can be worn multiple ways (on your face, your body, mixed with your favorite moisturizer or foundation) for a luminous, natural-looking glow.\n\nThis product is 90% natural, vegan, clean, cruelty-free, paraben-free, silicone-free, and gluten-free.\n\n0.91 FL OZ / 26.8 ML\n\n❄️ __How to Use__\n\n- To wear as a highlighter, gently squeeze tube to dispense a small dot of formula and apply to cheekbones, the bridge of your nose, cupid's bow, collarbones, and wherever else you want a targeted glow.\n\n- To wear as an illuminator, use a dime-size amount for full-face coverage.\n\n- Blend onto face and body with fingertips, a makeup brush, or sponge.\n\n- Can be mixed with skincare, makeup, or worn alone.\n\n❄️ __FAQ__\n\n*What is liquid highlighter used for?*\n\n- You can use this liquid highlighter and illuminator multiple different ways to get a super natural-looking glow. Blend it all over your face on bare skin or over foundation for healthy, glowing skin. Wear it as a highlighter on your cheekbones, collarbones, eyes, and other high points of your face for subtle radiance. Or combine it with liquid foundation or moisturizer for a soft-focus, lit-from-within effect. Check out our Bionic Glow how-to video to see all the ways to wear it in action.\n\n*How shimmery is Bionic Glow?*\n\n- We formulated Bionic Glow to give your skin a super natural-looking, lit-from-within effect. Think that healthy, radiant glow you get after a facial. Subtle—not sparkly. \n\n*What’s the difference between Bionic Glow and the cream Highlighter stick?*\n\n- We recommend Bionic Glow for anyone who prefers a liquid formula, a more sheer, hydrated finish, and makeup with skincare benefits. It's also ideal if you want a formula that layers easily over foundation and other makeup. Highlighter is great if you prefer a buildable cream formula and a stick format for precise application.\n\n\n❄️ __Ingredients__\n\n- *Snow mushroom, reishi mushroom, and hyaluronic acid* hydrate to give you smoother-looking, plumper-looking skin.\n\n- *Vegan plant-derived collagen* helps improve the look of skin texture, elasticity, and firmness.\n\n- *Pea protein* helps provide blue light protection from electronic devices.\n\nPrunus Cerasus (Bitter Cherry) Fruit Water, C10-18 Triglycerides, Caprylic/Capric Triglyceride, Glycerin, Pentylene Glycol, Butylene Glycol, Mica, 1,2-Hexanediol, Sodium Acrylates Copolymer, Aqua/Water/Eau, Acacia Senegal Gum, Zea Mays (Corn) Starch, Ganoderma Lucidum (Mushroom) Stem Extract, Tremella Fuciformis Sporocarp Extract, Hydrolyzed Pea Protein, Sr-Hydrozoan Polypeptide-1, Tocopheryl Acetate, Glucose, Lecithin, Glyceryl Caprylate/Caprate, Sodium Gluconate, Potassium Hydroxide, Sodium Chloride, Sodium Succinate, Tin Oxide, Sodium Hyaluronate, Sodium Benzoate, Phenoxyethanol, Potassium Sorbate, Fragrance (Parfum), Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, CI 77499).",
    "flair_text": "NEW RELEASE",
    "flair_template_id": null,
    "comments": [
      {
        "author": "peacelovejoy4all",
        "body": "Because I like a more subtle, skin like highlighter, these sound really nice, and since there is no silicone (causes breakouts for me) I could use it as a luminizer. I'm excited to see how they review.\n\nI'm pretty much on a no-buy unless I've used something up or don't have any in my collection, and I don't have a liquid facial lumizer because the ones that have interested me all had silicone.\n\nThanks for posting all of the info and ingredients OP!🌟",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Thank you for sharing u/Xub543! Please include a [direct link](https://imgur.com/a/W6c7SjJ) to this offer. \n\n* Check for referral discounts [here](https://www.reddit.com/r/MUAontheCheap/search?q=Self-Promotion%2FReferral%2FAffiliate+Links+&%252520Codes=&restrict_sr=1&sort=new&utm_source=reddit&utm_medium=usertext&utm_name=MUAontheCheap&utm_content=t5_3m2bs)\n* [Support Black-owned businesses](https://www.reddit.com/r/MUAontheCheap/wiki/supporting-black-owned-businesses)\n* [Spotlight on Asian Beauty Brands](https://www.reddit.com/r/MUAontheCheap/wiki/spotlightonasianbeautybrandsproducts)\n\n[^(Posting Guidelines)](https://www.reddit.com/r/MUAontheCheap/wiki/postingguidelines) ^(|) [^(Royal Court Nomination)](https://www.reddit.com/r/MUAontheCheap/wiki/royalcourt)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MUAontheCheap) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1lpv4e6",
    "title": "Apart from the molecular weight, are there any differences in the effects of proteins on hair?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1lpv4e6/apart_from_the_molecular_weight_are_there_any/",
    "score": 14,
    "num_comments": 2,
    "created": "2025-07-02T12:55:20+00:00",
    "body": "Modern products often use proteins in their formula: hydrolyzed kerat!n, hydrolyzed soy protein, hydrolyzed pea protein, hydrolyzed wheat protein etc. I know they have different molecular weight, which means that they penetrate the hair follicule differently, but is there any difference in what they DO to hair? Why do hair products tend to have a mix of different proteins instead of just one?",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9846un",
    "title": "Having doubts about DevaCurl Buildup Buster after reading the INCI",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9846un/having_doubts_about_devacurl_buildup_buster_after/",
    "score": 13,
    "num_comments": 1,
    "created": "2018-08-17T17:24:38+00:00",
    "body": "So, I bought the [DevaCurl Buildup Buster](https://www.devacurl.com/buildup-buster.html\n) and used it, but it didn't leave my scalp or hair feeling particularly clean or refreshed. After reading the ingredients, I cannot find anything that clears buildup (for me this would mean buildup caused by polyquats and guar) except maybe the mIcELLaR wAtEr which I doubt works the same way on hair as it does on skin. What's more, it has two ingredients, albeit low on the INCI, that can cause buildup: guar and polyquaternium-11. At most, it has surfactants that DevaCurl's cleansers also have.\n\nHere is the INCI:\n\nWater (Aqua, Eau), Lactamide MEA, Glycerin, Crambe Abyssinica Seed Oil, Limonium Gerberi Extract, Cynara Scolymus (Artichoke) Leaf Extract, Hydrolyzed Jojoba Esters, Hydrolyzed Pea Protein, Panthenol, Melissa Officinalis Extract, Humulus Lupulus (Hops) Extract, Cymbopogon Schoenanthus Extract, Chamomilla Recutita (Matricaria) Extract, Rosmarinus Officinalis (Rosemary) Extract, Achillea Millefolium Extract, Caprylic/Capric Triglyceride, Hydroxypropyl Guar Hydroxyproplytrimonium Chloride, Hydroxyethylcellulose, Cocamidopropyl PG-Dimonium Chloride Phosphate, Cetrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Polyacrylate-1 Crosspolymer, Polyquaternium-10, Polyquaternium-11, PPG-26-Buteth-26, Propanediol, Disodium EDTA, Citric Acid, Phenoxyethanol, Fragrance (Parfum).\n\nCan someone who is better versed in chemistry than me assuage or confirm my doubts?",
    "flair_text": "Truth Check",
    "flair_template_id": "097fa660-58be-11e4-810c-12313b0d5c3d",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9dggen",
    "title": "Ion Absolute Perfection (similar to Olaplex) - How does it work?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9dggen/ion_absolute_perfection_similar_to_olaplex_how/",
    "score": 12,
    "num_comments": 1,
    "created": "2018-09-06T08:40:27+00:00",
    "body": "This is a product at Sally Beauty Supply that is apparently a \"bond multiplier\" similar to Olaplex, even though the formula and the chemical structure may not be the same as the Olaplex.\n\nFor Ion's Absolute Perfection, there is Step 1 and Step 2 where you mix Step 1 into your bleach/dye like how you would do with Olaplex, and then Step 2 onto rinsed hair. It can also be used as a standalone where one will apply Step 1 for a couple minutes, and then apply Step 2 onto Step 1 without rinsing for at least 10 minutes.\n\nThe ingredients of Step 1 is:\n\n> WATER ,PROPYLENE GLYCOL ,PEG-7 GLYCERYL COCOATE ,HYDROXYCETYL HYDROXYETHYL DIMONIUM CHLOR ,PEG-15 COCOPOLYAMINE ,PEG-75 LANOLIN ,PHENOXYETHANOL ,HYDROXYPROPYL GUAR ,PEG-40 HYDROGENATED CASTOR OIL ,FRAGRANCE ,HYDROLYZED WHEAT PROTEIN ,ETHYLHEXYLGLYCERIN ,PHOSPHORIC ACID ,CENTELLA ASIATICA EXTRACT ,CHAMOMILLA RECUTITA (MATRICARIA) FLOWER ,SODIUM BENZOATE ,POTASSIUM SORBATE ,HYDROLYZED PEA PROTEIN ,BUTYLENE GLYCOL  \n\nand Step 2 (called the Color Sealer) is:\n\n> WATER ,CETEARYL ALCOHOL ,GLYCERIN ,HYDROXYPROPYL STARCH PHOSPHATE ,FRAGRANCE ,BEHENTRIMONIUM METHOSULFATE ,CETYL ESTERS ,PHENOXYETHANOL ,CETRIMONIUM CHLORIDE ,QUATERNIUM-87 ,PROPYLENE GLYCOL ,ARGANIA SPINOSA KERNEL OIL ,ETHYLHEXYLGLYCERIN ,HYDROXYETHYLCELLULOSE ,CAMELLIA OLEIFERA SEED OIL ,HYDROGENATED CASTOR OIL/SEBACIC ACID COP ,YELLOW 5 ,ORANGE 4 ,AMYL CINNAMAL ,BENZYL BENZOATE ,BENZYL SALICYLATE ,COUMARIN ,HEXYL CINNAMAL ,LIMONENE ,LINALOOL \n\nWhat is it about these ingredients that make these products work? I don't know if they \"multiply bonds\" but it still leaves my hair very soft. What is the explanation?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "per-oxide",
        "body": "Hydrolyzed wheat protein. Thats what makes your hair soft. Sadly the results aren’t permanent. Other than that there is no bond action going on here",
        "score": 10,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "1anstky",
    "title": "What's your experience with peptides? (except copper, but like Matrixyl and so on)",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/1anstky/whats_your_experience_with_peptides_except_copper/",
    "score": 10,
    "num_comments": 22,
    "created": "2024-02-10T22:54:26+00:00",
    "body": "What's your experience with peptides? Are they worth it, and did they improve anything for you? Talking about anti aging, lines, wrinkles and collagen - I don't mean copper peptides though, but all the other ones marketed at us, like Matrixyl, The Ordinary Buffet and so on\n\nI know that there is a thin study basis suggesting that peptide-products may improve a lot of different things, but research is thin. Dr Dray recommends them for moisture, because of their size being able to keep moisture in, but always warns that the research behind peptides when it comes to all these claims is so thin\n\n&#x200B;\n\nSo what's your personal experience with all these products? Right now I am thinking of not using these products anymore, because I have not experienced any visible benefits...\n\n&#x200B;\n\nIf anyone made any positive experience, clearly linked to a certain product, could you tell me which one?\n\n&#x200B;\n\nmy current one has these ingredients:\n\n*Aqua, Glycerin, Trifluoroacetyl Tripeptide-2, Hydrolyzed Rice  Protein, Hydrolyzed Pea Protein, Hydrolyzed Sodium Hyaluronate, N-Prolyl  Palmitoyl Tripeptide-56 Acetate, Palmitoyl Tripeptide-1, Palmitoyl  Tetrapeptide-7, Proline, Glycine, Hectorite, Dextran, Xanthan Gum,  Cellulose, Carbomer, Sodium Lactate, Citric Acid, Dehydroacetic Acid,  Benzyl Alcohol, Butylene Glycol, Pentylene Glycol, Sodium Benzoate,  Caprylyl Glycol, Polysorbate 20, Potassium Sorbate* \n\n[https://cosibella.com.de/de/products/nacomi-next-level-peptide-10-straffendes-serum-mit-peptiden-10-30ml-4816](https://cosibella.com.de/de/products/nacomi-next-level-peptide-10-straffendes-serum-mit-peptiden-10-30ml-4816)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "egriff78",
        "body": "I’m using TO multi peptides plus copper peptides and have seen significant improvement in my skin. Im actually shocked.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "lilac_ism",
        "body": "I've been using the TO Buffet (I'm always gonna call it that way) for years. After the first bottle, I wasn't sure it was doing anything so I didn't repurchase. But then I realized how sad my skin looks without and it's been in my routine ever since. Even if it's just keeping the moisture in or hydrating better than some other products, I think it's worth using for that.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "_un1ty",
        "body": "I have used TO matrixyl and have seen results almost immediately (smoothing of fine lines, plumpness)- which should be telling that it's mostly better skin hydration I'm experiencing. But I do like it even if just for that. If you want to keep using peptides but you are unsure if they're worth it maybe try a product with peptides that you like fog other reasons as well?",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "Witty_Vacation5098",
        "body": "I was using TO Argireline for a while with no results. Almost gave up, but then I read that if you combined it with Matrixyl 3000 it worked better. So I decided to give it a try. And within weeks I could see my crows feet becoming less visible. Quite happy with the results so I'm sticking with those. \nA word of advice,though. Nacomi , the brand you're using isn't bad. I've used some of their products. But the concentration of active ingredients in their products is pretty low. If I were you I wouldn't give up up on peptides, just try a different brand",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "be_a_pizza",
        "body": "I have used TO Matryiyl and Inkey List HA serum which has Matrixyl 3000. They definitely help with the fine wrinkles around my eyes but I wouldn’t say it last all day. (As well it’s just visible when I’m watching myself close to the mirror).\n\nI have used the Dear Klairs Youth Activating drop for a month, and it doesn’t give the immediate effect as Matrixyl , but I do feel it’s not doing much if not for hydration/skin barrier strengthening.\n\nBut honestly I can live without them as the result is merely temporary, and won’t last long.\n\nI’m happy for products that have peptides in, but won’t buy again peptides creams/serums for anti-aging.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "acornacornacorna",
        "body": "I think this type is so weird\n\nThe thing is that there are so many peptides out there\n\nEach one say they do something different from another peptide\n\nA lot have been around for very long time like Copper and Matrixyl\n\nThing is, the big question is what happens when you stop using it right? Like other people say\n\nIn a lifetime, if you have to use it forever how much does it cost?\n\nLike the one that has the advertisement as \"botox alternative\" I think it is weird because it is like...they are trying to make some kind of \"alternative cosmetic medicine\" type of thing. But if you have to use it forever on regular then how much does it cost?",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Patient-Emphasis2828",
        "body": "Side to side comparison I don't think they have much power at all for long lasting effects on collagen like one or two serious lasers could do. \n\nI tried peptides several years ago hoping they would help with atrophic acne scarring next to prescription retinoid and vitamin c e ferulic serum. It didn't do much of anything.\n\nFrom what I learned talking to other people about it, they can't hurt and especially might be helpful as a supplement but not a primary driver for collagen remodeling. \n\nAlso, when you stop using the peptide product then the \"visible results\" go away. This is unlike one or two sessions of a real laser that your \"visible results\" are deeper results that stay with you without having to repeat those sessions over and over again.\n\nI use peptides now as a supplement skincare. But I know they're unreliable for any deeper remodeling.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "alkemicalgold",
        "body": "I've been using the Mary & May peptide serum for a few months and have seen no changes. After I use it up I doubt I'll repurchase dedicated peptide serums, but if peptides are added in an otherwise already interesting product, I'll count them as a plus.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "MrsReilletnop",
        "body": "I also see the difference when I stop using the ones from TO. \nWould you recommend this cosibella seller ?",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionLux",
    "post_id": "1900qo2",
    "title": "Biologique Recherche Masque Vernix Reformulated - any good dupes?",
    "url": "https://www.reddit.com/r/SkincareAddictionLux/comments/1900qo2/biologique_recherche_masque_vernix_reformulated/",
    "score": 9,
    "num_comments": 23,
    "created": "2024-01-06T14:08:30+00:00",
    "body": "I'm late to the game but I just found out that the Vernix is being reformulated. It's been my HG for years. I'm beyond pissed off. Greed ruins everything pure.\n\nAfter extensive googling I found that the Joanna Czech Cream has similar ingredients. Does anyone have any firsthand experience with it?\n\nAnd for those who are no longer using BR products - let me know what brands are still worthy\n\nVernix OLD VERSION Ingredients: WATER (AQUA), AMNIOTIC FLUID, LECITHIN, LANOLIN OIL, PROPYLENE GLYCOL, PENTYLENE GLYCOL, SODIUM ACRYLATES COPOLYMER, MAGNESIUM ALUMINUM SILICATE, GLYCERIN, ALCOHOL DENAT. RASPBERRY SEED OIL / PALM OIL AMINOPROPANEDIOL ESTERS, HYDROLYZED CERATONIA SILIQUA SEED EXTRACT, LUFFA CYLINDRICA SEED OIL, HELIANTHUS ANNUUS (SUNFLOWER) SEED OIL, YEAST EXTRACT, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP. DIAMINOPRO- PIONOYL TRIPEPTIDE-33, ETHYLHEXYL PALMITATE, DIMETHYLMETHOXY CHROMANOL. PHYTOSPHINGOSINE, PAPAIN, CHOLESTEROL, HYDROLYZED PLACENTAL PROTEIN. HYDROLYZED GELATIN, EMBRYO EXTRACT, SQUALANE, TOCOPHEROL, XANTHAN GUM, CARBOMER, DISODIUM EDTA, SODIUM LAUROYL LACTYLATE, BHT. PHENOXYETHANOL. ETHYLHEXYLGLYCERIN, SODIUM DEHYDROACETATE, CAPRYLYL GLYCOL\n\n&#x200B;\n\nVernix NEW VERSION 2024 Reformulation Ingredients: \n\nWATER (AQUA), LECITHIN, METHYLPROPANEDIOL, GLYCERYL ISOSTEARATE, BENTONITE, ISOSTEARYL ALCOHOL, ETHYLHEXYL PALMITATE, SODIUM ACRYLATES COPOLYMER, PROPYLENE GLYCOL, HYDROLYZED WHEAT PROTEIN, HYDROLYZED BARLEY PROTEIN, BUTYROSPERMUM PARKII (SHEA) BUTTER EXTRACT, HELIANTHUS ANNUUS (SUNFLOWER) SEED OIL, RASPBERRY SEED OIL/TOCOPHERYL SUCCINATE AMINOPROPANEDIOL ESTERS, LUFFA CYLINDRICA SEED OIL, CERATONIA SILIQUA (CAROB) SEED EXTRACT, YEAST EXTRACT, ACETYL TETRAPEPTIDE-2, CERAMIDE NG, DIMETHYLMETHOXY CHROMANOL, TOCOPHEROL, SQUALANE, PHYTOSTEROLS, DEXTRAN, BUTYLENE GLYCOL, DISODIUM EDTA, CANDELILLA CERA (EUPHORBIA CERIFERA (CANDELILLA) WAX), BRASSICA CAMPESTRIS (RAPESEED) STEROLS, CAPRYLYL GLYCOL, PHENYLPROPANOL, SODIUM BENZOATE, POTASSIUM SORBATE, BENZYL ALCOHOL.  \n\n\nJoanna Czech Cream: Aqua/Water/Eau, Amniotic Fluid, Lanolin, Butylene Glycol, Pentylene Glycol, Squalane, Ethylhexyl Palmitate, Sodium Acrylates Copolymer, Glycerin, Carthamus Tinctorius (Safflower) Seed Oil, Linseed Oil/Palm Oil Aminopropanediol Esters, Raspberry Seed Oil / Tocopheryl Succinate Aminopropanediol Esters, Luffa Cylindrica Seed Oil, Sodium Lauroyl Lactylate, Ceramide NP, Ceramide AP, Tocopheryl Acetate, Phytosphingosine, Tocopherol, Cholesterol, Ceramide EOP, Hydrolyzed Rice Protein, Yeast Polysaccharides, Cassia Angustifolia Seed Polysaccharide, Hydrolyzed Hyaluronic Acid, Hydrolyzed Pea Protein, Proline, Lecithin, Papain, Diaminopropionoyl Tripeptide-33, Dimethylmethoxy Chromanol, Glycine, Sodium Carbomer, Phenoxyethanol, Ethylhexylglycerin, Dipotassium EDTA, Benzoic Acid, Methylparaben, Chlorphenesin, Propylene Glycol, Hydrolyzed Sodium Hyaluronate, Benzyl Alcohol, Potassium Sorbate, Sodium Benzoate, Caprylyl Glycol, Carbomer, Xanthan Gum, Sodium Chloride.",
    "flair_text": "Product Question",
    "flair_template_id": "3b9f279c-87cd-11ec-b0dd-469bb104d065",
    "comments": [
      {
        "author": "Azur000",
        "body": "Whaaaaaaat. BR has really lost their minds. And the audacity to pin it on “the original ingredients are not sold anymore”. Sure, Jan. What a BS.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "International-Sun415",
        "body": "I used to be a total BR devotee but now I mainly use Cosmedix, is Clinical, PCA skin, and Environ skincare . My favorites are Cosmedix products as well as some stuff from is Clinical.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "I_CRE8",
        "body": "Interesting, I had no idea they reformulated, but I also love the Masque Vernix! What about it specifically changed?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "MusicForAWhile",
        "body": "Thank you for sharing the ingredients for the Joanna Czech cream! Would never have looked at it but it looks good. Will order one once I run out of my Creme Masque Vernix backups.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Rosiepop123",
        "body": "I like the hydrating mask from pca. Not quite as lux but good price point \n\nhttps://www.pcaskin.com/products/hydrating-mask",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Usual_Committee_4480",
        "body": "I’m sure making abortions illegal cut down on the embryo extract! 😂😂😂",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Dafadami",
        "body": "The original Vernix is still available. I was able to choose between Creme Masque Vernix and Creme Masque Vernix VG when placing an order on Karina NYC’s site today. The same goes for Rescue Spa.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "sondering_hillbilly",
        "body": "Can you still get the old formula somewhere and can you get a sample of the Joanna Czech?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "inquiringdoc",
        "body": "OP did you try the Czech cream and if so, how does it compare?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Gastroparesis",
    "post_id": "1adgjy5",
    "title": "Peptide 1.5 formula is so expensive... can I make a comparable fake?",
    "url": "https://www.reddit.com/r/Gastroparesis/comments/1adgjy5/peptide_15_formula_is_so_expensive_can_i_make_a/",
    "score": 7,
    "num_comments": 13,
    "created": "2024-01-28T23:31:27+00:00",
    "body": "Saw the RD, and she wants me on a Peptide 1.5 formula (like Kate Farms). But... whoa. They're SO expensive. I made a little chart, because I've done some different Ensures in the past. Unfortunately my non-tech-savvy self can't seem to copy and paste it here! The punchline, though, is that a bottle of Ensure Complete runs about $2.98, while the Kate Farms Peptide 1.5 comes to about $9.47 per bottle. Per...stinkin...bottle.\n\nI remember her telling me that it was good because it uses hydrolyzed pea protein, which is easy to digest. So, can I buy that kind of protein powder and make shakes out of it myself? Like... a scoop of that plus a frozen banana and some milk? I don't know. I found this on Amazon:\n\n[https://www.amazon.com/gp/product/B08NLKFSCL/ref=ewc\\_pr\\_img\\_1?smid=A28H4WIFMKOS58&psc=1](https://www.amazon.com/gp/product/B08NLKFSCL/ref=ewc_pr_img_1?smid=A28H4WIFMKOS58&psc=1)\n\nI'm losing tons of weight, and she was concerned about muscle loss. Please, there has to be a way to do this for less than $300/month, right?",
    "flair_text": "Meals, Nutrition, Recipes",
    "flair_template_id": "4504b0a6-db3a-11ed-8c2a-82655e7f5acb",
    "comments": [
      {
        "author": "ReliefAltruistic6488",
        "body": "Can the RD not tell you how to make a formula that you can afford?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Less_Pumpkin_6729",
        "body": "does your insurance cover it? there’s a list somewhere on the kate farms website of insurances accepted, inculuding (i think) cigna and blue cross",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Bluegreen188",
        "body": "I would ask them. I’m lucky that my job will pay for some of it, (maybe worth looking into?) but if it’s too expensive and there’s no other funding, she should be able to either order you samples or figure an alternative out",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "coinbankcollector",
        "body": "If you get a prescription go through onesource medically supply, even if insurance doesn’t cover it it could be like 50% less expensive. I was drinking kate farms 1.0 and thru kate farms it’s like $50-60 and onesource it was $25",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "FakespotAnalysisBot",
        "body": "This is a Fakespot Reviews Analysis bot. Fakespot detects fake reviews, fake products and unreliable sellers using AI.\n\nHere is the analysis for the Amazon product reviews:\n\n>**Name**: Plant Based - 100% Pure Organic Hydrolyzed Pea Protein Powder - Canada Grown Yellow Pea, Vegan Natural Unflavored, Dairy Free, Gluten Free, Soy Free, Sugar Free, Non-GMO with BCAA 2.62lb \n\n>**Company**: VUNNEX\n\n>**Amazon Product Rating**: 3.9 \n\n>**Fakespot Reviews Grade**: D\n\n>**Adjusted Fakespot Rating**: 0.4\n\n>**Analysis Performed at**: 11-24-2023 \n\n[Link to Fakespot Analysis](https://fakespot.com/product/plant-based-100-pure-organic-hydrolyzed-pea-protein-powder-canada-grown-yellow-pea-vegan-natural-unflavored-dairy-free-gluten-free-soy-free-sugar-free-non-gmo-with-bcaa-2-62lb) | [Check out the Fakespot Chrome Extension!](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain)\n\n*Fakespot analyzes the reviews authenticity and not the product quality using AI. We look for real reviews that mention product issues such as counterfeits, defects, and bad return policies that fake reviews try to hide from consumers.*\n\n*We give an A-F letter for trustworthiness of reviews. A = very trustworthy reviews, F = highly untrustworthy reviews. We also provide seller ratings to warn you if the seller can be trusted or not.*",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "VettedBot",
        "body": "Hi, I’m Vetted AI Bot! I researched the **VUNNEX Plant Based 100 Pure Organic Hydrolyzed Pea Protein Powder Canada Grown Yellow Pea Vegan Natural Unflavored Dairy Free Gluten Free Soy Free Sugar Free Non GMO with BCAA 2 62lb** and I thought you might find the following analysis helpful.\n\n**Users liked:**\n* Great flavor and texture (backed by 7 comments)\n* Versatile and easy to use (backed by 6 comments)\n* High quality and organic (backed by 5 comments)\n\n**Users disliked:**\n* Strong taste that limits mixing with other liquids (backed by 1 comment)\n* Does not dissolve in hot liquids (backed by 1 comment)\n* Grainy texture due to incomplete dissolution (backed by 1 comment)\n\n\nIf you'd like to **summon me to ask about a product**, just make a post with its link and tag me, [like in this example.](https://www.reddit.com/r/tablets/comments/1444zdn/comment/joqd89c/) \n\nThis message was generated by a (very smart) bot. If you found it helpful, let us know with an upvote and a “good bot!” reply and please feel free to provide feedback on how it can be improved.\n\n *Powered by* [*vetted.ai*](http://vetted.ai/reddit)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LizDances",
        "body": "Thank you guys so much for your feedback. I went ahead and sent off an email to my dietician laying everything out, so hopefully she will get back to me in the next couple of days. I'll update when she does.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "New to gastroparesis? Please view [this post](https://www.reddit.com/r/Gastroparesis/comments/15i7siq/gastroparesis_101/?utm_source=share&utm_medium=web2x&context=3) or our wiki for a detailed explanation of gastroparesis, the main approaches of treating it, and a list of neurogastroenterologists and motility clinics submitted by users of this forum. Join these [Discord and Facebook support groups](https://www.reddit.com/r/Gastroparesis/comments/14oxaew/list_of_gastroparesis_support_groups_other/?utm_source=share&utm_medium=web2x&context=3) today! New users, please do not post asking for a diagnosis; instead, use the pinned thread: \"Do I have gastroparesis?\" Also, check out our new subreddit r/functionaldyspepsia.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Gastroparesis) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Bitter-Tumbleweed711",
        "body": "I am on Kate Farms Peptide 1.5 but for tube feeding for sole-source nutrition. I don’t take in hardly anything orally. My insurance covers it as it makes up for at least 50% of my diet.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Anyashadow",
        "body": "I use pea protein, but I get the kind that is just pea protein and nothing else.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Enchantris",
        "body": "My nutritionist has me on Orgain and Soylent.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "googlygaga",
        "body": "Most insurances will cover it as long as you have medical necessity . Or you can find a lot of cheap cases on Facebook marketplace  Maybe try orgain ? But it’s not peptide  Nestle has a peptide formula called compleat",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 12,
      "top_level": 12,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "hz6cia",
    "title": "Can anyone suggest a dupe for the plum undereye gel?",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/hz6cia/can_anyone_suggest_a_dupe_for_the_plum_undereye/",
    "score": 5,
    "num_comments": 1,
    "created": "2020-07-28T02:31:01+00:00",
    "body": "I originally bought it to see how it tackle dark undereyes brought about by constant laptop use. It didn't do much for my eyes. But, to repurpose it, I started using it on my lips and boy was I surprised with the results! My hyperpigmentation at the corners of my lips reduced quite a bit (not too much, but it was visible). I plan to use it on my lips, but spending 900+ bucks for 15ml of product (that I will be using frequently) seems a bit excessive. This is the first product that gave me visible positive results on my lips and I would highly recommend this/its dupe!! \n\nHere are the ingredients:-\n\nAloe Barbadensis (Aloe Vera) Leaf Juice, Ammonium Acryloyldimethyltaurate/VP Copolymer, Aqua, Argania Spinosa (Argan) Kernel Oil, Bellis Perennis (Daisy) Flower Extract, Betain, Fragrance, Glycerin, Glycine, Glycyrrhiza Glabra (Licorice) Root Extract, Hieracium Pilosella (Hawkweed) Extract, Hydrolyzed Hyaluronic Acid, Hydrolyzed Pea Protein, Hydrolyzed Rice Protein, Olive Oil PEG-7 Esters, Phenoxyethanol Ethyl Hexyl Glycerin , Proline, Propanediol, Sodium Benzoate, Sodium Gluconate, Xanthan Gum, CI 16255",
    "flair_text": "Discussion",
    "flair_template_id": "be47b7e8-2aae-11e8-9065-0e37aceca9de",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NewBeauty",
    "post_id": "lg5c8z",
    "title": "Shani Darden Skin Care Intensive Eye Renewal Cream with Firming Peptides",
    "url": "https://www.reddit.com/r/NewBeauty/comments/lg5c8z/shani_darden_skin_care_intensive_eye_renewal/",
    "score": 7,
    "num_comments": 0,
    "created": "2021-02-09T15:11:32+00:00",
    "body": "[https://www.sephora.com/product/shani-darden-intensive-eye-renewal-cream-with-firming-peptides-P467973?icid2=products%20grid:p467973](https://www.sephora.com/product/shani-darden-intensive-eye-renewal-cream-with-firming-peptides-P467973?icid2=products%20grid:p467973)\n\n&#x200B;\n\n Water (Aqua), Caprylic/Capric Triglyceride, Diheptyl Succinate, Capryloyl Glycerin/Sebacic Acid Copolymer, Butyrospermum Parkii (Shea Butter), Albizia Julibrissin Bark Extract, Darutoside, Cetearyl Alcohol, Pentylene Glycol, Glycerin, Niacinamide, Castanea Sativa (Chestnut) Seed Extract, Sorbitan Stearate, Glyceryl Stearate, PEG-100 Stearate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Hydrolyzed Pea Protein, Lecithin, Olea Europaea (Olive) Fruit Oil, Phytosterols, Squalane, Ceramide NP, Propanediol, Physalis Angulata Extract, Tocopheryl (Vitamin E) Acetate, Cucumis Sativus (Cucumber) Fruit Extract, Tetrasodium Glutamate Diacetate, Phenoxyethanol, Ethylhexylglycerin, Chlorphenesin. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CurcuminSupplements",
    "post_id": "1i9ewxe",
    "title": "Enhanced solubility, stability, bioaccessibility, and antioxidant activity of Curcumin with Hydrolyzed Pea protein-based Nano-micelles",
    "url": "https://www.reddit.com/r/CurcuminSupplements/comments/1i9ewxe/enhanced_solubility_stability_bioaccessibility/",
    "score": 5,
    "num_comments": 0,
    "created": "2025-01-25T04:20:32+00:00",
    "body": "",
    "flair_text": "New study",
    "flair_template_id": "f9b6acb6-7711-11ee-9320-ce70c163b240",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "hg0e5m",
    "title": "Cannot get contact dermatitis allergy under control - ingredient check for Linalool & Decyl Glucoside? Any advice to get rid of the rash?",
    "url": "https://www.reddit.com/r/Allergies/comments/hg0e5m/cannot_get_contact_dermatitis_allergy_under/",
    "score": 4,
    "num_comments": 4,
    "created": "2020-06-26T03:44:28+00:00",
    "body": "Hey guys, hoping some of you might have dealt with this type of contact dermatitis allergy and might be able to help me with A) how to get rid of this stubborn rash and B) other names for the ingredients I need to watch out for.\n\nI have a contact dermatitis allergy to **gold (more severe), chromium, linalool and decyl glucoside**.  I was given a list of some products that were safe to use and finally had my skin almost perfect for the first time in years!  But then a few things happened...\n\n1. My fiance developed a sudden and severe skin allergy to my \"safe\" laundry detergent and we had to switch it immediately.  The laundry detergent he was told to switch to (Tide Gentle & Free Liquid) seemed okay based on ingredients, but was missing from my \"safe list\" and I very obviously reacted to it within a few days.  We agreed to switch to Tide Gentle & Free Powder Detergent (which WAS on the safe list) ASAP but with COVID it took 2 weeks to arrive.  In that time I developed a decently bad rash on my chest and some flair ups in previous problem areas (behind my ears and back of the neck).  They burned to the touch, like my dermatitis rashes tend to.\n2. Switched the detergent, cleaned everything and prepared for the 6 week wait to clear things up.  Nope, it got worse.  Might have been made even worse because I also have a severe tree pollen allergy and started having a bad reaction to my antihistammines, so I stopped taking them (about 2 weeks ago).\n3. It has now been almost 8 weeks and the rash is spreading slowly across my chest and is still on the back of my neck/ear area.  The chest rash is pussy, dense and overall looks horrendous but no longer burns.  I've been moisturizing it daily (google suggested it) and even tried some of the medicated cream my fiance was prescribed as well as over the counter steroid cream - only for a few days, but it didn't seem to help.\n\nIn the last 2 weeks I did change my hair conditioner, as the conditioner on my list that I could get my hands on (I'm in Canada) was terrible and killing my hair.  I very carefully checked the ingredients for any fragrence, essential oils, or any type of \"glucoside\" but I'm wondering if I'm missing another word for some of these chemicals and it might just be making things worse!\n\nThe ingredients are:  Purified Water (Aqua), Brassica alcohol & Brassicamidopropyl dimethylamine & Aspartic acid, Caprylhydroxamic acid & Caprylyl glycol & Glycerin, Cetearyl Alcohol & Polysorbate 60, Apple Cider Vinegar, Lactic acid, EDDS- Ethylenediamine Disuccinate, Hydrolyzed Pea Protein, Chamomilla Recutita (Matricaria) Extract, Melissa Officinalis (Lemon balm) Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract\n\nEspecially with trying to navigate this Covid-19 thing where almost every soap and sanitizer has fragrance, this has been a nightmare. :(  Any advice, especially from those with these allergies would be so so appreciated.\n\n**TLDR: My contact dermatitis rash is not getting better (arguably worse) after 8 weeks and I'm wondering what other names Linalool, Decyl Glucoside, and to a lesser extent Chromium and Gold might hide under in my products.  Also looking for advice on how to help the rash along.**",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "omnimagination",
        "body": "Could be something derived from coconut. There are so many coconut derivatives in these new soaps. They give my husband rashes too. I'm leaning towards the capryl glycol and cetearyl alcohol.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Quartnsession",
        "body": "I wash my clothes with vinegar that's it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "nknmf3",
    "title": "Best sulphate , paraben , silicone and mineral oil free shampoo that lathers like sulphate shampoo.",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/nknmf3/best_sulphate_paraben_silicone_and_mineral_oil/",
    "score": 3,
    "num_comments": 0,
    "created": "2021-05-25T11:37:40+00:00",
    "body": "Hey everyone !\nToday I am reviewing a product from an amazing Indian brand @vilvah_ \nvilvah store is an all-natural skin care brand which makes skin care goodies with fresh ingredients. All the products from the brand are free from sulphates, parabens, mineral oil, and silicones.\n\nGOAT MILK SHAMPOO ENRICHED WITH PEA PROTEIN AND JASMINE HYDROSOL\nThis shampoo is one of their best sellers and is loved by many.\nI had purchased this on the recommendation of @shwetavijaynair and @theslickbeauty .\n\nThe shampoo contains goat milk as the main ingredient which is known to be e Sona racing along with hydrolyzed pea protein and Jasmine hydrosol . All these ingredients work  really well together for dull, dry and damaged hair.\nThis retails for rupees 590 for 200ml and can be used for  6 months after opening.\n\nMy experience:\n🐑being a sulphate free shampoo this forms up really well which helps to clean scalp well.\n🐑 Usually it is difficult to remove oil with the sulphate free shampoo but this does the job really well with such a little quantity.\n🐑 the shampoo contains a heavenly fragrance which uplifts your more but can be over drink for someone if you don't like strong fragrance or is allergic to Jasmine.\n🐑this does not agree waited my hair fall in any way and help me  improving my hair quality.\n🐑 As it cleanses the scalp really well, this will definitely work for oily scalp people too.\n🐑 many influencers along with the brand claims it to be so moisturising that you don't need a post conditioner but in my case this fail to do so. Each and every time I had to use a conditioner along with this.\n🐑 This can be a little expensive for many of us.\n\nFinal verdict :\nGoat milk shampoo is an amazing product by #vilvahstore and I will definitely recommend this to all hair types specially for dull dry and damaged hair only if it suits your budget.\n\nRatings : 4/5\n\nAvailable on #nykaa , #vanitywagon agon and  #vilvah official website.\n\nIf you are buying from vanity wagon can use my code PAMPER20 for 20% discount✨\n\n#réel #shampooandconditioner #shwetavijaynair #theslickbeauty #vilvahproducts #vilvahstores #vilvahgoatmilkshampoo #sulphatefreeshampoo #reelindia #share #showsomelove\nhttps://www.instagram.com/reel/CPNIsdYnCYv/?utm_medium=share_sheet",
    "flair_text": "Haircare",
    "flair_template_id": "7e4a8bb0-d313-11ea-8fef-0e0fa7c49eed",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "y7rk96",
    "title": "Kirkland Signature Moisture Shampoo and Conditioner",
    "url": "https://www.reddit.com/r/curlyhair/comments/y7rk96/kirkland_signature_moisture_shampoo_and/",
    "score": 3,
    "num_comments": 4,
    "created": "2022-10-19T03:28:16+00:00",
    "body": "Hello everyone, onthe Costco Website, it states that the shampoo and conditioner are sulfate free and color safe. Does anyone have any experience using these on curly hair?? Or if not, can anyone tell me if these would be good for curly hair?? These would be such an affordable option since curly hair products can get pricey 😓\n\nIngredient list for shampoo: \nIngredients: Water/Aqua/Eau, Sodium Cocoyl Isethionate, Cocamidopropyl Hydroxysultaine, Potassium Cocoyl Glycinate, Disodium Cocoyl Glutamate, Sodium Lauroyl Methyl Isethionate, Sodium Lauroyl Sarcosinate, Decyl Glucoside, Potassium Cocoate, Glycereth-26, Glycol Distearate, Cocamidopropylamine Oxide, Phenoxyethanol, Fragrance (Parfum), Sodium Cocoyl Glutamate, PEG-120 Methyl Glucose Dioleate, Methyl Gluceth-20, Quaternium-91, Amodimethicone, Acrylates Copolymer, Citric Acid, Dicaprylyl Ether, Polyquaternium-10, Guar Hydroxypropyltrimonium Chloride, Chlorphenesin, Trisodium Ethylenediamine Disuccinate, PPG-3 Benzyl Ether Myristate, Glyceryl Oleate, C11-15 Pareth-7, Polyquaternium-39, Laureth-9, Phospholipids, Glycerin, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Polyquaternium-55, Sodium Benzoate, Panthenol, Trideceth-12, Glycine Soja (Soybean) Oil, Acetic Acid, Tetrasodium EDTA, Benzoic Acid, Sodium Hydroxide, Disodium Edta, Potassium Sorbate, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Caprylyl Glycol, Tocopheryl Acetate, Helianthus Annuus (Sunflower) Seed Oil, Alcohol, Tocopherol, Argania Spinosa Kernel Oil, Ascorbic Acid, Persea Gratissima (Avocado) Oil, Copaifera Officinalis (Balsam Copaiba) Resin, Passiflora Edulis Seed Oil, Isomalt, Euterpe Oleracea Fruit Oil, Aloe Barbadensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Quaternium-95, Propanediol, Camellia Sinensis Leaf Extract, Persea Gratissima (Avocado) Fruit Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract, Vitis Vinifera (Grape) Seed Extract, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate.\n\nIngredients for Conditioner: \nIngredients: Water/Aqua/Eau, Cetearyl Alcohol, Stearamidopropyl Dimethylamine, Glycerin, Propanediol, Behentrimonium Methosulfate, Cetrimonium Chloride, Dimethicone, Isododecane, Isohexadecane, Citric Acid, Fragrance (Parfum), Hydroxyethylcellulose, Phenoxyethanol, Caprylyl Glycol, Glyceryl Stearate, PPG-3 Benzyl Ether Myristate, Guar Hydroxypropyltrimonium Chloride, Amodimethicone, Polyquaternium-73, Sodium Benzoate, Quaternium-87, Isopentyldiol, Disodium EDTA, Butyrospermum Parkii (Shea) Butter, Sodium Stearoyl Glutamate, Jojoba Esters, C11-15 Pareth-7, Laureth-9, Trideceth-12, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Acetic Acid, Glycereth-26, Sodium Hydroxide, Etidronic Acid, Potassium Sorbate, Helianthus Annuus (Sunflower) Seed Oil, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Phospholipids, Argania Spinosa Kernel Oil, Persea Gratissima (Avocado) Oil, Ascorbic Acid, Tocopheryl Acetate, Copaifera Officinalis (Balsam Copaiba) Resin, Isomalt, Quaternium-95, Tocopherol, Panthenol, Passiflora Edulis Seed Oil, Glycine Soja (Soybean) Oil, Euterpe Oleracea Fruit Oil, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Aloe Barbadensis Leaf Extract, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Persea Gratissima (Avocado) Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Alcohol, Vitis Vinifera (Grape) Seed Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "PlumPearls",
        "body": "Not suitable. Both contain silicones.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "It's what I've been using for years. Works for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "They are rebranded major label. This says it's Pureology Hydrate.\n\n[https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/](https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Lyme",
    "post_id": "wl8d9y",
    "title": "Protein",
    "url": "https://www.reddit.com/r/Lyme/comments/wl8d9y/protein/",
    "score": 3,
    "num_comments": 9,
    "created": "2022-08-10T20:47:54+00:00",
    "body": "Has anyone found a protein powder they like? \n\nI’m looking into hydrolyzed pea protein. Something non dairy as well. \n\nI bought a non dairy protein powder and it was hard to digest. So thats why I’m thinking of trying hydrolyzed. \n\nAny brands that have worked for you despite digestive issues due to lyme/co-infections?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Knobby_by_nature",
        "body": "All the plant based protein powders i find in stores are high in heavy metals. Its a bummer united states doesn't have more regulations for suppliments.\n\nWould love to hear people chime in on this. I'm currently using 365 brand grass-fed whey and its ok",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Tricky_Jackfruit_562",
        "body": "Sometimes I can tolerate Pea Protein, it's a part of MediClear, a supplement that I take for the nutrients and detox precursors. But sometimes I can't. It depends on what is going on with my microbiota. \n\nA month ago my 4 and 7 year old kids got Norovirus, and although I didn't get it fully, I could tell my body was trying to fight it off because I felt weird. Immediately I had to stop the pea protein. I can tell if I am not tolerating it well when my poo and pee start to smell like fermented beans - sorry, had to go there : ) But mostly I start to get a full distended belly and my gut aches like I am being sliced with micro knives. Then I get joint pain and fatigue. Basically SIBO IBS type symptoms. \n\nI can't do dairy (except butter thankfully) so I do not do Whey protein. I need a TON TON of protein and fat. I have had the wasting type of Lyme and my collagen get's really worn down. At one time I was eating 3500-3700 calories a day and still losing tons of weight, 20 pounds below my normal low weight (no thyroid problems or parasites, I checked, just the Lyme). \n\nso...I just eat a lot of meat. Always have. \n\nWhen I was traumatized by PETA in college, I became a vegetarian and I had horrendous flares. Too many carbs and not enough fat and protein makes me float out of my body. I had major sleep paralysis and disturbing symptoms like dead people asking me to help them cross over, due to yeast and Bartonella, but I think the vegetarian diet was a big part of it. Plus I was always hungry and had to eat every hour.\n\nI love beans too, I can always tolerate lentils and beans but the pea protein is harder for me. Nuts are good, but they are so expensive now! \n\nRecently I started snacking on kid pouches with beef liver. I like liver but I can only eat a tiny bit at a time, so any way to sneak it in I am all for. Lot's of Pho and bone broth too. Been thinking about adding in beef liver capsules.\n\nHowever, we are all different. Some people with Lyme (or any chronic disease) cannot eat that much meat, they can't digest it well. Some people can't eat any cow foods! Some people thrive with more plants and less animals. \n\nBut always I'd look at the diet and see what foods you can add in that are protein rich. Can you do scrambled eggs with ham? Turkey lettuce rollups? Cucumbers and salmon salad (like tuna salad with the mayo, celery, onion but with a super yummy salmon like the Raincost Wild Pink Salmon? It comes with the skin on and with bones in it, you have to clean it, but the flavor is 1000x better than any other canned salmon. Of course even wild fish will have the possibility of metals so I eat it once a month. Can you do nut butters?\n\nBest of luck and tell us what you find : )",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Putrid_Foundation_75",
        "body": "I like Mediclear by Thorne. I make my own nut milk using the almond cow machine (currently making macadamia nut) and add sunflower butter (no sugar added) and blend it up. If I over blend it sometimes I need to let it settle so that I don’t drink all the bubbles and feel bloated.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "finehair",
    "post_id": "1jn5wiq",
    "title": "Folks that use thickening spray, what's your favorite?",
    "url": "https://www.reddit.com/r/finehair/comments/1jn5wiq/folks_that_use_thickening_spray_whats_your/",
    "score": 3,
    "num_comments": 5,
    "created": "2025-03-30T05:46:16+00:00",
    "body": "Hey everyone.\n\nSaw a comment here not long ago recommending thickening spray to bring out waves/loose curls. Unfortunately, the exact one (R+Co BLEU Magnifier) happens to be rather fragrant. Not looking for a dupe per se, but would love to know what other sprays work for finer hair? (can be fragranced, the R+Co was just a bit much)\n\nINCI for the Bleau Magnifier:\n\n>Alcohol denat., aqua/water/eau, vp/va copolymer, fragrance (parfum), trimethylsiloxyamodimethicone, cetrimonium chloride, polyquaternium-11, c11-15 pareth-7, glycerin, c12-16 pareth-9, trideceth-12, benzophenone-4, biotin, polyquaternium-59, phenoxyethanol, hydrolyzed pea protein, hydrolyzed vegetable protein pg-propyl silanetriol, butylene glycol, silica, tapioca starch, disodium edta, potassium sorbate, ethyl linoleate, ethyl oleate, cyclodextrin, ethylhexyl methoxycinnamate, persea gratissima (avocado) oil, crambe abyssinica seed oil, helianthus annuus (sunflower) seed oil, benzyl alcohol, caprylyl/capryl glucoside, caprylic acid, guar hydroxypropyltrimonium chloride, xylitol, tocopherol, limonene, citral.",
    "flair_text": "Product Help",
    "flair_template_id": "bb8d5d74-589c-11ee-b690-1221113bcd5f",
    "comments": [
      {
        "author": "Absolutely_Regular",
        "body": "Oh man, I still haven’t tried any thickening sprays and I’ve heard this one is amazing, but I’m also sensitive to some fragrances. Bummer!\n\nSorry this is super unhelpful. I know Aveda makes a Thickening Tonic but haven’t tried it. They’re usually not outlandishly scented. Or maybe the Resken Volume Maximizer?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "DefiantThroat",
        "body": "I use Kenra Thickening spray or R+Co Dallas spray. I really like both, they both have fragrance. I’ve not tried R+Co BLEU Magnifier so I can’t speak to how they compare.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "101dagv",
    "title": "silicone free shampoo recommendations please?",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/101dagv/silicone_free_shampoo_recommendations_please/",
    "score": 3,
    "num_comments": 4,
    "created": "2023-01-02T14:01:14+00:00",
    "body": "i usead a shampoo with dimethicone and methylisthiozolinone it was great sfor first few month now hair is falling in sppan of 6 months in clumps i havent changed anything \n\nshampoo ingredient list: \n\nPurified Water, Disodium Laureth Sulfosuccinate, Sodium Lauryolsacrosinate, Cocoamidopheryl Betaine, Dimethicone & Cocoamidopheryl Betaine, Guar Hydroxypropyltrimonium Chloride, Disodium N- Cocoyl Glutamate, Ethylene Glycol Monostearate, Polysorbate, Sodium Pyrrolidone Carboxylic Acid, Hydrolyzed Pea Protein, Cocomonoethanolamide, Methylisothiazolinone, Hydrogenated Castor Oil, Apigenin Oleanolic Acid, Biotinoyl Tripeptide, Polyquartenium 10, Disodium Edta.",
    "flair_text": "Product Related Discussion",
    "flair_template_id": "20e907ba-0f7e-11eb-a26e-0ee57321ccbf",
    "comments": [
      {
        "author": "Sharp_Bite9080",
        "body": "Exactly the same thing happened to me. The silicone caused mass clump hairlfall. I still wanted a little sulphate since sulphate free doesn't suit me nuch. After tedious searches I've got sebamed. Hoping it works out well",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, thanks for posting! If your question pertains to personal queries, please \npost your routine/question in the appropriate weekly threads. Please read the \nsidebar rules before posting or commenting. Posts that do not \nconform to the rules will be removed.\n\nTo the commentors, Please keep rule 1 in mind. Be kind and respectful, bullying will not be tolerated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Slayer_IN1405",
        "body": "L’Oréal extraordinary oil shampoo",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "diet",
    "post_id": "1ip4w20",
    "title": "What could be causing nutritional shake issue?",
    "url": "https://www.reddit.com/r/diet/comments/1ip4w20/what_could_be_causing_nutritional_shake_issue/",
    "score": 2,
    "num_comments": 2,
    "created": "2025-02-14T06:59:49+00:00",
    "body": "I use nutritional shakes to supplement my nutrition. I have tried two kinds and they both cause a high heart rate, but Shake 2 has a lesser effect. Is there a possible explanation for this, based on the nutritional information and ingredients below?\n\n\n\n**Shake 1**\n\n**Nutritional Information (per 250 mL)**\n\nCalories: 385 calories\n\nTotal Fat: 19 g\n\nSodium: 269 mg\n\nPotassium: 538 mg\n\nTotal Carb.: 35 g\n\nDietary Fiber: 4 g\n\nSoluble Fiber: 3 g\n\nInsoluble Fiber: 1 g\n\nTotal Sugars: 15 g\n\nProtein: 18 g\n\nVitamin A: 438 mcg RAE\n\nPalmitate: 231 mcg RAE\n\nBeta Carotene: 208 mcg RAE\n\nVitamin C: 38 mg\n\nCalcium: 269 mg\n\nIron: 5 mg\n\nVitamin D: 5 mcg\n\nVitamin E: 7 mg\n\nVitamin K: 31 mcg\n\nThiamin: 0.4 mg\n\nRiboflavin: 0.5 mg\n\nNiacin: 4.2 mg\n\nVitamin B6: 0.5 mg\n\nFolate: 115 mcg DFE\n\nVitamin B12: 1.6 mcg\n\nBiotin: 15 mcg\n\nPantothenic Acid: 2.7 mg\n\nPhosphorus: 231 mg\n\nIodine: 50 mcg\n\nMagnesium: 108 mg\n\nZinc: 5 mg\n\nSelenium: 15 mcg\n\nCopper: 0.4 mg\n\nManganese: 0.6 mg\n\nChromium: 23 mcg\n\nMolybdenum: 38 mcg\n\nChloride: 400 mg\n\nCholine: 138 mg\n\nL-Carnitine: 31 mg\n\nTaurine: 31 mg\n\n**Ingredients**\n\nPURIFIED WATER, HYDROLYZED PEA PROTEIN\\*, BROWN RICE SYRUP SOLIDS\\*, AGAVE SYRUP\\*, HIGH LINOLEIC SUNFLOWER OIL\\*, MEDIUM CHAIN TRIGLYCERIDES (MCT FROM COCONUT)\\*, CONTAINS 1.5% OR LESS OF: AGAVE INULIN\\*, FLAXSEED OIL\\*, PEA STARCH\\*, LOCUST BEAN GUM\\*, ROSEMARY EXTRACT\\*, SUNFLOWER LECITHIN\\*, SPECTRA™ PHYTONUTRIENT BLEND\\* (EXTRACTS AND CONCENTRATES FROM: BROCCOLI\\*, COFFEEBERRY\\*, GREEN TEA\\*, TURMERIC\\*, KALE\\*, BROCCOLI SPROUT\\*, ACAI\\*, CINNAMON\\*, GARLIC\\*, TOMATO\\*, BLUEBERRY\\*, CARROT\\*, BEET\\*, RASPBERRY\\*, SPINACH\\*, TART CHERRY\\*, BLACKBERRY\\*)\n\nVITAMINS AND MINERALS (CHOLINE BITARTRATE, MAGNESIUM CHLORIDE, SODIUM CHLORIDE, TRICALCIUM PHOSPHATE, SODIUM ASCORBATE, CALCIUM CARBONATE, DIMAGNESIUM PHOSPHATE, POTASSIUM CHLORIDE, DIPOTASSIUM PHOSPHATE, DL-ALPHA-TOCOPHERYL ACETATE, BETA CAROTENE, CALCIUM PANTOTHENATE, CHOLECALCIFEROL \\[VITAMIN D3\\], FERRIC PYROPHOSPHATE, NIACINAMIDE, SODIUM MOLYBDATE, VITAMIN A PALMITATE, ZINC OXIDE, BIOTIN, CHROMIUM PICOLINATE, COPPER SULFATE, CYANOCOBALAMIN \\[VITAMIN B12\\], FOLIC ACID, MANGANESE SULFATE, PHYLLOQUINONE, POTASSIUM IODIDE, PYRIDOXINE HYDROCHLORIDE, RIBOFLAVIN, SODIUM SELENITE, THIAMINE HYDROCHLORIDE), L-CYSTEINE, L-CARNITINE, TAURINE, L-TRYPTOPHAN. \\*ORGANIC \n\n**Shake 2**\n\n**Nutritional Information (per 250 mL)**\n\nCalories: 375 calories\n\nTotal Fat: 18 g\n\nSodium: 350 mg\n\nTotal Carbohydrate: 38 g\n\nDietary Fiber: 3 g\n\nSugar: 11 g\n\nProtein: 17 g\n\nVitamin D: 5 mcg\n\nCalcium: 300 mg\n\nIron: 4.5 mg\n\nPotassium: 550 mg\n\nVitamin A\n\n    Retinol mcg 230 mcg\n    \n    B-Carotene 440 mcg\n\nVitamin C  75 mg\n\nVitamin E 5 mg\n\nVitamin K 31 mcg\n\nThiamin 1 4 mg\n\nRiboflavin 0.8 mg\n\nNiacin 5 mg\n\nVitamin B6 1 4 mg\n\nFolic Acid 120 mcg\n\nVitamin B12 1.8 mcg\n\nBiotin 15 mcg\n\nPantothenic Acid 4 mg\n\nPhosphorus 400 mg\n\nIodine 40 mcg\n\nMagnesium 105 mg\n\nZinc 4.5 mg\n\nSelenium 20 mcg\n\nCopper 0.5 mg\n\nManganese 1.2 mg\n\nChromium 30 mcg\n\nMolybdenum 38 mcg\n\nChloride 400 mg\n\nCholine 150 mg\n\nL-Carnitine 42 mg\n\nTaurine 42 mg\n\nInositol 0 mg\n\nWater g(mL) 190 g(mL)\n\n**Ingredients**\n\nWATER, BROWN RICE SYRUP, PEA PROTEIN ISOLATE, HYDROLYZED PEA PROTEIN ISOLATE, FRUIT AND VEGETABLE BLEND (APPLE PUREE, PEACH PUREE, CHERRY PUREE, BANANA PUREE, BUTTERNUT SQUASH PUREE, CARROT POWDER), HIGH OLEIC SAFFLOWER OIL OR SUNFLOWER OIL, CANOLA OIL, AND LESS THAN 2% OF VITAMINS AND MINERALS‡, SALT, PARTIALLY HYDROLYZED GUAR GUM, TAURINE, L-CARNITINE, L-CYSTINE, NATURAL FLAVOR\n\nVITAMINS AND MINERALS: CALCIUM PHOSPHATE, POTASSIUM CHLORIDE, MAGNESIUM PHOSPHATE, SODIUM ASCORBATE, CHOLINE CHLORIDE, POTASSIUM CITRATE, SODIUM CITRATE, MAGNESIUM OXIDE, DL-ALPHA TOCOPHERYL ACETATE, NIACINAMIDE, CALCIUM PANTOTHENATE, PYRIDOXINE HYDROCHLORIDE, THIAMINE HYDROCHLORIDE, RIBOFLAVIN, BETA-CAROTENE, VITAMIN A PALMITATE, ZINC SULFATE, FERROUS SULFATE, FOLIC ACID, MANGANESE SULFATE, COPPER SULFATE, CHROMIUM CHLORIDE, POTASSIUM IODIDE, SODIUM MOLYBDATE, SODIUM SELENATE, ASCORBIC ACID, VITAMIN K1, BIOTIN, VITAMIN D3, VITAMIN B12",
    "flair_text": "Discussion",
    "flair_template_id": "e53e82e2-afae-11e9-8c2f-0e1d37be4ea2",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Welcome to /r/Diet and thank you for posting. While you wait for replies, check out our Wiki. You may find your answer! \n\n**/r/Diet Wiki Links**\n\n[Helpful Resources](https://www.reddit.com/r/diet/wiki/index/resources)\n\n[Popular Diets](https://www.reddit.com/r/diet/wiki/index/diets)\n\n[Weight Loss FAQ](https://www.reddit.com/r/diet/wiki/index/faq)\n\n[Beginner's Guide to Weight Loss](https://www.reddit.com/r/diet/wiki/index/guide)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/diet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "alwayslate187",
        "body": "Hi, i only skimmed threse, but it looks like the first one has some caffeine?  (coffeeberry concentrate, green tea concentrate)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_Cotchaninoxgiare",
    "post_id": "asmqij",
    "title": "TẾ BÀO GỐC GSC CÓ TỐT KHÔNG? REVIEW TỔNG QUAN VỀ SERUM GSC",
    "url": "https://www.reddit.com/r/u_Cotchaninoxgiare/comments/asmqij/tế_bào_gốc_gsc_có_tốt_không_review_tổng_quan_về/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-02-20T10:19:11+00:00",
    "body": " \n\n## Tế bào gốc GSC có tốt không hay giá bao nhiêu? Là những thắc mắc thường gặp của đa số chị em khi nhắc về dòng sản phẩm dược mỹ phẩm cao cấp được nhập khẩu từ Hàn Quốc này. Mỹ phẩm GSC được biết đến là một trong những loại tế bào gốc thực vật dưỡng da được tin dùng và lựa chọn. Vì vậy cùng Review về bộ ba sản phẩm Serum GSC tốt nhất, nổi bật nhất hiện nay gồm tế bào gốc GSC trị nám, tế bào gốc GSC trị sẹo rỗ và tế bào gốc GSC trị mụn. Cũng như lắng nghe những đánh giá của khách hàng đã sử dụng tế bào gốc GSC trên Webtretho nhé.\n\n### TẾ BÀO GỐC GSC CÓ TỐT KHÔNG? REVIEW TỔNG QUAN VỀ SERUM GSC\n\n[**Tế bào gốc GSC**](http://nangcotrehoa.com/review-te-bao-goc-gsc-co-tot-khong-gia-bao-nhieu/) là dòng mỹ phẩm chăm sóc da cao cấp đến từ Hàn Quốc. Chúng đã xuất hiện trên thị trường từ đầu năm 2016. Và trong 4 năm phát triển cho đến thời điểm năm 2019 chúng đã thực sự tạo nên lòng tin vững chắc từ phía người tiêu dùng. Với 3 dòng sản phẩm cao cấp nhất của GSC bao gồm tế bào gốc GSC trị nám trắng da, sản phẩm tế bào gốc GSC trị sẹo rỗ lỗ chân lông to và sản phẩm tế bào gốc GSC trị mụn. Những sản phẩm trên đều là thành tựu đạt được của của ngành công nghệ sinh học nên bạn có thể hoàn toàn yên tâm về tác dụng cũng như sự lành tính của sản phẩm. Và để giúp bạn có cái nhìn rõ nét hơn về sản phẩm chúng ta cùng review 3 dòng tế bào gốc trên ngay dưới đây.\n\n#### REVIEW TẾ BÀO GỐC GSC TRỊ NÁM, TRẮNG DA: GV WHITENING AMPOULE\n\n**Tế bào gốc GSC trị nám**, trắng da là dòng sản phẩm chủ lực của thương hiệu GSC. Chúng được ưa chuộng trên toàn cầu đặc biệt là tại các quốc da châu á và tại Việt Nam đây cũng là sản phẩm được săn đón.\n\n*Tế bào gốc GSC GV Whitening Ampoule có tốt không?*\n\n**THÀNH PHẦN VÀ CÔNG DỤNG**\n\n**Mỹ phẩm GSC** trị nám được chiết xuất tế bào gốc cây rau má, tế bào gốc cây bắp dại tế bào gốc hoa hồi, tế bào gốc cây cam thảo, tế bào gốc cây bưởi, tế bào gốc hoa sen, tế bào gốc cây nho dại, tế bào gốc nhân sâm, tế bào gốc cây trà, tế bào gốc hoa phúc bồn tử, tế bào gốc ô liu, tế bào bốc hoa mẫu đơn, tế bào gốc cây hoàng cầm, tế bào gốc cây rau sam, tế bào gốc cây Shea Butter… Squalane, Phytosterols thực vật, Ceramide 3, Hydrolyzed Pea Protein.\n\n– Giữ ẩm, tăng cường dưỡng chất, axit amin làm đẹp da\n\n– Tái tạo, phục hồi các tế bào da đã hư tổn, kích thích sản sinh tế bào da mới, giúp làn da khỏe mạnh, tươi tắn.\n\n– Serum GSC Tăng cường liên kết tế bào da, làm săn chắc da, nâng cơ, tăng đàn hồi, chống oxy hóa mạnh mẽ, làm chậm tiến trình lão hóa.\n\n– Giảm lượng melanin làm da sáng, loại bỏ nám tận gốc, giúp làn da sáng mịn, đồng đều màu da.\n\n– An toàn, không gây kích ứng da, không gây nhờn rít, sinh mụn.\n\n– Đặc biệt hiệu quả hơn khi sử dụng công nghệ lăn kim, dùng trong và sau khi lăn kim.\n\n*Tế bào gốc GSC có công dụng trị nám, trắng da*\n\n#### TẾ BÀO GỐC GSC REVIEW TRỊ SẸO RỖ, LỖ CHÂN LÔNG TO: GA ANTI AGEING AMPOULE\n\nTế bào gốc bôi mặt GSC GA Anti Ageing Ampoule được biết đến là sản phẩm tốt nhất đã và đang được nhà sản xuất này sản xuất. Với những công dụng tuyệt vời mà chúng đem lại cho người dùng không có lí do gì chúng tôi không giới thiệu chúng đến tay bạn.\n\n**THÀNH PHẦN VÀ CÔNG DỤNG**\n\n*Tế bào gốc GSC trị sẹo rỗ – GA Anti Ageing Ampoule*\n\nTế bào gốc hạt dẻ, [serum tế bào gốc](http://nangcotrehoa.com/tag/serum-te-bao-goc/) cây liễu trắng, tế bào gốc cây rau má, tế bào gốc cây nho, tế bào gốc cây sen hồng, tế bào gốc cây tuyết tùng, tế bào gốc ô liu, tế bào gốc đậu nành…, Hamamelis Tế bào gốc nước cây phỉ (Virginiana (Witch Hazel) Water), Hydrolyzed Pea Protein, Squalane, PEG-60 Hydrogenated Castor Oil, Sodium Hyaluronate, Acetyl Hexapeptide-8…\n\n– Chiết suất thảo dược từ thiên nhiên, giúp phục hồi làn da bị hư tổn, tăng cường các liên kết tế bào, kích thích sản sinh các tế bào da mới.\n\n– Mỹ phẩm **tế bào gốc GSC trị sẹo rỗ** làm săn chắc, nâng cơ, tăng độ đàn hồi làm hồi phục các vết sẹo rỗ do mụn gây ra.\n\n– Tái tạo làn da giúp cải thiện: sẹo do mụn (hoặc do tai nạn), tàn nhang, nám, giãn vi mạch, chảy xệ.\n\n– Cải thiện và xóa các nếp nhăn, chống lão hóa da hiệu quả, da láng mịn, phẳng nếp nhăn\n\n– Cải thiện những làn da mỏng, yếu, dễ kích ứng.\n\n*Mỹ phẩm tế bào gốc GSC công dụng trị sẹo rỗ, lỗ chân lông to*\n\n#### REVIEW TẾ BÀO GỐC GSC TRỊ MỤN: GA AC CARE AMPOULE\n\nVới những bạn nào đã từng trải qua những ngày tháng đau đầu với tình trạng mụn thì chắc chắc đã từng một lần tìm hiểu qua dòng **mỹ phẩm GSC** GA AC Care Ampoule\n\n**THÀNH PHẦN VÀ CÔNG DỤNG**\n\n**Tế bào gốc GSC trị mụn** chiết xuất từ vỏ cây liễu, chiết xuất từ [tế bào gốc](http://nangcotrehoa.com/serum-te-bao-goc-loai-nao-tot-nhat/) cây trà xanh, chiết xuất tế bào gốc cây cam thảo, chiết xuất từ quả chanh, chiết xuất tế bào gốc từ cây sen trắng, chiết xuất tế bào gốc từ rễ mẫu đơn, chiết xuất tế bào gốc từ cây hoàng cầm, chiết xuất hoa bất tử, chiết xuất từ hạt mù u, chiết xuất từ hạt thầu dầu, chiết xuất từ quả bưởi, tế bào gốc rong biển, tế bào gốc cây ngải cứu, Disodium EDTA, Butyl Avocadate, Retinyl Palmitate.\n\n*Serum tế bào gốc GSC trị mụn- GA AC Care Ampoule*\n\n– Điều trị tận gốc theo cơ chế thải độc và đẩy các nhân mụn ra ngoài, tiêu diệt các vi khuẩn P.Acnes gây ra mụn.\n\n– Tác dụng kháng khuẩn, chống viêm và giảm sưng tấy giúp nuôi dưỡng từng tế bào da khỏe mạnh.\n\n– Xóa sạch các ổ mụn bên trong và ngăn chặn không cho mụn hình thành trở lại.\n\n– Ngoài ra **mỹ phẩm serum GSC** còn có công dụng xóa sạch các vết thâm và làm liền sẹo rỗ do mụn gây ra\n\n*Tế bào gốc GSC hỗ trợ điều trị mụn và tái tạo da sau mụn*\n\n### TẾ BÀO GỐC GSC GIÁ BAO NHIÊU? CẬP NHẬT BẢNG GIÁ CỦA 3 SẢN PHẨM HÀNG ĐẦU\n\nHiện nay **giá tế bào gốc GCS** được đánh giá là khá cao trên thị trường mỹ phẩm hiện tại. Nhưng với những công dụng mà chúng đem lại thì chúng vẫn được chị em hết sức ưa chuộng. Dưới đây là  bảng giá mỹ phẩm GSC được cập nhật mới nhất.\n\nLưu ý: Đây là giá tham khảo do đó có sự sai khác giữa các thời điểm và đại lí phân phối. Trước khi chọn mua bạn nên tham khảo kỹ giá để chọn được sản phẩm tốt nhất với mức giá phù hợp.\n\nMỸ PHẨM GSC CÓ GIÁ BAO NHIÊU HIỆN NAY**SẢN PHẨMGIÁ BÁN TRÊN THỊ TRƯỜNG SERUM GSCTế bào gốc GSC : GV Whitening Ampoule**Giá trên thị trường vào khoảng 3.200.000đ – 3.400.000đ/ (1 bộ gồm 10 sản phẩm)**Tế bào gốc GSC: GA Anti Ageing Ampoule**Được niêm yết giá vào khoảng 3.200.000đ đến 3.400.000đ/ (1 bộ gồm 10 sản phẩm)**Tế bào gốc GSC: GA AC Care Ampoule**Giá trên thị trường rơi vào khoảng 370.000đ đến 390.000đ /1 sản phẩm\n\n### TẾ BÀO GỐC GSC REVIEW TỪ KHÁCH HÀNG TRÊN WEBTRETHO\n\nVới những công dụng chuyên sâu của từng sản phẩm như trên, dòng mỹ phẩm GSC vẫn luôn được xem là sản phẩm chăm sóc, tái tạo và phục hồi da hàng đầu. Tế bào gốc GSC phù hợp với mọi loại da: da dầu, da thường, da khô, da mụn và cả da đang trị liệu tái tạo.\n\nTế bào gốc **GSC Korea** có thành phần có trong tế bào gốc thực vật giúp làm mạnh mẽ hơn những tế vào gốc trưởng thành ở da, sinh ra nhiều tế bào mới mạnh mẽ thay thế cho những tế bào đã già cỗi hư tổn. Tế bào gốc GSC làm mới làn da, duy trì sự mịn màng, giúp [nâng cơ trẻ hóa](http://nangcotrehoa.com/), căng bóng và trẻ trung.\n\n*Tế bào gốc GSC làm mới làn da, duy trì sự mịn màng, căng bóng và trẻ trung*\n\nTế bào gốc GSC được ứng dụng nhiều trong các liệu trình lăn kim, phi kim, laser nhằm phục hồi và tái tạo làn da và được rất nhiều Spa, thẩm mỹ viện sử dụng trong liệu trình chăm sóc da cho khách hàng. Tuy vào liệu trình và vấn đề da cần điều trị mà bạn lựa chọn loại **dược mỹ phẩm Hàn Quốc GSC** phù hợp nhất.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "1lhxbxn",
    "title": "Explain to me why my hair squeaks so much during the first shampoo, but less during the second shampoo. My hair also feels drier and more tangly if I only shampoo it once as opposed to twice. Is it because of buildup or something?",
    "url": "https://www.reddit.com/r/Haircare/comments/1lhxbxn/explain_to_me_why_my_hair_squeaks_so_much_during/",
    "score": 1,
    "num_comments": 6,
    "created": "2025-06-22T20:09:36+00:00",
    "body": "My hair is long, straight, and fine. I have a Culligan water filter on my shower head so hard water is probably not a factor.\n\nShampoo ingredients:\n\nPurified Water (Aqua), Ammonium Cocoyl Isethionate, Cocamidopropyl Betaine, Decyl Glucoside, Apple Cider Vinegar, Caprylhydroxamic Acid & Caprylyl Glycol & Glycerin, Lactic Acid, Hydrolized Pea Protein, Chamomilla Recutita (Matricaria) Flower Extract, Melissa Officinalis Leaf Extract (Lemon Balm), Urtica Dioica (Nettle) Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Salvia Officinalis (Sage)\n\n  \nConditioner ingredients:\n\nPurified Water (Aqua), Brassica alcohol & Brassicamidopropyl dimethylamine & Aspartic acid, Caprylhydroxamic acid & Caprylyl glycol & Glycerin, Cetearyl Alcohol & Polysorbate 60, Apple Cider Vinegar, Lactic acid, Hydrolyzed Pea Protein, Chamomilla Recutita (Matricaria) Extract, Melissa Officinalis (Lemon balm) Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract",
    "flair_text": "🔎 Product Question 🔎",
    "flair_template_id": "2c05ed5c-af6d-11ed-ae8c-ce99fcc18e68",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hey u/pahobee, thanks for your submission to r/Haircare!\n\nFeel free to engage in discussions and explore posts similar to yours.\n\n- [**New Posts**](/r/Haircare/new) - The latest posts in our community.\n- [**Rising Posts**](/r/Haircare/rising) - Posts that are quickly gaining attention.\n- [**Top Posts (Today)**](/r/Haircare/top/?t=day) - The most popular posts of today.\n- [**Top Posts (Week)**](/r/Haircare/top/?t=week) - The most popular posts of the week.\n- [**Top Posts (Month)**](/r/Haircare/top/?t=month) - The most popular posts of the month.\n\nWe hope these links help you connect with more of our community and find what you're looking for! ❤️\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Haircare) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "GossipingKitty",
        "body": "Product build up. I shampoo twice for the same reason.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Notsureindecisive",
        "body": "You’re confusing squeaky dirty with squeaky clean.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Antique-Scar-7721",
        "body": "Shower filters actually don’t usually soften water just FYI - don’t rule out hard water as a cause just because you have a shower filter.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_ccreedy80",
    "post_id": "gd6x0m",
    "title": "Can anyone tell me the difference between hydrolyzed pea protein and pea protein concentrate? And which is better for you?",
    "url": "https://www.reddit.com/r/u_ccreedy80/comments/gd6x0m/can_anyone_tell_me_the_difference_between/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-05-04T07:17:24+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_seonevada",
    "post_id": "glupt8",
    "title": "Top 10 kem dưỡng trắng da tốt nhất năm 2020 chị em nên sở hữu!",
    "url": "https://www.reddit.com/r/u_seonevada/comments/glupt8/top_10_kem_dưỡng_trắng_da_tốt_nhất_năm_2020_chị/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-05-18T04:40:00+00:00",
    "body": " \n\n## Kem dưỡng trắng da từ lâu đã phát triển thành món đồ chẳng thể thiếu trong tủ đồ điểm trang của các cô nàng. tuy nhiên chỉ cần khoảng vừa rồi bạn lại cảm thấy bản thân không còn phù hợp với dòng sản phẩm đang tiêu dùng nhưng lại không biết nên sử dụng sản phẩm nào là tốt và phù hơp. giả dụ trong trường hợp kể trên thì đừng chần chừ gì nữa mà không xem ngay top 10 kem dưỡng trắng da tốt nhất được khách hàng Tìm hiểu sau khi sử dụng nhé!\n\n### Top 10 kem dưỡng trắng da tốt nhất năm 2020 chị em nên sở hữu!\n\nDưới đây chính là thông tin cơ bản về top 10 kem dưỡng trắng da tốt nhất năm 2020 mà mỹ phẩm Hàn Quốc cao cấp Emcos Phân tích để bạn đọc có được các dòng nhìn khách quan nhất nhé!\n\n* Kem dưỡng trắng da Coringco Peach Whipping Tone Up Cream\n\nKem dưỡng trắng da Coringco Peach Whipping Tone Up Cream bây giờ đang là sản phẩm [**kem dưỡng trắng da**](https://emcos.vn/kem-duong-trang-da/) được xuất hiện đa số trên kệ hàng skin-care của nhất phổ biến các showroom chuyên mỹ phẩm Hàn Quốc trên toàn quốc. tuy nhiên đây cũng là một trong các Tips làm đẹp bít mật của những Hotgirl hiện tại đấy nhé!\n\n📷\n\nKem dưỡng trắng da Coringco Peach Whipping Tone Up Cream\n\nVới mẫu mã thuần tuý dạng tuýp cầm tay bạn hoàn toàn có thể mang đi du hý, đi công tác mà không hề chiếm diện tích hay có gì bất một thể cả nhé! 1 tuýp với dung tích 50ml bạn có thể sử dụng tha hồ từ thời gian 2-3 tháng, chính thành ra đây cũng được xem là một trong các lựa chọn xuất sắc cho những có nàng có mức thu nhập vừa phải.\n\nKem dưỡng trắng da Coringco Peach cũng mang trong mình mùi thơm dịu nhẹ, bỗng nhiên, không có mùi hóa học nên những cô nàng có phần mẫn cảm với mỹ phẩm hoàn toàn chẳng hề lo âu lúc tiêu dùng sản phẩm này đâu nhé!\n\n* Kem dưỡng trắng da Needs Nature Whitening Cream\n\nKem dưỡng trắng da Needs Nature Whitening Cream hay còn có 1 tên gọi khác là kem dưỡng trắng da Lohajin đã được báo chí Allure của Mỹ Phân tích là một trong các top kem dưỡng trắng da tốt nhất, nên sở hữu nhất năm nay với thành phần dưỡng chất an toàn từ đột nhiên, cùng với ấy là hiệu quả dưỡng trắng da hoàn hảo. Bạn hoàn toàn có thể cảm nhận được sự khác biệt trên da ngay sau lần dùng trước hết.\n\n📷\n\nKem dưỡng trắng da Needs Nature Whitening Cream\n\nChất kem khôn cùng mỏng, nhẹ, ngay khi bôi lên da là có thể thẩm thấu ngay để giúp bạn cân bằng độ ẩm cho da cũng như không hề lo lắng về da bị nhờn dính hay bí bít. các nàng lười khi đi ra ngoài trong thời gian ngắn không muốn makeup thì cũng có thể dùng Needs Nature Whitening Cream như một mẫu BB cream để tiêu dùng cũng khá ổn đó nhé!\n\n* Kem dưỡng trắng da Merbliss Pure Wedding Tone Up Cream\n\nkhi kể tới những top những sản phẩm [**dưỡng da**](https://emcos.vn/duong-da/) tốt nhất hiện này làm sao có thẻ bỏ qua dòng sản phẩm kem dưỡng trắng da Pure Wedding có phải không nào. Đây là 1 trong những dòng kem dưỡng trắng da dược người dùng quan tâm với thành phần dưỡng ẩm mấu chốt được chiết xuất từ trùng hợp như trà xanh và quả mơ Châu Âu. tiêu dùng đều đặn mỗi ngày sẽ khiến làn da của bạn phát triển thành trắng sáng, mịn màng, cải thiện các dấu hiệu lão hóa da như nám, tàn hương và những nếp nhăn cho bạn một phương pháp tốt nhất.\n\n📷\n\nKem dưỡng trắng da Merbliss Pure Wedding Tone Up Cream\n\nSản phẩm kem dương tráng da Merbliss Pure Wedding cũng được phổ thông quý khách Phân tích cao bởi có khả năng kiềm dầu khá tốt, giảm thiểu hiện tượng đổ dầu trên da. Bạn có biết rằng ví như dùng sản phẩm trước khi make up thì có thể giữ được lớp điểm trang lên đến 8 - 9 tiếng mà không lo bị xuống tone. Với công nghệ khóa ẩm cực tốt, em kem dưỡng trắng da này thực thụ thích hợp để bạn có thể sử dụng trong tiết trời sắm đông giá lạnh này!\n\n📷\n\nChương trình giảm giá khi mua hai tuýp kem dưỡng trắng Merbliss\n\n📷\n\nChương trình khuyến mại lúc tậu 3 tuýp kem dưỡng trắng Merbliss\n\n* Kem dưỡng trắng da Bellca Whitening Cream For Special\n\nKem dưỡng trắng da Bellca Whitening Cream For Special là sản phẩm dưỡng da của nhãn hàng mỹ phẩm Bellca Hàn Quốc cực nức danh với các mẫu sản phẩm có duyên cớ trong khoảng tự nhiên. các cô nàng có làn da mẫn cảm thường mua đến nhãn hàng để được tư vấn mẫu sản phẩm thích hợp với tình trạng da cũng như nhu cầu sử dụng.\n\n📷\n\nKem dưỡng trắng da Bellca Whitening Cream For Special\n\nVới chiết xuất trong khoảng những dòng thảo mộc và hoa quả quý hiếm của Hàn Quốc như hoa anh đào, hoa kim cúc, hoa sen, nhân sâm, kén tằm vàng. các cô nàng hoàn toàn có thể lặng tâm lúc sử dụng sản phẩm này để coi sóc làn da của mình mỗi ngày, đây chắc chắc là 1 sự lựa chọn hoàn hảo!\n\n* Kem dưỡng trắng da cao cấp Benew Special Crystal Whitening Cream\n\nKem dưỡng trắng da cao cấp Benew Special Crystal Whitening Cream cũng làn 1 trong những cử viên sáng giá để các nàng có thể lựa chọn khi muốn sắm cho mình 1 chiếc kem dưỡng da chất lượng tốt để dùng nhé! Benew Special Crystal Whitening Cream có thành phần chính là bột ngọc trai và thảo dược trong khoảng tình cờ với khả năng dưỡng trắng da cũng như cung ứng dưỡng chất giúp cải thiện tình trạng lão hóa da.\n\n📷\n\nKem dưỡng trắng da cao cấp Benew Special Crystal Whitening Cream\n\nChỉ sau 2 - 3 tuần dùng bạn đã có thể thấy được sự dị biệt của làn da. ngoài ra kem Benew Special Crystal Whitening Cream còn có thêm khả năng giúp làn da giảm thiểu tối đa việc sản sinh ra các hắc tố đen, ngăn ngừa và làm cho chậm đi những tín hiệu lão hóa như hắc tố đen sạm, giúp ngăn ngừa và khiến cho chậm sự vững mạnh của những tín hiệu lão hóa da. Bạn có thể dùng cả ngày và đêm cho làn da của mình nhé!\n\nnhững chị em phụ nữ ở độ tuổi ngoài 25 nên dùng để trông nom làn da được tốt và hiệu quả nhất. các nguy cơ lão hóa da nên được ngăn chặn ngay kể từ chúng bắt đầu xuất hiện.\n\n* Kem Cao Cấp Collagen Nâng Cơ Chống Lão Hóa Da - DABO Collagen Lifting Cream\n\nDABO Collagen Lifting Cream là một trong top 10 loại kem dưỡng trắng da tốt nhất chuyên dụng để sử dụng để cải thiện trạng thái lão hóa da của những Các bạn. Collagen thủy phân tình cờ có trong sản phẩm có khả năng thẩm thấu sâu vào trong da giúp nâng cơ và khiến săn chắc các vùng da đang có hiện tượng bị chùng nhão, chảy xệ do tuổi tác.\n\n📷\n\nKem Cao Cấp Collagen Nâng Cơ Chống Lão Hóa Da - DABO Collagen Lifting Cream\n\nSản phẩm hoàn toàn có thể giúp bạn cải thiện hiện trạng xuất hiện nếp nhăn trên mặt. DABO Collagen Lifting Cream sở hữu những thành phần dưỡng chất trong khoảng bỗng nhiên như lô hội, dầu Olive... Có khả năng dưỡng ẩm, chống oxy hóa, xúc tiến sự chuyển hóa những mô liên kết để bạn vẫn giữ được 1 làn da sáng hồng, tươi trẻ ở lứa tuổi trung niên.\n\n* Kem Dưỡng Trắng Da Mặt Shorohada Pure Whitening Cream\n\nKem Dưỡng Trắng Da Mặt Shorohada Pure Whitening Cream với công thức sáng chế đặc trưng tạo điều kiện cho sản phẩm có khả năng phân phối dưỡng chất nhu yếu cho da, mang lại cho bạn làn da sáng khỏe, đẹp đột nhiên. Shorohada Pure Whitening Cream thuộc top 10 kem dưỡng trắng da tốt nhất làm cải thiện sắc tố da nâng cao độ sáng của da và làm giảm các tín hiệu lão hóa da, mang đến làn da trắng mịn, rỡ ràng. những nám do mặt trời ảnh hưởng cũng như những vết mụn, vết sẹo cũng sẽ được hạn chế tối đa nếu như bạn sử dụng đều đặn.\n\n📷\n\nKem Dưỡng Trắng Da Mặt Shorohada Pure Whitening Cream\n\nnhững cô nàng có làn da mẫn cảm cũng không phải lo lắng khi dùng sản phẩm này vì nó mà 1 trong những cái kem dưỡng trắng da tốt nhất có thể phù hợp dùng với mọi chiếc da với tính chất cũng như thành phần không thiên về 1 mẫu da nào cả. Người tiêu dùng sẽ cảm thấy sự vừa đủ lúc thử trải nghiệm sản phẩm.\n\n* Kem dưỡng trắng da cao cấp 24k Benew Premium Whitening Gold Cream\n\nKem dưỡng trắng da cao cấp 24k Benew Premium Whitening Gold Cream cũng là cái tên được gọi lúc nói đến các cái sản phẩm được những chị em ưa thích tiêu dùng chỉ mất khoảng vừa qua. giả dụ bạn là 1 tín đồ ham mê làm đẹp thì hoàn toàn có thể biết được rằng chỉ cần khoảng qua chiếc mỹ phẩm khiến đẹp vàng 24K đang nóng như thế nào trên thị trường.\n\n📷\n\nKem dưỡng trắng da cao cấp 24k Benew Premium Whitening Gold Cream\n\nKem dưỡng trắng Benew Premium Whitening Gold Cream giúp dưỡng trắng làn da trong khoảng sâu bên trong, dần dần xóa mờ các vết thâm nám, tàn nhang do tuổi tác già đi gây nên. Thành phần Hydrolyzed Pea Protein và Niacinamide có khả năng sản xuất độ ẩm cho da cũng như giúp làn da căng, mịn, xóa mờ nếp nhăn, mang lại cho bạn một làn da trắng sáng hơn hẳn.\n\nSản phẩm được Phân tích hơi tha hồ lúc tiêu dùng, ngay lúc trâm lên da đã có thể thẩm thấu nhanh chóng vào sâu bên trong, không gây hiện trạng bí bít, khó chịu như phổ thông người vẫn hay e ngại.\n\n* Kem Trị Nám làm Trắng Whitening Spot Cream\n\nKem trị nám làm cho trắng Whitening Spot Cream 20g là sản phẩm với công dụng dành riêng cho các người sở hữu làn da bị sạm, nám, tàn nhang. chiếc kem này có chứa thành phần tương trợ phá bỏ lớp melanin sậm màu góp phần giúp da sáng trắng đều màu và phục hồi da bị bắt nắng. Bạn cũng có thể tiêu dùng nó cho bất nói vùng da nào mà bạn muốn cải thiện để có một làn da tươi sáng và đều màu hơn.\n\n📷\n\nKem Trị Nám làm cho Trắng Whitening Spot Cream\n\nThành phần sản phẩm Whitening Spot Cream - Kem dưỡng trắng da tốt nhất 2019 có duyên cớ trong khoảng trùng hợp và đã được kiểm định chất lượng chăm chút. Các bạn hoàn toàn có thể im tâm rằng đây là mẫu sản phẩm rất an toàn, lành tính và phù hợp để dùng với mọi mẫu da.\n\n* Kem Dưỡng Trẻ Hóa Và bảo kê Da Tenamyd Nutrition Lift Day Cream SPF 15\n\nKem dưỡng trẻ hóa, bảo kê da Tenamyd Nutrition Lift Day Cream với chỉ sô SPF 15 có cội nguồn từ Canada. Đây là mẫu sản phẩm chuyên dụng với mục đích tái tạo và dưỡng trắng da trong khoảng sâu bên trong, bên cạnh đó còn có khả năng bảo kê bạn trước các tác động xấu trong khoảng ánh nắng mắt trời.\n\n📷\n\nKem Dưỡng Trẻ Hóa Và bảo kê Da Tenamyd Nutrition Lift Day Cream SPF 15\n\nLà một trong những dòng kem dưỡng trắng da tốt nhất, Tenamyd Nutrition Lift Day Cream có thành phần dưỡng chất từ thiên nhiên với khả năng thẩm thấu vào da nhanh chóng khiến bạn có thế cảm thấy rõ ràng sự thay đổi của làn da sau từ ngày sử dụng sản phẩm.\n\n### khiến cho sao để có thể tìm tậu được những dòng sản phẩm chất lượng này?\n\nTrên thị trường hiện nay có đầy đủ những dòng sản phẩm dưỡng da được bán ra nhằm sản xuất cho những quý khách. Cũng bởi thế ngoài việc nhiều người băn khoăn không biết rằng đâu mới là sản phẩm tốt nhất để tiêu dùng thì việc làm sao để có thể sắm được mỹ phẩm chính hãng với nguyên cớ rõ ràng lại càng khó khăn hơn. Sau đây là những lưu ý mà bạn không nên bỏ qua lúc chọn sắm mỹ phẩm nhé!\n\n📷\n\nkhiến cho sao để có thể tìm tìm được những cái sản phẩm chất lượng này?\n\n\\- Chọn liên hệ tậu hàng uy tín: hãy Đánh giá và tham khảo để biết được liên hệ bạn mua hàng có bán các sản phẩm chất lượng hay không? Bạn có thể Nhận định bởi những khách hàng cũ, đã từng tậu hàng ở liên hệ ấy hoặc tham khảo quan điểm của người thân và bạn bè để có thể chọn được các địa chỉ đáng tin cậy.\n\n\\- Hãy kiểm tra tem mác cũng như cỗi nguồn của sản phẩm định tậu để cứng cáp rằng sản phẩm sắm là sản phẩm có duyên do và được rà soát tỷ mỉ. Bạn có thể dùng các phần mềm ứng dụng trên điện thoại để kiểu tra thông báo về sản phẩm định mua để kiên cố hơn nhé.\n\n\\- kiểm tra hạng tiêu dùng của sản phẩm, nên đảm bảo rằng bản thân sắm được các sản phẩm mới cung ứng và thời gian hiện tại không quá sắp với hạn sử dụng của sản phẩm được ghi trên bao bì sản phẩm. Bạn nên chọn những sản phẩm còn hạn dùng khoảng một năm là an toàn nhất để sử dụng cũng như đảm bảo công dụng sản phẩm không bị giảm nhé!\n\nTrên đây chính là top 10 kem dưỡng trắng da tốt nhất mà [**Mỹ phẩm Emcos**](https://emcos.vn/) gợi ý cho bạn, kỳ vọng bạn có được những trải nghiệm tuyệt vời nhất cũng như tậu được cho mình cái sản phẩm phù hợp với bản thân. nếu có điều gì cần được tương trợ và trả lời thêm thì có thể để lại lời nhắn ở bên dưới bài viết để nhóm trả lời viên nhanh chóng gọi điện địa chỉ cho bạn nhé!\n\nNguồn: **https://emcos.vn/top-10-kem-duong-trang-da-tot-nhat/**",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_PersefanyReign",
    "post_id": "qaav1b",
    "title": "CHEMICAL $#!+ STORM",
    "url": "https://www.reddit.com/r/u_PersefanyReign/comments/qaav1b/chemical_storm/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-10-17T23:58:57+00:00",
    "body": "-BHA & BHT (Butylated Hydroxytoluene)\nThanks to the research that shows it could be linked to ●Cancer the U.k.🇬🇧 & EU🇪🇺, Banned them. \n\n-rBGH (rBST) growth hormones. ●Cancer. Banned in Europe🇪🇺, Canada🇨🇦, Japan🇯🇵.\nwww.thrillist.com/health/nation/8-food-additives-banned-in-europe-that-are-legal-in-the-united-states\n\n-RACTOPAMINE This additive can affect the ●cardiovascular system. Banned in Europe🇪🇺. \n\n-ENRICHED FLOUR www.joshgitalis.com/dark-side-white-sugar-flour/#\n\n-PROPYLENE GLYCOL ALGINATE E405 -Other Names •1,2-Propanediol •1,2-Dihdroxypropane •Methyl ethyl glycol •Trimethyl glycol is a synthetic -Food additive ●Kidney or Liver Disease ●Lactic acid in the bloodstream, causing symptoms of toxicity & acidosis. \n🤮Stomach upset &🤢Nausea.\n●🫀💔disease ●🫀💔attacks. \nIn Cosmetics it can cause allergic reactions that include hair loss, rashes, eye irritation. Household cleaners may cause skin-related allergies. \n\n-MALTODEXTRIN Other Names •Corn Syrup Solids •Modified Corn Starch •Modified Rice Starch •Modified Topioca •Modified Wheat Starch \nIs used as a thickener and is a preservative. ●Crohn's disease ●Levels of sugar can lead to WEIGHT GAIN. ●Allergic reactions ●Rash ●🫁Asthma ●Cramping ●High glycemic index (GI), can cause a spike in your blood sugar. \n\n-ARTIFICIAL SWEETENERS. •High Fructose Corn Syrup •Sucralose (Splenda) •Acesulfame K Potassium Sunett •Aspartame (Equal,  Nutrasweet) •Saccharine (Sweet 'N Low, Sugar Twin) •Neotame, •Advantame, Luo Han Guo fruit extracts •High-purity steviol glycosides (Stevia rebaudiana). ●\"Artificial sweeteners cross the 🧠blood-brain barrier and disrupt hippocampus function. This impairs sensitivity to interceptive signals, dysregulate appetitive behavior, and thereby promote food intake and affect the normal gut microbiota. This can lead to OBESITY and metabolic syndrome.\" Rocio Salas-Whalen, MD, endocrinologist. and  ●Raises Blood sugars and increases the risk of diabetes ●Cancer ●Cronic INFLAMMATORY disorders. \n\n-HIGH FRUCTOSE CORN SYRUP (HFCS) •61 different names •Sucrose •Barley Malt •Isoclucose •Fructose Glucose Syrup •Dextrose •Maltose •Rice syrup are a few. It is an Artificial Sweetener. (Corn Syrup is a different product) -Side effects  \n●🧠Diminishes the brain's ability to learn and remember information ●Insulin resistance ●OBESITY ●Type 2 diabetes ●High blood pressure ●INFLAMMATION \n●🫀💔 disease ●Cancer \n●Increase harmful substances called advanced glycation end products (AGEs), which may harm your cells (21, 22, 23) \nay cause Diabetes ●Increases Risk of irritable Bowl Syndrome (IBS)●Crohn's disease ●Bloating ●Serious Pro=Inflammatory conditions that affect your digestive system. ●WEIGHT GAIN \n●The BODY CANNOT DIGEST SUCRALOSE, it travels through the human gastrointestinal track and damages it as it goes. It harms the intestinal wall, potentially causing Leaky Gut. ●Can Generate Toxic (and Carcinogenic) compounds when heated. \nhealth.clevelandclinic.org/avoid-the-hidden-dangers-of-high-fructose-corn-syrup-video/\n\n-ACESULFAME POTASSIUM (Ace K) Brand names •Sweet One & •Sunett. Is an Artificial Sweetener. \n\n-ARTIFICIAL COLORS -Most commonly used (Blue 1, & 2, Red 3, & 40, Yellow 5 & 6. ●Can cause Inflammatory response in the body. ●Artificial dyes contain small molecules, which are able to attach to proteins in our body. This can cause disruptions in the immune system since the immune system finds it difficult to defend the body against them. ●CONTAIN CANCER-CAUSING, TOXIC CONTAMINANTS. ●CAUSES HYPERSENSITIVITY, ESPECIALLY IN CHILDREN. ● Negatively impacts the functioning of the liver and other vital organs and nerve cells development ●Interfere with the digestive enzymes that our bodies produced to help properly break down the food that we eat. ●Increases intestinal permeability aka \"leaky gut.\" ●Linked to respiratory disorders such as 🫁ASTHMA and 🫁bronchitis. SYNTHETIC COLORS are illegal in the U.K.🇬🇧 because of links to hyperactivity & inattention in children. EU 🇪🇺, coloring agents are legal w SPECIAL LABELS. www.foodnerdinc.com/blogs/food-for-thought/Artificial-food-coloring-no-thank-you\n\n-BROMINATED VEGETABLE OIL (BVO) This stuff is a Flame Retardant.\nIt's in sports drinks and sodas. And it's to keep flavor from floating to the surface. ●Can cause nerve disorders. \n\n-POTASSIUM BROMATE (Bromated Flour) Plenty of studies have been done on Potassium Bromate as a potential human Carcinogen. ●Cancer causing. Banned in EUROPE 🇪🇺,  Canada 🇨🇦,  Brazil 🇧🇷,  since the 80's.\n\n-OLESTRA Substitutes fat. Unattractive gastrointestinal problems~like anal leakage. It is Banned in the U.K.🇬🇧, and Canada 🇨🇦, \n\n-POTASSIUM SORBATE ●Leukemia ●Cirrhosis of the liver ●Parkinson's disease  \n\n-POTASSIUM BENZOATE ●Leukemia ●Cirrhosis ●Parkinson's ●Triggers Allergies. www.detoxandcure.com/what-are-the-dangers-of-potassium-benzoate-and-other-chemicals/\n\n-POTASSIUM METABISULFITE ●is an allergen for some individuals. ●If you have 🫁difficulty breathing, swelling of your extremities, difficulty swallowing, rash or welts STOP CONSUMING. -It is a Food Preservative. www.livestrong.com/article/470024-what-is-potassium-metabissulphite/\n\n-SODIUM METABISULFITE ●People w Allergies to Sulfites and 🫁asthmatics should avoid anything containing Sulfites. Also know as: SODIUM PYROSULFITE. www.isitbadforyou.com/questions/is-sodium-metabisulfite-bad-for-you\n\n-SOY LECITHIN ●May cause Diseases & Nutrient Deficiencies including an, increased chance of ●Cancer. Most Soy in our modern day comes from GMO crops. \n\n-POLYSORBATE 80 Other Names- •Alkest •Canarcel •Tween 80 and is a synthetic surfactant composed of fatty acid esters of polyoxyethylene sorbitan and is used as an emulsifier in food.\n●May contribute to the impact of dietary factors on Crohn's disease pathogenesis. ●Increased risk of blood clots ●Stroke \n●🫀💔 attacks ●🫀💔failure ●Tumor growth or recurrence in patients w certain types of ●Cancer. thegoodhuman.com/what-is-polysorbate-80\n\n-SODIUM NITRATE ●Liver disease\n●🧠Headaches ●🫁Difficulty Breathing  ●🤢Diarrhea ●Confusion ●Dizziness ●Ab pain \n\n-SODIUM SULFATE ●Allergies ●Joint pain ●🫀💔 Palpitations  ●🧠Headaches \n●Cancer\n\n-PROPYL GALLATE is also denoted E310 is an artificial food additive ●Allergic reactions that impact 🫁BREATHING ●\"May\" cause kidney & Liver problems ●\"May\" Cause Cancer. ●Skin & 🤢Stomach irritability. \n\n-AZODICARBONAMIDE An additive that bleaches Flour rapidly. It's in over 500 common Supermarket products. It's also used to make plastic for sneakers 👟 and yoga 🧘‍♀️ mats. ●Linked to 🫁ASTHMA &  \n🫁RESPIRATORY ILLNESSES. The EU Banned it from being used in containers that will come into contact with food. \n\n•CARBOXYMETHYL CELLULOSE (CMC) Which is packaged as WALOCEL. Is a stabiliser.\n\n-🫁?MONOGLYCERIDES, also known as Monoacylglycerol, are a type of glyceride, or Ester formed from glycerol and fatty acids. They are emulsifiers & Stabilizers. The biggest health concern linked to monoglycerides is there Trans fat content. Trans fats, or trans-fatty acids, are a kind of unsaturated fat believed to be harmful to human health. According to Livestrong.com Trans fats can: \n●Decrease high-density lipoprotein (HDL) or good cholesterol levels \n●Increase the risk of Strokes, Diabetes, \n🫀💔Disease. \n●Promote OBESITY and INFLAMMATION \n●Raise low-density lipoprotein (LDL) or bad cholesterol levels.\n Although the amounts of trans fat in monoglycerides is small, it remains notable. This is why, however, the United States 🇺🇸 Food and Drug Administration (FDA) doesn't require food manufacturers to indicate the trans fat content of certain foods if they contain monoglycerides but no triglycerides. https://naturalpedia.com/monoglycerides-toxicity-side-effects-diseases-and-environmental-impacts.html\n\n-🫁HYDROGENATED  or FRACTIONATED OIL \n●INFLAMMATION \n-Palm Oil \n-Palm Kernel Oil \n-Soybean Oil \n-Corn Oil \n-Canola Oil\n\nAll of these are basically different names to hide ingredients that either contain MONOSODIUM GLUTAMATE (MSG) or form MSG during processing: \nsaveourbones.com/12-dangerous-ingredients/\n\n food.allwomenstalk.com/harmful-additives-in-food-to-avoid-that-might-be-causing-your-stomach-problems/\n- CARRAGEEN \n-MODIFIED CORNSTARCH \n-YEAST EXTRACT \n-DISODIUM GUANYLATE \n-DISODIUM INOSINATE \n-CASEINATE \n-TEXTURED PROTEIN \n-HYDROLYZED PEA PROTEIN \nThe entire process of creating GMO's may produce ●Carcinogens, ●Allergens, and ●Toxins. Aside from ●Cancer, these chemicals may induce ●Birth defects, ●Sterility. realfoodwholehealth.com/2011/05/excitotoxins-msg-and-hidden-names/",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CurlyHairCare",
    "post_id": "1iakq83",
    "title": "Help!! Will this leave-in conditioner containing keratin do more bad than good?",
    "url": "https://www.reddit.com/r/CurlyHairCare/comments/1iakq83/help_will_this_leavein_conditioner_containing/",
    "score": 1,
    "num_comments": 1,
    "created": "2025-01-26T17:37:39+00:00",
    "body": "Hi, my curls are in need of some protein and I happened to stumble across this leave-in, but there's not many reviews to be found about it (it is by a Polish company). All of the ingredients seem to be CGM friendly. My worry is that it contains keratin and hydrolized keratin, and from what I've heard, keratin can make your curls loosen. I totally don’t want this. Can that happen in this instance?:( I've heard keratin is a good choice of protein but I'm not sure if this is different from the results of a keratin treatment (those ones do indeed make your curls disappear.)\n\nI have tried posting this on the main curly hair sub, but it was taken down immediately most probably because i mentioned the word loosen\n\nThe product is Anwen Protein Orchid. I used isitcg.com but I will still leave the ingredient list, because a lot of the ingredients said \"probably ok\". If anyone who has more knowledge than me regarding these ingredients and if there's something that may do more harm than good, please let me know. Tysm 🩷\n\n>!AQUA, CETEARYL ALCOHOL, BEHENTRIMONIUM CHLORIDE, PPG-3 BENZYL ETHER MYRISTATE, HYDROLYZED PEA PROTEIN, KERATIN, HYDROLYZED KERATIN, COLLAGEN, HYDROLYZED ELASTIN, CETRIMONIUM CHLORIDE, STARCH HYDROXYPROPYLTRIMONIUM CHLORIDE, PHENOXYETHANOL, BENZOIC ACID, DEHYDROACETIC ACID, PARFUM, BENZYL SALICYLATE, COUMARIN, LIMONENE, GERANIOL, LINALOOL, HEXYL CINNAMAL.!<",
    "flair_text": "Advice Needed",
    "flair_template_id": "71a7159e-744b-11ea-a0c1-0e6436d290b3",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "&#x1F33F; Welcome! If you're looking for recommendations, please let us know what country you're in. It's also helpful for us to know your budget and where you like to shop (drugstore, online, etc.), and your [hair type](https://www.reddit.com/r/CurlyHairCare/comments/w85g1a/how_to_find_your_hair_type/). Also please check out [our wiki](https://www.reddit.com/r/CurlyHairCare/wiki/index/) for info about routines, products, and more.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/CurlyHairCare) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "1dolr8i",
    "title": "Certain shampoo making me shed more? ",
    "url": "https://www.reddit.com/r/Haircare/comments/1dolr8i/certain_shampoo_making_me_shed_more/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-06-26T00:47:36+00:00",
    "body": "For context, my two favorite hair care lines are gisou and Garnier honey treasures. Completely different ends of the price spectrum, but I find them to both work incredibly well on my wavy, fine hair. I've been using the gisou shampoo and conditioner for over a year now, and it makes my hair so healthy. I have an issue however-I've noticed that whenever I use it, I shed WAY more than usual. Recently I switched back to Garnier just to try it, and I immediately stopped shedding like that when washing. Why might this be? I'd assume it has something to do with the Garnier having sulfates and therefore effectively cleansing my scalp, but I honestly don't know. Here's the ingredients for both:\nGisou: \nAqua (Water/Eau), Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Glyceryl Laurate, PEG-40 Hydrogenated Castor Oil,Glycerin, Parfum (Fragrance), Mel (Honey/Miel)*,Hydrolyzed Pea Protein, Hydrolyzed Vegetable Protein, Argania Spinosa Kernel Oil, Arginine,Creatine, Hydrolyzed Adansonia Digitata Seed Extract, Helianthus Annuus Hybrid (Sunflower Seed) Oil, Sodium Lauroyl Sarcosinate, Decyl Glucoside, Citric Acid, Sodium Benzoate, Cetearyl Alcohol, Sodium Chloride, Guar\nHydroxypropyltrimonium Chloride,Polyquaternium-10, Xanthan Gum,Hydroxypropyltrimonium Inulin, Caramel,Tocopheryl Acetate, Potassium Sorbate, Benzyl Alcohol, Panthenol, CI 14700 (Red 4), CI 19140(Yellow 5), Coumarin**, Hexyl Cinnamal**,Limonene**, Linalool*\n\nGarnier: AQUA / WATER/EAU,\nSODIUM LAURETH SULFATE,\nSODIUM LAURYL SULFATE, COCAMIDE MEA,GLYCOL DISTEARATE, SODIUM CHLORIDE,PARFUM /FRAGRANCE, DIMETHICONE,citriC acid, sodium BENzOATe,PPG-5-CETETH-20, SODIUM HYDROXIDE,coco-Betaine, GLYCERIN, CARBOMeR,SALICYLIC ACID,\nGUAR HYDROXYPROPYLTRIMONIUM CHLORIDE\n,MEL / HONEY / MIEL,BENZYL ALCOHOL,COUMARIN, LIMONENE,\nBENZYL SALICYLATE, ARGANIA SPINOSA KERNEL OIL, CERA ALBA/BEESWAX/CIRE DABEILLE,CARAMEL, FUMARIC ACID, MEL EXTRACT/HONEY EXTRACT, CI 19140/YELLOW 5, POTASSIUM SORBATE",
    "flair_text": "Help needed",
    "flair_template_id": "fb6ae90e-af6c-11ed-b65a-9ae950aefbfe",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DermatologyQuestions",
    "post_id": "15j6s9s",
    "title": "Aveeno Conditioner allergic reaction?",
    "url": "https://www.reddit.com/r/DermatologyQuestions/comments/15j6s9s/aveeno_conditioner_allergic_reaction/",
    "score": 1,
    "num_comments": 2,
    "created": "2023-08-05T21:08:19+00:00",
    "body": "I tried out the Aveeno Strength and Length Plant Protein Conditioner and upon applying it my scalp felt tingly and warm and the skin on my back where my hair was resting felt hot. I immediately rinsed and had a splotchy red patch on my back. \n\nThis is the ingredient list: Colloidal Oatmeal Extract, Water (Aqua), Behentrimonium Chloride, Cetyl Alcohol, Cetearyl Alcohol, Glycerin, PPG-3 Benzyl Ether Myristate, Hydrolyzed Vegetable Protein, Hydrolyzed Pea Protein, Salvia Hispanica Seed Oil, Dimethicone, Polyquaternium-47, Steareth-20, Disodium EDTA, Citric Acid, Sodium Hydroxide, Sodium Benzoate, Fragrance (Parfum)\n\nI’m not an expert in ingredients and I don’t even know if I’m allergic to anything, any ideas on what could have caused this reaction? I’d like to avoid any ingredients that could cause this again.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "laney-louey",
        "body": "Same!! It travels down my neck and on my arms/shoulders. I’m covered rn. Thought I’d give it a second go and it made me reaction worse. I’m not sure what would cause this reaction, I’m stuck myself.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]