[
  {
    "subreddit": "antiMLM",
    "post_id": "7xnpdn",
    "title": "What's in Monat?",
    "url": "https://www.reddit.com/r/antiMLM/comments/7xnpdn/whats_in_monat/",
    "score": 62,
    "num_comments": 23,
    "created": "2018-02-15T03:23:23+00:00",
    "body": "All right I did it. So here's all the crap they're putting in their \"Revive\" shampoo. And I'm not one to be all \"Oooh! Spooky chems!\" but for a company that screams MODERN NATURE!!! and PURE INGREDIENTS!!! every other page on their website there sure is a lot of shit in their shampoo.\n\nJust so you know, you're buying shiney, smelly bubbles when you buy this shit... and it's costing you $35.00 fucking dollars. I could buy a year's worth of Suave for the same amount of money (by the way, Suave has an awesome ingredients page for each of their products.)\n\nAnyway, here's the breakdown of what's in this trite bullshit called Monat Revive Shampoo:\n\nWater, anti-static stuff, foaming agent, adhesive, foaming surfactant, cleanser, more anti-static stuff, even more anti-static stuff, cleanser again, EVEN MORE anti-static, pea extract, skin protectant, \n\n**(this is a stupid list of plants that were squeezed for oils)** clover extract, meadowfoam seed oil, mustard seed oil, camellia seed oil, tomato see oil, carrot seed oil, lemon peel oil, lime oil, bergamot fruit oil, Baobab seed oil, buriti fruit oil, coconut oil, gardenia extract, drumstick tree seed oil, pequi fruit oil, sunflower seed oil,\n\nsolvant/denaturant, synthetic Vitamin E, basically a blood thinner, acid... the kind used in chemical peels, thinner, pearlescent thickening agent/foamer, MOAR FOAM!, really long name for **EVEN MOOOAR FOAMMMM**, thickening-anti-static-FOAM-booster, sigh foam, thickener, silicone, emulsifying agent, preservative, pH adjuster, vague reference to fragrance, surfactant, fragrant preservative, anti-dandrufff smelly stuff, fragrance again.\n\n**EDIT:** Here's the original ingredients list directly from their website. Water (Aqua),Lauramidopropyl Betaine, Sodium C14-16 Olefin Sulfonate, Acrylates Copolymer, Sodium Methyl Cocoyl Taurate, Sodium Cocoamphoacetate, Guar Hydroxypropyltrimonium Chloride, Cinnamidopropyltrimonium Chloride, Stearyldimoniumhydroxypropyl Decylglucosides Chloride, Polyquaternium-11, Pisum Sativum (Pea) Extract, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Limnanthes Alba (Meadowfoam) Seed Oil, Crambe Abyssinica Seed Oil, Camellia Oleifera Seed Oil, Solanum Lycopersicum (Tomato) Seed Oil, Daucus Carota Sativa (Carrot) Seed Oil, Citrus Limon (Lemon) Peel Oil, Citrus Aurantifolia (Lime) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Adansonia Digitata Oil, Mauritia Flexuosa Fruit Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis Flower Extract, Moringa Oleifera Seed Oil, Caryocar Brasiliense Fruit Oil, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Tocopherol, Dextran, Citric Acid, Propanediol, Glycol Distearate, Cocamidopropyl Hydroxysultaine, Sodium Hydroxypropylphosphate Decylglucoside Crosspolymer, Lauramide MIPA,Sodium Hydroxypropylphosphate Laurylglucoside Crosspolymer, Cocamidopropyl Betaine, Butylene Glycol, Propoxytetramethyl Piperdinyl Dimethicone, Trideceth-6, Centrimonium Chloride, Aminomethyl Propanol, Fragrance (Parfum), C11-15 Pareth-7, Phenethyl Alcohol, Undecyl Alcohol, Benzyl Alcohol",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fishymcswims",
        "body": "Adhesive??  What’s the point of putting adhesive in your hair?  It could be in other shampoos...I don’t know, just never seen an ingredients list broken down like this to know what all the chemicals do (thank you for the breakdown, btw!).",
        "score": 33,
        "is_top_level": true
      },
      {
        "author": "girlslikesciencetoo",
        "body": "Doesn't this shampoo make people's hair fall out? And the ingredients aren't that much different than normal drugstore shampoo, so definitely not worth $40 a bottle.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "juel1979",
        "body": "Grateful to see sunflower oil in there. That’s my out if I ever get approached by these folks and want to try to not launch into “YOU ARE LITERALLY BALDING PEOPLE!” tirades.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "lavenderhoneysarah",
        "body": "That's a ton of chemicals. I have very sensitive skin and that would absolutely burn me. You can throw as many pretty sounding oils as you want in there Monat, it's not gonna cover up from the amount of nasty ass stuff on there too.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "whimsyNena",
        "body": "H2O gets em every time.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "advcthrwy",
        "body": "It seems incredibly ironic that they're marketing this as something \"cleaner and more natural\" than drugstore shampoo when it actually contains *MORE* ingredients (scary, hard-to-pronounce ones at that! 🙄) than any other shampoo I've seen.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "heo4gy",
    "title": "[News] Soko Glam's new skincare brand Good (Skin) Days™",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/heo4gy/news_soko_glams_new_skincare_brand_good_skin_days/",
    "score": 41,
    "num_comments": 13,
    "created": "2020-06-23T22:04:13+00:00",
    "body": "[Good (Skin) Days](https://sokoglam.com/collections/good-skin-days)\n\nSoko Glam released their new cruelty-free, vegan, and 'affordable' skincare line! The current line-up includes a cream cleanser, toner, vitamin C, and moisturizer featuring ingredients such as mugwort, green tea, pumpkin and papaya enzymes, and probiotics.\n\n**A New Leaf Cream Cleanser** - Aqua (Water, Eau), Glycerin, Potassium Cocoyl Glycinate, Lauramidopropyl Betaine, Hydroxypropyl Starch Phosphate, Acrylates Copolymer, Artemisia Capillaris Extract, Camellia Sinensis Leaf Extract, Camellia Sinensis Leaf Powder, Apium Graveolens (Celery) Stem Extract, Coptis Japonica Extract, Artemisia Princeps Leaf Powder, Brassica Oleracea Acephala Leaf Extract, Cichorium Intybus (Chicory) Leaf Extract, Brassica Oleracea Italica (Broccoli) Extract, Citric Acid, Potassium Cocoate, Sodium Chloride, Hydroxyacetophenone, Dipropylene Glycol, Caprylyl Glycol, Butylene Glycol, Gardenia Florida Fruit Extract, Maltodextrin, Dipotassium Glycyrrhizate, 1,2-Hexanediol\n\n**Prime Time Cleansing Toner** - Aqua (Water, Eau), Acer Saccharum (Sugar Maple) Extract, Carica Papaya (Papaya) Fruit Water, 1,2-Hexanediol, Dipropylene Glycol, Glycereth-25 PCA Isostearate, Cucurbita Pepo (Pumpkin) Fruit Extract, Artemisia Capillaris Extract, Papain, Allantoin, Panthenol, Rosa Damascena Flower Water, Hamamelis Virginiana (Witch Hazel) Water, Polyglyceryl-4 Caprate, Sodium Lactate, Sodium Gluconate, Coptis Japonica Extract, Butylene Glycol, Ethylhexylglycerin, Citrus Paradisi (Grapefruit) Fruit Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Lavandula Angustifolia (Lavender) Oil, Cyanocobalamin, Rosmarinus Officinalis (Rosemary) Leaf Oil, Pelargonium Graveolens Flower Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Disodium EDTA\n\n**C's The Day Serum** (10% Vitamin C) - Aqua (Water, Eau), Butylene Glycol, Ascorbic Acid, Glycerin, 1,2-Hexanediol, Sodium Bicarbonate, Myrciaria Dubia Fruit Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Niacinamide, Magnesium Ascorbyl Phosphate, Arbutin, Tocopheryl Acetate, Coptis Japonica Extract, Panax Ginseng Berry Extract, Crocus Sativus Flower Extract, Tuber Magnatum Extract, Hibiscus Sabdariffa Flower Extract, Theobroma Cacao (Cocoa) Extract, Glycereth-25 PCA Isostearate, Hydroxydecyl Ubiquinone, Sodium Metabisulfite, Xanthan Gum, Ethylhexylglycerin, Adenosine, Dextrin, Caprylic/Capric Triglyceride, Cetyl Ethylhexanoate, Hydrogenated Lecithin\n\n**On The Bright Side Moisturizer** - Rice Ferment Filtrate (Sake), Butylene Glycol, Caprylic/Capric Triglyceride, Squalane, 1,2-Hexanediol, Cetyl Alcohol, Stearyl Alcohol, Lactobacillus Ferment Lysate, Isopentyldiol, Water, Ceramide NP, Propanediol, Glycerin, Bifida Ferment Lysate, Streptococcus Thermophilus Ferment, Madecassoside, Ammonium Acryloyldimethyltaurate/VP Copolymer, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Ethylhexylglycerin\n\n--\n\nWhat does everyone think of the products thus far? The ingredients look good, although it's unfortunate that essential oils were included in the toner. The price point is about right for me as well - I always wanted to try Charlotte Cho's Then I Met You brand but it's a little outside of my normal budget range so I wonder how these products will compare. I personally ordered the cleanser and moisturizer!",
    "flair_text": "News",
    "flair_template_id": "0c101566-7721-11e7-8f24-0e3ebc7a853c",
    "comments": [
      {
        "author": "saesaenyaa",
        "body": "Oooh.. the moisturizer and the vit C serum sounds so appealing! I'm going to give those a try when I'm done with my current set (.. and back ups..) of serums/moisturizers! The price isn't too bad either!",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "noBSbeauty",
        "body": "I'm excited to try these out, especially the vitamin c and moisturizer.  Looks like the ingredients seem to be relatively safe for sensitive skin- and the prices aren't ridiculous!  Can't wait to play with them and try out!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "moonbubble1",
        "body": "I was happy to see their announcement, and I love that it raises money for charity too! I’m looking forward to ordering the cleanser soon, I have way too many toners and moisturizers right now. I feel kind of betrayed by their last two forays into Vitamin C, so I’m hesitant to try the serum but I wish it well 💅🏻",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "atllauren",
        "body": "Intrigued by the vitamin c serum. The combination of vitamin c + b3 + the calming ingredients sounds great.\n\nI don't order from Soko Glam very often because whenever I look around their site 90% of what I want is sold out.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Miki_Hufflepuffle",
        "body": "I excited to try the entire line. I’m waiting for the toner to be in stock to make an order. The vitamin c serum is the most interesting to me because she explained that it doesn’t need to be refrigerated. That was the main issue I had with other serums. \nThe prices seem reasonable and I hope it’s as good as it sounds!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "bobbie_snoopie",
        "body": "Damn some products have crap ton of essential oils and fragrances",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Cutepengwing",
        "body": "The cleanser and moisturiser are both fragrance free and sound good.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sugard09",
        "body": "Seems pretty good so far though it’s too new to tell. I would have loved to have seen an oil cleansing balm, though. My boss bought the one from “Then I Met You” and gave me a sample. I loved how not stripped my skin felt and how it didn’t irritate my eyes, but she and I both agreed $38 is still a bit steep, though warranted if you have that kind of cash. Considering the size, amount you need (it’s not super spreadable without using a generous amount) and the fact that because of sunscreen you kinda have to use it every day, I really would have loved to see more options. Banilla isn’t exactly cheap, but it kind of works for much less.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "zoe_doan",
        "body": "Both of the ing lists of the Vitamin C serum & Moisturizer are great but I cannot afford that price for daily use, still too expensive...\n\nThe Good Skin Day Vitamin C serum's ph level is  4 to 4.5 while an effective PH level for L-Ascorbic Acid to work is less than 3.5 (source: Lab Muffin blog). I suspect this Vitamin C serum is more for sensitive skin or beginners with vitamin C b/c low concentration of L-Ascorbic Acid and > 3.5 ph level.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "KindCapital",
        "body": "I definitely plan on getting the cleanser once my current one runs out, and I may get the moisturizer since it's fragrance free. I'm torn on the Vitamin C and I'll wait until further reviews to see what others say.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 10,
      "top_level": 10,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "71pq82",
    "title": "[Discussion] How effective is AHA/BHA in your cleanser?",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/71pq82/discussion_how_effective_is_ahabha_in_your/",
    "score": 26,
    "num_comments": 13,
    "created": "2017-09-22T08:44:22+00:00",
    "body": "So I've been thinking of trying out some Hada Labo cleansers, and I noticed they have an AHA/BHA Face Wash. They way I use my BHA is to leave it on my face for ~20mins before moving on to the next step of skincare - so will the AHA/BHA in facial washes work in the short time that the cleanser is on my face? \n\nJust for reference, here are the ingredients to the Hada Labo AHA/BHA Face Wash (maybe the % of AHA and BHA helps it be more effective in a shorter time? IDK)\nWater, Butylene Glycol, Potassium Myristoyl Glutamate, PEG-20M, Lauramidopropyl Betaine, Stearic Acid, Lauramide DEA, Glycolic Acid, Lauric Acid, Betaine, Glycol Distearate, Potassium Hydroxide, Methylparaben, Salicylic Acid, Betaine / Sodium PCA / Sorbitol / Serine / Glycine / Glutamic Acid / Alanine / Lyine / Arginine / Threonine / Proline / Methylpar",
    "flair_text": "Discussion",
    "flair_template_id": null,
    "comments": [
      {
        "author": "satisphoria",
        "body": "> so will the AHA/BHA in facial washes work in the short time that the cleanser is on my face? \n\nNo. Wrong pH, wrong concentration.",
        "score": 31,
        "is_top_level": true
      },
      {
        "author": "ASmallPidgey",
        "body": "I've not used the hada labo cleanser but I do use an AHA/BHA cleanser (face theory) which I leave on for 5 minutes before washing off. Its super good for loosening up blackheads. Never used other AHA/BHA products though so I can't compare.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "salgene",
        "body": "While they might not be useful in the typical sense that we are used to, mainly because of the concentration/ph not being the same as an exfoliate, these ingredients do have the benefit of fighting inflammation when added to products.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "marshmallowmermaid",
        "body": "I've tried that face wash and it did nothing for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sadstarfish",
        "body": "I've found the Acwell bubble free cleanser to be effective. Maybe because it's non foaming and at a low ph. I massage it in for a few mins to get the full benefits.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Mommychoochoo",
        "body": "For sure. Neutrogena salicylic acid body wash works on my body acnein 2 days. I just rub on in the beginning of shower and wash off at the end of shower.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "ty3lko",
    "title": "Interesting ingredient lists, with a side of label vs marketing copy reality check",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/ty3lko/interesting_ingredient_lists_with_a_side_of_label/",
    "score": 25,
    "num_comments": 0,
    "created": "2022-04-07T03:12:49+00:00",
    "body": "I did bury the company name somewhat, but if you made it here, you'll find it. Everything I say here is my opinion based solely on their website content, and I've never tried their products or even heard of them before today. Part of the reason that I am so specifically critical of this brand is that they also sell an expensive oral supplement for hair, which I think is inappropriate for any cosmetics brand to do, but it is especially worrisome from a tiny one that is so loose with their claims for other products.\n\nOn the other hand, seldom does a company make it this easy to read their labels with some kind of confidence, so I thought it might be interesting to share. On the website product pages they do a couple of bullet-point type \"contains X% of Y\" that I call advertising claims for ingredients, but when compared to the full ingredients list it becomes obvious just how far they're stretching. In one case it is obvious that the claim percent is probably how much of the material as supplied they use, the rest are less clear.\n\nI want to say that despite the cleanwashing and the painfully bad sciencewashing this brand does, these may not be bad products to use, though they all range between somewhat and ridiculously overpriced. However, they are pushing the limits of language use in advertising/marketing to the flimsiest edge of reason and legality, and their \"science\" is a mish-mash of misleading puffery, long debunked fearmongering misinformation, and some other stuff I think they pulled out of thin air. Given all of the aroma chemicals in some their ingredients lists, I'd love to know how they would define \"synthetic\" in relationship to fragrance.\n\nThey have filed a patent application both World and US for stirring ingredients together at room temperature to make their products, which has got to be some troll level BS, or maybe a shady sidestep attempt to patent protect the cosmetic products ingredients lists or formulas without actually doing anything patentable. They are not Skinceuticals making a breakthrough with C E Ferulic. I mostly skimmed these because reading such patent apps is a good treatment for insomnia.\n\nWorld patent app here: https://patents.google.com/patent/WO2019165115A1/en\n\nUS here: https://patents.google.com/patent/US20200375877A1/en\n\nThe US version removes claims 8-17 as compared to the World version.\n\nNo idea where the hyperbaric chamber nonsense fits into this, but I laughed very hard at what seems to be a cut & paste definition of a pressure chamber from somewhere else. The patent app doesn't mention needing a hyperbaric chamber, despite the website claims.\n\nLast thing that I can't let go of: A quick lab test is not a clinical trial. In this case it \"proves\" that the 3 main products used in sequence will clean some synthetic sebum out of standardized hair samples in a lab.\n\nOh, and they've registered a trademark for Cold Processed. Yeah. https://uspto.report/company/Act-Acre-Inc\n\nAnyway. Enough of my judgemental rambling. On to the real reason for this: the labels!\n\nThey start as expected, but everything under 1% is listed alphabetically for most of their products. There are a few I didn't include here. I've formatted them to italics at the point where they go alphabetical to make it more obvious.\n\n**Act+Acre Stem Cell Serum** (for the scalp)\n\nAdvertising claim amounts: 2% apple stem cells, 2% bamboo and pea extract\n\nIngredients list as of April 6 2022: Water (Aqua), Glycerin, Butylene Glycol, *Aloe Barbadensis Leaf Juice (ALOE), Bambusa Vulgaris Leaf/Stem Extract (BAMBOO), Caprylyl Glycol, Carbomer, Citric Acid, Plant-Based Collagen, Ethylhexylglycerin, Glucosamine Hcl, Glycereth-26, Lecithin, Leuconostoc/Radish Root Ferment Filtrate (RADISH), Malus Domestica Fruit Cell Culture Extract (APPLE), Pentylene Glycol, Phenoxyethanol, Pisum Sativum (Pea) Extract (PEA), Propanediol, Quercus Petraea Fruit Extract (OAK), Sodium Hyaluronate, Sodium Hydroxide, Tetrasodium Glutamate Diacetate, Xanthan Gum*\n\nNote: Raw material manufacturers have been trying to make plant stem cells happen in cosmetics for well over a decade. I have not tried any and have no plans to do so. PhytoCellTec's SDS for their apple stem cell extract on Lotioncrafter's site gives the amount as 9% of the whole solution as supplied.\n\n**Hair Cleanse**\n\nAd Claim: 2% Apple amino acids, 0.045% Baobab oil (they say it supports a healthy scalp microbiome, not sure how that applies in a rinse off)\n\nIngredients list april 6 2022: Water (Aqua), Sodium Lauroyl Methyl Isethionate, Sodium Cocoyl Apple Amino Acids, Triethyl Citrate, Sorbitan Oleate Decylglucoside Crosspolymer, Hydroxypropyl Starch Phosphate, Lauramidopropyl Betaine, Glycerin, *Acrylates Copolymer, Acrylates/Beheneth-25 Methacrylate Copolymer, Adansonia Digitata Seed Oil (BAOBAB), Amaranthus Caudatus Seed Oil (AMARANTH), Amyris Balsamifera Bark Oil (AMYRIS), Aquilaria Agallocha Wood Oil (AGARWOOD), Cananga Odorata Flower Oil (YLANG YLANG), Caprylyl Glycol, Cistus Ladaniferus Leaf/Stem Extract (ROCKROSE), Citric Acid, Cocamide Mipa, Dimethyl Heptenal, Elettaria Cardamomum Seed Oil (CARDAMOM), Gamma-Nonalactone, Glycol Distearate, Helianthus Annuus (Sunflower) Seed Oil (SUNFLOWER), Hexenyl Acetate, Hexylene Glycol, Ionone, Juniperus Virginiana Oil (CEDARWOOD), Lavandula Angustifolia (Lavender) Oil (LAVENDER), Menthyl Ethylamido Oxalate, Moringa Oleifera Seed Oil (MORINGA), Panthenol, Phenoxyethanol, Pogostemon Cablin Oil (PATCHOULI), Potassium Sorbate, Rosmarinus Officinalis (Rosemary) Leaf Extract (ROSEMARY), Sodium Hydroxide, Sodium Lauroamphoacetate, Steareth-4, Tetrasodium Glutamate Diacetate, Vanillin, Viola Odorata Flower/Leaf Extract (VIOLET), Xanthan Gum* \n\nNote: Oils are only put in shampoos for making label claims.\n\n**Scalp Detox**\n\nUndoubedly misleading as heck ad claims: 4.55% Aloe & Calendula Extract, 2.73% Botanical Blend (either of those could mean anything)\n\nIngredients list april 6 2022: C12-15 Alkyl Benzoate, Helianthus Annuus (Sunflower) Seed Oil (SUNFLOWER), Glycine Soja (Soybean) Oil (SOYBEAN), Isostearyl Linoleate, Adansonia Digitata Seed Oil (BAOBAB), Moringa Oleifera Seed Oil (MORINGA), *Aloe Barbadensis Leaf Extract (ALOE), Amaranthus Caudatus Seed Oil (AMARANTH), Calendula Officinalis Extract (CALENDULA), Cananga Odorata Flower Oil (YLANG YLANG), Citrus Aurantium Dulcis (Orange) Oil (ORANGE), Cocos Nucifera (Coconut) Oil (COCONUT), Ocimum Basilicum Hairy Root Culture Extract (BASIL), Vetiveria Zizanoides Root Oil (VETIVER)*\n\nNote: Calendula is frequently extracted in sunflower seed oil for commercial use, and oil soluble aloe extracts are also widely available. The process for how they claim to stir this formula together is in the patent application as Working Example 3. A version of the hair cleanse is example 1. Anyway, I would guess that it is probably 80% or more C12-15 Alkyl Benzoate.\n\n**Conditioning Hair Mask** (also called Restorative Hair Mask)\n\nAd claims: 2% castor oil, no other % claims but mentions shea butter and panthenol benefits\n\nIngredients list april 6 2022: Water (Aqua), Cetearyl Alcohol, Isoamyl Laurate, Hydrogenated Castor Oil/Sebacic Acid Copolymer, Glycerin, Diheptyl Succinate, Triethyl Citrate, Arachidyl Alcohol, Di-C12-15 Alkyl Fumarate, Behentrimonium Methosulfate, C12-15 Alkyl Benzoate, *Amyris Balsamifera Bark Oil (AMYRIS), Aquilaria Agallocha Wood Oil (AGARWOOD), Arachidyl Glucoside, Behentrimonium Chloride, Behenyl Alcohol, Butyrospermum Parkii (Shea) Nut Extract (SHEA BUTTER), Cananga Odorata Flower Oil (YLANG YLANG), Caprylic/Capric Triglyceride, Capryloyl Glycerin/Sebacic Acid Copolymer, Caprylyl Glycol, Ceteareth-20, Cetrimonium Chloride, Cistus Ladaniferus Leaf/Stem Extract (ROCKROSE), Citric Acid, Dimethyl Heptenal, Elettaria Cardamomum Seed Oil (CARDAMOM), Ethylhexylglycerin, Gamma-Nonalactone, Guar Hydroxypropyltrimonium Chloride, Helianthus Annuus (Sunflower) Extract (SUNFLOWER), Hexenyl Acetate, Hydrogenated Vegetable Oil, Hydrolyzed Vegetable Protein, Hydroxyethylcellulose, Ionone, Juniperus Virginiana Oil (CEDARWOOD), Oryza Sativa (Rice) Bran Extract, Panthenol, Phenoxyethanol, Pogostemon Cablin Oil (PATCHOULI), Ricinus Communis (Castor) Seed Oil (CASTOR), Rosmarinus Officinalis (Rosemary) Leaf Extract (ROSEMARY), Sclerotium Gum, Sodium Hydroxide, Tetrasodium Glutamate Diacetate, Tocopherol, Tocopheryl Acetate, Vanillin, Viola Odorata Flower/Leaf Extract (VIOLET)*\n\nNote: The star here is Crodabond CSA INCI: Hydrogenated Castor Oil/Sebacic Acid Copolymer. It does have a tiny amount of plain castor oil too. Hard to say how accurate that 2% claim is.\n\nTheir **Hair Oil** doesn't have the detailed ingredients list that would show off their obvious fragrance inrgedients, as it would crush the \"just 5 natural ingredients\" idea, but they also say their squalane is squalene in the ad copy and I am petty enough about that kind of thing to put this here. \n\nAd claim from website: 5% plant-based squalene, 5% Argan oil\n\nList: Limnanthes alba (meadowfoam) seed oil, Squalane, Argania spinosa kernel (argan) oil, Crambe abyssinica seed oil phytosterol esters, Fragrance\n\nNote: As far as brand cohesiveness, this is an odd choice given the detailed ingredients lists of the other products that include the names of aroma chemicals and carefully avoid using the word \"fragrance\" but it is probably the most honest.",
    "flair_text": "discussion",
    "flair_template_id": "45a9aa12-2823-11e4-8962-12313b0e52a2",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Wetshaving",
    "post_id": "bw3vrp",
    "title": "[Review] Helmsman Shave Cream",
    "url": "https://www.reddit.com/r/Wetshaving/comments/bw3vrp/review_helmsman_shave_cream/",
    "score": 23,
    "num_comments": 8,
    "created": "2019-06-02T23:37:48+00:00",
    "body": "[Video](https://youtu.be/gHJ0g9SmP-k)  \n\n&#x200B;\n\nHelmsman ([https://bethehelmsman.com/](https://bethehelmsman.com/)) is a company that specializes in brushless shaving cream. The company prides itself on having all aspects of production based in the US. From manufacturing from the chemist to the designers to the tube manufacturers, the product is 100% made in the U.S.A. Helmsman can be purchased direct from their site or on Amazon ([https://www.amazon.com/Helmsman-Mens-Shaving-Cream-Irritation/dp/B074W272LB/](https://www.amazon.com/Helmsman-Mens-Shaving-Cream-Irritation/dp/B074W272LB/)).\n\n&#x200B;\n\nHelmsman Original Scent is a light, refreshing scent that smell similar to many modern mens soaps and grooming products. This pleasant scent is hard to distinguish individual notes from. In general it is refreshing, clean and crisp. This scent is a nice divergence from complex scents and as such, Mrs. Ruds is neutral on this one. She cannot really smell it once I rinse it away, making it a great user if you want your post shave product or fragrance of the day to dominate. Scent strength is light to mid out of the container and remains that way through the shave. \n\n&#x200B;\n\nHelmsman brushless shave cream appears to be a vega based cream. Ingredients are listed as: Aloe Barbadensis Leaf Juice, Purified Water, Stearic Acid, Sodium Methyl, Cocoyl Taurate, Cetearyl Olivate, Sorbitan Olivate, Decyl Glucoside, Glycerin, Lauramidopropyl Betaine, Coco-Betaine, Sodium Cocoyl Isethionate, Phenoxyethanol, Caprylyl Glycol, Butylene Glycol, Hamamelis Virginiana, Bark/Leaf/Twig Extract, Caprylic/Capric Triglyceride, Argania Spinosa Kernel Oil, Tocopheryl Acetate, Xanthan Gum, Siloxanetriol Alginate, Caffeine, Helianthus Annuus Seed Oil, Glycine Soja Germ Extract, Boswellia Carterii Resin Extract, Silybum Marianum Fruit Extract, Glycyrrhiza Glabra Root Extract, Calophyllum Tacamahaca Seed Oil, Citrus Aurantium Bergamia Fruit Oil, Cedrus Atlantica Bark Oil, Oleic Acid, Sodium Gluconate, Ceramide, Sodium Chloride and Citric Acid. Being a brushless cream, this cream can be applied with your hand or a brush but does not require water. Primary and residual slickness are good. I am able to buff without visible lather with no fear of the razor skipping or dragging. Post shave is also good. I am not left dry or tight once rinsed away. The ShaveScore for Helmsman Shave Cream is an 82. For similar performance I suggest you check out: Castle Forbes.\n\n&#x200B;\n\n***Disclosure: All reviews and impressions must state how the product was acquired whether it be free, sponsored, promotional, purchased, or otherwise.***\n\n* Soap - Helmsman Shave Cream (promotional gift)\n* Brush - N/A\n* Razor - Rockwell 6S (purchased)\n* Post - Aqua Velva (purchased)",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "CanadaEh97",
        "body": "Off the top of my head from your cream reviews it seems like most are scoring and performing all in the same score range.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "NobleOtter",
        "body": "Id be interested to see how you score our tester base.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "BDR_MPB",
        "body": "I've got to share a hotel room with a stranger for about a week for work. Been looking for something so that I won't hog the sink in the morning or make a mess. For the price, this will work. Thanks, Ruds!",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "igryws",
    "title": "[Review]: Good Skin Days A New Leaf Cream Cleanser",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/igryws/review_good_skin_days_a_new_leaf_cream_cleanser/",
    "score": 18,
    "num_comments": 3,
    "created": "2020-08-26T04:05:39+00:00",
    "body": "Good Skin Days A New Leaf Cream Cleanser\n\nIt’s hard to get excited about a cleanser. Some products will offer a slight uptick of hydration, others may provide a nice softening effect. But for the most part, I have found most of the cleansers I have used to fall into two simple categories...low pH and high pH (the latter being something I avoid). That’s really what I look for over anything else.\n\nOf course, there have been cleansers that have stood out to me by offering a bit more. My first love was the D’Alba Pidemont Peptide No-Sebum Cleanser which helped clear excess oil and sebum (it was my 2018 pick of the year). Others from brands like Peach & Lily, Solved Skincare, Make P:rem, and Rovectin helped to soothe my skin. And a few others just smelled good LOL. Glow Recipe, Sulwhasoo, and The Lotus offer products that added a sensorial experience to my cleansing step.\n\nThe Soko Glam Good Skin Days A New Leaf Cream Cleanser takes some of the qualities I mentioned above and takes things a step further.\n\nThis cream/gel hybrid cleanser impressed me pretty much from the initial application. The consistency is similar to other thick “sticky style” cleansers like the Then I Met You Soothing Tea Cleansing Gel and the Krave Beauty Matcha Hemp Hydrating Cleanser. But, there is a visible cloudy/creamy-ness to this product that makes it look a bit more intriguing.\n\nOne of the featured ingredients here is Green Tea Leaf Powder...which I love in the Inward Agas ACue Herbal Mask. Here though, they aren’t as concentrated and really just offer a pleasant appearance (at least for me).\n\nOther ingredients in the A New Leaf Cream Cleanser include Mugwort Extract, Green Tea Leaf Extract, and Celery Stem Extract.\n\nAside from the look of this product...the feel is even more impressive. Honestly, the thick/rich later that can be had from this cleanser is awesome. It’s been rare (in my experience) to get a foam so dense from a pH balanced product. Few others I have used make this happen but it’s a lovely surprise when it does.\n\nI had no issue taking my time massaging the lovely lather in...sometimes bringing the product down to my neck/chest just to enjoy the experience. A little bit goes a really long way here though. The smallest dollop/pea sized amount is sufficient for the whole face.\n\nOnce rinsed, the Good Skin Days A New Leaf Cream Cleanser leaves behind thoroughly cleansed skin...without being at all stripping. The lack of fragrance gives this product a “plain soap” scent that had me worried about the cleanser’s intensity...but that turned out to be a non-issue.\n\nIn addition to general cleansing, this product also delivered on its ability to calm/soothe the skin. The relatively high concentration of mugwort...while only on the skin for a short time...seems to pull through and reduce redness/irritation. Because of this, I found myself feeling comfortable in grabbing this product for not only my AM and PM routine...but also as a stand in for cleansing wipes after a workout or day spent hiking. \n\nAfter just about a month with the Good Skin Days A New Leaf Cream Cleanser...I am left feeling super impressed. To me, I see the Good Skin Days line as an excellent entry point into not only Soko Glam but K-Beauty in general (I’ll have my review for the moisturizer out very soon). The Prime Time Cleansing Toner wasn’t my cup of tea...but I know others will love it (some have already professed their love on the Soko Glam site).\n\nThis cleanser totally plays into that by offering a gentle/approachable use, awesomely dense lather, and a pretty great value. I am kind of a cleanser junkie so I’ll be continuing to test other products...but the Good Skin Days A New Leaf Cream Cleanser will be making it into several christmas gift bags for friends and family!\n\nFull Ingredients List: Aqua (Water, Eau), Glycerin, Potassium Cocoyl Glycinate, Lauramidopropyl Betaine, Hydroxypropyl Starch Phosphate, Acrylates Copolymer, Artemisia Capillaris Extract, Camellia Sinensis Leaf Extract, Camellia Sinensis Leaf Powder, Apium Graveolens (Celery) Stem Extract, Coptis Japonica Extract, Artemisia Princeps Leaf Powder, Brassica Oleracea Acephala Leaf Extract, Cichorium Intybus (Chicory) Leaf Extract, Brassica Oleracea Italica (Broccoli) Extract, Citric Acid, Potassium Cocoate, Sodium Chloride, Hydroxyacetophenone, Dipropylene Glycol, Caprylyl Glycol, Butylene Glycol, Gardenia Florida Fruit Extract, Maltodextrin, Dipotassium Glycyrrhizate, 1,2-Hexanediol\n\nWhere To Buy (Soko Glam $16.00 USD): [https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser](https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser) \n\nPS: I have been incorporating the Foreo Luna 3 into my routine for a little over a week, and I want to include a little blurb at the end of each cleanser review to talk about how they played together. As for the Good Skin Days A New Leaf Cream Cleanser...it’s not something I would use with the Foreo.\n\nThe little bits of green tea (while pleasing to look at and have on the skin) tend to get caught in the little silicone touch points of the Foreo. I found myself taking just as much time picking/rinsing out the little pieces as I did actually cleansing my face lol! It ended up being kind of a hassle to the point that I set my Foreo aside for the last few days of this review.\n\nNow that I have finished my “testing time” with the Good Skin Days A New Leaf Cream Cleanser...I will be using what I have left to either decant into smaller bottles for friends or just as a body wash. I really want to bring the Foreo back into the fold and for that to happen I’ll need to switch to a different product. \n\nhttps://preview.redd.it/oct7ps65u9j51.jpg?width=5472&format=pjpg&auto=webp&s=7b996a5e309d78985bea879ea4ac020333c26410",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "imprecationstation",
        "body": "What does it smell like",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "igryne",
    "title": "[Review]: Good Skin Days A New Leaf Cream Cleanser",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/igryne/review_good_skin_days_a_new_leaf_cream_cleanser/",
    "score": 19,
    "num_comments": 0,
    "created": "2020-08-26T04:05:11+00:00",
    "body": "Good Skin Days A New Leaf Cream Cleanser\n\nIt’s hard to get excited about a cleanser. Some products will offer a slight uptick of hydration, others may provide a nice softening effect. But for the most part, I have found most of the cleansers I have used to fall into two simple categories...low pH and high pH (the latter being something I avoid). That’s really what I look for over anything else.\n\nOf course, there have been cleansers that have stood out to me by offering a bit more. My first love was the D’Alba Pidemont Peptide No-Sebum Cleanser which helped clear excess oil and sebum (it was my 2018 pick of the year). Others from brands like Peach & Lily, Solved Skincare, Make P:rem, and Rovectin helped to soothe my skin. And a few others just smelled good LOL. Glow Recipe, Sulwhasoo, and The Lotus offer products that added a sensorial experience to my cleansing step.\n\nThe Soko Glam Good Skin Days A New Leaf Cream Cleanser takes some of the qualities I mentioned above and takes things a step further.\n\nThis cream/gel hybrid cleanser impressed me pretty much from the initial application. The consistency is similar to other thick “sticky style” cleansers like the Then I Met You Soothing Tea Cleansing Gel and the Krave Beauty Matcha Hemp Hydrating Cleanser. But, there is a visible cloudy/creamy-ness to this product that makes it look a bit more intriguing.\n\nOne of the featured ingredients here is Green Tea Leaf Powder...which I love in the Inward Agas ACue Herbal Mask. Here though, they aren’t as concentrated and really just offer a pleasant appearance (at least for me).\n\nOther ingredients in the A New Leaf Cream Cleanser include Mugwort Extract, Green Tea Leaf Extract, and Celery Stem Extract.\n\nAside from the look of this product...the feel is even more impressive. Honestly, the thick/rich later that can be had from this cleanser is awesome. It’s been rare (in my experience) to get a foam so dense from a pH balanced product. Few others I have used make this happen but it’s a lovely surprise when it does.\n\nI had no issue taking my time massaging the lovely lather in...sometimes bringing the product down to my neck/chest just to enjoy the experience. A little bit goes a really long way here though. The smallest dollop/pea sized amount is sufficient for the whole face.\n\nOnce rinsed, the Good Skin Days A New Leaf Cream Cleanser leaves behind thoroughly cleansed skin...without being at all stripping. The lack of fragrance gives this product a “plain soap” scent that had me worried about the cleanser’s intensity...but that turned out to be a non-issue.\n\nIn addition to general cleansing, this product also delivered on its ability to calm/soothe the skin. The relatively high concentration of mugwort...while only on the skin for a short time...seems to pull through and reduce redness/irritation. Because of this, I found myself feeling comfortable in grabbing this product for not only my AM and PM routine...but also as a stand in for cleansing wipes after a workout or day spent hiking. \n\nAfter just about a month with the Good Skin Days A New Leaf Cream Cleanser...I am left feeling super impressed. To me, I see the Good Skin Days line as an excellent entry point into not only Soko Glam but K-Beauty in general (I’ll have my review for the moisturizer out very soon). The Prime Time Cleansing Toner wasn’t my cup of tea...but I know others will love it (some have already professed their love on the Soko Glam site).\n\nThis cleanser totally plays into that by offering a gentle/approachable use, awesomely dense lather, and a pretty great value. I am kind of a cleanser junkie so I’ll be continuing to test other products...but the Good Skin Days A New Leaf Cream Cleanser will be making it into several christmas gift bags for friends and family!\n\nFull Ingredients List: Aqua (Water, Eau), Glycerin, Potassium Cocoyl Glycinate, Lauramidopropyl Betaine, Hydroxypropyl Starch Phosphate, Acrylates Copolymer, Artemisia Capillaris Extract, Camellia Sinensis Leaf Extract, Camellia Sinensis Leaf Powder, Apium Graveolens (Celery) Stem Extract, Coptis Japonica Extract, Artemisia Princeps Leaf Powder, Brassica Oleracea Acephala Leaf Extract, Cichorium Intybus (Chicory) Leaf Extract, Brassica Oleracea Italica (Broccoli) Extract, Citric Acid, Potassium Cocoate, Sodium Chloride, Hydroxyacetophenone, Dipropylene Glycol, Caprylyl Glycol, Butylene Glycol, Gardenia Florida Fruit Extract, Maltodextrin, Dipotassium Glycyrrhizate, 1,2-Hexanediol\n\nWhere To Buy (Soko Glam $16.00 USD): [https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser](https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser) \n\nPS: I have been incorporating the Foreo Luna 3 into my routine for a little over a week, and I want to include a little blurb at the end of each cleanser review to talk about how they played together. As for the Good Skin Days A New Leaf Cream Cleanser...it’s not something I would use with the Foreo.\n\nThe little bits of green tea (while pleasing to look at and have on the skin) tend to get caught in the little silicone touch points of the Foreo. I found myself taking just as much time picking/rinsing out the little pieces as I did actually cleansing my face lol! It ended up being kind of a hassle to the point that I set my Foreo aside for the last few days of this review.\n\nNow that I have finished my “testing time” with the Good Skin Days A New Leaf Cream Cleanser...I will be using what I have left to either decant into smaller bottles for friends or just as a body wash. I really want to bring the Foreo back into the fold and for that to happen I’ll need to switch to a different product. \n\nhttps://preview.redd.it/yzw0rl22u9j51.jpg?width=5472&format=pjpg&auto=webp&s=2565789b81a630d2d717d68b20722cf3024b939e",
    "flair_text": "REVIEW",
    "flair_template_id": "62e1292e-4166-11e8-9ee1-0eb6a157035e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "VeganBeauty",
    "post_id": "xvt8s9",
    "title": "Help! Need a replacement for my old cleanser :(",
    "url": "https://www.reddit.com/r/VeganBeauty/comments/xvt8s9/help_need_a_replacement_for_my_old_cleanser/",
    "score": 14,
    "num_comments": 32,
    "created": "2022-10-04T22:50:58+00:00",
    "body": "Hey y'all; I've been using a facewash called 'The Vegan Glow Mild Foaming Cleanser' for about two years now. I have chronic topical allergies which means extremely sensitive skin, and to date this is the ONLY cleanser that hasn't irritated it, provoked acne and/or dried out my face. \n\nSadly it appears that it's no longer being sold; the only trustworthy looking website carrying it and shipping to the U.S is for some reason not accepting orders. And the company's website has vanished from the internet. \n\nI'm DEVASTATED. I need a new cleanser ASAP. So far I've discovered that my skin hates any kind of alcohol, sodium chloride, any fragrances, and any weird essential oils. Typically if a product has a long ingredients list.. it's going to upset my skin. \n\nThe ingredients in my original cleanser were as follows: \n\nWater, Lauramidopropyl Betaine, Potassium Cocoyl Glycinate, Decyl Glucoside, Sodium Cocoyl Isethionate, Butylene Glycol, Xanthan Gum, Acrylates/​C10-30 Alkyl Acrylate Crosspolymer, Illicium Verum (Anise) Fruit Extract, 1,2-Hexanediol, Caprylyl Glycol\n\nIt also had a perfect 5.5 PH value. I tried Native's vegan alcohol free cleanser but the PH must've been off because it immediately made my skin oily. I also looked into Vanicream but saw people saying that the PH is in the 6-7 range, a range I have had a bad experience with :( Plus both of those contain sodium chloride.. \n\nIf anyone can help me find a dupe or something similar to TVG's I greatly appreciate it! Since no longer being able to buy it, my skin has rapidly deteriorated..",
    "flair_text": "Skincare",
    "flair_template_id": "bef5a6aa-e44e-11e3-8359-12313b0d5a0a",
    "comments": [
      {
        "author": "Just_a_Marmoset",
        "body": "I suggest trying Ceramedx:\n\n[https://ceramedx.com/collections/shop/products/extra-gentle-body-cleanser](https://ceramedx.com/collections/shop/products/extra-gentle-body-cleanser)\n\n(This cleanser is for face and body even though it's called a body cleanser; see description.)\n\nYou can get samples here:\n\n[https://ceramedx.com/collections/shop/products/sample](https://ceramedx.com/collections/shop/products/sample)\n\nNote: cetearyl alcohol is a fatty acid, not a drying alcohol like you might imagine, but I don't know if you'd be sensitive to it. Seems worth a shot!",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "hissyfit64",
        "body": "ELF has a cleanser that is gentle, Vegan and affordable. I order off their website because you collect points and can use it for discounts. I now use all their skin care products and have noticed a huge difference for the better in my skin",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "syncleir",
        "body": "You can try the Garden of Wisdom [skin friendly cleanser ](https://gardenofwisdom.com/collections/cleansers/products/gow-skin-friendly-cleanser-no-added-essence?variant=13464280367216).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SixdaywarOnSnapchat",
        "body": "i have used aquanil cleanser for a while. it has the fewest ingredients of any cleanser i have seen before and i am able to buy three bottles in bulk on amazon. vanicream cleanser shredded my face.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "flyaway21",
        "body": "I've heard good things about the Round Lab Dokdo cleanser",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "cuttlefishcuddles",
        "body": "So I don’t know my ingredients as well as I would like (in terms of alcohols, etc) but would glossier milky jelly work for you? \n\nLately I’ve been using thayers ph balancing daily cleanser, but that has sodium chloride in the middle of the list.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "wellshitdawg",
        "body": "There’s that cerave dupe mega list that’s pinned to the sub you could sift through\n\nI just started using the skinfix barrier cleanser, it’s too early to tell a huge difference but so far it’s pretty gentle\n\nI don’t like foaming cleansers though, and it def is that",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MystlcM00n",
        "body": "Try AprilSkin's cleansers. The Calendula is most gentle option I've found!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "jenmac01",
        "body": "Have you ever tried an oil cleanser?  Check out the vegan oil cleanser on www.empyri.com it dissolves all your makeup and sunscreen and leaves your skin clean and soft but not greasy.  Canadian company that ships to the US.  Ingredients: hemp seed oil, MCT oil, avocado oil, meadow foam seed oil, hemp root (it’s anti inflammatory) rosemary oil and a couple of essential oils.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "CzeckeredBird",
        "body": "I also have severely sensitive skin. I wanted to share a tool I've been using to find dupe products or products without ingredients that are troublesome for me.  \n\nINCI Decoder: https://incidecoder.com/  \n\nHow to use:  \n\n1. Leave the search box blank (in order to capture all cleansers, since they could be named \"cleanser,\" \"wash,\" or even creative names like \"Swipe Clean\" (by Bybi)). Just click the magnifying glass.  \n\n2. Under \"Must Contain All Of These Ingredients,\" type the names of your favorite products' ingredients and select them from the autocomplete window.  \n\n3. Under \"Must Not Contain Any Of These Ingredients,\" enter any ingredients that you don't want.  \n\n4. Click \"Filter\" and you will get a list of matching products, sometimes spanning multiple pages.  \n\n5. Sometimes nothing matches the exact ingredients list you provided. To loosen the filters, click on the \"X\" next to any ingredients in the \"Must Contain\" box.  \n\nI've been using this tool for years. And even though I still struggle with cleansers, INCI Decoder has helped me find niche ingredient products that I otherwise would never have found on Google. A lot of them end up being from Canada or Europe, like Denmark, Germany, Italy, and The Netherlands. I repeatedly find vegan and cruelty free as well as fragrance free and so-called hypoallergenic products from those countries. Again, products that my English Google searches likely would have missed. So it's an amazing tool. But the database only has products entered by users.  \n\nI went ahead and searched for a cleanser fitting some of your criteria:  \n\nErhalogy (or Erha21) Skin Barrier Facial Wash (I substituted cocamidopropyl betaine for lauramidopropyl betaine)  \n \nEtude House Cica Balance 5.5 Foam Cleanser (lacks a few thickeners and humectants from the Vegan Glow cleanser)\n\nRael Daily Detox Oil to Foam Gentle Cleanser (has olive oil and quite a few plant extracts, which might not be desired)  \n\nYou can also make the following substitutions of similar ingredients:  \n-lauramidopropyl betaine: cocamidopropyl betaine, coco-betaine  \n-decyl glucoside: coco glucoside, lauryl glucoside, caprylyl/capryl glucoside  \n-1,2-hexanediol: propylene glycol, propanediol, caprylyl glycol, pentylene glycol, butylene glycol, 1,2-butanediol  \n-sodium cocoyl isethionate: sodium lauroyl isethionate, sodium cocoyl methyl isethionate, sodium lauroyl sarcosinate, sodium cocoyl sarcosinate  \n\n\nGood luck and hope you find a dupe cleanser!  \n\nETA: I'm unfamiliar with the products mentioned above, so their vegan and cruelty free status needs to be confirmed with the vendor. Beyond the vendor I would also check Cruelty Free Kitty's database. Some companies lie about or use ambiguous language to claim that they don't test on animals (but then still do in countries like China, for example). Cruelty Free Kitty audits companies for truly cruelty free practices.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "iamkismet",
        "body": "If you haven't heard of the EWG Skin Deep database, it's a great source for finding clean skincare, makeup, and cosmetic products! \n\n[https://www.ewg.org/skindeep/](https://www.ewg.org/skindeep/)\n\nIf you haven't heard of the EWG Skin Deep database, it's a great source for finding clean skincare products!  Acne Control Face Cleanser, Acne Treatment Face Wash - Fragrance-Free, and it's alcohol free!",
        "score": -1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 11,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "1ecklxs",
    "title": "[Combination-oily] Review of Acne Quad Kick-Start face wash with salicylic acid and Thymol T Essence™",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ecklxs/combinationoily_review_of_acne_quad_kickstart/",
    "score": 11,
    "num_comments": 15,
    "created": "2024-07-26T10:20:10+00:00",
    "body": "♦️ **Review type:** Promising, but not for me. 3/5  stars?\n\n♦️ **Skin type:** Normal in winters, combination-oily in summers, slightly dehydrated.\n\nSensitive, acne- and inflammation-prone. Slow healing Generally have some clogged pores/comedones plus a couple hormonal nodules every month. Usually some ongoing PIH+PIE (red-brown acne marks) from that.\n\nAllergic/reactive to strongly fragranced skincare, shea butter, MCI/MI (a relatively uncommon preservative). Mineral oil and lanolin suit my skin a lot better than plant oils.\n\n♦️ **Climate:** Mumbai. Hot and humid summers.\n\n♦️ **Current routine:**\n\n☀️ AM: \n+ Acne Squad Kick-Start Cleanser\n+ DIY vitamin c serum ([details here](https://www.reddit.com/r/IndianSkincareAddicts/s/eIi64ptr8k)) with glycerin and green tea extract added in to make it hydrating\n+ Dermadew Aloe cream [(review here)](https://www.reddit.com/r/IndianSkincareAddicts/s/QCyo55E2rI) with a pinch of Purenso Colloidal Oatmeal powder (I skip the powder if wearing sunscreen, otherwise it causes pilling)\n+ Vilvah Melt-in-Milk SPF30 ([review here](https://www.reddit.com/r/IndianSkincareAddicts/s/hIPvg9vFiC)) if facing windows indoors or stepping out briefly, Vilvah SPF50 if spending time outdoors. Skip if entirely indoors.\n\n🌙 PM: \n+ DIY cleansing balm (if wearing makeup)\n+ Simple Refreshing Face Wash\n+ Minimalist AHA BHA 10% exfoliator OR Minimalist 3% Tranexamic Acid Face Serum (or a skip day if I feel my skin needs it)\n+ Dermadew Aloe cream with a pinch of Purenso Colloidal Oatmeal powder mixed in (also over the lips)\n+ 100% lanolin as an occlusive balm - dabbed on the lips, healing acne spots, and (if sleeping in AC or feeling like my skin is sensitised) a thin overall layer by rubbing between the palms and gently pressing all over the face.\n\nNote that I built up to this routine of actives by introducing them one at a time, over the course of several weeks.\n\n♦️ **Age:** Early 30s\n\n♦️ **Usage timeline:** just under a month, every morning.\n\nThe brand directs you to use it daily, AM/PM, which is a bit confusing - does that mean twice a day? 🤔\n\n#✨️Ingredient list: \n\nWater, Sodium Cocoyl Glycinate, Glycerin, Hydroxypropyl Starch Phosphate, Sodium chloride, Sodium Lauroamphoacetate, Acrylates Copolymer, Decyl Glucoside, Lauramidopropyl Betaine, Coconut Acid, Fragrance, Terpineol, Phenoxyethanol, Polyquaternium-6, Citric Acid, Salicylic Acid, PEG-150 Distearate, Thymol, Tetrasodium EDTA, Butylhydroxytoluene, Sodium hydroxide, Iodopropynyl Butylcarbamate, Saccharide Isomerate, Linalool.\n\nNotably, contains an unspecified percentage of salicylic acid (looks like 0.5% if we speculate that phenoxyethanol is 1% and the ingredients are in decreasing order) and what they call their \"patented Thymol T Essence™\" which is a botanical extract that has antimicrobial properties.\n\nIs sulphate- and paraben-free, does contain fragrance, linalool, terpineol and thymol as potentially sensitising ingredients.\n\n♦️ **Claims and expectations:**\n\n>A gentle, sulphate-free cleanser created with Thymol T Essence™ & Salicylic Acid, clinically proven to reduce acne causing bacteria & soothe acne in 3 days. Restores moisture leaving skin hydrated with Pentavitin™ molecules.\n\nThe \"soothing acne\" and whole Acne Squad approach with their stages of acne was what got me interested, because yeah, when you're acne-prone it's a cycle that is naturally always ongoing. That seemed realistic to me, I appreciate that. I had been using a 2% salicylic cleanser in the daytime (Zitcare foaming face wash) and was curious to see if a cleanser with less salicylic that had a different antimicrobial action would be more effective and maybe work better for my sensitive skin? \n\nThis proved to not be the case 🙃\n\n♦️ **Price:** MRP ₹325 for 100ml (always available at reduced price of under 300)\n\n#✨️Texture, consistency and fragrance\n\nThe texture is like most other foaming cleansers that come in a tube, but not super thick. It's a clear gel that makes a soft and fine foam when rubbed between damp hands. Does not lather a lot, but enough to satisfy those of us who need the foamy feeling 😂\n\nIt has a fresh, herby-spicy fragrance that is characteristically from thyme. Quite mild, doesn't linger at all and only lasts for a few seconds when massaged on a wet face and rinsed.\n\nThose who like the smell of tea tree, rosemary or similar green fragrances would like it. Maybe even people who like minty/menthol face washes. I personally really enjoy a herby fragrance, so I enjoyed using it every morning ☺️\n\n♦️ Packaging - a very cute lilac tube. Looks and feels great, but at least initially, the products tends to run out and it dispenses too much just with gravity. It's better to open it with the cap upwards and then flip it down to dispense. A small detail, but mildly annoying at first.\n\n#✨️Effects\n\nFoams quickly and applies very smoothly on a qet face - no dragging at all. The foam only lasts a few seconds after application on the face, and quickly disappears.\n\nThe result is a nicely cleansed face that isn't too stripped of oils. Using a smaller amount gives a gentler cleanser, and using more gives a stronger cleanse. \n\nHere's my problem - after about two weeks of using it daily in the mornings, I started experiencing mild barrier damage and redness. Especially around the nose corners (a tell-tale sign for those with sensitive skin). My skin texture became slightly bumpy all over, and I saw a few pinrpick pustules. Initially I figured I'd just dial back the exfoliation, but that didn't make a difference and eventually I stopped using this cleanser. Within two days my skin was back to normal and drinking up glycolic acid like nobody's business 😂\n\nJust goes to show, even sensitive skin is sensitive TO very particular things. I also use acids in my routine, so that might have had some impact, but I personally find that my skin likes acids and is more likely to react badly to botanical extracts in general. Just confirms that 🤷🏽‍♀️\n\nI didn't find it affected my acne in any way, but considering my skin's reaction, that doesn't mean much.\n\n#✨️Final thoughts, pros and cons\n\nI actually really liked using this cleanser, and am somewhat disappointed it didn't work for me. I think it's a nice product, something of a level up from menthol type acne face washes of the past. A nice gateway product for men who are stuck on the \"for men\" train to try normal skincare 😂\n\nI think it would probably work quite well for people of all sebum levels, oily, combo, even dry if used in small amounts. \n\nNormal and resilient skin types would probably find it works well. If you're not using any serums or treatments for acne, I think it's worth a shot to see if this cleanser helps.\n\nIf you have sensitive skin I would use with caution, especially if you already know your skin reacts badly to essential oils, since the extracts are key constituents of those. This doesn't guarantee it won't work for you, just a heads up to keep an eye on your skin (like I did - no real harm done).\n\n\n♦️ **Repurchase status:**\n\nSadly, a WNRP. One of those products that I know a majority of people will probably like, but just doesn't suit me personally. Anyway, I think I can just skip a treatment cleanser in the mornings now (and save it for summer mornings, when I have more oiliness).\n\nI'd love to hear from others who have used this product! Searching the sub didn't bring up any full reviews, is why I chose to post, but I know there's people out there using it. See you in the comments!",
    "flair_text": "I Followed Posting Rules",
    "flair_template_id": "76ceebf2-445b-11ef-be7d-aa5e510be4ed",
    "comments": [
      {
        "author": "GagrotXGb",
        "body": "Acne squad products are manufactured by Hindustan Unilever Ltd (HUaL). Its their B2C brand. Novology is also made by HUL but marketed primarily via dermats. Acne squad's super saviour serum for acne marks and Novology's hyperpigmentation serum have the same ingredients with just price difference.  ( ₹650 vs 850)\n\nAnce squad face wash with salicylic acid and Novology's acne face wash have the same ingredients both out of stock at the same time with just a little price difference. \n\nDo what u have to do with that info XD.\n\nFrom HUL's manufacturing afaik only their pigmentation serum has come out as a winner, this thymol terpeniol shit is mostly a dud compared to other industry standards and their 7% PHA toner (novology) is the last promising product yet to be heard about or tried.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "PinkMoonbow",
        "body": "Your review is always a sight for sore eyes , but especially now. \n\nThank you, I was eyeing some sos from Acne Squad, but ended up getting Mario Bedescu drying lotion (not tried it yet).",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Samyak07",
        "body": "Great review OP!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi /u/UnevenHanded**: Please read carefully. [This sub is currently experimenting with user curated moderation](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Mods are not enforcing Posting Rules 4, 5, 7, 8. Your fellow members are. Reported posts will be removed and will not be re-approved.\n\nUsing this sub for medical advice (Rule 9) will result in a ban. Ensure you're adhering to all other sub rules. **Violations will result in a ban.**\n\nAutomod automatically spoilers all images. You may remove this ONLY IF you are posting non-human pictures (eg. Products, shelfies,) \n\n**Do not remove spoilers if your image shows any part of a human (skin, hair, etc).** Even for Progress Pics, Before/After and Journey posts. Not all members consent to viewing images/close up images of strangers. \n\n*Removing the spoiler in an attempt to get more views for your post, will result in a permanent ban. Be considerate.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "#Warnings and Reminders\n\n**To /u/UnevenHanded**\n\n# Posting Rules + Ban Policy: \n[Posting rules 4, 5 and 8 are currently being enforced by members, not mods](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Please report posts if you feel a need. \n\n**All other sub rules are in effect. Refer sidebar, or [view in full here](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Please report rulebreaking comments. Offenders will be banned.**\n\n**If your post doesn't go live: If your post does not go live immediately: While we are no longer automatically filtering posts for manual moderation, this sub's settings have zero impact on Reddit's main sitewide settings, filters and algorithms.\n\nReddit algorithms may flag certain posts for manual moderation. We have no control over this. If this happens to your post, please wait patiently till we manually resolve the issue. If your post is not attended to after 24 hours, you can modmail us then.\n\n\n**To the Members**\n\n#Rx/medical advice policy:\nYour peers will interpret your comments as expert recommendations. \n\nTherefore, ALL comments mentioning Rx products, giving opinions on a doctor's treatment plan, speculating visual diagnoses from photos, or any other borderline medical scope  MUST INCLUDE EXPLICIT DISCLAIMERS.  If in doubt, include disclaimer. If sharing anecdotal experience, include disclaimers. \n\nERR ON THE SIDE OF CAUTION. BE MINDFUL OF THE  SAFETY AND WELLBEING OF YOUR PEERS. BANS WILL BE ENFORCED FOR RECKLESS/POOR ADVICE.\n\n#Spoilers:\nThe mods set it up so all posts are automatically spoilered. If this spoiler is removed, you can use the trigger phrase \"!spoilerthis \" to respoiler the post yourself. \n\nReport posts with images unspoiled that show any part of a human (skin, hair, etc). \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Chaotic_Beautiful",
        "body": "Do you think it'll work if I use it twice or thrice a week in my morning routine instead of every day ? My skin is oily combo sensitive 🥺.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "c1lwaq",
    "title": "Thoughts on these ingredients? SOME BY MI - AHA, BHA, PHA 30 Days Miracle Cleansing Bar",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/c1lwaq/thoughts_on_these_ingredients_some_by_mi_aha_bha/",
    "score": 7,
    "num_comments": 7,
    "created": "2019-06-17T10:23:19+00:00",
    "body": "I'm looking for a body soap/cleanser that is suitable for skin with eczema and acne. There seem to be a lot of extracts in this product but I'm not sure if they're in high enough concentrations to have any effect. Do you think I should give this soap a try?\n\n \n\n##### Major Ingredients:\n\nLauric Acid, Sodium Stearate, Saponified Palm Oil, Sodium Laurate, Sodium Myristate, Stearic Acid, Glycerin, Sorbitol, Lauramidopropyl Betaine, Sodium Hyaluronate, Niacinamide, Chlorella Vulgaris (Dermochlorella Algae) Powder, Triticum Vulgare (Wheat) Sprout Powder, Melaleuca Alternifolia (Tea Tree) Extract, Houttuynia Cordata Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Leontopodium Alpinum (Edelweiss) Extract, Olea Europaea (Olive) Fruit Oil, Argania Spinosa (Argan) Oil, Camellia Sinensis (Green Tea) Seed Oil, Hydrolyzed Adansonia Digitata (Baobab) Extract, Salix Alba (White Willow) Bark Extract, Centella Asiatica (Gotu Kola) Extract, Pyrus Malus (Apple) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Betula Platyphylla Japonica Bark Extract, Hydrolyzed Potato Protein, Hydrolyzed Wheat Protein, Hydrolyzed Rice Protein, Hydrolyzed Oat Protein, Lactobionic Acid, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Tetrasodium EDTA",
    "flair_text": "Discussion",
    "flair_template_id": "f5703f4a-459e-11e4-bd43-12313b0e84f5",
    "comments": [
      {
        "author": "chellebell13",
        "body": "I've had this cleansing bar for almost a year now! I feel like it's a great preventive step against acne, my skin responds well to tea tree, centella asiatica and licorice root. It's not my everyday cleanser, but I use it maybe 2-3 times a week as my second step cleanse. I like it, it lasts foreverrrr, suds up very mildly, doesn't leave my skin feeling stripped.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "feathereddinos",
        "body": "Saponified palm oil means it's soap, not a syndet (a solid cleanser made of synthetic detergents - like the Vanicream bar and CeraVe bar, which are much more gentler than soap and has low pH), so that means it will have a high pH, like \\~9-10. So I would advise against it, it's better to stick to a lower pH cleansers.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Badcatgoodcat",
        "body": "It has some ingredients that stand out as disconcerting. The first being palm oil. Aside from the environmental ethics of harvesting palm oil, it’s comedogenic. Following that, the chlorella powder; algae can be an acne trigger because of its iodine content. I’m not acne prone and, politics aside, the palm oil is enough to put me off to the product, due to its high comedogenic rating (4).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "getleyd_",
        "body": "I am waiting here, waiting for someone to say something about these...",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IsItBullshit",
    "post_id": "7re1so",
    "title": "Isitbullshit: Monat",
    "url": "https://www.reddit.com/r/IsItBullshit/comments/7re1so/isitbullshit_monat/",
    "score": 6,
    "num_comments": 5,
    "created": "2018-01-18T23:37:47+00:00",
    "body": "my mother recently purchased me a bottle of [MONAT](http://monatglobal.com/) shampoo, and told me about how its supposed to do all this magical mumbo jumbo to your hair. i checked out the website, and there were a few red flags i noticed, specifically the ridiculous usage of the word \"detox\" and several other large words i didnt understand. i did a google search and found many conflicting reviews. some swore by the stuff while others reported hair loss or hair damage from it. \n\nthe only other information i found was its ingredient list(taken from its official website):\n\n>Water (Aqua), Lauramidopropyl Betaine, Sodium C14-16 Olefin Sulfonate, Sodium Methyl Cocoyl Taurate, Sodium Cocoamphoacetate, Cinnamidopropyltrimonium Chloride, Stearyldimoniumhydroxypropyl Decylglucosides Chloride, Fragrance (Parfum), Guar Hydroxypropyltrimonium Chloride, Pisum Sativum (Pea) Extract, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Limnanthes Alba (Meadowfoam) Seed Oil, Crambe Abyssinica Seed Oil, Camellia Oleifera Seed Oil, Solanum Lycopersicum (Tomato) Seed Oil, Daucus Carota Sativa (Carrot) Seed Oil, Citrus Limon (Lemon) Peel Oil, Citrus Aurantifolia (Lime) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Adansonia Digitata Oil, Mauritia Flexuosa Fruit Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis Flower Extract, Moringa Oleifera Seed Oil, Caryocar Brasiliense Fruit Oil, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Dextran, Citric Acid, Cocamidopropyl Hydroxysultaine, Propanediol, Glycol Distearate, Sodium Hydroxypropylphosphate Decylglucoside Crosspolymer, Lauramide MIPA, Sodium Hydroxypropylphosphate Laurylglucoside Crosspolymer, Cocamidopropyl Betaine, Butylene Glycol, Amodimethicone, Trideceth-12, Cetrimonium Chloride, Benzoic Acid, Caprylyl Glycol, Benzyl Alcohol.\n\nit all seems very fishy to me, but i dont know enough about this to call bullshit or not. so is it bullshit?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "gameraisturtlemeat",
        "body": "It's a MLM/pyramid scheme company selling snake oil shampoo. If the shampoo had any actual curative properties it would sell itself.",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "hezamac1",
        "body": "my mom used to sell this stuff! in my experience it doesn't have any \"detoxing\" qualitys but it still is pretty good shampoo. the conditioner is really good as well, it makes. my hair super soft",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "CarolineTurpentine",
        "body": "This is one of the many MLMs that my crazy cousin is involved with but a few of my aunts have tried it and they do actually like Monat hair products, but they’re normally the cheapest drugstore brand type of people so I’m skeptical of how great the stuff actually is vs a good quality shampoo in its price range. None of them has had any dramatic results as far as I can tell so I wouldn’t bother.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1b4x2zf",
    "title": "What ingredient is making my scalp so hecking itchy?",
    "url": "https://www.reddit.com/r/curlyhair/comments/1b4x2zf/what_ingredient_is_making_my_scalp_so_hecking/",
    "score": 5,
    "num_comments": 17,
    "created": "2024-03-02T19:55:10+00:00",
    "body": "Hi curlies, I need some help troubleshooting. I feel like I have zero way to predict whether my scalp will like a shampoo or not; some with supposedly \"harsher\" ingredients work great for me and others that are \"gentler\" make me super dry and itchy! I have to stick to low-poo because my low-porosity, medium-thickness 2C hair gets weighed down really easily. I desperately want to experiment with new shampoos but I have no way of narrowing down which ones might work for me!!\n\nHere are some of the products I've tried, how my scalp liked them, and their ingredients.\n\nTHE BODY SHOP GINGER SHAMPOO - Somehow? this is the nicest of all the shampoos I've ever tried on my scalp?? I legitimately don't understand why, it's one of the only things that leaves my scalp feeling calm. I'd like to be able to use something else though because I know all the sulfates are probably really harsh on my curls.\n\nIngredients: Aqua/Water/Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Piroctone Olamine, Sodium Chloride, Citric Acid, Panthenol, Sodium Benzoate, Polysorbate 20, Propylene Glycol, Sodium Gluconate, Dimethicone Propyl PGBetaine, PEG-120 Methyl Glucose Dioleate, Guar Hydroxypropyltrimonium Chloride, Sodium Salicylate, Salix Alba Bark Extract/Salix Alba (Willow) Bark Extract, Parfum/Fragrance, Linalool, Limonene, Betula Alba Bark Extract, Zingiber Officinale Root Oil/Zingiber Officinale (Ginger) Root Oil, Citronellol, Citral, Isopropyl Alcohol, Benzyl Alcohol, sr-Spider Polypeptide-1, 1,2- Hexanediol, Caprylyl Glycol\n\n-\n\nPANTENE NUTRIENT BLENDS COMPLETE CURL CARE SHAMPOO - Made me unbearably itchy, red and flaky. The worst of the bunch.\n\nIngredients: Water, Lauramidopropyl Betaine, Sodium Cocoyl Isethionate, Fragrance, Citric Acid, Sodium Citrate, Polyquaternium-10, Sodium Benzoate, Sodium Salicylate, Tetrasodium EDTA, Acrylates Copolymer, Panthenol, Panthenyl Ethyl Ether, Histidine, Simmondsia Chinensis (Jojoba) Seed Oil\n\n-\n\nBRIOGEO SCALP REVIVAL MICRO-EXFOLIATING SHAMPOO - This one feels pretty good, but sometimes it leaves my hair feeling too \"squeaky clean\" and I'm not sure if I should be exfoliating my scalp every wash day. \n\nIngredients: Water/Aqua/Eau, Sodium Lauroyl Methyl Isethionate*, Cocos Nucifera (Coconut) Oil*, Glyceryl Stearate*, Glycerin*, Microcrystalline Cellulose*, Cocamidopropyl Betaine*, Sodium Methyl Oleoyl Taurate*, Sodium Cocoyl Isethionate*, Hydrogenated Castor Oil*, Lithium Magnesium Sodium Silicate, Panthenol, Xylitylglucoside*, Charcoal Powder*, Melaleuca Alternifolia (Tea Tree) Leaf Oil*, Mentha Piperita (Peppermint) Oil*, Zingiber Officinale (Ginger) Root Oil*, Mentha Viridis (Spearmint) Leaf Oil*, Anhydroxylitol*, Bisabolol, Menthyl Lactate*, Xylitol*, Polyquaternium-7, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Dehydroacetic Acid, Benzyl Alcohol, Fragrance (Parfum), Citric Acid*, Sodium Hydroxide\n\n-\n\nBRIOGEO BLOSSOM & BLOOM VOLUMIZING SHAMPOO (which I guess was recently discontinued?) - Feels pretty good as well, some itchiness.\n\nIngredients: Water, Sodium Cocoyl Isethionate*, Cocamidopropyl Hydroxysultaine*, Lauramidopropyl Betaine*, Glycerin*, Disodium Laureth Sulfosuccinate*, Polysorbate 80*, Sodium Lauryl Sulfoacetate*, Soyamidopropyldimethylamine Oxide*, Maltodextrin*, Biotin, Panthenol, Panax Ginseng Root Extract, Zingiber Officinale (Ginger) Extract, Zingiber Officinale (Ginger) Root Oil, Tocopheryl Acetate*, Aloe Barbadensis Leaf Juice, Argania Spinosa Kernel Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Citrus Tangerina (Tangerine) Peel Oil, Cocos Nucifera (Coconut) Oil, Lavandula Angustifolia (Lavender) Oil, Mentha Viridis (Spearmint) Leaf Oil, Santalum Album (Sandalwood) Oil, Sodium C14-18 Olefin Sulfonate*, Sodium Cocoyl Glutamate*, Sodium Lauroyl Sarcosinate*, Polyquaternium-7, Polyquaternium-71, Fragrance, Citric Acid, Benzyl Alcohol, Dehydroacetic Acid\n\n-\n\nBRIOGEO CURL CHARISMA SHAMPOO - Moderate itchiness on my scalp and also just way too heavy for my hair.\n\nIngredients: Water/Aqua/Eau, Lauramidopropyl Betaine*, Sodium Cocoyl Isethionate*, Glycerin*, Glycol Distearate*, Cocamidopropyl Hydroxysultaine*, Disodium Laureth Sulfosuccinate, Butyrospermum Parkii (Shea) Butter*, Oryza Sativa (Rice) Extract*, Rice Amino Acids*, Lactobacillus/Tomato Fruit Ferment Extract*, Persea Gratissima (Avocado) Oil*, Rosa Canina Fruit Oil*, Acanthus Mollis Leaf Extract*, Tocopheryl Acetate, Aloe Barbadensis Leaf Juice*, Keratin Amino Acids*, Coconut Acid*, Hydrolyzed Quinoa*, Sodium Hyaluronate*, Acyl Coenzyme A Desaturase*, Citrus Aurantium Dulcis (Orange) Peel Oil*, Citrus Paradisi (Grapefruit) Peel Oil*, Polyquaternium-71, Sodium Lauryl Sulfoacetate, Leuconostoc/Radish Root Ferment Filtrate*, Sodium Lauroyl Sarcosinate, Sodium Isethionate, Polyquaternium-7, Anhydroxylitol*, Xylitylglucoside*, Xylitol*, Fragrance (Parfum), Dehydroacetic Acid, Benzyl Alcohol",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "cantspellrestaraunt",
        "body": "You shouldn't be scared of sulfates, especially if you're low porosity. \n\nMy hair's low porosity (also protein sensitive), and sulfate shampoo is about the only way I can get life into it. If I didn't strip the excess gunk/protein from my hair, I wouldn't be able to get any moisture in. \n\nIt sounds counter intuitive, but shampoo has far more impact on the softness/health of my hair than conditioner ever has. \n\nSulfates effectively 'break' the surface tension of water, making it easier to get moisture between tight cuticles.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "krillemdafoe",
        "body": "While I definitely can’t and am not trying to diagnose you over the internet, do you think it’s possible you have dandruff? I noticed that the shampoos that don’t make you itchy happen to contain antifungal ingredients like piroctone olamine and tea tree oil",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "cuddlyasacactus",
        "body": "I’ll say this. I never had worse scalp issues than when I stopped using sulfates. It was both somehow greasy AND itchy and flaky. \n\nMaybe try a “harsher” shampoo for a while, focusing mostly on the scalp only, and see that helps.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "hxllbent_",
        "body": "I’m having the same problem!! The body shop ginger shampoo is the shampoo of dreams and the only thing that doesn’t make mine (and my partner’s) scalp crazy itchy. I’m happy to keep using that as my shampoo but I’ve been trying to work out what the ingredient that seems to make my scalp angry is so I can avoid it in other products, and I’m starting to think it could be polyquaternium 10 (or polyquaternium in general). The body shop shampoo doesn’t have it in, but I’ve tried the only curls cleanser & umberto giannini scalp restore and got really itchy both times - and they both have polyquaternium 10 in! It could just be complete coincidence though obviously! I’ve also found I get slightly itchy with boots extra firm mousse which has polyquaternium 16. \n\nI’ve also found that my hair feels instantly dry (as in not wet, not as in straw like) to the touch soon as the water isn’t on it when I’m washing it as if there is a film on it and that doesn’t happen with the body shop shampoo either. \n\nI could be completely off the mark here but I’ve never seen anyone else have the same issue!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "UnhingedLawyer",
        "body": "I’m guessing this is a combination of buildup and fragrance sensitivity. Try a fragrance free shampoo and a shampoo/scalp scrubber. FWIW, I struggle with itchy scalp and the As I Am scalp care co-wash is a godsend.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "igry5y",
    "title": "[Review]: Good Skin Days A New Leaf Cream Cleanser",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/igry5y/review_good_skin_days_a_new_leaf_cream_cleanser/",
    "score": 5,
    "num_comments": 4,
    "created": "2020-08-26T04:04:16+00:00",
    "body": "Good Skin Days A New Leaf Cream Cleanser\n\nIt’s hard to get excited about a cleanser. Some products will offer a slight uptick of hydration, others may provide a nice softening effect. But for the most part, I have found most of the cleansers I have used to fall into two simple categories...low pH and high pH (the latter being something I avoid). That’s really what I look for over anything else.\n\nOf course, there have been cleansers that have stood out to me by offering a bit more. My first love was the D’Alba Pidemont Peptide No-Sebum Cleanser which helped clear excess oil and sebum (it was my 2018 pick of the year). Others from brands like Peach & Lily, Solved Skincare, Make P:rem, and Rovectin helped to soothe my skin. And a few others just smelled good LOL. Glow Recipe, Sulwhasoo, and The Lotus offer products that added a sensorial experience to my cleansing step.\n\nThe Soko Glam Good Skin Days A New Leaf Cream Cleanser takes some of the qualities I mentioned above and takes things a step further.\n\nThis cream/gel hybrid cleanser impressed me pretty much from the initial application. The consistency is similar to other thick “sticky style” cleansers like the Then I Met You Soothing Tea Cleansing Gel and the Krave Beauty Matcha Hemp Hydrating Cleanser. But, there is a visible cloudy/creamy-ness to this product that makes it look a bit more intriguing.\n\nOne of the featured ingredients here is Green Tea Leaf Powder...which I love in the Inward Agas ACue Herbal Mask. Here though, they aren’t as concentrated and really just offer a pleasant appearance (at least for me).\n\nOther ingredients in the A New Leaf Cream Cleanser include Mugwort Extract, Green Tea Leaf Extract, and Celery Stem Extract.\n\nAside from the look of this product...the feel is even more impressive. Honestly, the thick/rich later that can be had from this cleanser is awesome. It’s been rare (in my experience) to get a foam so dense from a pH balanced product. Few others I have used make this happen but it’s a lovely surprise when it does.\n\nI had no issue taking my time massaging the lovely lather in...sometimes bringing the product down to my neck/chest just to enjoy the experience. A little bit goes a really long way here though. The smallest dollop/pea sized amount is sufficient for the whole face.\n\nOnce rinsed, the Good Skin Days A New Leaf Cream Cleanser leaves behind thoroughly cleansed skin...without being at all stripping. The lack of fragrance gives this product a “plain soap” scent that had me worried about the cleanser’s intensity...but that turned out to be a non-issue.\n\nIn addition to general cleansing, this product also delivered on its ability to calm/soothe the skin. The relatively high concentration of mugwort...while only on the skin for a short time...seems to pull through and reduce redness/irritation. Because of this, I found myself feeling comfortable in grabbing this product for not only my AM and PM routine...but also as a stand in for cleansing wipes after a workout or day spent hiking. \n\nAfter just about a month with the Good Skin Days A New Leaf Cream Cleanser...I am left feeling super impressed. To me, I see the Good Skin Days line as an excellent entry point into not only Soko Glam but K-Beauty in general (I’ll have my review for the moisturizer out very soon). The Prime Time Cleansing Toner wasn’t my cup of tea...but I know others will love it (some have already professed their love on the Soko Glam site).\n\nThis cleanser totally plays into that by offering a gentle/approachable use, awesomely dense lather, and a pretty great value. I am kind of a cleanser junkie so I’ll be continuing to test other products...but the Good Skin Days A New Leaf Cream Cleanser will be making it into several christmas gift bags for friends and family!\n\nFull Ingredients List: Aqua (Water, Eau), Glycerin, Potassium Cocoyl Glycinate, Lauramidopropyl Betaine, Hydroxypropyl Starch Phosphate, Acrylates Copolymer, Artemisia Capillaris Extract, Camellia Sinensis Leaf Extract, Camellia Sinensis Leaf Powder, Apium Graveolens (Celery) Stem Extract, Coptis Japonica Extract, Artemisia Princeps Leaf Powder, Brassica Oleracea Acephala Leaf Extract, Cichorium Intybus (Chicory) Leaf Extract, Brassica Oleracea Italica (Broccoli) Extract, Citric Acid, Potassium Cocoate, Sodium Chloride, Hydroxyacetophenone, Dipropylene Glycol, Caprylyl Glycol, Butylene Glycol, Gardenia Florida Fruit Extract, Maltodextrin, Dipotassium Glycyrrhizate, 1,2-Hexanediol\n\nWhere To Buy (Soko Glam $16.00 USD): [https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser](https://sokoglam.com/collections/water-based-cleansers/products/good-skin-days-a-new-leaf-cream-cleanser) \n\nPS: I have been incorporating the Foreo Luna 3 into my routine for a little over a week, and I want to include a little blurb at the end of each cleanser review to talk about how they played together. As for the Good Skin Days A New Leaf Cream Cleanser...it’s not something I would use with the Foreo.\n\nThe little bits of green tea (while pleasing to look at and have on the skin) tend to get caught in the little silicone touch points of the Foreo. I found myself taking just as much time picking/rinsing out the little pieces as I did actually cleansing my face lol! It ended up being kind of a hassle to the point that I set my Foreo aside for the last few days of this review.\n\nNow that I have finished my “testing time” with the Good Skin Days A New Leaf Cream Cleanser...I will be using what I have left to either decant into smaller bottles for friends or just as a body wash. I really want to bring the Foreo back into the fold and for that to happen I’ll need to switch to a different product.",
    "flair_text": "Review",
    "flair_template_id": "9297aa06-d015-11e3-b9a1-12313d18e5cd",
    "comments": [
      {
        "author": "Cutepengwing",
        "body": "This sounds amazing! May I ask what your skin type is?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/ig4zvs/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "iovbku",
    "title": "Herbal Essences Sulfate Free Shampoo - CG Friendly?",
    "url": "https://www.reddit.com/r/curlyhair/comments/iovbku/herbal_essences_sulfate_free_shampoo_cg_friendly/",
    "score": 4,
    "num_comments": 12,
    "created": "2020-09-08T15:11:43+00:00",
    "body": "Hi all,\n\nI noticed herbal essences have a new sulfate, paraben, paraffin and colourants free range that's got me quite curious. They're not typically known for being very CG friendly, but there aren't many options where I am for curly hair products so I had to check it out. \n\nI've listed the ingredients for the aloe & avocado oil shampoo below.\n\nIngredients/ingrédients: Lauramidopropyl Betaine, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Sodium Citrate, Citric Acid, Parfum, Sodium Benzoate, Sodium Salicylate, Polyquaternium-10, Tetrasodium EDTA, Limonene, Aloe Barbadensis Leaf Juice, Butylene Glycol, Histidine, Persea Gratissima Oil, Ecklonia Radiata Extract, Alcohol Denat.\n\nLauramidopropyl Betaine, Sodium Cocoyl Isethionate and Sodium Lauroyl Sarcosinate are the ingredients I'm most curious about. They appear to be quite gentle cleansers, but are they CG friendly?",
    "flair_text": "discussion",
    "flair_template_id": "8a0f6380-21dd-11e6-9e78-0ead3f7791ed",
    "comments": [
      {
        "author": "maxyt789",
        "body": "Tried the hemp version an it’s one of the best shampoos I’ve used first time I’ve had a fully flake free scalp in ages",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "LadyB5091",
        "body": "I have the Mango and Aloe and it cleans well without drying and smells nice. Not all the Herbal Essence Bio-Renew line is sulfate free, so check the label 😊",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7k5h31",
    "title": "[Product question] The cleanser that I loved is discontinued. Help!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7k5h31/product_question_the_cleanser_that_i_loved_is/",
    "score": 3,
    "num_comments": 6,
    "created": "2017-12-16T06:04:14+00:00",
    "body": "Hello all,   \nI was using Galderma's Benzac Skin Balancing Foaming Cleanser which had .5%SA and it was fragrance free. After not being able to find it anywhere I contacted them and it's no longer being manufactured and distributed in the US! I'm heartbroken and not sure where to turn.  \nHere are the ingredients: Salicylic Acid (0.5%). Purpose: Acne Treatment. Inactive Ingredients: Alcohol Denatured, Backhousia Citriodora Leaf Extract, Butylene Glycol, Caprylic/Capric Triglyceride, Citric Acid, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Citrus Reticulate (Tangerine) Peel Oil, Glycerin, Glycine Soja (Soybean) Oil, Lauramidopropyl Betaine, Lonicera Caprifolium (Honeysuckle) Flower Extract, Lonicera Japonica (Honeysuckle) Flower Extract, Phenoxyethanol, Polysorbate 80, Potassium Benzoate, Potassium Sorbate, Santalum Album (Sandalwood) Oil, Sodium Laurylglucosides Hydroxypropylsulfonate, Terminalia Ferdinandiana Fruit Extract, Tocopherol, Water.   \nDoes anyone know of a cleanser similar to this? It had a pH of 3.5-5.   \nI'm nervous about using a new cleanser because my skin is so sensitive and breaks out very easily. This cleanser has helped to clear my skin and calm it.   \nI would love to hear your suggestions. I looked at CosRx SA cleanser but that has such a high pH I'm worried it'll strip my skin.   \nThoughts?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Souliria",
        "body": "If you don't find anything that matches that ingredient lost, many dermatologists recommend cerave and cetaphil. Both with a foaming version and they're excellent.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "loloholmes",
        "body": "I just googled it and found people selling multipacks on ebay.com\nMight be worth buying one of those then you're stocked up for a while!",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "messenia",
        "body": "CeraVe's [Renewing Cleanser](http://www.cerave.com/Our-Products/Cleansers/Renewing-SA-Cleanser) has SA. You can get that almost anywhere.\n\nYou might also want to request some samples of [Paula's Choice Skin Balancing Cleanser](http://www.paulaschoice.com/skin-balancing-oil-reducing-cleanser/115.html).\n\n> but that has such a high pH I'm worried it'll strip my skin.\n\n3.5 is a rather low pH for a cleanser.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Quynh138",
        "body": "Copy and paste the ingredient list to google and hopefully some similar cleansers will come up. Good luck!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "pyfa8u",
    "title": "If a shampoo is sulfate free but still has a lot of suds and lather, is it color safe?",
    "url": "https://www.reddit.com/r/HairDye/comments/pyfa8u/if_a_shampoo_is_sulfate_free_but_still_has_a_lot/",
    "score": 3,
    "num_comments": 1,
    "created": "2021-09-30T08:07:15+00:00",
    "body": "To mantain my colorful hair I've been using a sulfate free shampoo for most of my washes unless I need to clarify my scalp.\nBut this shampoo (Loreal Low Poo) doesn't lather at all, it takes a lot of product and effort to wash my hair with it and it's not a nice experience overall (the hair look really good tho)\n\nAre sulfates the actual culprits of color fading? Or the suds themselves?\n\nI was thinking of trying Herbal Essences' Aloe and Avocado sulfates free shampoo but I'm not sure if this won't fade my color. \n\nThose are the ingredients(EU):\n\nAqua, Lauramidopropyl Betaine, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Sodium Citrate, Citric Acid, Parfum, Sodium Benzoate, Sodium Salicylate, Polyquaternium-10, Tetrasodium EDTA, Limonene, Aloe Barbadensis Leaf Juice, Butylene Glycol, Histidine, Persea Gratissima Oil, Alcohol Denat., Ecklonia Radiata Extract",
    "flair_text": ":txt: Question",
    "flair_template_id": "8e1f8a30-b3da-11e9-9adb-0efd305d1176",
    "comments": [
      {
        "author": "azssf",
        "body": "‘Color protection’ ( weaker/milder detergency) and foam are unrelated. Chemists add different surfactants  in different concentrations so that the shampoo is milder and it still foams. They do this bc culturally foam = cleaning.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "mtj7qu",
    "title": "[Misc] Can you use a Vitamin C cleanser before applying Retinol?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/mtj7qu/misc_can_you_use_a_vitamin_c_cleanser_before/",
    "score": 3,
    "num_comments": 3,
    "created": "2021-04-18T19:09:00+00:00",
    "body": "I have done some research on products that you can and cannot use when applying retinol and am curious about how it relates to cleansers (which stay on your face for ~1min vs creams that stay on). My cleanser has a few ingredients you are not supposed to mix with Retinol (e.g., Vitamin C) and I am wondering if it still okay to use my cleanser before applying Retinol or if I should consider looking for another cleanser without those ingredients. \n\nFor reference my night time routine is shower > cleanse > ROC correxion Retinol night cream  > moisturize \n\n\nMy cleanser is: Earth to Skin Super Greens Nourshing Face Cleanser\n\nEarth to Skin Super Greens Nourshing Face Cleanser, 4.74 oz.\nExclusive Broccoli-Cucumber-Kale Complex instantly rejuvenates and replenishes skin with Vitamins A, Vitamin C, Vitamin K, Iron and anti-oxidants; known to protect skin from free-radicals that cause skin damage.\nHydrating cleanser is loaded with rich Glycerin, known to draw in water, replenish and retain moisture by creating a protective skin barrier Added Aloe Vera helps to replenish the signs of fatigue, aging and stress. \n\nActive Ingredients: Water ((Aqua)Eau), Coco-Glucoside, Glycerin, PEG-7 Glyceryl Cocoate, Lauramidopropyl Betaine, Sucrose, Acrylates/Steareth-20 Methacrylate Copolymer, PEG-150 Pentaerythrityl Tetrastearate, Cucumis Sativus (Cucumber) Fruit Water, Brassica Oleracea Italica (Broccoli) Extract, Brassica Oleracea Acephala Leaf (Kale) Extract, Bioflavonoids, Phenoxyethanol, Fragrance(Parfum), PEG-6 Caprylic/Capric Glycerides, Sodium Chloride, Aminomethyl Propanol, Xanthan Gum, Caprylyl Glycol, Benzophenone-9, Disodium EDTA, Propanediol, Yellow 5 (CI 19140), Aloe Barbadensis Leaf Extract, Leuconostoc/Radish Root Ferment Filtrate, Blue 1 (CI 42090), Red 4 (CI 14700), Sodium Benzoate, Citric Acid, Potassium Sorbate",
    "flair_text": "Miscellaneous",
    "flair_template_id": "56f33ba0-35e0-11e5-9715-0ee61c357d3b",
    "comments": [
      {
        "author": "valkyriion",
        "body": "This so bizarre. There are no stabilized forms of vitamin C in the ingredients anyway. Vitamin C comes in a lot of different forms, some more effective than others. I assume the description is referring to the Bioflavonoids for the vitamins it says are included. Ironically, Vitamin A (which this includes) can refer to retinol as well.\n\nIn any event, there is no reason that you can't use vitamin C and retinol together in the same routine (other than potential irritation). ([Source](https://www.paulaschoice.com/expert-advice/skincare-advice/retinol/five-retinol-myths-busted.html?p=EXTRA&gclid=Cj0KCQjwse-DBhC7ARIsAI8YcWJroh5xN2WPozQG-_E9ZKhnT5YsOWX4czoAvaXiGEDC48pS9D_5i64aAha2EALw_wcB&gclsrc=aw.ds)) ([Source](https://pubmed.ncbi.nlm.nih.gov/15767769/)) ([Source](https://www.thezoereport.com/beauty/can-you-use-retinol-vitamin-c-together-18700288))\n\nInterestingly, one study even found combining vitamin C and retinol actually increased their effectiveness.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "ReaLitTea",
        "body": "Yes you can since it’s wash off and should not affect the retinol",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "doggrooming",
    "post_id": "m99c5u",
    "title": "Best oat shampoo? (Eastern EU edition)",
    "url": "https://www.reddit.com/r/doggrooming/comments/m99c5u/best_oat_shampoo_eastern_eu_edition/",
    "score": 4,
    "num_comments": 2,
    "created": "2021-03-20T15:32:08+00:00",
    "body": "Hi!\n\nMy dog Truffle (10 months old) recently got flaky skin. First it was only on her groin, but now she got it on the rest of the body too - basically it looks like dandruff. \n\nI took Truffle to the dermatologist and she told me its nothing serious and to wash her with an oat shampoo. She recommended me one but it has SLS and I'm not sure about using it - is it not that good for hair and skin as it is with humans? I also found few different ones, but I don't think I know enough about dog hair and skin to pick the best one. \n\nI figured itd be best to ask professionals, I hope it's not a bad place to ask this question. Could you please help me choose one that won't make her condition worse and hopefully help soothe it?\n\nI'll post the ingredients as I'm from Poland so there's a very small choice of oat dog shampoos and I don't have access to most imported ones.\n\nSoap 1, recommended by the vet - dr Seidel shampoo with Oat and aloe Vera extracts (I'm not sure if I can use it because of SLS):\n\nAqua; Sodium Laureth Sulfate; Disodium Laureth Sulfosuccinate; Lauryl Glucoside; Avena Sativa (Oat) Kernel Extract; Ricinus Communis (Castor) Seed Oil; PEG-7 Glyceryl Cocoate; Lauramidopropyl Betaine; Aloe Barbadensis Leaf Extract; Allantoin; Panthenol; Urea; Lanolin; Sodium Chloride; Sodium Benzoate.\n\nSoap 2, bar soap made in Poland which smells of roses and contains oatmeal\n\nAqua, Elaeis Guineesis Oil, Cocos Nucifera Oil, Olea Europaea Fruit Oil, Sodium Hydroxide, Ricinus Communis Seed Oil, Theobroma Cacao Seed Butter*, Butyrospermum Park Butter*, Avena sativa Kernel Flour, Pelargonium Graveolens Flower Oil; Geraniol Linalool, Citral, Limonene**\n\nSoap 3, also bar soap made in Poland, with honey and oatmeal (ingredienta list is from translator because it's really vague and incomplete in Polish, sorry)\n\ncoconut oil shampoo ingredients, honey, panthenol (provitamin B5), sodium lactate, cocoa butter, cetyl alcohol (fatty alcohol), tamanu oil, oatmeal, baking soda, preservative\n\n\nSoap 4, John Paul Pet Oatmeal Shampoo\n\nWater, Sodium Laureth Sulfate, Cocamide MIPA, Cocamidopropyl Betaine, Sodium Chloride, Aloe Barbadensis Leaf Juice, Chamomilla Recutita (Matricaria) Flower Extract, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Hydrolyzed Oat Protein, Butylene Glycol, Citric Acid, Phenoxyethanol, Magnesium Chloride, Magnesium Nitrate, Methylchloroisothiazolinone, Methylisothiazolinone, Fragrance (Parfum), Yellow 5 (CI 19140).\n\nSoap 5, bio-groom natural Oatmeal soothing anti-itch shampoo\n\n2% (RAW) Colloidal Oatmeal USP, Purified Water, Cleansers Derived from Regrowable and 100% Biodegradable sources of Corn, Coconut and Palm Kernel Oils, Organic Amphoteric, Decyl Glucoside, Disodium Cocoamphodiacetate, Sodium Laureth Sulfate, Lauramidopropyl Betaine, Bishydroxyethyl Dihydroxypropyl Stearammonium Chloride, Cocomide DIPA, Vegetable Glycerine, Aloe Vera, Citric Acid, Rainfall Fragrance, Phenoxyethanol, MIT\n\nSoap 6, Beleko dog shampoo oats\n\nAqua, Glycerin, Cocamidopropyl, Betaine, Sodium Lauroyl Sarcosinate, Sodium Lauryl Sulfoacetate, Hydrolyzed Silk, Hydrolyzed Wheat Protein, Collagen Amino Acids, Bisabolol, Avea Sativa Kernel Extract, Lavandula Officinalis Flower Oil, Juniperus Communis Fruit Oil, Melaleuca Alternifolia Leaf Oil, Lactic Acid, Sodium Benzoate, Potassium Sorbate\n\nSoap 7, Wahl Oatmeal Essense Shampoo\n\nAqua (Water),\nSodium Laureth Sulfate,  Cocamidopropyl Betaine,  Sodium Chloride,  Glycol Distearate,  Parfum (Fragrance),  Coumarin, Cocos Nucifera (Coconut) Extract,  Prunus Amygdalus Dulcis (Sweet Almond) Oil,  Cocamide MEA,  Amodimethicone,  Laureth-10,  Hydrolyzed Oat Protein,\nGuar Hydroxypropyltrimonium Chloride, Trideceth-12, Cetrimonium Chloride, Citric Acid, Sodium Benzoate, Methylchloroisothiazolinone, Methylisothiazolinone\n\nThat's all the ones that I found in Poland. Eventually I can order one from Amazon.de if there's something better. \n\nThanks for all answers, tips and advices in advance!!!!\n\n(Inb4 she can't be supplemented with anything other than probiotics for at least a month because she's on strong antibiotics and an elimination hypoallergenic diet)\n\n[View Poll](https://www.reddit.com/poll/m99c5u)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "xsnow-ponyx",
        "body": "I was going to recommend Wahl Oatmeal when I saw this, my dog has itchy skin and this shampoo really helped her, use it in my salon with all the sensitive skin dogs and it works great. Make sure to dilute it properly though, 15:1 (water to shampoo) dilution rate",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "11btww6",
    "title": "Is Lauramidopropyl Betaine a strong enough surfactant for a clarifying wash?",
    "url": "https://www.reddit.com/r/NoPoo/comments/11btww6/is_lauramidopropyl_betaine_a_strong_enough/",
    "score": 3,
    "num_comments": 4,
    "created": "2023-02-25T19:50:59+00:00",
    "body": "The only shampoo I already own with no silicones or plastics uses Lauramidopropyl Betaine as it's surfactant. I'm wondering if that will work for my onetime clarifying wash, or if I need to go buy another shampoo.\n\nHere's the ingredient list in case you see something else in there I should be concerned about. Thanks!\n\n> Water, Aloe Vera Leaf Juice, Decyl Glucoside, Lauramidopropyl Betaine, Caffeine, Biotin, Cornmint Oil, Eucalyptus Leaf Oil, Phenoxyethanol, Ethylhexylglycerin, Xanthan Gum, Citric Acid.",
    "flair_text": "Troubleshooting (HELP!)",
    "flair_template_id": "427aea9e-bea4-11eb-abf5-0ed12a1a3c6b",
    "comments": [
      {
        "author": "shonaich",
        "body": "It may remove some of it, but since it is a gentle low-poo detergent, it would not be reliable.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Welcome! If you're new, get started here: [Natural Haircare Quick Start Guide](https://www.reddit.com/r/NoPoo/wiki/index/quickstart) \n\nPlease answer the following questions to help us help you. \n\nDo you have hard water? If you don't know what it is, there's an [article in the wiki](https://www.reddit.com/r/NoPoo/wiki/index/hardwater) that discusses it. \n\nWhat is the porosity of your hair? If you don't know, there's a quiz linked in the sidebar. \n\nHow long have you been doing nopoo? \n\nNo-poo can mean many different things. Describe in detail how you wash your hair. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoPoo) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nini_1993",
        "body": "https://incidecoder.com/",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thebouncingcupcake",
        "body": "No.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "b5wgub",
    "title": "Has any one tried Briogeo Curl Charisma?",
    "url": "https://www.reddit.com/r/curlyhair/comments/b5wgub/has_any_one_tried_briogeo_curl_charisma/",
    "score": 2,
    "num_comments": 7,
    "created": "2019-03-26T22:44:13+00:00",
    "body": "Was wondering if anyone has tried these products, there seems to be a good deal on their full size product kits online.\n\n**Curl Charisma Essentials Kit Includes:**\n\n* 8oz Curl Charisma Rice Amino + Avocado Hydrating Shampoo\n\n* 8oz Curl Charisma Rice Amino + Shea Curl Defining Conditioner\n\n* 6oz Curl Charisma Rice Amino + Avocado Leave In Defining Creme\n\n* 5.5oz Curl Charisma Rice Amino + Quinoa Frizz Control Gel ^ \n\n\n**Ingredients:**\n\n*Curl Charisma™ Rice Amino + Avocado Hydrating Shampoo:*\n\n* Water/Aqua/Eau, Cocamidopropyl Hydroxysultaine, Sodium Cocoyl Isethionate, Lauramidopropyl Betaine, Glycerin, Glycol Distearate, Disodium Laureth Sulfosuccinate, Polysorbate 80, Sodium Lauryl Sulfoacetate, Soyamidopropyldimethylamine Oxide, Sodium Lauroyl Sarcosinate, Butyrospermum Parkii (Shea) Butter, Oryza Sativa (Rice) Amino Acids, Lactobacillus/Solanum Lycopersicum (Tomato) Ferment Extract, Persea Gratissima (Avocado) Oil, Rosa Canina Fruit Oil, Acanthus Mollis Leaf Extract, Tocopheryl Acetate, Aloe Barbadensis Leaf Juice, Keratin Amino Acids, Sodium Hyaluronate, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Santalum Album (Sandalwood) Oil, Pogostemon Cablin Oil, Juniperus Virginiana Oil, Cananga Odorata Flower Oil, Xyitylglucoside, Anhydroxylitol, Xylitol, Sodium C14-16 Olefin Sulfonate, Acyl Coenzyme A Desaturase^ , Polyquaternium-71, Leuconostoc/Radish Root Ferment Filtrate, Fragrance (Parfum), Polyquaternium-7, Citric Acid, Dehydroacetic Acid, Benzyl Alcohol ^ Coconut, vegetable, or plant derived\n\n*Curl Charisma Conditioner:*\n\n* Water, Cetyl Alcohol, Stearyl Alcohol, Glycerin, Brassicyl Isoleucinate Esylate, Brassica Alcohol, Cetyl Esters, Isopropyl Myristate, Caprylic/Capric Triglyceride, Oryza Sativa (Rice) Amino Acids, Butyrospermum Parkii (Shea) Butter, Helianthus Annuus (Sunflower) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Lactobacillus/Solanum Lycopersicum (Tomato) Ferment Extract, Acanthus Mollis Leaf Extract, Bambusa Vulgaris (Bamboo) Extract, Ocimum Basilicum (Basil) Leaf Extract, Citrus Aurantium Dulcis (Orange) Flower Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Santalum Album (Sandalwood) Oil, Vanilla Planifolia Fruit Extract, Citrus Tangerina (Tangerine) Peel Oil, Cananga Odorata Flower Oil, Rosa Canina Fruit Oil, Tocopheryl Acetate, Panthenol, Aloe Barbadensis Leaf Juice, Keratin Amino Acids, Algae Extract, \n\n*Curl Charisma Leave-In Creme:*\n\n* Water, Polyquaternium-37, Oryza Sativa (Rice) Amino Acids, Hydrolyzed Quinoa, Persea Gratissima (Avocado) Oil, Glycine Soja (Soybean) Oil, Lactobacillus/Solanum Lycopersicum (Tomato) Ferment Extract, Aloe Barbadensis Leaf Juice, Tocopheryl Acetate^ , Panthenol, Citric Acid, Hydrolyzed Keratin, Sorbitol, Keratin Amino Acids, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Santalum Album (Sandalwood) Oil, Vanilla Planifolia Fruit Extract, Citrus Tangerina (Tangerine) Peel Oil, Cananga Odorata Flower Oil, Stearoyl Coa-Desaturase (SCD-1)^ , Stearamidopropyl Dimethylamine^ , Fragrance, PPG-1 Trideceth-6, Polyquaternium-10, Polyquaternium-72, Propylene Glycol Dicaprylate/Dicaprate^ , Dehydroacetic Acid, Benzyl Alcohol. ^ Coconut, Vegetable, Plant, Or Sugar Derived.\n\n*Curl Charisma Leave-In Gel:*\n\n* Water, Polyquaternium-37, Oryza Sativa (Rice) Amino Acids, Hydrolyzed Quinoa, Persea Gratissima (Avocado) Oil, Glycine Soja (Soybean) Oil, Lactobacillus/Solanum Lycopersicum (Tomato) Ferment Extract, Aloe Barbadensis Leaf Juice, Tocopheryl Acetate^ , Panthenol, Citric Acid, Hydrolyzed Keratin, Sorbitol, Keratin Amino Acids, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Santalum Album (Sandalwood) Oil, Vanilla Planifolia Fruit Extract, Citrus Tangerina (Tangerine) Peel Oil, Cananga Odorata Flower Oil, Stearoyl Coa-Desaturase (SCD-1)^ , Stearamidopropyl Dimethylamine^ , Fragrance, PPG-1 Trideceth-6, Polyquaternium-10, Polyquaternium-72, Propylene Glycol Dicaprylate/Dicaprate^ , Dehydroacetic Acid, Benzyl Alcohol. ^ Coconut, Vegetable, Plant, or Sugar Derived\n\n\n\n\n",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Get_M_A_D",
        "body": "The rice amino gel stuff is amazinggggggg",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "713te4",
    "title": "[Product Question] Kate Somerville",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/713te4/product_question_kate_somerville/",
    "score": 1,
    "num_comments": 3,
    "created": "2017-09-19T15:41:45+00:00",
    "body": "Hi all, I am wondering everyone's thoughts on Kate Somerville products. I have been using her products for 6 months now and seems to work. I have sensitive/combination skin and sometimes redness on my chin. I live in Florida and am 27 and on the pill. The products I use now seem to help however I do notice sometimes my face gets dry and slightly flaky. Wondering if I should stick with her products or if there's something else more effective. Skin goals are anti aging and staying healthy and moisturized. Recommendations for other products are welcome!\n\nBelow are the 3 products I currently use with the ingredients:\n\n1. Gentle daily wash/cleanser- \nFull Ingredients\nWater/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, PEG/PPG-8/3 Diisostearate, Glycerin, Cocamidopropyl Betaine, Acrylates Copolymer, Silicone Quaternium-8, Butylene Glycol, Yucca Schidigera Leaf/Root/Stem Extract, Salvia Officinalis (Sage) Leaf Extract, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Lavandula Angustifolia (Lavender) Oil, Quillaja Saponaria Bark Extract, Sodium Chloride, Disodium EDTA, Sodium Hydroxide, Potassium Sorbate, Sodium Benzoate, Zinc PCA, Saponins, Chlorphenesin, Citric Acid\n\n2. Goat milk moisturizer-\nFull Ingredients\nWater/Aqua/Eau, Ethylhexyl Palmitate, Myristyl Myristate, Glyceryl Stearate, PEG-100 Stearate, Cetearyl Ethylhexanoate, Decyl Oleate, Glycerin, Propanediol, Goat Milk Powder/Caprae Lac Powder/ Poudre de lait de chèvre, Lactose, Milk Protein/Lactis Proteinum/Protéine du Lait, Helianthus Annuus (Sunflower) Seed Oil, Hamamelis Virginiana (Witch Hazel) Flower Water, Cocos Nucifera (Coconut) Oil, Persea Gratissima (Avocado) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Aloe Barbadensis Leaf Juice Powder, Oryza Sativa (Rice) Bran Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Tocopheryl Acetate, Tocopherol, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Phenoxyethanol, Ethylhexylglycerin, Hexylene Glycol, Xanthan Gum, Aminomethyl Propanol, Disodium EDTA, Lactic Acid, Benzoic Acid\n\n3. ExfoliKate Cleanser-\nFull Ingredients\nWater/Aqua/Eau, Stearic Acid, Sodium Cocoyl Glycinate, Lauramidopropyl Betaine, Glycerin, Hydroxypropyl Starch Phosphate, Cetearyl Phosphate, Xylitylglucoside, Dimethicone PEG-8 Meadowfoamate, Anhydroxylitol, Xylitol, Leuconostoc/Radish Root Ferment Filtrate, Bromelain, Papain, Lactobacillus/Pumpkin Fruit Ferment Filtrate, Lauramide DIPA, Aloe Barbadensis Leaf Juice Powder, Lactic Acid, Glycolic Acid, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Aniba Rosaeodora (Rosewood) Wood Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Geranium Maculatum Oil, Benzyl Alcohol, Sodium Hydroxide, Chlorphenesin, Chlorophyllin-Copper Complex (CI 75810), Maltodextrin\n\n",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "SamanthaSick",
        "body": "I used their facial oil for a while, it was nice but I didn't find the price tag worth it",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskDocs",
    "post_id": "fugitp",
    "title": "I'm 27F who gets contact dermatitis from DMAPA and some other skin condition and I'm not sure if prebiotic soap is safe to use.",
    "url": "https://www.reddit.com/r/AskDocs/comments/fugitp/im_27f_who_gets_contact_dermatitis_from_dmapa_and/",
    "score": 1,
    "num_comments": 4,
    "created": "2020-04-03T21:07:32+00:00",
    "body": "Like I said in the title, I'm 27F and I have a contact allergy to DMAPA (dimethylaminopropylamine) and was told to avoid products containing ingredients like Cocamidopropyl Betaine, Lauramidopropyl Betaine and other similarly named products.\n\nAt the start of the lockdown in NY, I went to the store to buy soap and couldn't find anything in what was leftover that wouldn't cause a rash except for Tom's of Maine's Prebiotic hand soap, which I bought because I thought having any soap with this virus going around is better than nothing. I have other skin conditions that I didn't get a chance to finish having diagnosed before this whole thing began and have rashes all over my scalp, behind/in my ears, and on my eyelids.   \n\n\nI'm about to run out of the soap I normally use (Dial anti-bacterial hand soap that didn't have Cocamidopropyl Betaine in it) and I'm unsure what \"prebiotic\" means and if this is a bad idea to use with a virus going around and who knows what skin condition I have going on with my face and scalp. \n\n&#x200B;\n\nBtw I did some searching online and could only find articles that were more cosmetic than scientific in nature without any references to any studies to back them up which is why I'm concerned about using this product.",
    "flair_text": "Physician Responded",
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for your submission. **Please note that a response does not constitute a doctor-patient relationship.** This subreddit is for informal second opinions and casual information. The mod team does their best to remove bad information, but we do not catch all of it. Always visit a doctor in real life if you have any concerns about your health. Never use this subreddit as your first and final source of information regarding your question. By posting, you are agreeing to our [Terms of Use](https://www.reddit.com/r/AskDocs/wiki/terms_of_use) and understand that all information is taken at your own risk.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskDocs) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Itchdoc",
        "body": "This product has multiple potential allergens in it and the prebiotic (total pseudoscientific marketing) is:  [https://en.wikipedia.org/wiki/Inulin](https://en.wikipedia.org/wiki/Inulin). That being said, it is unlikely to contain DMAPA. Although not hypoallergenic, you are likely to be fine using it. BTW, I complement the doc that documented your allergy to this somewhat obscure ingredient.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_jamesgamble083",
    "post_id": "dw7ril",
    "title": "Global Lauramidopropyl Betaine Market Witness Significant Revenue Growth Through to 2024",
    "url": "https://www.reddit.com/r/u_jamesgamble083/comments/dw7ril/global_lauramidopropyl_betaine_market_witness/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-14T10:35:58+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "164wxmf",
    "title": "Question about coconut derived products.",
    "url": "https://www.reddit.com/r/Hair/comments/164wxmf/question_about_coconut_derived_products/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-08-29T22:41:29+00:00",
    "body": "So personally, coconut oil in hair products absolutely destroys my hair. I have to stay far far away from it. It will become incredibly brittle, frail, and prone to breakage. \n\n&#x200B;\n\nI've found Lauramidopropyl Betaine, Sodium Cocoyl Isethionate, and Sodium Lauroyl Sarcossinate in a shampoo I just bought and had used twice. I was wondering what \"Derived from plant oils\" meant exactly.\n\n&#x200B;\n\nUpon looking it up, all of these cleansers are derived from Coconut / Coconut oil. Would it be safe to assume this will have a similar affect that coconut oil does on my hair, and to not use it? Thanks in advance to any insight on this topic!",
    "flair_text": "Question",
    "flair_template_id": "8ca8c0c4-19ec-11e8-a6e5-0ed094bb9d2e",
    "comments": [
      {
        "author": "metaphoricmoose",
        "body": "Sounds like you might have an allergy to it",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1bulcsp",
    "title": "[acne] I can't find a surfecant that doesn't break me out. ",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1bulcsp/acne_i_cant_find_a_surfecant_that_doesnt_break_me/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-04-03T06:07:55+00:00",
    "body": "I've been trialing shampoos for a while and they all cause acne on my neck, hairline, and side of my face that I sleep on.\n\nI only don't get acne in these places when I don't use shampoo and then as soon as I use it, within a week then acne develops. \n\nThis is what ti recently used and got the acne. I'm not sure what to do.  And if there is a such a thing as a surfecant free shampoo? \n\nNot sure if it's another ingredient. Trying to figure it out. I know that Butelyn Glycol irritates my skin, but that's not in this. \n\nWater/Eau, Sodium Cocoyl Isethionate, Lauramidopropyl Betaine, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Fragrance/Parfum, Honey Extract/Extrait de Miel, Niacinamide, Aloe Barbadensis Leaf Juice, Histidine, Sodium Benzoate, Polyquaternium-10, Sodium Salicylate, Sodium Citrate, Citric Acid, Tetrasodium EDTA\n\n",
    "flair_text": "Acne",
    "flair_template_id": "635ca28e-d0cc-11e3-a662-12313b08b431",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]