[
  {
    "subreddit": "SkincareAddiction",
    "post_id": "5oxhp4",
    "title": "[Product Question] January Labs Moisture Balancing Lotion?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/5oxhp4/product_question_january_labs_moisture_balancing/",
    "score": 4,
    "num_comments": 1,
    "created": "2017-01-19T16:22:58+00:00",
    "body": "I recently ordered this from Cult Beauty and it has good reviews but I'm wondering what SCA thinks about the ingredients in this product. It claims to be \"gentle, plant-based day cream that’s pure, efficacious and uncomplicated.\" I have dehydrated, oily, clogged skin btw. Will this break me out? \n\nIngredients:\nWater , C12-15 Alkyl Benzoate, Squalane, Glyceryl Stearate , Cetyl Alcohol , Organic Aloe Vera Leaf Juice, Sunflower Oil, Polysorbate-60, Organic Cranberry Seed Oil, Organic Avocado Oil, Organic Olive Oil, Evening Primrose Extract, Linseed Seed Oil, Organic Cucumber Fruit Extract, Organic Shea Butter, Starflower Seed Oil, Argan Oil, Palmitoyl Tripeptide-5, Caprylic/Capric Triglyceride, Behenyl Alcohol, Stearic Acid, Ethylhexylglycerin, Palmitoyl Oligopeptide, Palm Oil, Palmitoyl Tetrapeptide-3, Tetrahydroxypropyl Ethylenediamine, Carbomer, Jojoba Seed Oil, Sesame Seed Oil, Shea Butter Fruit, Avocado Oil, Lime Oil, Goji Berry, Chamomile Extract, Green Tea Leaf Extract, Sodium Hydroxymethylglycinate.",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "EvangelineG",
        "body": "I was just looking at this product the other day. It has some really nice  beneficial ingredients. I am not a fan of palm oil or having citrus oils in my products, so it was a pass for me, but it may work for you. I would make sure to wear daily SPF if you are using this during the AM, if you aren't already, since citrus oils are photosensitizing.\n\nAs far as whether or not it will break you out- any product can break anyone out. Certain skin won't do well with some of the oils or the shea butter, but others would be fine. All you can do is try it and see. I would patch test it for a couple of weeks before introducing it to your whole face.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "mj72yd",
    "title": "[Product Question] Has anyone tired the Coola Cucumber Mineral SPF30?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/mj72yd/product_question_has_anyone_tired_the_coola/",
    "score": 3,
    "num_comments": 5,
    "created": "2021-04-03T11:55:08+00:00",
    "body": "Has anyone tried [this](https://www.cultbeauty.co.uk/coola-classic-face-spf-30-cucumber.html?utm_source=Salesforce&utm_medium=Email&utm_campaign=WL_Backinstock_split_A&SubKey=613700)?\n\nI’m looking for a mineral/physical sunscreen for very very sensitive and dry skin. Currently ordered the Inkey List SPF, but the ingredients on this look good as well. Tried the search bar but not finding anything. \n\nIngredients \n\nCyclopentasiloxane, Polysilicone-11, Isopropyl Myristate, Stearalkonium Hectorite, Dimethiconecrosspolymer, Polyamide-5, Titanium Dioxide, Glycerin, Cucumis Sativus (Cucumber) Fruit Extract, Aqua/Water/Eau, Zinc Oxide (Ci 77947), Silica Silylate, Propylene Carbonate, Aluminum Hydroxide, Hydrogen Dimethicone, Butyrospermum Parkii (Shea) Butter, Rosa Canina Seed Extract, Linum Usitatissimum Seed Oil, Oenothera Biennis (Evening Primrose) Oil, Plankton Extract",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "susieq2019",
        "body": "I really liked this, but I didn’t repurchase because of the price. There are so many drugstore options that work just as good. It also has a matte finish so I don’t know if it will be compatible with someone with very dry skin.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "9lxthb",
    "title": "Thoughts on Aunt Jackie's Don't Shrink Flaxseed Gel?",
    "url": "https://www.reddit.com/r/curlyhair/comments/9lxthb/thoughts_on_aunt_jackies_dont_shrink_flaxseed_gel/",
    "score": 2,
    "num_comments": 3,
    "created": "2018-10-06T17:40:52+00:00",
    "body": "I got a sample packet of Aunt Jackie's Don't Shrink Flaxseed Elongating Gel. I've used it three times (third time is drying as I type). I liked it the first two times - pretty good curl definition, mildish frizz, fine smell. I have thick 2C/3A ish hair for reference. \n\nAnyone have thoughts on this product? Have you used it? What does Flaxseed do? Is it CG friendly?  \n\nSee here: auntjackiescurlsandcoils.com/product/dont-shrink/\n\nIngredients: \nAqua, Glycerin, Carbomer, Aminomethyl Propanol, Phenoxyethanol,Polyvinylpyprrolidone, Polysorbate-20,Hydrolyzed Wheat Protein, Parfum, Ethylhexylglycerin, Tetrasodium EDTA, Sodium Hydroxide, Sodium Glycolate, Potassium Sorbate, Linum Usitatissimum Seed Oil, Polyaminopropyl Biguanide, Tocopherl, Limonene, Hexyl Cinnamal, Linalool, Amyl Cinnamal, Butylphenyl Methylpropional.\n\nThanks all!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "shelchang",
        "body": "From that ingredient list, it looks like a tiny amount of flaxseed oil in what is otherwise a regular hair gel (it's listed lower than the preservatives, so we're looking at <1%). But nothing else jumps out as non-CG friendly.\n\nI just tried some homemade flaxseed gel (made by boiling flaxseeds in water) on my hair and I really liked it as a curl enhancer. But this looks like a conventional PVP based hair gel with just enough flax oil in it that they can call it a \"flaxseed gel\" for marketing purposes.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "naturellecosmetics",
    "post_id": "58z2tq",
    "title": "Benefits Of Linum Usitatissimum Seed Oil Use In Natural Skin Care",
    "url": "https://www.reddit.com/r/naturellecosmetics/comments/58z2tq/benefits_of_linum_usitatissimum_seed_oil_use_in/",
    "score": 1,
    "num_comments": 0,
    "created": "2016-10-23T15:37:38+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beautyblogs",
    "post_id": "58z2s5",
    "title": "Benefits Of Linum Usitatissimum Seed Oil Use In Natural Skin Care",
    "url": "https://www.reddit.com/r/beautyblogs/comments/58z2s5/benefits_of_linum_usitatissimum_seed_oil_use_in/",
    "score": 1,
    "num_comments": 0,
    "created": "2016-10-23T15:37:19+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddicts",
    "post_id": "1ivhk74",
    "title": "Choose between two products",
    "url": "https://www.reddit.com/r/SkincareAddicts/comments/1ivhk74/choose_between_two_products/",
    "score": 1,
    "num_comments": 4,
    "created": "2025-02-22T12:22:11+00:00",
    "body": "Hi eveveryone.\n\nI have recently been to an aesthetician, where she did microdermabrasion.   \nShe sold me pHformula P.O.S.T Recovery Cream.\n\nI have a lot of blackheads, and sebacious fillaments along with sundamage.\n\nLooking at the ingredientlist i see:  \nAqua (Water), Cetearyl Alcohol, Panthenol, Cyclopentasiloxane, Niacinamide,ButyrospermumParkii butter, Glycerin, Prunus Amygdalus Dulcis oil, Gossypium Herbaceum Seed oil, Linum Usitatissimum Seed oil, Phenoxyethanol, Lactobionic acid, Aloe Barbadensis Leaf Juice, Sodium Cetearyl Sulfate, Sodium Lauryl Sulfate, Glycyrrhetinic acid, Triethanolamine, Bisabolol, Lecithin, Ethylhexylglycerin, PEG-8, Tocopherol, Sodium Hyaluronate, Ascorbyl Palmitate, Potassium Sorbate, Sodium Benzoate, Ascorbic acid, Citric acid.\n\nI've tried to run it by [https://acneclinicnyc.com/pore-clogging-ingredients/](https://acneclinicnyc.com/pore-clogging-ingredients/), and there is only one potential clogging ingredient which is shea butter.  \nI also found out that's a 2 out of 5 on clogging scale.\n\nUsually i do not tolerate niacinamid and pathenol, but i thought perhaps she knew what is best for me having seen my skin.\n\nBefore i went there i bougth a Carbamide Bodylotion 10% (Urea).  \nNow, when i run it by the ingredient checker it has zero poreclogging ingredients:  \nAqua, Glycerin, Urea, ParaffinumLiquidum, Propylene Glycol, Cetearyl Alcohol, Caprylyl Glycol, Dimethicone, PEG-40 Hydrogenated Castor Oil, Sodium Cetearyl Sulfate, Parfum, Sodium Gluconate, Citric Acid,   \nPhenoxyethanol..\n\nShe told me if I'm allergic or anything to the current product i can visit her again, and get another one.  \nI'm already starting to see what is small whiteheads most likely similar to what i get from Panthenol and Niacinamide.\n\nI have a hard time choosing between trusting a licensed aesthetician and myself.  \nMaybe i should discontinue the cream and go get another one to try, while i use the Carbamide 10% instead.\n\nIt's also quite heavy, so it makes me shine a bit.  \nIf anyone has any pointers, or ideas i would REALLY appreciate it.  \nI'm a an end here.\n\nI also bought Ordinarys Squalene which she told me not to use, because the reason Ordinarys is so cheap is because the quality is low.\n\nThank you!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Unfair_Finger5531",
        "body": "I don’t like either of these tbh. But if I had to choose, I’d go with the first one. I just don’t care for triethanolamine bc it can be irritating in 5% of more amounts. But the second one is a hard no for me. \n\nAlso, acne clinic is consistently wrong, so maybe try incidecoder. Shea is not necessarily clogging. And mineral oil, which is a 0, can definitely be clogging. Just be sure to cleanse your skin properly to her potentially clogging ingredients off.\n\nPropylene glycol is not only clogging, but it’s also a known irritant. It doesn’t even flag that one.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "11ke7pv",
    "title": "Is the following combination of ingredients special together? (Results can be compared to Wonder Water): Alcohol, Cetrimonium Chloride, Cetyl Alcohol, Glycolic Acid, Linum Usitatissimum Seed Oil, Carapa Guaianensis Seed Oil, Bertholletia Excelsa Nut Oil, Mauritia Flexuosa Fruit Oil",
    "url": "https://www.reddit.com/r/HaircareScience/comments/11ke7pv/is_the_following_combination_of_ingredients/",
    "score": 0,
    "num_comments": 5,
    "created": "2023-03-06T21:13:36+00:00",
    "body": "Looking to analyze these ingredients to **skip the** **alcohol** next time  ?",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "HairHealthHaven",
        "body": "Wait... One of the ingredients is just \"alcohol\" without specifying what kind?! I've never even heard of that and I recommend avoiding that product like the plague. Some kinds of alcohol (fatty alchohols) are good and moisturize your hair (like cetyl alcohol), others will dry out your hair like there is no tomorrow.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Motor-Bell1837",
        "body": "All the oils are irrelevant to the function of the products. That's just added to make the consumer think it's something nice. It seems the alcohol in this type of product somehow melts down the actual emollients for a few seconds to help it coat the hair. For me these work better than any other product I have ever used.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  }
]