[
  {
    "subreddit": "AsianBeauty",
    "post_id": "y02bnt",
    "title": "Review: Every Sheet Mask I've Ever Tried (30+)",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/y02bnt/review_every_sheet_mask_ive_ever_tried_30/",
    "score": 408,
    "num_comments": 54,
    "created": "2022-10-10T01:47:28+00:00",
    "body": "[Sheet mask stash](https://preview.redd.it/wgxhjvyewvs91.jpg?width=4032&format=pjpg&auto=webp&s=b6abccda3c8adea4102acd1f86938090b0651a06)\n\n[Sheet mask empties for the year so far](https://preview.redd.it/4wbryhyewvs91.jpg?width=2378&format=pjpg&auto=webp&s=f1981a214466cbd69df270ab57a4cebf000a66d9)\n\nAs you can probably tell from the photos, I adore sheet masks. Aside from providing additional hydration and calming to my skin, they also help me unwind from a long day at work. I usually use a sheet mask or toner mask nearly everyday so over the years I’ve tried out quite a few! I add to this list every so often over the years and now it’s grown to the size that I should post so I can start on a nice new page. For most of the masks below I’ve used at least a box of…for some I’ve used many boxes. If you have any sheet mask recommendations, I would love to hear them! :) If you want a quick summary, scroll to the bottom :)\n\n**Skin Type:** Normal forehead and dry to very dry cheeks depending on the season. Using tretinoin so skin is occasionally irritated and sensitive.\n\n**Climate**: Cool and humid, mild temperatures, lots of rain.\n\n**Abbreviations:**\n\n* **MRP** = Maybe Repurchase\n* **WNRP** = Would Not Repurchase\n* **WRP** = Would Repurchase\n\n&#x200B;\n\n**Abib**\n\n* **\\[Gummy Sheet Mask - Heartleaf Sticker\\](**[**https://incidecoder.com/products/abib-gummy-sheet-mask-heartleaf-sticker**](https://incidecoder.com/products/abib-gummy-sheet-mask-heartleaf-sticker)**)** **-** Mask is comfortable, super soft microfiber material and adheres to my face really well; mask feels like your second skin. I consistently used the mask everyday for 2 weeks and saw a slight reduction in redness at the end. Hydration was decent but there are other sheet masks that left my skin feeling more plump (e.g. Rovection Lotus Calming Mask) and calm (e.g. BOJ Centella Calming Mask). The mask is pricey but for every 2 sheet masks you use, there is enough serum for you to do 1 toner mask. ***Alcohol free. 4/5. WRP***\n\n&#x200B;\n\n**Beauty of Joseon**\n\n* **\\[Centella Asiatica Calming Mask\\](**[**https://incidecoder.com/products/beauty-of-joseon-centella-asiatica-calming-mask**](https://incidecoder.com/products/beauty-of-joseon-centella-asiatica-calming-mask)**)** \\- So soothing and gentle! Centella Asiatica Extract is the #2 ingredients and makes up 15% of the serum. The mask also contains 3 different types of hyaluronic acid. Minimal to no fragrance, very soft sheet material (tencel/cellulose) that adheres to face well. No sticky finish. I prefer this one over the Abib one for calming and soothing. ***Alcohol free. 5/5. WRP***\n\n&#x200B;\n\n**Dr. Jart+**\n\n* **\\[Ceramidin Facial Barrier Mask\\](**[**https://incidecoder.com/products/dr-jart-ceramidin-facial-barrier-mask**](https://incidecoder.com/products/dr-jart-ceramidin-facial-barrier-mask)**) -** Nourishing, Strengthening, Repairing. I absolutely LOVE this one and always try to have some on hand. When I started tretinoin I had dry, flaky and sensitive skin. My skin was so irritated and flaky at times I couldn't apply sunscreen and could barely apply moisturizer; I looked like a snake shedding their skin. Everytime I used one of these masks the flakiness would all be gone the next day. The cellulose sheet is very soft (feels kind of like microfiber) and the liquid is cream-like, like mixing the ceramidin liquid and moisturizer together. \\*How does toner masking with the Ceramidin Liquid compare?\\* The liquid contains denatured alcohol as the 3rd ingredient and is not as thick/creamy as the sheet mask liquid. Still good and more cost effective but for really bad skin days, I would recommend going for the sheet mask. ***Alcohol free. 5/5. WRP***\n* **\\[Cicapair Calming Mask\\](**[**https://incidecoder.com/products/dr-jart-cicapair-calming-mask**](https://incidecoder.com/products/dr-jart-cicapair-calming-mask)**)** \\- Mask was okay. The cellulose sheet was thin and each mask was loaded with essence so you could soak some pads and do a toner mask. It helped with redness but I think there are better sheets masks for calming, soothing and hydration. I also didn't enjoy the smell, it smells like kitchen cleaner or herbal windex to me. ***Alcohol free. 0/5. WNRP***\n* **\\[Porecting Solution Bubbling Charcoal Sheet Mask\\](**[**https://incidecoder.com/products/dr-jart-porecting-solution-bubbling-charcoal-sheet-mask**](https://incidecoder.com/products/dr-jart-porecting-solution-bubbling-charcoal-sheet-mask)**)** \\- This sheet mask is well loved by many but for me, it was one of 2 things ever that I've had to take off after a few mins and rewash my face. To use, you rub the mask and bubbles will form to clear your pores. A tingling sensation started so I stopped rubbing early on. I was hoping the tingling would stop as a result but nope, it grew more intense so ended up taking the mask off and rewashing my face. I was too scared to try again so I ended up giving the rest of the box away. Just a note that you have to separate the mask from the dressing it's included with. Unfortunately it's black as well but the material is thinner than the mask (cellulose material). I've seen review comments where people say there are no bubbles and it turns out they're using the serum soaked dressing instead of the actual mask. ***0/5. WNRP***\n* **\\[Soothing Hydra Solution Mask\\](**[**https://incidecoder.com/products/dr-jart-dermask-soothing-hydra-solution-deep-hydration-sheet-mask**](https://incidecoder.com/products/dr-jart-dermask-soothing-hydra-solution-deep-hydration-sheet-mask)**) -** Thicker serum consistency similar to the Vital Hydra Solution Mask, sheet is cellulose and thin. Aloe and phytonicdes are the active soothing ingredients.  Sheet mask is well saturated but overall, it was just an alright mask. Nothing mind blowing. For those with sensitive skin, this mask contains alcohol as the 4th ingredient as well as essential oils. ***2.5/5. WNRP***\n* **\\[Vital Hydra Solution Mask\\](**[**https://incidecoder.com/products/dr-jart-dermask-water-jet-vital-hydra-solution**](https://incidecoder.com/products/dr-jart-dermask-water-jet-vital-hydra-solution)**)** \\- The cellulose sheet is thin and soaked in a thick serum with a light scent. This was a deeply hydrating mask that made my skin feel plump. It dried down nicely (no sticky or tacky feeling) and because the serum is thicker, I didnt have to worry about serum dripping as I lied down. Does not have as  much extra serum as some of the other Dr. Jart+ masks but still worth it. For those with sensitive skin, this mask contains alcohol as the 4th ingredient as well as essential oils. ***3.5/5. MRP.***\n\n&#x200B;\n\n**Dr. Morita**\n\n* **\\[Hyaluronic Acid Essence Mask / Moisturizing Renewal Mask / Intensive Hydrating Mask / Rich Source of Youthful Renewal Mask / Revitalizing Essence Facial Mask / Intensive Whitening Essence Mask\\](**[**https://incidecoder.com/brands/dr-morita**](https://incidecoder.com/brands/dr-morita)**)** \\- Despite the different types, I found all the masks were interchangeable as each had the same formulation, feel and effect: watery essence that was hydrating and had a very light floral scent. In fact, most of their masks (all in the list above except the Intensive Whitening Mask) have the same first 5 ingredients: Water; Dipropylene Glycol; Sodium PCA; PPG-28-Buteth-35; and Niacinamide; so no wonder they all feel the same. Most of the masks contained different types of hyaluronic acids, some contained multiple types of ceramides and plant extracts, and a few contained collagen, sake and/or caviar too. No drying alcohols and overall I think the masks are great for all skin types. The sheet material feels a bit thicker than most and contains slits so you can fit the mask better on your face. I thought the essence was too runny for my preference and found myself wiping away lots of dipping essence while lying down. The sheet did not adhere well to the face so walking around while sheet masking was not an option. It would be better if the essence was a serum consistency instead. I feel like they're your basic sheet mask that provides the much needed bit of extra hydration mask but doesn't provide anything else. I enjoyed using the masks but I wouldn't go out of my way to purchase them; however if you're looking for a basic no frills hydrating mask without heavy fragrance, these are great and very inexpensive, especially in Taiwan where 4 - 5 boxes is just $20 CAD (each box has 8-10 masks). Each mask is also loaded with so much essence you can get a few toner masks out of each one. ***Alcohol-free. 2/5. WNRP***\n\n&#x200B;\n\n**The Face Shop / Nature Republic**\n\n* **\\[The Solution and Real Nature Mask Lines (various)\\](\\*\\*\\*\\***[**https://incidecoder.com/brands/the-face-shop**](https://incidecoder.com/brands/the-face-shop)**)**\\]) **-** These are the sheet masks I started with when I got more into skincare. These are super affordable, very accessible and during my student days, these were the masks I gravitated to. I felt the essence/serum consistency in each mask was similar but each mask was distinguishable based on all the different scents (my fave was the green tea one). I used all mainly for hydration and to be refreshed so I cant speak to the claimed benefits but from the ingredients list most beneficial ingredients were lower down. The masks were comfortable but didn’t fit my face properly. Denatured alcohol in their top 5 ingredients list and they are scented so I would avoid these if you’re sensitive to alcohol or fragrance. ***2/5. WNRP***\n\n&#x200B;\n\n**I'm From**\n\n* **\\[Mugwort Sheet Mask\\](**[**https://incidecoder.com/products/im-from-mugwort-sheet-mask**](https://incidecoder.com/products/im-from-mugwort-sheet-mask)**)** \\- I love the mugwort scent. This mask contains 91.45% mugwort and  is soothing, hydrating and calming. Redness is reduced relatively fast - not as fast as the I'm From mugwort wash off mask but this is more hydrating than the wash off mask if you’re looking for something that offers both hydration and calming. The sheet mask material is 100% plant based and known as “I-cell” but it’s so-so in quality: not super soft, a bit rough and I felt the material detracted from the experience. These masks are on the pricier side and not as accessible so I probably won’t repurchase - I would rather purchase the essence and wash-off mask, and do a toner mask with the essence. ***Alcohol, fragrance and EO free. 3/5. WNRP.***\n\n&#x200B;\n\n**Isntree**\n\n* **\\[Isntree Spot Saver Mugwort Gauze\\](**[**https://incidecoder.com/products/isntree-spot-saver-mugwort-gauze-mask**](https://incidecoder.com/products/isntree-spot-saver-mugwort-gauze-mask)**) -** I was concerned the gauze material would be similar in texture to the I’m From sheet mask and be  uncomfortable but the material is quite soft. Contains 45% Mugwort extract but mugwort scent is very faint. I increased my tretinoin strength when I was testing out this sheet mask and definitely felt this mask played a part in keeping my skin calm and moisturized. ***Alcohol, fragrance and EO free. 4/5. WRP.***\n\n&#x200B;\n\n**Leaders**\n\n* **\\[Mediu Amino Moisture Mask\\](**[**https://incidecoder.com/products/leaders-mediu-amino-mousture-mask**](https://incidecoder.com/products/leaders-mediu-amino-mousture-mask)**)** \\- Contains 17 different amino acids to help strengthen the skin barrier. Sheet mask material is soft cotton but its slightly heavier and thicker than cellulose/water gel types. Every time I use this mask I never feel like the serum penetrated my skin to deeply nourish or hydrate. Leaves a sticky finish. Nothing special. For every 2 masks you’ll have enough serum to do a toner mask. ***Alcohol free.*** ***2.5/5. WNRP.***\n\n&#x200B;\n\n**Lululun**\n\n* **\\[Moisture Balance Facial Sheet Mask (Pink)\\](**[**https://incidecoder.com/products/lululun-balance-moisture-face-mask-pink**](https://incidecoder.com/products/lululun-balance-moisture-face-mask-pink)**) -** The resealable bag comes with 7 masks (they also have 32 packs) and are intended for everyday maskers to use for 5-10 mins each day instead of the usual \\~20 mins. Fragrance free with environmentally friendly packaging. Each mask is lightly soaked and offers light hydration but for me, it wasn’t enough so I wouldn’t say these are worth it in my case but I can see others enjoying this - especially if you’re the type to use a face mask in the morning before makeup application. ***Alcohol, fragrance and EO free. 1/5. WNRP***\n\n&#x200B;\n\n**Mediheal**\n\n* **\\[Double Calming Water Mask\\](**[**https://incidecoder.com/products/mediheal-double-calming-water-mask**](https://incidecoder.com/products/mediheal-double-calming-water-mask)**)** \\- Great quality and affordable. While most soothing masks focus on cica, mugwort and/or madecassoside, this mask’s main star is allantoin but there are minor amounts of cica and madecassoside as well. Comfortable and thin tencel/cellulose sheet that adheres well. Noticeable redness reduction. ***Alcohol free. 4/5. WRP***\n* **\\[Hyalu Moist Essence Mask\\]**([https://incidecoder.com/products/mediheal-hyalu-moist-essence-mask](https://incidecoder.com/products/mediheal-hyalu-moist-essence-mask)) - Comfortable tencel sheet material that adheres well. Minimal scent. Skin definitely feels hydrated afterwards but I felt the Rovection Lotus Calming and JM Solution Bird’s Nest ones were more hydrating. Would still recommend this one. ***Alcohol free. 3.5/5. WRP***\n* **\\[Pepta Lifting Ampoule Mask\\]**([https://incidecoder.com/products/mediheal-pepta-lifting-ampoule-mask](https://incidecoder.com/products/mediheal-pepta-lifting-ampoule-mask)) - Similar to above, same comfortable tencel sheet material that adheres well. Contains 6 different peptides to help with skin firming but unfortunately I can’t confirm appreciable difference to skin firmness; however, I did feel my skin was moisturized. There is a slight sticky finish with this one but not sticky on the level of honey propolis masks. ***Alcohol free. 3.5/5. WRP***\n\n&#x200B;\n\n**My Beauty Diary**\n\n* **\\[Black Pearl Brightening Mask\\](**[**https://incidecoder.com/products/black-pearl-bightening-mask-my-beauty-diary**](https://incidecoder.com/products/black-pearl-bightening-mask-my-beauty-diary)**) -** My favorite out of the three MBD masks I’ve tried but in comparison to all the other masks, this one was okay. Licorice root extract and arbutin are the active brightening ingredients in this mask and I would say I did notice some brightening in my complexion. Mask is made of tencel and also contains aloe for soothing. ***Alcohol free.*** ***2.5/5. WNRP.***\n* **\\[Damask Rose Mask\\](**[**https://incidecoder.com/products/my-beauty-diary-damask-rose-facial-mask**](https://incidecoder.com/products/my-beauty-diary-damask-rose-facial-mask)**)** \\- Thin tencel sheet mask with lots of serum so you end up with a thoroughly soaked sheet mask that offers lots of hydration. Decent and not as heavily scented as the red wine mask but not memorable. ***Alcohol free. 2/5. WNRP.***\n* **\\[Red Wine Revitalizing Mask(\\*\\*\\*\\***[**https://www.skincarisma.org/products/my-beauty-diary/red-vine-revitalizing-mask)\\]**](https://www.skincarisma.org/products/my-beauty-diary/red-vine-revitalizing-mask)\\])\\]) - Hydrating like the damask rose mask but the scent of the red wine mask was a bit too strong for me so I never gravitated towards it...I ended up not using the entire box of 8 before expiry so I used a couple for my body before throwing the rest out. ***Alcohol free. 0/5. WNRP.***\n\n&#x200B;\n\n**Jayjun**\n\n* **\\[Essential Brightening Mask (Rosemary)\\](**[**https://jayjun-usa.com/products/essential-brightening-mask**](https://jayjun-usa.com/products/essential-brightening-mask)**) -** Strong rosemary scent - feels like you’re doing aromatherapy while sheet masking and I didn’t mind it; however, I can see that some people will. Rosemary oil and niacinamide are the main brightening ingredients and I did notice a more even complexion the next day. Rosemary oil is supposed to be anti-inflammatory so that also helps. I tried this mask prior to using tretinoin so I will likely not repurchase now because of the possible skin irritating ingredients. Sheet is made of tencel and soft. ***3/5. WNRP.***\n\n&#x200B;\n\n**JM Solution**\n\n* \\[**Active Pink Snail Brightening Mask\\](**[**https://incidecoder.com/products/jm-solution-active-pink-snail-brightening-mask-prime**](https://incidecoder.com/products/jm-solution-active-pink-snail-brightening-mask-prime)**)** \\- Serum is pink and gloopy, and very hydrating. Sheet material is cellulose.I didn’t notice any brightening effects but with the gloopy hydration, I felt it helped maintain my skin barrier. Loaded with serum - I poured all the serum into a container and was able to use it generously for a few days. ***Alcohol free. 3.5/5. MRP.***\n* **\\[Active Bird Nest Moisture Mask\\](**[**https://incidecoder.com/products/jm-solution-active-birds-nest-moisture-mask-prime**](https://incidecoder.com/products/jm-solution-active-birds-nest-moisture-mask-prime)**)** **-** This mask is a hydration bomb! They’re great for the winter. Super hydrating and very gentle, soft cellulose sheet material. Adheres decently well but not like the Abib gummy or Rovectin lotus masks. In addition to bird’s nest, the mask contains artemisia and calendula extract, collagen (humectant) and multiple types of hyaluronic acid.. Like all JM Solution masks, it’s drenched in serum and feels more luxurious than the price point. This one is my favorite out of all the JM Solution ones I’ve tried. ***Alcohol free. 4.5/5. WRP***\n* **\\[Glow Luminous Rose Firming Mask\\](**[**https://incidecoder.com/products/jm-solution-glow-luminous-flower-firming-sheet-mask-rose**](https://incidecoder.com/products/jm-solution-glow-luminous-flower-firming-sheet-mask-rose)**) -** Rose scent is nice and not overpowering. Similar to previous notes, mask material is soft cellulose and sheet is thoroughly soaked in serum. Contains peptides to help with skin firming. I’m relatively young still so no appreciable difference in skin firmness or elasticity can be confirmed. No difference in luminosity was noticed either but the mask is hydrating. Compared to the other JM Solution ones, this one does contain alcohol. ***3/5. WNRP.***\n* \\[**Honey Luminous Royal Propolis Mask\\](**[**https://incidecoder.com/products/jm-solution-honey-luminous-royal-propolis-mask**](https://incidecoder.com/products/jm-solution-honey-luminous-royal-propolis-mask)**) -** Moisturizing, nourishing and hydrating. Soaked in serum made up of propolis, royal jelly, honey, five different peptides and hyaluronic acid. Like most honey/propolis serums/masks, the serum does leave a slight sticky feeling so although you have lots of extra serum leftover to rub all over your body, I usually refrain and will pour the serum in a container to just use on my face. Will likely not repurchase because of the sticky finish. Material is also cellulose. ***Alcohol free. 3.5/5. WNRP***\n* **\\[Marine Luminous Pearl Deep Moisture Mask\\](**[**https://global.oliveyoung.com/product/detail?prdtNo=GA210001523&lang=en&gclid=CjwKCAjwrZOXBhACEiwA0EoRD0d083J7\\_q1u49s6DH2IfTBMWZUsUMaZn4oWLVaZbNwEJ09Hvq6vmxoCeFgQAvD\\_BwE#prd-detail-page**](https://global.oliveyoung.com/product/detail?prdtNo=GA210001523&lang=en&gclid=CjwKCAjwrZOXBhACEiwA0EoRD0d083J7_q1u49s6DH2IfTBMWZUsUMaZn4oWLVaZbNwEJ09Hvq6vmxoCeFgQAvD_BwE#prd-detail-page)**) -** A 3-step mask pack that comes with a serum, sheet mask and eye cream. Used to be my favorite at one time. Mask pack does a very sufficient job at deeply hydrating the skin; all products contain multiple types of hyaluronic acid and marine collagen. Sheet material is thin and made of cellulose, adheres well and is almost transparent after application. Baby powder scent. Slight tacky finish. ***Alcohol free. 3.5/5. MRP.***\n\n&#x200B;\n\n**ROVECTIN**\n\n* **\\[Lotus Water Calming Mask\\](**[**https://rovectin.com/products/lotus-water-calming-sheet-mask-1-pack**](https://rovectin.com/products/lotus-water-calming-sheet-mask-1-pack)**)** \\- It's amazing and my favorite! The mask fits and adheres very well to the face - I honestly feel you could dance with this on and it wont budge. It's a watergel/hydrogel type of sheet so it's very soft, comfy and incredibly thin - it feels like your second skin. The sheet absorbs the serum very well, which is thick, soothing and deeply hydrating. When I first tried this mask I was so surprised at how plump my skin was afterwards! The mask contains lotus flower extract, houttuynia cordata extract and aquaxl (patented formula that Rovectin uses in their popular toner) to achieve its goal of calming irritated skin which I think it does a good job of. If you like toner masking, for every 2 masks there's enough serum for 1 toner mask. Not super generous with the serum but it's okay, I would still repurchase. ***Alcohol, fragrance and EO free. 5/5. WRP***\n\n&#x200B;\n\n**Secret Key**\n\n* **\\[Secret Key Starting Treatment Essential Mask Sheet\\](**[**https://incidecoder.com/products/secret-key-starting-treatment-essential-mask-sheet**](https://incidecoder.com/products/secret-key-starting-treatment-essential-mask-sheet)**)** \\- I receive 1 mask as a sample so I can’t speak to efficiency but it was pleasant and more worth it than the SK-II mask. Strong ferment scent which is a good sign that it’s filled with lots of galactomyces to help brighten complexion. A hydrating mask. Mask was soaked but there wasn’t a lot of extra essence for a toner mask. ***Alcohol, fragrance and EO free. 3.5/5. MRP***\n\n&#x200B;\n\n**SK-II**\n\n* **\\[Facial Treatment Mask\\](**[**https://incidecoder.com/products/sk-ii-facial-treatment-mask-2**](https://incidecoder.com/products/sk-ii-facial-treatment-mask-2)**)** \\- After all the hype about how life changing and splurge-worthy these masks are, and how brides have this in their skincare arsenal before their wedding day, I was really excited to try these masks out. Similar to the essence, the mask has a heavy fermentation scent but I don’t mind it. While unfolding, I was surprised at how thick, bulky and stiff the cotton sheet mask material was - honestly I think this is the thickest sheet mask I’ve ever used. I think there are other material types that would have been better in absorbing the serum and without the provided side slits, it would have been difficult to find the perfect fit/smooth out because the material is just so stiff. After usage I patted the remaining serum in but when I continued the remainder of my skincare routine, the serum residue started to pill on me. So the mask is expensive, stiff and pills? Not sure why there’s so much hype. It’s not particularly hydrating either. I’ve noticed a ‘glow from within’ from using the essence but I don’t think the mask provided above average glow in comparison. I would rather spend the money on the essence and layer it. ***Alcohol, fragrance and EO free. 1/5. WNRP***\n\n&#x200B;\n\n**SNP**\n\n* **\\[Black Pearl Renew Black Ampoule Mask\\](**[**https://snpcos.us/products/black-pearl-renew-black-ampoule-mask-sheet**](https://snpcos.us/products/black-pearl-renew-black-ampoule-mask-sheet)**)** \\- This mask is really trying to do it all - brighten, hydrate, soothe, strengthen and protect. Contains black pearl, niacinamide, rice extract, centella asiatica, soybean extract, ceramides and hyaluronic acid. Sheet thickness is medium, material is soft (cellulose) and scent is light. I think because this mask is trying to do a bit of everything, there are better masks for each specific target (e.g. get the BOJ one for soothing) but overall I enjoyed this mask and would like to try more from the brand. ***3.5/5. MRP.***\n\n&#x200B;\n\n**Thank You Farmer**\n\n* **\\[Miracle Age Repair Cotton Mask\\](**[**https://www.skincarisma.com/products/thank-you-farmer/miracle-age-repair-cotton-mask/ingredient\\_list**](https://www.skincarisma.com/products/thank-you-farmer/miracle-age-repair-cotton-mask/ingredient_list)**)** \\- Strong but pleasant citrus scent. I didn't read the ingredients before purchasing but the 2nd half of the list is all essential oils (18 total) so sensitive skin folks beware. The mask is similar in feel and consistency to the Dr. Jart Ceramidin mask - cream serum texture, thicker soft cotton material. The mask claims to help brighten, nourish and provide anti wrinkle care. I didn't notice any brightening effects and can't speak to the anti wrinkle effects but it does help nourish skin. I noticed my redness remained after using the mask so I am a bit concerned the EOs will eventually cause me to break out. I will likely not repurchase as I prefer the Dr. Jart ceramidin mask instead. ***Alcohol free. 2/5 WNRP***\n\n&#x200B;\n\n**My Favorites**\n\n* **Calming:** Beauty of Joseon - Centella Asiatica Calming Mask\n* **Hydration:** ROVECTIN - Lotus Water Calming Mask\n* **Nourishment:** Dr. Jart- Ceramidin Facial Barrier Mask",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "rosieinjapan",
        "body": "Wow! This is giving me all the motivation to sheet mask more regularly! ♡\n\nP.S. For me, I am loving Su:m37's Secret Essence Mask 3-Step Kit.",
        "score": 47,
        "is_top_level": true
      },
      {
        "author": "SnapCrackleMom",
        "body": "I'm a fan of the Dear Klairs Rich Moist Soothing Tencel Sheet Masks. Very hydrating and soothing, fragrance-free. The mask comes in two pieces (upper face and lower face) which makes for a great fit.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "OtherJaguar7073",
        "body": "Wow so much detail! Thank you for this, really enjoyed reading.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "zzoom_zoom",
        "body": "A rare sheet mask post! Thanks for the extensive reviews! Your stash looks so nice too! Do you have any eye patches/masks you'd recommend?",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "Unfair_Finger5531",
        "body": "Thank you taking the time to write such a thorough review 🙏🏼.  Have you ever tried benton aloe mask or klairs tencel mask?  I like those.",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "Big_Process_5220",
        "body": "How often do you use the masks? I’ve been doing it pretty often and not sure if I should do it almost everyday 👀",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "gryffyryne",
        "body": "Thank you for this thorough review! Added your tops to my wishlist",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Vael0",
        "body": "This post is rather old now (1year), but I'm at a point where sheet masks are really fitting for me (I am really tired and lazy at night after long work days and a long commute, and it is both really hydrating + really fun and comfortable sheetmasking. I can do it while watching an episode or reading, which is also a plus !). So I'm looking at some nice masks, and I found your post ! Thank you a lot :)  \n\n\nDid you discover any favorites sheet masks this past year ?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "spikechild",
        "body": "Im the same with TFS being the intro to sheet masks, lol... I bought so many of them since they had so many sales, but since Ive branched out more I can tell how not great they were.... The essences were probably fine, but the mask itself was not. Now that its more popular to use other materials, the cotton  masks that would dry your skin out way too early just seem so old school.  Im surprised about your experience with the MBD ones though! I generally enjoyed those, as well as the JM solutions ones...  I dont use sheet masks much anymore and have such a stash left to get through....\n\nIF anyone wants to know , I find the best sheet masks Ive ever used were the Papa Recipe ones, followed by Naruko ones, but  I havent tried the rovectin ones",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Swimming-Patience655",
        "body": "The exact post I needed to see today, as my shopping cart is full of masks :) I’m trying to do a skin reset and am looking at this category for the first time in years—it’s so vast and overwhelming. Thank you so much for sharing all this great info!💫\n\nI’ve tried Dr.Jart Cicapair (not as soothing as I’d expected, never finished my pack: WNRP), Mediheal (so much leftover essence, enjoyed all I’ve tried—except tea tree is just ok: WRP), and Tony Moly I’m Honey (at Ulta; super soothing, a little sticky but it didn’t bother me—really enjoyed this one: WRP but looking for alternative ‘cleaner’ honey masks)",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "jamiixz",
        "body": "Hi! I was just wondering whether you’ve tried the Torriden sheet masks? They’re very popular in Korea (won consecutive olive young championships I think?) and I’ve heard that they’re quite moisturizing! Would love to hear your thoughts if you’ve tried them. :)",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "YogurtclosetSmart928",
        "body": "Thank you for this very detailed review. I'm venturing into trying face masks and this really help me a lot.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "anon22334",
        "body": "Have you tried the innisfree ones? What are your thoughts on those?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "PeachBlossomBee",
        "body": "OP I’m oily dehydrated and if you can get your hands on 2sol the Mask I’d LOVE to hear you compare it to your fave",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LiteratureFront2211",
        "body": "Hi! I'm new to skincare and I'm curious on whether I should apply my other serums after putting on sheet mask? As I've heard that after applying sheet mask, we must put on moisturiser..or do I apply my other serum after moisturiser on days I use sheet masks? 😅",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Queenhighly",
        "body": "Thank you for this, been looking to try some, I use tret as well and have very dry skin",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "isla_inchoate",
        "body": "Omg this is great, thank you!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "thedoctorthepach",
        "body": "Such an amazing review, thank you random internet stranger!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LongTie9223",
        "body": "Lets do a fav  2025 mask review",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "After_Dog_4517",
        "body": "This is a great and informative post. I have red skin, possibly rosacea. It's quite dry though I'm only saying that because a dermatologist told me it was dry. I can't tell by looking at it. I don't use masks, but would like one to make me look more youthful and lessen the redness. I also burned my neck with boiling water in my 20s and the skin is sagging a little from where the burn was. There's no scarring and it's been healed completely for many many years - it's just a little loose. Do you you have any recommendations for the best masks for me personally to try? Definitely nothing with alcohol in it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Mukisiggy",
        "body": "Thank you for this amazing review of masks! Wow!!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Perfect-Lab-2640",
        "body": "Woooo!! So details and wasy to read !! Thank you so much!!! \nI also love using a face sheet mask (but i am lazy. I use washable masks more, hahaha)\n\nI got two Korean face sheet mask when I went to my back home, and i love them!\nMaybe you can get it and try !\n(I dont know where you are from...not sure if you can get it from your place, tho\n\n*\nNauni is more moisturized while Love DES face is more hydration \n\nI like to put Nauni that one on my face longer , like half an hour(it recommends to use 20 to 30 mins). After that, it still has a lot of serum left on my face. \n\n\nFor Love DES face, I usually use it around 20 mins (it recommends 10 to 20 mins)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "LongjumpingPace7361",
        "body": "Have u tried lebelage?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "purple_pressure6080",
        "body": "Appreciate your post! For the 3 favorite ones, I plan to gift them to 3 separate teachers for my kid. Now which one do you recommend for a lady in her 50s, one in 30s and another in late 30s?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "852HK44",
        "body": "**Vital Hydra Solution Mask** saved my skin this winter. Just used it twice today, had recently suffered from dry patches near my nasal area. Nothing worked except this mask. It's phenomenal.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "LAsunshine1234",
        "body": "Hi! WOW — thank you so much for this AMAZING post of product reviews! 🤩😍🙌 Super impressive! \n\nDo you mind me asking how old you are? You sound super knowledgeable about beauty and treatments and I’m relatively new to this world and kind of overwhelmed 😵‍💫🫣😳 I am looking for masks, moisturizers/products, etc. or potential laser treatments to target signs of aging and “tech neck” specifically! I work in my laptop and/or phone most of the day and I think my neck lines show it. Anyway, this thread is so amazing and I’m just wondering if you’d be willing to share any really effective moisturizers or laser treatments that you’ve done to improve the skin on your face and neck. I’d love to hear from you! Thank you!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 26,
      "top_level": 26,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "boxycharm",
    "post_id": "ky4z3b",
    "title": "Felt like I had to make a post on just how crappy Avant and 111skin products are",
    "url": "https://www.reddit.com/r/boxycharm/comments/ky4z3b/felt_like_i_had_to_make_a_post_on_just_how_crappy/",
    "score": 64,
    "num_comments": 49,
    "created": "2021-01-15T21:59:35+00:00",
    "body": "Here’s a comment I posted about Avant:\n\nAvant’s Deluxe Hyaluronic Acid Vivifying Face & Eye Night Cream (this was being sold in the FFF edit sale last week), we were suppose to get this last December for premium box but instead we got the Pro-Intense Hyaluronic Acid Illuminating Day Cream instead, it’s the same RV $134 and has equally crappy ingredients, I’ve seen hand creams/body creams with better/actual effective formulas.\n\nIngredients for the Avant Face & Eye Cream: aqua (water), Butyrospermum Parkii (shea) butter, glycerin (humectant) cetyl alcohol (texture enhancer, emollient), glyceryl stearate (emulsifying agent), dicaprylyl ether (emollient), propylheptyl caprylate (emollient), dimethicone (type of silicone occlusive), sodium hyaluronate (salt form of hyaluronic acid), niacinamide (Vitamin B3, excellent antioxidant has many beneficial properties), maris aqua (sea water, has more minerals than tap water), Prunus Amygdalus dulcis (sweet almond) oil (emollient which contains lots of skin nourishing fatty acids), allantoin (skin soothing), tocopheryl acetate (vitamin e), peg-75 stearate (texture enhancer, emulsifier), ceteth-20 (texture enhancer), steareth-20 (emulsifier) propylene glycol (humectant, texture enhancers), disodium edta (too lazy to explain this one) sodium polyacrylate (thickening agent, texture enhancer), xanthan gum (thickening agent), lactic acid (when used at this kind of low concentration most likely it’s being used as a pH adjuster), parfum (fragrance), potassium sorbate (preservative), ethylhexylglycerin (preservatives) CI 15985 (orange dye) (FD&C Yellow No. 6), CI 17200 (red dye) (D&C Red No. 33).\n\nHere’s the ingredients for a $134 moisturizer.  It doesn’t take Einstein to figure out all the products from Avant are crap, even if this were $5 it would still be crap. There’s nothing wrong with the ingredients, its just the formulation and ingredients for the moisturizer isn’t worth more than $5, it has no high levels of any active ingredients/patented technology (almost all moisturizers at that price point has patents). If this were ingredients for a dollar store hand cream, then i would buy it, unfortunately it’s $134.  Avant products AREN’T EVEN WORTH the $12 Boxycharm add on/pop up price.\n\nLook at the ingredients for Acure Radically Rejuvenating Whipped Night Cream ($15.99 on iherb.com) \n\nWATER/AQUA/EAU, GLYCERIN, CETEARYL ALCOHOL, CETEARYL OLIVATE, SORBITAN OLIVATE, SCLEROCARYA BIRREA (MARULA) SEED OIL, NYMPHAEA ALBA ROOT EXTRACT, SH-OLIGOPEPTIDE-1, SH-OLIGOPEPTIDE-2, SH-POLYPEPTIDE-1, SH-POLYPEPTIDE-9, SH-POLYPEPTIDE-11, COPPER PALMITOYL HEPTAPEPTIDE-14, HEPTAPEPTIDE-15 PALMITATE, PALMITOYL TETRAPEPTIDE-7, PALMITOYL TRIPEPTIDE-1 (PEPTIDE BLEND), FERULIC ACID, ASCORBIC GLUCOSIDE (VITAMIN C), COCONUT ALKANES, PSEUDOALTEROMONAS FERMENT EXTRACT (GLACIAL GLYCOPROTEINS), SALICYLIC ACID COCO-CAPRYLATE/CAPRATE, SODIUM HYALURONATE, ASPARTIC ACID, LINOLEIC ACID, LINOLENIC ACID, LECITHIN, SODIUM PCA, PCA, SORBITAN ISOSTEARATE, LACTIC ACID/GLYCOLIC ACID COPOLYMER, CURCUMA LONGA (TURMERIC) ROOT EXTRACT, SYMPHYTUM OFFICINALE CALLUS CULTURE EXTRACT.\n\nBesides the fact that this has way more antioxidants/age prevention/hydrating ingredients.  This ingredients list for a $16 moisturizer might look familiar to some people because it’s like 95% the same as a certain Drunk Elephant Moisturizer(it’s just missing a few amino acids at the end of the ingredients list but all the important ingredients are exactly the same, even the peptides are the same).  Looks a thousand times better than all the crappy $130 Avant Moisturizers, and this is just one example, there’s CeraVe, Elf, tons of Korean brand moisturizers, all around or under $20. \n\nDECIEM’s hand cream $16 for 100ML\nAqua (Water), Caprylic/Capric Triglyceride, Propanediol, Cetearyl Glucoside, Cetearyl Alcohol, Glycerin, Cetyl Alcohol, Plukenetia Volubilis Seed Oil, Copper Lysinate/Prolinate, Plantago Lanceolata Leaf Extract, Methylglucoside Phosphate, Proline, Alanine, Serine, Pseudoalteromonas Ferment Extract, Tremella Fuciformis Sporocarp Extract, Tocopherol, Betaine, Cellulose, Xanthan Gum, Sodium Polyacrylate, Sodium Phosphate, Sodium Hydroxide, Potassium Sorbate, Caprylyl Glycol, Ethylhexylglycerin, Phenoxyethanol, Chlorphenesin, Parfum (Fragrance), Limonene, Linalool.\n\nThere’s copper peptide (the next big thing in anti aging), snow mushrooms, amino acids, algae ferment, and Plantago Lanceolata which can reduce dark spots, all this from a hand cream, people were using this as a facial moisturizer cos it’s that good. \n\nMoisturizers which are around $134\n\n- Guerlain’s Abeille Royale Creams (has patent on formulas and also the frigging jar the moisturizer comes in) \n\n* Sisley Black Rose Cream Mask (really this needs no introduction) \n\n* Charlotte Tilbury’s Night Cream\n\n* Dior Capture Totale Firming and Wrinkle Correcting Cream (Again patented formula, with a lot of research and clinical trials)\n\n* Lancer Skincare the Nourish (Dr. Lancer dermatologists for Hollywood Stars) \n\n* Fresh Creme Ancienne Moisturizer (Literally made by hand in a Monastery in Europe) \n\n* Chanel Le Lift Restorative Cream (clinical and in vitro testing, patented formula) \n\n* Caudalie Premium Cru Rich/Normal Cream (again patented formula, developed with Harvard Medical School) \n\n* If you check out CultBeauty the Eve Lom holiday set (the one with the Moisture Cream and cleanser (all full size) are basically the same RV as the stupid Avant moisturizer. \n\nThe list can go on forever, also Anti pollution micellar water from Chanel only costs $45. If you take a look at the ingredients for Avant’s Micellar Water it’s missing a very crucial ingredient that the majority of “high end/effective” micellar water contain, PEG-6 Caprylic/ Capric Glycerides.  Seriously this is not even worth $1. \nLastly someone from this subreddit did some research on this company, I think she concluded it was being used to launder money. But the fact that they’re selling you crap for $100+ is enough proof for me.\n\nNow the 111skin products we get from boxycharm or Ipsy are NOT the same as the ones sold in retail stores or 111skin’s online site.  The hydra gel moisturizer that came from Ipsy for example has a completely different ingredients list from the “real” moisturizer.\n\nIngredients from 111skin Cryo Activating Hydra Gel Ipsy version: \nAloe Barbadensis Gel, Glycerin, Ethylhexyl Palmitate, Butylene Glycol, Isohexadecane, Dipropylene Glycol, Cetearyl Alcohol, Sodium Acrylates Copolymer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Prunus Amygdalus Dulcis (Sweet Almond / Amande Douce) Oil, Sodium Ascorbyl Phosphate, Phenoxyethanol, Betaine, Lecithin, Pyrus Malus (Apple / Pomme) Fruit Water, Allantoin, Hydrogenated Polyisobutene, Hydroxyacetophenone, Trehalose, Propanediol, Glyceryl Caprylate, 1,2-Hexanediol, Ceteth-10 Phosphate, Aluminium Dicetyl Phosphate, BHT, Tetrasodium EDTA, Panax Ginseng Root Extract, Sodium Hydroxide, Caprylhydroxamic Acid, Citric Acid, Hydrogenated Lecithin, Tocopheryl Acetate, Tocopherol, Achillea Millefolium (Yarrow / Achillée) Extract, Xanthan Gum, Menthol, Menthyl Lactate, Sodium Hyaluronate, Fragrance / Parfum, Limonene, Benzyl Salicylate, Citronellol, Linalool.\n\nIngredients from 111skin’s site for the Hydra Gel:\nAQUA / WATER / EAU, NELUMBO NUCIFERA (LOTUS) ROOT WATER, BUTYLENE GLYCOL, PEG-40 HYDROGENATED CASTOR OIL, GLYCERIN, PRUNUS AMYGDALUS DULCIS (SWEET ALMOND / AMANDE DOUCE) OIL, SODIUM ACRYLATES COPOLYMER, CARBOMER, TETRAHEXYLDECYL ASCORBATE, ETHYLHEXYL PALMITATE, PHENOXYETHANOL, BETAINE, LECITHIN, PROPANEDIOL, BENZYL ALCOHOL, HORDEUM VULGARE (BARLEY / ORGE) SEED EXTRACT, PENTYLENE GLYCOL, PRUNUS PERSICA (PEACH / PÊCHE) JUICE, PYRUS MALUS (APPLE / POMME) JUICE, TRITICUM VULGARE (WHEAT / BLÉ) SEED EXTRACT, DISODIUM EDTA, PANAX GINSENG ROOT EXTRACT, DEHYDROACETIC ACID, TRIHYDROXYSTEARIN, ACHILLEA MILLEFOLIUM (YARROW / ACHILÉE) EXTRACT, SODIUM HYALURONATE, MENTHOL, GLYCERYL CAPRYLATE, ALOE VERA LEAF EXTRACT, GLYCERYL UNDECYLENATE, MENTHYL LACTATE, XANTHAN GUM, GLUCOMANNAN, FRAGRANCE / PARFUM, BENZYL SALICYLATE, LIMONENE, CITRONELLOL, LINALOOL.\n\nSee the difference? The Ipsy one although it advertises that it’s made with lotus water, there’s no lotus anything in the ingredients. It’s full of texture enhancers and solvents, IMO they were mainly trying to copy the “gel texture” of the real moisturizer.  The real moisturizer that’s $200 isn’t that much better. No expensive ingredients or actives....Check out the Rovectin Lotus Water Cream, made from 75% lotus flower extract (I’m assuming extracts holds a lot more nutrients than lotus root water), and it’s $20 but it goes on sale for $10, has similar light texture etc etc.  Usually the “made for beauty boxes 111skin products” will have “Made in China for 111skin” on the packaging. The real products use to be made in Bulgaria and now I think it’s made in UK, and some are made in the US.  Even if the ingredients line up like the 111skin vitamin c serum from Ipsy and the old formula of the vitamin c from 111skin’s site, the texture, colour, smell are completely different.  The real one had a serum like texture, transparent, had some kind of smell (I forgot the smell, I compared the products like a year ago).  The Ipsy version has the texture of water, yellow tint, no smell I think. Even the real products from 111skin are total ripoffs...what the hell does that say about the “fake” ones? \n\nTL:DR - both Avant and 111skin products are crap, 111skin sends out fakes to beauty boxes but even the real products are crap.  Avant is a sketchy company and their products aren’t even worth the $12 add on price.  It doesn’t matter if Avant’s website looks legitimate, every MLM website looks a thousand times more legitimate than Avant but it’s still a scam.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "nievesur",
        "body": "Ahhh...  a fellow ingredient nerd. Thank you for posting, you're doing the Lord's work, lol. Unfortunately, I think the vast majority of people just don't take an interest in understanding even the basics about reading ingredient labels or interpreting them and prefer to rely on anecdotes and reviews. The problem with that is these subscription box subs frequently act as a hype chamber for thoroughly mediocre products.",
        "score": 20,
        "is_top_level": true
      },
      {
        "author": "StrawberryShade",
        "body": "Okay, so you should DEFINITELY be our skincare authority. I'd suggest posting on r/SkincareAddiction etc.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "CutResponsible4123",
        "body": "Curious about farmacy products on boxy",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "CenCali805",
        "body": "Not gonna lie though, I’ve loved the Avant products I’ve received from them. Really come in handy during winter when my skin gets really dry and the micelles water this time around has worked and not broken me out. Gonna keep using them to be honest.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "penguinlily",
        "body": "I don’t understand why they would change the ingredients. Isnt the point of a product being in a beauty box to bring awareness to the brand name and products? If the products are inferior in a beauty box I’m not spending the money outside of the box in the future. They’re only hurting themselves.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "pegasusnites",
        "body": "Well, this is extremely concerning. Thankfully I've not purchased anything at full retail, nor have I purchased any of their products in the add-ons",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "chinamontega215",
        "body": "Yeah the only reason I picked it was because I saw on YouTube that micellar water could restore colourpop jellymuch eyeshadows once they’ve dried out",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "SnooKiwis2573",
        "body": "I wish I knew this before I made my choice to avant for my janurary box 😬😬😬😬",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "New_Cardiologist_763",
        "body": "This post is amazing. I need you to navigate my skincare for me. If you do this on social media pls DM me your info. 🥰",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "RiotGirrl4life",
        "body": "You are doing the work we all needed to know!! I thought I was a genius using incidecoder.com  but you have totally brought the research through.  111skin products are garbage. I'm going to go find that hand moisturizer after I cancel Ipsy and switch to Boxy. The January bag is too good to miss out on. You made a lot of really good points here and I just appreciate your dedication to the truths in the makeup/skin care industry.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MashaSP",
        "body": "I agree about the Avant brand, but a lot of my friends from Europe with money swear by 111Skin products (real ones). Maybe we get different stuff in US, I don't know. \nThank you for the post. I'm not good about reading ingredients, but I want to learn more.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ersonday",
        "body": "I found this post looking up an add on avant product from fff and I’m so impressed and thankful for this research! I’m starting to feel dermalactives is similar!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Striking-Ad2442",
        "body": "Hey did anyone get any more information on Avant?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "avomir",
        "body": "I so appreciate this post! I saw Avants skin care price and honestly was fishy about the entire line suspecting it's shitty ingredients disguised as \"super expensive\" to make the Boxes seem more valuable.\n\nYou can't find the owners anywhere online (which seriously, if you're this high-end brand that is backed by a \"bunch of research\" wouldn't you be proud and want to show your face?). On their Instagram they even have a FAQ where someone asks who the CEO/Founder is, and they say that \"They don't focus on the CEO/Founder but the brand only\"\n\nNot to mention their website copy is absolute garbage and super vague, and though they say they're back by science it seriously just seems like they are using science-washing terms. \n\nCame on reddit and saw this post that validated everything I was feeling.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Heather-Tatum",
        "body": "I was just beginning to wonder about these companies because I get both boxes and I see the huge discounts for the skin care and I've actually fell for it quite a bit but now they're coming out with all these new products over 100 dollars",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 15,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "hb0ev2",
    "title": "[Review]: Klairs Midnight Blue Calming Cream",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/hb0ev2/review_klairs_midnight_blue_calming_cream/",
    "score": 42,
    "num_comments": 8,
    "created": "2020-06-17T21:20:30+00:00",
    "body": "**Klairs Midnight Blue Calming Cream**\n\nYay…I’m so happy to be back to writing reviews! The past couple of weeks have left me less than motivated to talk/write about skincare. But, I feel like finding a balance between keeping up with my interests/hobbies while also setting aside time to support the community will be best for me. Plus…looking at my spreadsheet and seeing so many products approaching the one month mark makes me anxious LOL! \n\nThe Klairs Midnight Blue Calming Cream is a product that so many people have suggested to me and raved about. This is a medium weight/thick cream style product that has a very slight “jelly” feel compared to other heavier night creams. Featured ingredients include Sodium Hyaluronate, Centella Asiatica (wow…writing that for the first time in weeks is nice), Shea Butter, Argan Oil, Jojoba Seed Oil, Lotus Flower Extract, and several Ceramides/Peptides. Blue Chamomile Extract is also featured here to really support calming/redness reduction. That ingredient is also what gives this product its light blue hue.\n\nApplication of this product is pretty straight forward…just slap it on LOL! The Klairs Midnight Blue Calming Cream applies/glides on fairly easily and absorbs well. In fact…for me it tended to absorb a little too well for my taste leading me to use a bit more per application than I had anticipated. The lack of added fragrance (including essential oils) here means that this product has a light “lotion” scent but really there isn’t much of a scent at all. \n\nOnce applied and absorbed…the Klairs Midnight Blue Calming Cream really impressed me with the light yet slightly dewy finish it left my skin. Even with the various oils and Shea Butter this product doesn’t feel greasy or leave a shiny residue. I kind of love the way my skin looks after using this product to the point that I could see myself using it in the AM if my skin was feeling particularly dry. This product really leaves my skin feeling nourished and hydrated.  \n\nAs for the calming/soothing benefit, that is where this product takes a bit of a stumble in my opinion (I know…GASP). While I do think the Klairs Midnight Blue Calming Cream provides a physical cooling effect upon application and some mild redness reduction…it wasn’t as impactful on my skin as it has been for so many others. It was a great support product (especially as I was adjusting to Tretinoin)…but I found myself relying much more on the I’m From Mugwort Essence and Mask as real soothing/redness reducing steps. \n\nThe Ceramides here along with the nourishing emollients are an excellent way to moisturize the skin and lock in hydration. There is no doubt that this product helped to keep my skin as happy and healthy as it could be while adjusting to Tretinoin and I’m so glad I decided two work it into my routine. But, those that are looking specifically for a calming/soothing product and aren’t as concerned with the other benefits may be left wanting more. Also, those that tend to go heavy with their night cream application (be it to quench dry skin or just as a personal preference) may burn through this product faster than anticipated. I was lucky enough to have both the 30ml and 60ml versions and I ended up having to crack open the 60ml before the month trial was up just to finish out the month.   \n \n\nWhen it comes to a recommendation…I don’t know if I can call this one a winner for me or point people to it. If calming/soothing are what you are after I would go for the I’m From Mugwort Essence and keep your moisturizer focused on hydration/nourishment. If Ceramides/Peptides are your jam this could be a good option…but keep an eye out for products that don’t have the Blue Chamomile (as they might be a bit more affordable). I have the Klairs Supple Preparation All-Over Lotion in my stash now and while it does not contain Peptides it does have Ceramides, Jojoba Oil, and Shea Butter. From what I remember it is about the same price as the 60ml Midnight Blue Calming Cream…but it comes in at 250ml. \n\nI’ll keep hunting for a moisturizer that perfectly marries soothing/calming with. nourishment…I just didn’t find the Klairs Midnight Blue Calming Cream to be it. \n\nFull Ingredients List: Water, Cetyl Ethylhexanoate, Butylene Glycol, Glycerin, Sodium Hyaluronate, Caprylic/Capric Triglyceride, Centella Asiatica Extract, Sorbitan Stearate, Cetyl Alcohol, Butyrospermum Parkii (Shea) Butter, Argania Spinosa Kernel Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Sorbitan Sesquioleate, Glyceryl Stearate, Stearic Acid, Portulaca Oleracea Extract, Anthemis Nobilis Flower Extract, Ceramide NP, Polysorbate 60, Candelilla Cera, Chlorphenesin, Tocopheryl Acetate, Xanthan Gum, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Morus Alba Root Extract, Tromethamine, Brassica Oleracea Italica (Broccoli) Extract, Guaiazulene, Acetyl Hexapeptide-8, Lecithin, Acetyl Glutamine, sh-Oligopeptide-1, sh-Oligopeptide-2, sh-Polypeptide-1, sh-Polypeptide-9, sh-Polypeptide-11, Bacillus/Soybean/Folic Acid Ferment Extract, Caprylyl Glycol, 1,2-Hexanediol\n\nWhere To Buy ($24.50 USD on Wishtrend for 30ml): [https://www.wishtrend.com/shop/midnight-blue-calming-cream/](https://www.wishtrend.com/shop/midnight-blue-calming-cream/)",
    "flair_text": "Review",
    "flair_template_id": "9297aa06-d015-11e3-b9a1-12313d18e5cd",
    "comments": [
      {
        "author": "0l0l00l",
        "body": "I purchased this product after researching it for a while. I used it for a week, and then gave it away to my friend who has been asking about product recommendations. I just wasn't impressed with it. It didn't add to my routine, and it didn't actually layer well with my other products. \n\nBottom line, I agree with your review. It's something I'd recommend to others looking for such product, but wouldn't say it's a must have in your routine.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "scoopie77",
        "body": "Excellent review! Keep up the good work.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "AliceLid",
        "body": "This stuff is amazing on my eczema. Different strokes :)",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "smitha12345",
        "body": "I have this too and use it as an “emulsion” step before applying something more occlusive. My review is similar to yours. Nicely hydrating but not that noticeably soothing, though I’ve been switching up this step lately so it could be that I just haven’t used it enough.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "ddddfushxjjd",
        "body": "Is this completely unscented  ?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/hajp0v/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "hb0ftq",
    "title": "[Review]: Klairs Midnight Blue Calming Cream",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/hb0ftq/review_klairs_midnight_blue_calming_cream/",
    "score": 36,
    "num_comments": 2,
    "created": "2020-06-17T21:21:53+00:00",
    "body": "**Klairs Midnight Blue Calming Cream**\n\nYay…I’m so happy to be back to writing reviews! The past couple of weeks have left me less than motivated to talk/write about skincare. But, I feel like finding a balance between keeping up with my interests/hobbies while also setting aside time to support the community will be best for me. Plus…looking at my spreadsheet and seeing so many products approaching the one month mark makes me anxious LOL! \n\nThe Klairs Midnight Blue Calming Cream is a product that so many people have suggested to me and raved about. This is a medium weight/thick cream style product that has a very slight “jelly” feel compared to other heavier night creams. Featured ingredients include Sodium Hyaluronate, Centella Asiatica (wow…writing that for the first time in weeks is nice), Shea Butter, Argan Oil, Jojoba Seed Oil, Lotus Flower Extract, and several Ceramides/Peptides. Blue Chamomile Extract is also featured here to really support calming/redness reduction. That ingredient is also what gives this product its light blue hue.\n\nApplication of this product is pretty straight forward…just slap it on LOL! The Klairs Midnight Blue Calming Cream applies/glides on fairly easily and absorbs well. In fact…for me it tended to absorb a little too well for my taste leading me to use a bit more per application than I had anticipated. The lack of added fragrance (including essential oils) here means that this product has a light “lotion” scent but really there isn’t much of a scent at all. \n\nOnce applied and absorbed…the Klairs Midnight Blue Calming Cream really impressed me with the light yet slightly dewy finish it left my skin. Even with the various oils and Shea Butter this product doesn’t feel greasy or leave a shiny residue. I kind of love the way my skin looks after using this product to the point that I could see myself using it in the AM if my skin was feeling particularly dry. This product really leaves my skin feeling nourished and hydrated.  \n\nAs for the calming/soothing benefit, that is where this product takes a bit of a stumble in my opinion (I know…GASP). While I do think the Klairs Midnight Blue Calming Cream provides a physical cooling effect upon application and some mild redness reduction…it wasn’t as impactful on my skin as it has been for so many others. It was a great support product (especially as I was adjusting to Tretinoin)…but I found myself relying much more on the I’m From Mugwort Essence and Mask as real soothing/redness reducing steps. \n\nThe Ceramides here along with the nourishing emollients are an excellent way to moisturize the skin and lock in hydration. There is no doubt that this product helped to keep my skin as happy and healthy as it could be while adjusting to Tretinoin and I’m so glad I decided two work it into my routine. But, those that are looking specifically for a calming/soothing product and aren’t as concerned with the other benefits may be left wanting more. Also, those that tend to go heavy with their night cream application (be it to quench dry skin or just as a personal preference) may burn through this product faster than anticipated. I was lucky enough to have both the 30ml and 60ml versions and I ended up having to crack open the 60ml before the month trial was up just to finish out the month.   \n \n\nWhen it comes to a recommendation…I don’t know if I can call this one a winner for me or point people to it. If calming/soothing are what you are after I would go for the I’m From Mugwort Essence and keep your moisturizer focused on hydration/nourishment. If Ceramides/Peptides are your jam this could be a good option…but keep an eye out for products that don’t have the Blue Chamomile (as they might be a bit more affordable). I have the Klairs Supple Preparation All-Over Lotion in my stash now and while it does not contain Peptides it does have Ceramides, Jojoba Oil, and Shea Butter. From what I remember it is about the same price as the 60ml Midnight Blue Calming Cream…but it comes in at 250ml. \n\nI’ll keep hunting for a moisturizer that perfectly marries soothing/calming with. nourishment…I just didn’t find the Klairs Midnight Blue Calming Cream to be it. \n\nFull Ingredients List: Water, Cetyl Ethylhexanoate, Butylene Glycol, Glycerin, Sodium Hyaluronate, Caprylic/Capric Triglyceride, Centella Asiatica Extract, Sorbitan Stearate, Cetyl Alcohol, Butyrospermum Parkii (Shea) Butter, Argania Spinosa Kernel Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Sorbitan Sesquioleate, Glyceryl Stearate, Stearic Acid, Portulaca Oleracea Extract, Anthemis Nobilis Flower Extract, Ceramide NP, Polysorbate 60, Candelilla Cera, Chlorphenesin, Tocopheryl Acetate, Xanthan Gum, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Morus Alba Root Extract, Tromethamine, Brassica Oleracea Italica (Broccoli) Extract, Guaiazulene, Acetyl Hexapeptide-8, Lecithin, Acetyl Glutamine, sh-Oligopeptide-1, sh-Oligopeptide-2, sh-Polypeptide-1, sh-Polypeptide-9, sh-Polypeptide-11, Bacillus/Soybean/Folic Acid Ferment Extract, Caprylyl Glycol, 1,2-Hexanediol\n\nWhere To Buy ($24.50 USD on Wishtrend for 30ml): [https://www.wishtrend.com/shop/midnight-blue-calming-cream/](https://www.wishtrend.com/shop/midnight-blue-calming-cream/) \n\nhttps://preview.redd.it/x41tcre6fj551.jpg?width=4032&format=pjpg&auto=webp&s=e2599382a8724f11086672c1e653a6646d411958\n\n&#x200B;\n\nhttps://preview.redd.it/1tltx5h7fj551.jpg?width=4032&format=pjpg&auto=webp&s=26afec2242403028be33ac2c5904a6d7fa1e4813",
    "flair_text": "REVIEW",
    "flair_template_id": "62e1292e-4166-11e8-9ee1-0eb6a157035e",
    "comments": [
      {
        "author": "ramenhairwoes",
        "body": "Excellent review, thanks! Always looking for skin soothing/healing products as a tret user.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "BehindTheVeil01",
        "body": "My holy grail for years now! This has been my saviour when it comes to my rosacea flare ups along with the Klairs unscented toner 🥰",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "s4cfby",
    "title": "[Review] Brand Review: Skin Need (Hong Kong)",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/s4cfby/review_brand_review_skin_need_hong_kong/",
    "score": 26,
    "num_comments": 0,
    "created": "2022-01-15T05:02:51+00:00",
    "body": "This review is about a relatively newer brand called Skin Need. I believe it is a Hong Kong brand, although a bit confusing because their products say they are \"Made in California\". It's one of those clean, cruelty-free, green/sustainable type brands which advertises on being simple and straightforward. Supposed to be great for sensitive skin types. Back in September 2021 I made the plunge and ordered a bunch of their things-- and honestly have been ordering from them almost every sale ever since! I get my stuff from another site called Woke Up Like This (WULT Beauty), which also makes their own make-up and products, but I believe they are the only distributor that will ship to the US from Asia. \n\nJust a little bit about my skin: I'm a longtime acne sufferer, in my 30s and still getting acne (although thankfully \\*KNOCK ON WOOD\\* not the cystic breakouts of my teens and 20s). My skin now is still pretty oily and plagued by sebaceous filaments, large pores, and even sebaceous cysts. I believe I'm an \"oily, dehydrated\" though, so my skin is also dry. Getting into my 30s, I also have some fine lines appearing and dryness on my cheeks. It's my T-zone (chin, nose and forehead) that remain the oiliest.\n\nWhat I tend to look for in my skincare: fungal acne safe (aiming for 100% FA safe!), fragrance-free, and simple ingredients. Pretty recently (November 2021), I've been cutting out all actives and just trying out the \"repair my skin barrier\" thing, so the main things I look for are moisturization.\n\n&#x200B;\n\n[My most recent haul - I'm only reviewing the Skin Need stuff! ](https://preview.redd.it/ttvvpq5x7sb81.jpg?width=3024&format=pjpg&auto=webp&s=c569e44363f3277d2964eb8d89d8bdc0880e2747)\n\nWithout further ado, here are my thoughts on all the products I've bought/tried so far. I tried to include some photos of the products but I didn't really think I was going to post or review at first, so they are limited!\n\n**Intense Nano-Lift Peptides** **Serum.** I only ordered 1 bottle of this, 40ml, which lasted about 1-month or so. The serum claims to help to lift and firm the skin, good for all skin types, and focus is on lines. The serum comes out a white and cloudy, opaque. Not tacky and absorbs fast. It's a bit runny, so either drop it into your palm and then smooth over the face or rub quickly to prevent dripping. 3-4 drops was enough to cover face and neck! I really liked how this serum helped to calm my redness and helped with moisture. This is probably the biggest benefit I saw to reduce lines-- I look older when I'm dehydrated and this serum helped to stabilize my skin. Even if I was breaking out, the acne was just more calm and healed much quicker for me while using this. I can't say I can speak for improving lines- my expression lines on the forehead and around the eyes when I smile are still there when I am smiling. I always consider serums targeting lines is more for prevention, and since I only had 1-mo of it, not sure I can really comment on it!\n\n>Ingredients: Argireline, Pentapeptides, Resveratrol, Marine Kelp Extract, Eternity Grass Extract, Nano Hyaluronic Acid, High Molecular Weight Sodium Hyaluronate. Ethylhexylglycerin, DI Water. \n\n**S-cell Power** **Serum.** I also only had a 40ml bottle of this, so my trial of it only lasted for a month or so. This is also thin, white/opaque. It was less runny than the Intense Nano-Lift Peptides though, and still 3-4 drops is enough for the whole face. This serum is meant to target dull and stressed skin, with a focus on collagen repair. I used this, along with the KGF serum after a microneedling session. I feel that it helped a with healing and calming down redness in the recovery days, and overall has helped to minimize the appearance of my pores. I can't comment on the anti-aging aspect so quickly but I am a fan of the serum and will be repurchasing. You can all check on me when I'm 40 to see if I look younger than my age! \n\n>Ingredients:  Swiss Apple Stem Cell Extract, Partridge Berry Stem Cell Extract, Geranylgeranylacetone, Nano-Hyaluronic Acid, High Molecular Weight Sodium Hyaluronate. Ethylhexylglycerin, DI Water. \n\n**100% Hyaluronic Acid +KGF** **serum**. I was using this serum at the same time as the S-cell Power serum, so all of my comments on it's effects are the same as above. The focus of this serum is on repair, and is advertised to be used after procedures to boost healing. This serum is clear and more like your usual hyaluronic acid serums, a bit thicker but absolutely not tacky at all! Dries super smooth and I usually do about 4-5 drops to cover my whole face and neck. I actually went back and bought 2-more of these during their Thanksgiving sale in November and will continue to use it. \n\nI recently got a microneedling session done again this week and will only have the KGF serum (ran out of the S-cell Power serum already), so I'll try to update back on it later this month on how the KGF is helping by itself! \n\n> Ingredients: Keratinocyte Growth Factor, Palmitoyl Tripeptide, Beta Glucan, Nano Hyaluronic Acid, High Molecular Weight Sodium Hyaluronate, Ethylhexylglycerin, DI Water. \n\nThe one nice thing about all of the serums above is that they are **all fungal acne safe**! Or at least based on their listed/posted ingredients they are. I'm going to try their HA+B5 serum next, and right now just at a loss of how to decide between all of them. I want to use them all every day! But trying to use 4 different serums all at once, in addition to the rest of the skincare routine, is crazy. \n\n&#x200B;\n\n[I do enjoy the airless pump bottle! ](https://preview.redd.it/9k9cut07asb81.png?width=790&format=png&auto=webp&s=2c09a17efe10ea2b0d6b164bdea3b3d7139301e5)\n\n**XX The Signal** **Moisturizer.** I bought this more because it came as a part of a package during one of their sales. This moisturizer is **not** fungal acne safe. I did give it a try a couple times on the face but I think it immediately made my skin oilier, bumpier, and started to get more acne spots again. I stopped  it in about 2 weeks, and then tried to give it a try around my eyes as an eye cream, which has been fine. This probably has less to do with the moisturizer and more because I deal with fungal acne. It is moisturizing and I feel like it can help with fine lines. It is pretty thin, more lotion than cream. It also melts down, absorbs rather fast, and doesn't leave a film over the face. There is no real fragrance to it. It's moisturizing ability is equivalent to the Cerave cream.\n\n>Ingredients:  Mexican Wild Yam Extract, Argireline, Pentapeptides, Lotus Flower Extract, Persian Rose Extract, French Lavender Hydrosol, Aloe Vera Leaf Juice, Citrus Glauca Extract, Acacia Fruit Extract, Kukui Nut Oil, Rosewood Essential Oil, Olive Extract \n\nI still have yet to try their squalane oil and their Hydra Smooth Essence Moisturizer. I am a little cautious though, when you run the ingredients of the Hydra Smooth Essence Moisturizer through any of the fungal acne checkers -- it'll say fungal acne safe, but that's because they list it as \"rice bran extract\" instead of \"rice bran oil\". Not quite sure if I'm willing to risk trying this one yet! \n\n**Overall impression**: I super like this brand, mostly for their serums since not every item of theirs is fungal acne safe. I do feel that my skin is more stable since starting on their products. I think for those with less sensitive needs than me, you'll have no problem investing in an entire routine from them! It does have a very \"instagram clout\" type of feel to it though, and there aren't a lot of other reviews in English available. Make of that what you will! \n\nIf you're ordering from WULT to USA, it can be a little costly. Since they're shipping from Hong Kong, and due to recent COVID-19 issues, the only option is DHL ($$$). Shipping on average is about $200HKD ($25 USD). If you're ordering during sales + plus the shipping costs, it comes out to about $40 per item, which is no Timeless Skin Care sale but it's not like a Tatcha or Lancome type of $$$ either. Their customer service is amazing though, super responsive on both Instagram and through Whatsapp. I'm dreaming that one day they'll have free shipping for us international customers! \n\nI am a bit confused by their \"Made in California\" claim. Does this mean I'm paying for a product that is made in the state I live in, to be shipped to Hong Kong, just to get shipped back to me? Lol, I almost want to ask if there is a way I can cut the middle man and just get it from the warehouse in California.",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "g92qxz",
    "title": "[Review]: Troiareuke Acsen Pore Control Mask",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/g92qxz/review_troiareuke_acsen_pore_control_mask/",
    "score": 6,
    "num_comments": 2,
    "created": "2020-04-27T15:24:30+00:00",
    "body": "**Troiareuke Acsen Pore Control Mask**\n\nThis brand has been on my radar for quite some time. A lot of my favorite YouTube personalities rave about Troiareuke not only for their take-home products…but also for their chain of spas in Seoul. Their signature facial called the “Troipeel” involves little plant-based micro needles being pushed into the skin. While it looks really painful…so many people love the brightening, lifting, and resurfacing benefits. \n\nI kept myself from diving into the products mainly because of the prices compared to other K-Beauty brands (at least the ones I was familiar with early on). And while I do think some of their offerings are still on the pricey side…I don’t feel the same “sticker shock” as I did a couple of years ago. Of course, that is personal opinion…everyone has a different price range/budget they need to stick to.\n\nAnyway, all of that is to say that the first Troiareuke product I decided to go for was the Acsen Pore Control Mask. The Acsen line is focused on acne prone/sensitive skin. Ac(ne)sen(sitive)…you get the idea. The Pore Control Mask focuses on lessening the appearance of large pores while also removing excess oil/sebum and calming the skin. Pretty run-of-the-mill claims from a clay based mask…but I’ve found it hard to find one that truly does it all.\n\nFeatured ingredients here include Kaolin Clay, Bentonite Clay, Moroccan Lava Clay, Yuzu Fruit Extract, Green Tea Leaf Extract, Centella Asiatica Extract, Sage Leaf Extract, and Lotus Flower Extract. There is added fragrance here (which doesn’t really line up with the claim to target sensitive skin) and the scent is quite strong. I cant really place it to be honest LOL! It is a powdery/floral scent that I don’t hate…but I don’t love. It’s strong enough that some people may not be able to handle this mask.\n\nApplication of this mask is once again pretty typical for a clay based mask. I use a brush to apply several dollops of product on to my skin…but fingers are fine too. One of the main differences I have found with the Acsen Pore Control Mask though is just how easily and smoothly it applies. The texture of this mask is so unique and just feels more “fine” in a way. Other clay masks can be hard to spread around and even feel clumpy…this is like a really smooth/near lotion feel.\n\nOnce on, this mask dries rather quickly (you only need a thin layer). Just 5-10 minutes and this product dries down completely. I have used a few clay masks recently that remain damp during application and rinsing which I have really liked. But, this clay mask (while it hardens like a more traditional mask) feels plenty comfortable to me. It has a bit more flex and doesn’t feel like it will flake off with the slightest movement.\n\nWhen it comes time to rinse/remove…the Troiareuke Acsen Pore Control Mask really shines. Even the rinsing process alone is impressive LOL! The “cast” that is created when this product dries breaks up incredibly well and allows the mask to risne off/emulsify super easily. This isn’t a product that you have to scrub or use tons of water to fully remove. It just kind of…melts away.\n\nAnd the final result is just awesome! I don’t know if the Kaolin and Bentonite Clays are just used in a unique way here, or if they are more finely milled than usual…but my skin is left looking so soft and even toned. Even more impressive is that my larger pores and general skin texture seems to be so much more even and “blurred” after using the Acsen Pore Control Mask. It almost has a cosmetic effect in that its so immediate and impressive. There is also a noticeable brightening and calming effect as well.\n\nOver time I have taken to moving this product to my AM routine just so I can have that “look” or benefit during the daytime rather than wasting it in bed. I cant wait to use this product when quarantine is over LOL! Using it in the PM is totally fine too as I do find the benefits from this product to be rather long lasting. In addition to the immediate results my skin just seems more balanced and I don’t notice the patches of oily skin on my t-zone that I normally get by the end of the day. Once again, there is something they did with the clays here to make them seem more effective and just “elegant” in application.\n\nIt only took about three uses of the Troiareuke Acsen Pore Control Mask for me to fall in love with it LOL! It’s that impressive. I’ve still got about half of my first tube left after one month and I already have a backup waiting. Outside of an Elizavecca Clay Bubble Mask “something or other” that I am using as part of a collaboration review…the Acsen Control Mask is the only other clay product I have in my stash and I don’t think I’ll be exploring other options. This really is one of the more impressive clay masks that I have ever used and I think I’m all set on hunting for more.\n\nThe price did seem a bit steep at first…especially compared to other “bulk” clay masks like the Aztec Secret. But, after using clay products in a higher price point from Peach & Lily and Youth To The People (both of which I loved) and just being THAT much more impressed with the immediate and long-term results from the Acsen Pore Control Mask…I’m ready to put a ring on it. \n\nThe only thing that could make this love connection better would be the omission of added fragrance. \n\nFull Ingredients List:\n\nWater, Kaolin, Propanediol, Bentonite, Butylene Glycol, Titanium Dioxide, 1,2-Hexanediol, Magnesium, Aluminum Silicate, Dimethyl Sulfone , Xanthan Gum, Ethylhexylglycerin, Caprylyl Glycol, Dipotassium Glycyrrhizate, Moroccan Lava Clay, Betaine, Allantoin, Citrus Junos Fruit Extract, Camellia Sinensis Leaf Extract, Centella asiatica extract, Salvia Officinalis (Sage) Leaf Extract, Poncirus Trifoliata Fruit Extract, Anthemis Nobilis Flower Extract, Propylene Glycol, Disodium EDTA, Camellia Japonica Flower Extract, Nelumbo Nucifera Flower Extract, Fragrance\n\nWhere To Buy (Soko Glam $38.00 USD): [https://sokoglam.com/collections/troiareuke/products/troiareuke-acsen-pore-control-mask](https://sokoglam.com/collections/troiareuke/products/troiareuke-acsen-pore-control-mask)\n\nhttps://preview.redd.it/580h1sqyodv41.jpg?width=4032&format=pjpg&auto=webp&s=f86a4273f5d899bded1ad5145041500b0b5851fd",
    "flair_text": "Review",
    "flair_template_id": "9297aa06-d015-11e3-b9a1-12313d18e5cd",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/g8tbvi/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi there! \n\nIt seems like you may be looking for some information on Dermarolling/Dermastamping. \n\nDermarolling can improve the appearance of atrophic scarring when done correctly. \n\nHowever, there are several risks and I'd like to warn you about them: \n\n* You should not be doing this every day. When done in-office, treatments are spaced a few weeks to a month apart.\n\n* Done improperly you can end up with hypopigmentation (white or colorless spots in the skin that do not return to a normal color)\n\n* It hurts.\n\n* You can not fully sterilize the needles at home. They can be sanitized at best.\n\n* The needles can become bent over time, or come from the manufacturer already bent. Small bends can be imperceptible to the naked eye and can cause unwanted damage to your skin.\n\n**Because of these risks, ScA does not recommend attempting dermarolling or dermastamping at home. Please be careful with your skin and your health!**\n\n*If you see that I am replying to something out of context (eg. listed in a routine), please report this comment so my handlers can remove it. Cheers!*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "g92rqw",
    "title": "[Review]: Troiareuke Acsen Pore Control Mask",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/g92rqw/review_troiareuke_acsen_pore_control_mask/",
    "score": 4,
    "num_comments": 0,
    "created": "2020-04-27T15:25:42+00:00",
    "body": "**Troiareuke Acsen Pore Control Mask**\n\nThis brand has been on my radar for quite some time. A lot of my favorite YouTube personalities rave about Troiareuke not only for their take-home products…but also for their chain of spas in Seoul. Their signature facial called the “Troipeel” involves little plant-based micro needles being pushed into the skin. While it looks really painful…so many people love the brightening, lifting, and resurfacing benefits. \n\nI kept myself from diving into the products mainly because of the prices compared to other K-Beauty brands (at least the ones I was familiar with early on). And while I do think some of their offerings are still on the pricey side…I don’t feel the same “sticker shock” as I did a couple of years ago. Of course, that is personal opinion…everyone has a different price range/budget they need to stick to.\n\nAnyway, all of that is to say that the first Troiareuke product I decided to go for was the Acsen Pore Control Mask. The Acsen line is focused on acne prone/sensitive skin. Ac(ne)sen(sitive)…you get the idea. The Pore Control Mask focuses on lessening the appearance of large pores while also removing excess oil/sebum and calming the skin. Pretty run-of-the-mill claims from a clay based mask…but I’ve found it hard to find one that truly does it all.\n\nFeatured ingredients here include Kaolin Clay, Bentonite Clay, Moroccan Lava Clay, Yuzu Fruit Extract, Green Tea Leaf Extract, Centella Asiatica Extract, Sage Leaf Extract, and Lotus Flower Extract. There is added fragrance here (which doesn’t really line up with the claim to target sensitive skin) and the scent is quite strong. I cant really place it to be honest LOL! It is a powdery/floral scent that I don’t hate…but I don’t love. It’s strong enough that some people may not be able to handle this mask.\n\nApplication of this mask is once again pretty typical for a clay based mask. I use a brush to apply several dollops of product on to my skin…but fingers are fine too. One of the main differences I have found with the Acsen Pore Control Mask though is just how easily and smoothly it applies. The texture of this mask is so unique and just feels more “fine” in a way. Other clay masks can be hard to spread around and even feel clumpy…this is like a really smooth/near lotion feel.\n\nOnce on, this mask dries rather quickly (you only need a thin layer). Just 5-10 minutes and this product dries down completely. I have used a few clay masks recently that remain damp during application and rinsing which I have really liked. But, this clay mask (while it hardens like a more traditional mask) feels plenty comfortable to me. It has a bit more flex and doesn’t feel like it will flake off with the slightest movement.\n\nWhen it comes time to rinse/remove…the Troiareuke Acsen Pore Control Mask really shines. Even the rinsing process alone is impressive LOL! The “cast” that is created when this product dries breaks up incredibly well and allows the mask to risne off/emulsify super easily. This isn’t a product that you have to scrub or use tons of water to fully remove. It just kind of…melts away.\n\nAnd the final result is just awesome! I don’t know if the Kaolin and Bentonite Clays are just used in a unique way here, or if they are more finely milled than usual…but my skin is left looking so soft and even toned. Even more impressive is that my larger pores and general skin texture seems to be so much more even and “blurred” after using the Acsen Pore Control Mask. It almost has a cosmetic effect in that its so immediate and impressive. There is also a noticeable brightening and calming effect as well.\n\nOver time I have taken to moving this product to my AM routine just so I can have that “look” or benefit during the daytime rather than wasting it in bed. I cant wait to use this product when quarantine is over LOL! Using it in the PM is totally fine too as I do find the benefits from this product to be rather long lasting. In addition to the immediate results my skin just seems more balanced and I don’t notice the patches of oily skin on my t-zone that I normally get by the end of the day. Once again, there is something they did with the clays here to make them seem more effective and just “elegant” in application.\n\nIt only took about three uses of the Troiareuke Acsen Pore Control Mask for me to fall in love with it LOL! It’s that impressive. I’ve still got about half of my first tube left after one month and I already have a backup waiting. Outside of an Elizavecca Clay Bubble Mask “something or other” that I am using as part of a collaboration review…the Acsen Control Mask is the only other clay product I have in my stash and I don’t think I’ll be exploring other options. This really is one of the more impressive clay masks that I have ever used and I think I’m all set on hunting for more.\n\nThe price did seem a bit steep at first…especially compared to other “bulk” clay masks like the Aztec Secret. But, after using clay products in a higher price point from Peach & Lily and Youth To The People (both of which I loved) and just being THAT much more impressed with the immediate and long-term results from the Acsen Pore Control Mask…I’m ready to put a ring on it. \n\nThe only thing that could make this love connection better would be the omission of added fragrance. \n\nFull Ingredients List:\n\nWater, Kaolin, Propanediol, Bentonite, Butylene Glycol, Titanium Dioxide, 1,2-Hexanediol, Magnesium, Aluminum Silicate, Dimethyl Sulfone , Xanthan Gum, Ethylhexylglycerin, Caprylyl Glycol, Dipotassium Glycyrrhizate, Moroccan Lava Clay, Betaine, Allantoin, Citrus Junos Fruit Extract, Camellia Sinensis Leaf Extract, Centella asiatica extract, Salvia Officinalis (Sage) Leaf Extract, Poncirus Trifoliata Fruit Extract, Anthemis Nobilis Flower Extract, Propylene Glycol, Disodium EDTA, Camellia Japonica Flower Extract, Nelumbo Nucifera Flower Extract, Fragrance\n\nWhere To Buy (Soko Glam $38.00 USD): [https://sokoglam.com/collections/troiareuke/products/troiareuke-acsen-pore-control-mask](https://sokoglam.com/collections/troiareuke/products/troiareuke-acsen-pore-control-mask)\n\nhttps://preview.redd.it/zluenq26pdv41.jpg?width=4032&format=pjpg&auto=webp&s=e4b10493b9bf002c2491c0c187d945795e461fe9",
    "flair_text": "REVIEW",
    "flair_template_id": "62e1292e-4166-11e8-9ee1-0eb6a157035e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "KoreanBeauty",
    "post_id": "j3frod",
    "title": "[REVIEW] THE FACE SHOP LOTUS SHEET MASK REVIEW",
    "url": "https://www.reddit.com/r/KoreanBeauty/comments/j3frod/review_the_face_shop_lotus_sheet_mask_review/",
    "score": 2,
    "num_comments": 4,
    "created": "2020-10-01T19:45:38+00:00",
    "body": "THE FACE SHOP LOTUS SHEET MASK REVIEW\n\nINTRODUCTION:\n\nSheet masks are fabric masks drenched in serums. Today, I am going to share my review on The Face Shop Lotus Sheet Mask. \n\nNow, these masks come in different types of masks. Each mask has a special serum derived from that particular natural ingredient.\n\nCLAIMS:\n\nThe mask sheet drenched in a smooth serum with oil with the pure energy of Lotus Flower moisturises and gives tired, rough skin a boost of radiance. The formula is without added parabens.\n\nPRICE:\n\n$2 - $3\n\nQUANTITY:\n\nThe sheet mask is filled with about 20g of serum.\n\nMAIN INGREDIENTS:\n\nLotus flower extract is it's main ingredient.\n\nHOW TO USE:\n\n1. After washing your face, place the sheet on your face.\n\n2. After 15 - 20 minutes, remove the sheet and pat the remaining essence on the face for absorption.\n\nBENEFITS (Claimed by TFS):\n\nImprove your dull complexion and skin elasticity.\n\nTIPS:\n\nPut it in the fridge before using it for a more cooling effect.\n\nPRECAUTIONS:\n\nIf you experience any symptoms such as redness, swelling, or itchiness during usage or from exposure to direct sunlight after usage, suspend use, and consult a physician.\n\nFINAL THOUGHTS:\n\nThis mask is a cotton sheet mask that is drenched in serum. It is a very travel friendly option for those who are traveling.\n\nThe mask is very moisturizing and it made my skin feel so soft.\n\nI used this mask on 2 different days and the results were amazing. You can watch my results here:\n\nhttps://youtu.be/A_M9Y59POEI",
    "flair_text": "REV",
    "flair_template_id": "f964eb06-d248-11e3-b9d1-12313d18e5cd",
    "comments": [
      {
        "author": "tanzu122",
        "body": "I love the masks from The Face Shop n their rice wash",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "herbs",
    "post_id": "1disxhs",
    "title": "Hello! Where can I find nelumbo nucifera extract ? I live in France",
    "url": "https://www.reddit.com/r/herbs/comments/1disxhs/hello_where_can_i_find_nelumbo_nucifera_extract_i/",
    "score": 2,
    "num_comments": 0,
    "created": "2024-06-18T15:06:27+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "eyelashextensions",
    "post_id": "1ku47i4",
    "title": "Is this product safe for lash extensions?",
    "url": "https://www.reddit.com/r/eyelashextensions/comments/1ku47i4/is_this_product_safe_for_lash_extensions/",
    "score": 2,
    "num_comments": 2,
    "created": "2025-05-24T05:32:04+00:00",
    "body": "I've been working as a salon manager for a franchise chain of lash salons for the past 6 months and one of the benefits is free lashes regularly. So this has been my first venture into them and the aftercare. Our salon advises to avoid all products with any oils in them. But beyond that, there isn't much information or details given by the stylists.  I'm not sure if I see just the word 'oil' in it, does it definitively mean avoid at all costs? \n\nI personally use a foam lash shampoo, the correct cleansing brush, and wash the rest of my face with either Neutrogena oil-free foaming scrub or Clinique All About Clean rinse-off foaming cleanser.\n\nSorry for the novel, but I'd like the pros and very knowledgeable lash experts to let me know if they know of certain cosmetic ingredients that I should 'full stop' not put on my face. With this regimen I've done the past 6 months, I have great lash retention and minimal damage to my natural lashes. \n\nPlease help me out, and be gentle, I'm trying to learn 🙏 plus it's literally my job to know as much as I can about lashes. Since I'm not an actual lash stylist.\n\nHere are the full ingredients of the Fresh brand moisturizer I mentioned in the beginning of the post:\n\nAqua (Water), Glycerin, Propylene Glycol Dicaprylate/Dicaprate, Butylene Glycol, Caprylic/Capric Triglyceride, Pentylene Glycol, Cetearyl Alcohol, C10-18 Triglycerides, Diglycerin, Myristyl Myristate, Glyceryl Stearate, Butyrospermum Parkii (Shea) Butter, Nelumbo Nucifera Extract, Prunus Persica (Peach) Leaf Extract, Citrus Limon (Lemon) Peel Oil, Cucumis Sativus (Cucumber) Fruit Extract, Glycine Soja (Soybean) Oil, Helianthus Annuus (Sunflower) Seed Oil, Tocopheryl Acetate, Tocopherol, Cetearyl Glucoside, Caprylyl Glycol, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Behenyl Alcohol, Sodium Stearoyl Glutamate, Cetyl Palmitate, Cocoglycerides, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Parfum (Fragrance), Sodium Polyglutamate, Sodium Hydroxide, 1,2-Hexanediol, Sodium Phytate, Chlorphenesin, Sodium Metabisulfite, Potassium Sorbate, Sodium Benzoate, Limonene, Citral, Linalool",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "revengegrl",
        "body": "Okay so several\nof these ingredients in here have oil in their name. Im seeing lemon peel oil soy bean oil etc….. so not safe for lashes. If its not causing  retention issues right now i wouldn’t worry about it but if you’re losing lashes at some point I would consider it as possibly one of the reasons. But yes generally you should avoid products with oils in the ingredient list. Moisturizers especially because they tend to migrate to the eye area even if you don’t apply it there. Im really surprised they hired you with no prior lash knowledge, id even consider taking a lash education course so you can better deal with clients. Best of luck",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Jolly_Sorbet_1625",
        "body": "any oil free like water mircellar should be safe.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ZeroWaste",
    "post_id": "1etpo6o",
    "title": "Itchy Scalp with Local Hair Care Bars",
    "url": "https://www.reddit.com/r/ZeroWaste/comments/1etpo6o/itchy_scalp_with_local_hair_care_bars/",
    "score": 1,
    "num_comments": 6,
    "created": "2024-08-16T14:05:45+00:00",
    "body": "Hi yall,\n\nI use local shampoo and conditioner bars. I switched between 2 to see if one worked better for my hair. My scalp is itchy within 3 days. I use a apple cider vinegar rinse after i shampoo.\n\nI do not care about what my hair looks like. I like going a week between showers and do not mind looking like a greasy rat. I just want to be comfortable. My itchy scalp is driving me crazy and it forces me to shower more often than i care to.\n\n\n\nShampoo (i switched between 2 made by same company)\n\nIngredients:\n\nLuscious Lemon (for normal to oily hair): Sodium Cocoyl Isethionate (derived from coconut), Sodium Lauryl Sulfoacetate (Not SLS! It is a sulfate free alternative to SLS derived from coconut), Behentrimonium Methosulfate (derived from the Colza plant), Cetyl Alcohol, Tamanu Oil, Coconut Oil, Cocomidopropyl Betaine (derived from coconut oil), Hydrolyzed Quinoa protein, Panthenol B5, Essential oil, Phthalate free fragrance oil, & mineral mica for color.\n\nWicked Ginger + Seaberry (for normal to dry hair): Sodium Cocoyl Isethionate (derived from coconut), Sodium Lauryl Sulfoacetate (Not SLS! It is a sulfate free alternative to SLS derived from coconut), Behentrimonium Methosulfate (derived from the Colza plant), Cetyl Alcohol, Tamanu Oil, Coconut Oil, Cocomidopropyl Betaine (derived from coconut oil), Hydrolyzed silk protein, Panthenol B5, Hibiscus powder, Lotus flower extract, Phthalate free fragrance oil, & mineral mica for color.\n\nConditioner (i also switch between two)\n\nIngredients:\n\nLuscious Lemon (for normal to oily hair): Behentrimonium Methosulfate, Cetyl Alcohol, Coconut Oil, Tamanu Oil, Cocoa Seed Butter, Argan Oil, Jojoba Oil, Dimethicone, Glycerin, Vege Keratin, Panthenol B5, Hydrolyzed Quinoa Protein, Essential Oils, Phthalate Free Fragrance Oils, & Mineral Mica for color.\n\nWicked Ginger + Seaberry (for normal to dry hair): Behentrimonium Methosulfate, Cetyl Alcohol, Coconut Oil, Tamanu Oil, Cocoa Seed Butter, Argan Oil, Jojoba Oil, Dimethicone, Glycerin, Vege Keratin, Panthenol B5, Hydrolyzed Silk Protein, Lotus Flower Extract, Hibiscus powder, Phthalate Free Fragrance Oils, & Mineral Mica for color.\n\nMy local refillery offers 3/4 of different bars i could try instead. I loved that these were locally produced but… willing to try different things. You can see the different products they offer below-\n\nhttps://www.lifeunplastic.com/shop/HAIR-CARE-c120517724\n\nAny suggestions or feedback deeply appreciated. Been using this for about a year. Didnt have this problem with ethique bars but i hated the shipping. \n\nXoxoxo",
    "flair_text": "Question / Support",
    "flair_template_id": "57ea44da-1d3a-11eb-a30e-0ea4e55a3265",
    "comments": [
      {
        "author": "MistressLyda",
        "body": "I would suspect the ginger and the lemon to have become a irritant due to long term exposure.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "evilmitzi",
        "body": "shower once a week. yikes. if showering fixes the problem, that's a sign you need to shower more often.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Rojikoma",
        "body": "You could be reacting to anything in it, essential oils and fragrance oils would be high on my list of suspects. It could also be that something about the shampoos or conditioners messes with the normal balance of your hair, like too clean or not clean enough. I used one of Lush's shampoo bars for several years - my hair loved it, but it turned a normally innocuous ecaema on my scalp into a monster. Had to switch to baby shampoo and medicated shampoo to get it somewhat under control.\n\nSo... experiment. Maybe another product from that brand works better for you, maybe you need to try something different.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "EmbersWithoutClosets",
        "body": "Consider abandoning shampoo completely?\n\n[https://www.theguardian.com/lifeandstyle/2020/jul/28/soap-dodger-meet-the-doctor-who-says-we-have-been-showering-wrong](https://www.theguardian.com/lifeandstyle/2020/jul/28/soap-dodger-meet-the-doctor-who-says-we-have-been-showering-wrong)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Suspicious_Hope_4173",
        "body": "I use Garnier honey bar shampoo and it's pretty good. The effect is pretty similar to their bottle version. I bought it on Amazon.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  }
]