[
  {
    "subreddit": "Haircare",
    "post_id": "uteekw",
    "title": "Deep Conditioning Your Hair",
    "url": "https://www.reddit.com/r/Haircare/comments/uteekw/deep_conditioning_your_hair/",
    "score": 12,
    "num_comments": 0,
    "created": "2022-05-19T22:09:15+00:00",
    "body": "Deep conditioning is a best practice to incorporate into your hair routine. Even if you feel your hair is not damaged, deep conditioners still help maintain healthy looking hair over time. Choosing how often to deep condition and which products to use can be a challenge. Deep conditioners go by many names, but are often thicker and heavier in their ingredient concentration.\n\n(This is the entire text from my [original blog](https://www.thehairlooks.com/blog-deep-conditioning-your-hair.html))\n\n**What hair types and styles need deep conditioning?**\n\n* Long hair that feels dry\n* Chemically altered hair (examples: hair that has been lightened, permed, relaxed)\n* Naturally dry hair\n* [Damaged hair](https://www.thehairlooks.com/blog-hair-challenges-part-i---damage.html)\n* [Hair with frizz](https://www.thehairlooks.com/blog-hair-challenges-part-i---frizz.html)\n* Swimmers that expose their hair to chlorine often\n* Beach lovers with sun-bleached hair\n* People with hard water, or who use well water\n* Anyone who frequently uses high heat to style their hair (ex: flat iron)​\n\n**What is the goal of a deep conditioning treatment for hair?**  \n​The two goals here are (1) hydration and (2) slip. Both help with the appearance and overall longevity of your hair's strands.   \n\n\nHydration\n\n* Silky, flexible strands (versus dry, brittle ones) with more shine\n* Smooth ends (versus puffy and frayed)\n* On curly hair - curls that form evenly (versus inconsistently)\n\nSlip\n\n* Reduces [tangling](https://www.thehairlooks.com/blog-hair-challenges-part-ii---tangles.html)\n* Reduces friction from [traction damage](https://www.thehairlooks.com/blog-hair-challenges-part-i---damage.html) (to help hair grow)\n* Reduces[ frizz](https://www.thehairlooks.com/blog-hair-challenges-part-i---frizz.html)\n\n**How often should I deep condition?**  \nThis is unique to each person's hair type. Deep conditioning bi-monthly or monthly is common. If your hair is damaged, you can deep condition up to once a week. For more insights on how to fit deep conditioning into your routine, check out my post on [Hair Schedules](https://www.thehairlooks.com/blog-hair-schedules.html).\n\n**What are the best ingredients for deep conditioners?**  \nBelow I've shared common ingredients you'll find in conditioner and/or deep conditioners. It's helpful to know what these ingredients are in case a company doesn't use the term \"deep conditioner\" on the product label. Other terms used for deep conditioning-related products are:  hair treatment, hair tonic, hair lotion and hair masque. You can also check out my post on [Hair Oils](https://www.thehairlooks.com/blog-hair-oils.html) for more insights on ingredient lists.\n\n* Panthenol\n* Glycerin\n* Amino Acids\n* Peptides\n* Cetyl alcohol or cetyl alcohol\n* Hydrolyzed proteins (ex: wheat, soy, keratin protein)\n* Stearamidopropyl Dimethylamine\n* Quaternium-87\n* Behentrimonium Methosulfate\n* Behentrimonium Chloride\n* Dicetyldimonium Chloride\n* Distearyldimonium Chloride\n* Polyquaternium 55\n* Guar Hydroxypropyltrimonium Chloride \n* Polyquaternium-44 \n* Cetrimonium Bromide\n* Cetrimonium Chloride\n* Palmitamidopropyltrimonium Chloride\n* Laurdimonium hydroxypropyl hydrolyzed \n* Polyquaternium-4\n* Polyquaternium-10\n\n**How should you deep condition your hair?**  \nI've listed the process I recommend to my clients to help them get the best hydration and slip below.\n\n* Shampoo twice with clarifying shampoo, or use a regular shampoo plus a detox treatment, and rinse well.\n* Ring out most of the water from your hair, and/or soak it up with a towel.\n* Apply conditioner or deep conditioner from roots-to-ends.\n* Massage conditioner and water into your hair. Good coverage equals a better result. This can look like a combination of the techniques below. You can read more about the squeezing and scrunching technique [here](https://www.cosmopolitan.com/style-beauty/beauty/a37304107/squish-to-condish/) in Cosmopolitan.\n   * untangling\n   * working in sections\n   * pressing root to tip\n   * gentle squeezing\n   * scrunching\n   * combing\n   * gathering all the hair together​\n* Let the deep conditioner sit for between 10-20 minutes on thicker hair or 5 - 10 minutes on finer hair.\n* Dunk hair in water using a sink or cup, or just quickly rewet in the shower.\n* Use the techniques listed above to press more water into the hair.\n* Do a final rise. On drier hair, this can be a quick rinse that leaves more conditioner residue. On finer hair, you'll want to do a more thorough rinse to prevent the deep conditioner from weighing your hair down. \n* Add leave-in products.\n* End with drying and/or styling  method of your choice:\n   * ​Air dry (avoid this method if it will take more than one hour to dry)\n   * Diffuse or blowdry with cold air\n   * Diffuse or blowdry with hot air and [heat protection](https://www.thehairlooks.com/blog-protecting-your-hair-from-heat-damage.html)\n\n**Can you over-condition hair?**  \nIf you are experiencing hair that appears:\n\n* limp, flat or heavy\n* to have build up or residue\n* straighter than you'd like\n* greasy or too shiny\n\nthen you could be over-conditioning. Try cutting back on the amount of deep conditioning treatments in your routine, switching conditioners to one that is for volume, or lightly shampooing after you condition. You can also check out my post on [Hygral Fatigue](https://www.thehairlooks.com/blog-hygral-fatigue.html) to learn more about maintaining balance between moisture and protein in your hair. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "l4n1m9",
    "title": "PLEASE help me with my baby fine hair - I will be eternally grateful",
    "url": "https://www.reddit.com/r/HaircareScience/comments/l4n1m9/please_help_me_with_my_baby_fine_hair_i_will_be/",
    "score": 4,
    "num_comments": 6,
    "created": "2021-01-25T12:37:05+00:00",
    "body": "I struggle so much with my hair. It is very fine, but there is plenty of it. It is wavy and prone to breakage and frizz. It is color treated (because I have some greys) and I rarely use heat to style. The one upside it that is tends to be very soft (except when I pick the wrong product and dry it out). \n\nI am getting so turned around and confused with all the hair care advice I read. I am currently using [HairStory](https://www.hairstory.com/products/new-wash/) and it is going alright, but that s\\*&t is expensive. I made the mistake of using a leave-in that came in an Ipsy bag ( [FoxyBae Magic Daily Leave In Hair Mask - 12-in-1](https://www.foxybae.com/products/12-in-1-magic-daily-leave-in-hair-mask)). It was good the first time I used it but now my hair is feeling a bit grubby (so I guess I need to use a clarifying shampoo). I like to wash my hair ever other day, but on day two I always have to wear it in a ponytail. I'm tired of fighting it every day and spending a fortune on stuff that never seems to work. \n\nI have tried CG method, untold products for decades, products for curly hair, products for wavy hair, products for fine hair...). If I don't wash my hair frequently my scalp itches, so I have never managed more than three days. It takes my hair a long time to air dry, so I hate washing it because I have to go to work with wet hair or sleep with wet hair. \n\nI just want my hair to be moisture/protein balanced and not weighed down. I don't like complicated hair routines and prefer to use little or no product outside of shampoo and conditioner. I occasionally use [L'anza Bounce Up Spray](https://www.ulta.com/healing-oil-bounce-up-spray?productId=xlsImpprod18041073) and that seems to be magic. I have [Olaplex](https://olaplex.com/) 3 and it worked great the first time and has had diminishing returns since. I also have Olaplex 6 and it feels heavy in my hair. \n\nI tried that hair in water test and it never sunk despite leaving it in the cup for over an hour; however, I hear that this test may not be that helpful. Again, I get conflicting information. \n\nI am currently eyeing the [Verb Ghost line](https://www.verbproducts.com/products/smooth-shine-duo?variant=32294608240729). Ingredients below. Should I try that one? Or is there something else that could work for me? Please help. I am so frustrated. \n\nGhost Shampoo™: Aqua/Water/Eau, Sodium Lauroyl Methyl Isethionate,  Cocamidopropyl Betaine, Sodium Cocoyl Isethionate, Sodium Lauroyl  Sarcosinate, Cocamidopropyl Hydroxysultaine, Saccharum Officinarum  (Sugarcane) Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Moringa  Oleifera Seed Oil, Aloe Barbadensis (Aloe Vera) Leaf Juice, Cocodimonium  Hydroxypropyl Hydrolyzed Rice Protein, Chamomilla Recutita (Chamomile)  Flower Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hydrolyzed  Vegetable Protein PG-Propyl Silanetriol, Citrus Aurantium Dulcis  (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Pyrus Malus  (Apple) Fruit Extract, Lavandula Angustifolia (Lavender) Flower Extract,  Rosa Centifolia Flower Extract, Helianthus Annuus (Sunflower) Seed  Extract, Hydrolyzed Soy Protein, Hydrolyzed Quinoa, Glycol Distearate,  Panthenol, Parfum/Fragrance, Citric Acid, PPG-2 Hydroxyethyl  Coco/Isostearamide, Coconut Acid, Guar Hydroxypropyltrimonium Chloride,  Glycerin, Cocamidopropylamine Oxide, Coco-Glucoside, Glyceryl Oleate,  Trisodium Ethylenediamine Disuccinate, Tetrasodium Glutamate Diacetate,  Silicone Quaternium-8, Sodium Isethionate, Polyquaternium-7, Sodium  Laurate, Polyquaternium-44, Tetrasodium EDTA, Magnesium Nitrate,  Cocamidopropyl Dimethylamine, Lactic Acid, Sodium Sarcosinate, Sodium  Hydroxide, Sodium Glycolate, Magnesium Chloride, Ethylhexylglycerin,  Hydrogen Peroxide, Sodium Formate, Tocopherol, Hydrogenated Palm  Glycerides Citrate, Disodium EDTA, Lecithin, Ascorbyl Palmitate,  Phenoxyethanol, Sodium Benzoate, Methylchloroisothiazolinone,  Methylisothiazolinone, Potassium Sorbate, Benzyl Alcohol, Chlorphenesin,  Sorbic Acid, Hydroxycitronellal, Butylphenyl Methylpropional, Limonene\n\nGhost Conditioner™: Aqua/Water/Eau, Cetearyl Alcohol, Behentrimonium  Methosulfate, Cetyl Alcohol, Panthenol, Hydrolyzed Soy Protein,  Hydrolyzed Rice Protein, Saccharum Officinarum (Sugarcane) Extract, Aloe  Barbadensis (Aloe Vera) Leaf Juice, Hydrolyzed Vegetable Protein  PG-Propyl Silanetriol, Citrus Aurantium Dulcis (Orange) Fruit Extract,  Citrus Limon (Lemon) Fruit Extract, Pyrus Malus (Apple) Fruit Extract,  Simmondsia Chinensis (Jojoba) Seed Oil, Moringa Oleifera Seed Oil,  Theobroma Cacao (Cocoa) Seed Butter, Hydrolyzed Quinoa, Camellia  Sinensis (Green Tea) Leaf Extract, Helianthus Annuus (Sunflower) Seed  Extract, Ethylhexylglycerin, Tocopherol, Stearamidopropyl Dimethylamine,  Cetrimonium Chloride, Behentrimonium Chloride, Polysorbate 60,  Parfum/Fragrance, Citric Acid, Isopropyl Alcohol, Magnesium Nitrate,  Hydrogenated Castor Oil/Sebacic Acid Copolymer, Tetrasodium EDTA, Sodium  Hydroxide, Magnesium Chloride, Benzyl Alcohol,  Methylchloroisothiazolinone, Phenoxyethanol, Methylisothiazolinone,  Sodium Benzoate, Potassium Sorbate, Disodium EDTA, Butylphenyl  Methylpropional, Limonene",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "hokieltm",
        "body": "I have long, fine hair too, and I totally feel your pain on how long air drying takes! I’ve never tried Hairstory, but I like the Verb Ghost line a lot. I’ve use the shampoo and conditioner for about six months, and I’ve tried the hair mask and oil from the same line. The Ghost hair mask is very light, so if you felt weighed down by others, definitely try that one. I use the oil sparingly at night any time my ends feel dry and I always wake up to super soft hair. I bought one of those [shampoo brush things](https://www.amazon.com/dp/B074ZDXFL6?ref=ppx_pop_mob_ap_share) for a scalp massage while shampooing and that feels nice and I think my roots are less greasy for longer. Good luck with your search!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EcoFriendly",
    "post_id": "13kyftt",
    "title": "I’m new to Eco-Products and need help",
    "url": "https://www.reddit.com/r/EcoFriendly/comments/13kyftt/im_new_to_ecoproducts_and_need_help/",
    "score": 2,
    "num_comments": 1,
    "created": "2023-05-18T12:55:29+00:00",
    "body": "I’m trying to buy my friend an Eco-Friendly, Reef Safe Shampoo and Conditioner Set that fits her goth aesthetic and won’t harm the oceans since we’re becoming divers but I don’t know what ingredients to look out for so is this ingredients list okay?\n\nShampoo: Aqua/Water/Eau, Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Sodium Cocoyl Isethionate, Sodium Lauroyl Sarcosinate, Cocamidopropyl Hydroxysultaine, Saccharum Officinarum (Sugarcane) Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Moringa Oleifera Seed Oil, Aloe Barbadensis (Aloe Vera) Leaf Juice, Cocodimonium Hydroxypropyl Hydrolyzed Rice Protein, Chamomilla Recutita (Chamomile) Flower Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Lavandula Angustifolia (Lavender) Flower Extract, Rosa Centifolia Flower Extract, Helianthus Annuus (Sunflower) Seed Extract, Hydrolyzed Soy Protein, Hydrolyzed Quinoa, Glycol Distearate, Panthenol, Parfum/Fragrance, Citric Acid, PPG-2 Hydroxyethyl Coco/Isostearamide, Coconut Acid, Guar Hydroxypropyltrimonium Chloride, Glycerin, Cocamidopropylamine Oxide, Coco-Glucoside, Glyceryl Oleate, Trisodium Ethylenediamine Disuccinate, Tetrasodium Glutamate Diacetate, Silicone Quaternium-8, Sodium Isethionate, Polyquaternium-7, Sodium Laurate, Polyquaternium-44, Tetrasodium EDTA, Magnesium Nitrate, Cocamidopropyl Dimethylamine, Lactic Acid, Sodium Sarcosinate, Sodium Hydroxide, Sodium Glycolate, Magnesium Chloride, Ethylhexylglycerin, Hydrogen Peroxide, Sodium Formate, Tocopherol, Hydrogenated Palm Glycerides Citrate, Disodium EDTA, Lecithin, Ascorbyl Palmitate, Phenoxyethanol, Sodium Benzoate, Methylchloroisothiazolinone, Methylisothiazolinone, Potassium Sorbate, Benzyl Alcohol, Chlorphenesin, Sorbic Acid, Hydroxycitronellal, Butylphenyl Methylpropional, Limonene \n\nConditioner: Aqua/Water/Eau, Cetearyl Alcohol, Behentrimonium Methosulfate, Cetyl Alcohol, Simmondsia Chinensis (Jojoba) Seed Oil, Moringa Oleifera Seed Oil, Aloe Barbadensis (Aloe Vera) Leaf Juice, Theobroma Cacao (Cocoa) Seed Butter, Saccharum Officinarum (Sugar Cane) Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hydrolyzed Quinoa, Helianthus Annuus (Sunflower) Seed Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Limon (Lemon) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Hydrolyzed Soy Protein, Hydrolyzed Rice Protein, Tocopherol, Panthenol, Citric Acid, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Parfum/Fragrance, Hydrogenated Castor Oil/Sebacic Acid Copolymer, Polysorbate 60, Stearamidopropyl Dimethylamine, Isopropyl Alcohol, Lactic Acid, Tetrasodium EDTA, Sodium Hydroxide, Sodium Benzoate, Magnesium Chloride, Ethylhexylglycerin, Phenoxyethanol, Magnesium Nitrate, Potassium Sorbate, Disodium EDTA, Benzyl Alcohol, Cetrimonium Chloride, Behentrimonium Chloride, Methylisothiazolinone, Methylchloroisothiazolinone, Butylphenyl Methylpropional, Limonene",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "4w6e6k",
    "title": "Need help determining if cleansing agents in shampoo are damaging",
    "url": "https://www.reddit.com/r/HaircareScience/comments/4w6e6k/need_help_determining_if_cleansing_agents_in/",
    "score": 3,
    "num_comments": 1,
    "created": "2016-08-04T19:45:31+00:00",
    "body": "I'm trying to find my first products for a silicone/sulfate free routine and I'm looking at the Verb Hydrating Shampoo/Conditioner. Are the compounds at the top of the shampoo ingredients list damaging like SLS? I can't find much information about them but they seem to be some sort of sulfate-based compound. Any information is appreciated- are there gentler sulfates than SLS that don't need to be avoided? \n\nShampoo Ingredients \nWater, Sodium C14-16 Olephin Sulfonate, Sodium Laurylsulfoacetate, Disodium Laureth Sulfosuccinate, Cocamidopropylamine Oxide, Cocamidopropyl Betaine, Cocamide DIPA, Polyquaternium-7, Sodium Cocoyl Isethionate, Glycol Distearate, Ammonium Chloride, Fragrance, Citric Acid, Panthenol (Pro-Vitamin B5), Silicone Quaternium-8, Guar Hydroxypropyltrimonium Chloride, Sodium PCA, Sodium Lactate, Arginine (L-Arginine), Aspartic Acid (L-Aspartic Acid), PCA, Hydrolyzed Quinoa, Aloe Barbadensis (Aloe Vera) Leaf Juice, Glycine, Alanine (L-Alanine), Serine (L-Serine), Tetrasodium EDTA, Valine (L-Valine), Threonine (L-Threonine), Proline (L-Proline), Isoleucine (L-Isoleucine), Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Phenylalanine (L-Phenylaline), Histidine (L-Histidine), Sodium Lauroyl Methyl Isethionate, Polyquaternium-44, Argania Spinosa Kernal (ORGANIC Argan) Oil, Quaternium-95, Methylchloroisothiazolinone, Trimethylsilylamodimethicone, Propanediol, Methylisothiazolinone, Trideceth-12, Helianthus Annuus (Sunflower) Seed Extract, Glycerin, C12-15 Pareth-9, C11 15.\n\nConditioner Ingredients\n\nWater, Cetearyl Alcohol, Behentrimonium Chloride,Polysorbate-60, Quaternium-95, Propanediol, Stearamidopropyl Dimethylamine, Amodimethicone, Polyquaternium-55, Panthenol (Pro-Vitamin B5), Citric Acid, Polyquaternium-37, Fragrance, Propylene Glycol Dicaprylate/Dicaprate, PPG-1 Trideceth-6, Hydrolyzed Quinoa, Sodium PCA, Polysilicone-15, Organic Argan Oil, Aloe Barbadensis (Aloe Vera) Leaf Juice, Sodium Lactate, Arginine (L-Arginine), Aspartic Acid (L-Aspartic Acid), PCA, Tetrasodium EDTA, Limnanthes Alba (Meadowfoam) Seed Oil, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Glycine, Alanine (L-Alanine), Helianthus Annuus (Sunflower) Seed Extract, Serine (L-Serine), Valine (L-Valine), Threonine (L-Threonine), Proline (L-Proline), Isoleucine (L-Isoleucine), Phenylalanine (L-Phenylaline), Histidine (L-Histidine), Methylchloroisothiazolinone, Methylisothiazolinone.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "carmillivanilli",
        "body": "The sidebar in /r/curlyhair is really helpful when it comes to this sort of thing.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]