[
  {
    "subreddit": "AsianBeauty",
    "post_id": "13r9qy4",
    "title": "[Review] Round Lab vs Bring Green Mugwort Cleansers",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/13r9qy4/review_round_lab_vs_bring_green_mugwort_cleansers/",
    "score": 153,
    "num_comments": 13,
    "created": "2023-05-25T06:16:11+00:00",
    "body": "I have been a long time devoted user of the Round Lab Mugwort Calming Cleanser, and would consider it my HG. I can't even remember how many tubes of it I've gone through. Recently I've noticed that it's started going up in price (last time I bought it I had to pay $26 CAD), and it's become increasingly hard to justify that price for a cleanser. So when I saw this Bring Green Artemisia pH Balancing Foam at my local kbeauty shop for $13.99 CAD I had to try it!\n\n\nSkin type: combination, dehydrated, acne and clog prone\n\n\nRound Lab Ingredients:\n\nWater, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, Butylene Glycol, Coco-Betaine, Betaine, Hydroxypropyl Starch Phosphate, Artemisia Vulgaris Extract, Aspartic Acid, Citric Acid, Sodium Chloride, Caprylyl Glycol, Polyquaternium-67, Artemisia Princeps Leaf Extract, Melia Azadirachta Leaf Extract, Malt Extract, 1,2- Hexanediol, Melia Azadirachta Flower Extract, Camellia Sinensis Leaf Extract, Salvia Officinalis (Sage) Oil, Ethylhexylglycerin, Allantoin, Madecassoside, Panthenol, Asiaticoside, Asiatic Acid\n\n\nBring Green Ingredients:\n\nGlycerin, Purified Water, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, 1,2-Hexanediol, Lauryl Betaine, Hydroxypropyl Starch Phosphate, Artemisia Capillaris Extract (8,000ppm), Melia Azadirachta Leaf Extract, Malt Extract, Melia Azadirachta Flower Extract, Coccinia Indica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Ocimum Sanctum Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Corallina Officinalis Extract, Ulmus Davidiana Root Extract, Centella Asiatica Extract, Portulaca Oleracea Extract, Houttuynia Cordata Extract, Amaranthus Caudatus Seed Extract, Lavender Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Rosemary Leaf Oil, Juniperus Virginiana Oil, Orange Peel Oil, Polyquaternium-39, Artemisia Princeps Leaf Powder (800ppm), Butylene Glycol, Propanediol, Panthenol, Madecassoside, Ethylhexylglycerin, Linalool, Limonene \n\n\nBoth cleansers claim to be pH balanced at 5.5 and gentle on the skin. That I will say is true, I never had irritation using the Round Lab, and in the 4 times I've used the Bring Green I didn't either. They both leave my skin feeing properly cleansed without being stripped or dry. \n\n\nTexture wise I prefer the Round Lab. It has a slightly thicker texture which foams up to a nice rich foam. However at times it can take a little extra effort to rinse away. The Bring Green does foam up just as well, but it isn't as rich of a foam. It contains very tiny visible bits of mugwort, but they're so small you don't feel them. It also rinses away much cleaner and faster. \n\n\nIn terms of scent the Round Lab doesn't really have one, it smells very faintly of mugwort. The Bring Green however has a light citrus scent due to the essential oils, but it isn't overpowering and doesn't linger once rinsed. \n\n\nOverall I think I might end up switching to the Bring Green. Although the user experience might not be as pleasant as when using the Round Lab, for almost half the price it's definitely worth keeping in my routine.",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "PeptideWitch",
        "body": "Hello fellow Canadian! Where did you get this cleanser from? I’m also struggling with raising prices for the most basic skincare.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "amneiu",
        "body": "Bookmarking this! Ty for the reviews",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "iamtyan",
        "body": "Love the bring green cleanser! It leave my skin feeling clean and glowy without being stripped. I have oily combi skin btw. & its soo affordable.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "18nusra",
    "title": "CeraVe Brand Review: Hydrating Cream-to-Foam Cleanser, Acne Foaming Cream Cleanser (4% Benzyl Peroxide) Resurfacing Retinol Serum, PM Facial Moisturizing Lotion, Moisturizing Cream (White Tub)",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18nusra/cerave_brand_review_hydrating_creamtofoam/",
    "score": 60,
    "num_comments": 17,
    "created": "2023-12-21T19:16:27+00:00",
    "body": "**Review (Long Term Usage; 1+ years)** I have been using a few CeraVe products for more than an year. Putting down all the reviews at one place.\n\nhttps://preview.redd.it/21mqpuxa4p7c1.jpg?width=768&format=pjpg&auto=webp&s=6152cd7496bcfdc6354819d50cab1872dd769b28\n\n**About me**: 25 F; I have combination skin with an oily T zone in summers and dry cheeks and nose in winters. I don't like strong fragrance in products, and I stay away from DIYs\n\n**Skin concerns**: Cystic acne; scars, hyperpigmentation *and* *crying* from the cystic acne\n\nAccording to the brand, All CeraVe products are formulated to be fragrance-free.\n\n*Category 1: Cleansers*\n\n**CeraVe Hydrating Cream-to-Foam Cleanser**\n\nTexture: Just like its described. It’s a creamy lotion texture out of the bottle. When you add water to it, it foams up and washes off like any other foaming cleanser. No noticeable fragrance.\n\nApplication: I use it two ways. First, if I want to take off any light makeup I rub it all over my dry face and it melts makeup off, then I add water it it and cleanse. Second way, I use it as a regular cleanser taking a pump in palm adding water to it and rubbing it all over my face, washing it off with water\n\n**10/10. Excellent. No notes. HG**. Already on 6th bottle. **WRP Forever**.\n\nIngredients AQUA / WATER / EAU, GLYCERIN, SODIUM METHYL COCOYL TAURATE, COCO-BETAINE, SODIUM COCOYL ISETHIONATE, SODIUM CHLORIDE, PCA, PPG-5-CETETH-20, PEG-100 STEARATE, PEG-150 PENTAERYTHRITYL TETRASTEARATE, PEG-6 CAPRYLIC/CAPRIC GLYCERIDES, PEG-30 DIPOLYHYDROXYSTEARATE, CI 77891 / TITANIUM DIOXIDE, ASPARTIC ACID, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, SORBITAN ISOSTEARATE, CARBOMER, GLYCOL DISTEARATE, GLYCERYL STEARATE, GLYCERYL OLEATE, GLYCINE, TRIDECETH-6, CETEARYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, THREONINE, SODIUM HYDROXIDE, SALICYLIC ACID, SODIUM PCA, SODIUM LACTATE, ARGININE, SODIUM LAUROYL LACTYLATE, SERINE, SODIUM BENZOATE, VALINE, SODIUM HYALURONATE, PROLINE, ISOLEUCINE, CHOLESTEROL, PHENOXYETHANOL, ALANINE, PHENYLALANINE, COCONUT ACID, COCO-GLUCOSIDE, CHLORPHENESIN, DISODIUM EDTA, HYDROXYETHYL UREA, CITRIC ACID, HYDROXYETHYL ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, CAPRYLYL GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, HISTIDINE, ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER, POLYQUATERNIUM-53, POLYQUATERNIUM-39, POLYSORBATE 60, ETHYLHEXYLGLYCERIN, BENZOIC ACID\n\n**CeraVe** **Acne Foaming Cream Cleanser (4% Benzyl Peroxide)**\n\nTexture: Translucent lotion-y texture, It’s runnier than the Cream to foam cleanser. Foams up well on wet face.\n\nApplication: It’s a wash off BP product. I use it 2x a week. I apply on face, neck and underarms. I leave it on for 5min and wash it off with water. I think it works better this way. If I leave it on for too long it does dry out my skin.\n\nI use it as a body wash too. It helped me with active acne on my face and back. I find it Better than other BP bodywashes and facewashes I tried. It doesn’t strip my skin. I do use a thick moisturiser after this.\n\n**9/10**. I cut one point for the packaging; It leaked on a flight once. **WRP**\n\nIngredients BENZOYL PEROXIDE 4%\n\nINACTIVE INGREDIENTS: WATER, GLYCERIN, PROPYLENE GLYCOL, COCAMIDOPROPYL HYDROXYSULTAINE, SODIUM C14-16 OLEFIN SULFONATE, XANTHAN GUM, POTASSIUM HYDROXIDE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, NIACINAMIDE, GLYCOLIC ACID, SODIUM CHLORIDE, SODIUM CITRATE, SODIUM HYALURONATE, SODIUM LAUROYL LACTYLATE, SODIUM HYDROXIDE, CHOLESTEROL, PHENOXYETHANOL, PROPANEDIOL, CITRIC ACID, TETRASODIUM EDTA, DIETHYLHEXYL SODIUM SULFOSUCCINATE, PHYTOSPHINGOSINE, ETHYLHEXYLGLYCERIN, BENZOIC ACID\n\n*Category 2: Serum*\n\n**CeraVe Resurfacing Retinol Serum**\n\nTexture: Off-white runny lotion texture. Spreads easily. Not sticky, layers well under other products in my routine. No added fragrance.\n\nApplication: I started with using it twice a week and built up to every day. I use the sandwich method and layer between essence and a moisturizer. I don’t like it. It didn’t do anything for me. I noticed no difference in my skin except a slight smoothing effect. I find it to be a non-offensive beginner retinol.\n\n**5/10**. Excellent packaging. All Retinol products should come in a pump like this. **WNRP**\n\nIngredients: AQUA/WATER/EAU, PROPANEDIOL, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), CETEARYL ETHYLHEXANOATE, NIACINAMIDE, AMMONIUM POLYACRYLOYLDIMETHYL TAURATE, DIPOTASSIUM GLYCYRRHIZATE, HYDROGENATED LECITHIN, POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, CETEARYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, DIMETHICONOL, LECITHIN, SODIUM CITRATE, RETINOL, SODIUM HYALURONATE, SODIUM LAUROYL LACTYLATE, CHOLESTEROL, PHENOXYETHANOL, ALCOHOL, ISOPROPYL MYRISTATE, CAPRYLYL GLYCOL, CITRIC ACID, TRISODIUM ETHYLENEDIAMINE DISUCCINATE, PENTYLENE GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, POLYSORBATE 20, ETHYLHEXYLGLYCERIN\n\n*Category 3: Moisturizers*\n\n**CeraVe PM Facial Moisturising Lotion**\n\nTexture: Super light gel cream texture. Applies like a dream on my skin. No noticeable fragrance.\n\nApplication: I apply it after Hada Labo lotion. Used it throughout summer, great stand alone moisturizer. It was the only niacinamide product I was using at the time. I don’t like it for colder weather as my skin becomes drier. Excellent in hot weather at night. Helps oil control and the usual niacinamide things. It might feel heavy if you have super oily skin.\n\n**10/10.** No Nonsense night moisturizer in a pump bottle!!! **WRP**.\n\nIngredients : AQUA / WATER / EAU, GLYCERIN, CAPRYLIC/CAPRIC TRIGLYCERIDE, NIACINAMIDE, CETEARYL ALCOHOL, POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), CETEARETH-20, BEHENTRIMONIUM METHOSULFATE, SODIUM LAUROYL LACTYLATE, SODIUM HYALURONATE, CHOLESTEROL, PHENOXYETHANOL, DISODIUM EDTA, DIPOTASSIUM PHOSPHATE, CAPRYLYL GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, POLYGLYCERYL-3 DIISOSTEARATE, ETHYLHEXYLGLYCERIN\n\n**CeraVe Moisturizing Cream (White Tub)**\n\nTexture: Thick and gooey. The only CeraVe product that has a strange plastic/fevicol smell. The brand says there is no added fragrance so maybe it's just me. \n\nApplication: Applies smooth. Feels super super heavy on my face. I could just feel it sitting heavy on my skin. It didn’t give me any CCs. I used the rest of the tub as a body moisturizer. Great as a body moisturizer.\n\n**4/10.** The tub packaging too is disappointing. **WNRP.**\n\nIngredients: AQUA / WATER / EAU, GLYCERIN, CETEARYL ALCOHOL, CAPRYLIC/CAPRIC TRIGLYCERIDE, CETYL ALCOHOL, CETEARETH-20, [PETROLATUM](https://www.cerave.com/skincare/petrolatum), POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), BEHENTRIMONIUM METHOSULFATE, SODIUM LAUROYL LACTYLATE, SODIUM HYALURONATE, CHOLESTEROL, PHENOXYETHANOL, DISODIUM EDTA, DIPOTASSIUM PHOSPHATE, TOCOPHEROL, PHYTOSPHINGOSINE, XANTHAN GUM, ETHYLHEXYLGLYCERIN\n\nSorry for any mistakes. Let me know if I've missed any points. I'm new to reviews and English is hard.\n\nIf you have any questions about the products, please do ask.",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "Poignant-musings",
        "body": "Amazing review. Thank u so much!",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "Rumi2019",
        "body": "Excellent write up 👍 👍 👍 \n\nHow much does the Hydrating cream to foam cleanser actually foam? Mild lather /mild foam Sulphate free shampoo kind or full on foamy?\n\nAlso strange that cerave in the tub smells like fevicol to you. I didn't smell that when I used it.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Sweet-Opportunity111",
        "body": "Where did you get these products from",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "skinndom",
        "body": "I’ve been wanting to try the acne foaming cleanser for while. Loved your review! Will get my hands on it !",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Intelligent_Side_729",
        "body": "Very well written review. \nI have a similar skin type as yours. Definitely going to try the night moisturiser in summers. Do you have a suggestion for a winter moisturizer as well? I get dry patches but am scared to try anything too thick because it might trigger my acne.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ilovecvocks",
        "body": "Do you use hydrating cream to foam cleanser daily? If so, how has it changed your skin? Does it help with hyperpigmentation and fading away acne marks and even skin texture and brightening? Can you provide us the link to the product, please?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "bke2t7",
    "title": "Aldi Lacura & Simple face wash reformulations, CosDNA uploads",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/bke2t7/aldi_lacura_simple_face_wash_reformulations/",
    "score": 40,
    "num_comments": 8,
    "created": "2019-05-03T22:02:00+00:00",
    "body": "I was getting some supermarket own-brand non/low foaming face washes ready to pH test when I realised the new packaging for the Aldi face wash actually has a different ingredients list from the old one (online product photos are still the old ones, so the website doesn’t help).\n\nHere are the ingredients, removed/added ingredients are in **bold**. \n\n-\n\nAldi Lacura refreshing gel old formulation http://www.cosdna.com/eng/cosmetic_3ee6438066.html\n\nAqua, Cocamidopropyl Betaine, Propylene Glycol, **Hydroxypropyl Methylcellulose**, Sodium Chloride, Panthenol, **Phenoxyethanol**, **Imidazolidnyl Urea**, Disodium EDTA, **Sodium Hydroxide**.\n\nThe “Disodium, EDTA” is presumably a typo and should be “Disodium EDTA” (one ingredient). CosDNA doesn’t match Hydroxypropyl, so I’m guessing “Hydroxypropyl, Methylcellulose” wasn’t supposed to have the comma either.\n\n-\n\nAldi Lacura refreshing gel new formulation http://www.cosdna.com/eng/cosmetic_cc80438071.html\n\nAqua, Cocamidopropyl Betaine, Propylene Glycol, **Hydroxyethylcellulose**, Sodium Chloride, **Glycerin**, Panthenol, **Tocopheryl Acetate**, **Dipropylene Glycol**, **PEG-40 Hydrogenated Castor Oil**, **Citric Acid**, Disodium EDTA, **Sodium Benzoate**.\n\n\nThe new bottle now has the cruelty-free leaping bunny logo in line with their other products, and they’ve corrected the typos.\n\n-\n\nAldi “moisturising” foaming wash old formulation http://www.cosdna.com/eng/cosmetic_8947438252.html\n\nAqua, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Decyl Glucoside, PEG-55 Propylene Glycol Oleate, Propylene Glycol, PEG-7 Glyceryl Cocoate, **Phenoxyethanol**, Panthenol, Sodium Chloride, Glycol Distearate, **Imidazolidinyl Urea**, **Citric Acid**, Bisabolol, Tocopheryl Acetate, Polyquaternium-39, **Cocamide MEA**, **Laureth-10**, Disodium EDTA, **Benzoic Acid**, Sodium Hydroxide, Sodium Benzoate.\n\n-\n\nAldi “moisturising” foaming wash new formulation http://www.cosdna.com/eng/cosmetic_2fd6438253.html\n\nAqua, Sodium Laureth Sulfate, Decyl Glucoside, Cocamidopropyl Betaine, Sodium Chloride, PEG-7 Glyceryl Cocoate, Panthenol, **Glycerin**, Tocopheryl Acetate, Bisabolol, Polyquaternium-39, **Lactic Acid**, PEG-55 Propylene Glycol Oleate, Propylene Glycol, Glycol Distearate, **Laureth-4**, Disodium EDTA, Sodium Hydroxide, **Formic Acid**, Sodium Benzoate.\n\nThe new bottle now has the cruelty-free leaping bunny logo in line with their other products.\n\n\n---\n\n\nSimple changed the packaging and formulations of a lot of their products a while ago, and I’ve discovered I have the old and new versions, so can list the ingredients (and test the pH) of all of them!\n\nThey’re listed on practically every website (including their own) with the old ingredients.\n\n-\n\n\nSimple refreshing gel old formulation http://www.cosdna.com/eng/cosmetic_dfba438072.html\n\nAqua, Cocamidopropyl Betaine, Propylene glycol, Hydroxypropyl Methylcellulose, Panthenol, Tocopheryl Acetate, Pantolactone, Sodium hydroxide, Disodium EDTA, Sodium Hydroxymethylglycinate\n\n-\n\nSimple refreshing gel new formulation http://www.cosdna.com/eng/cosmetic_8496438073.html\n\nAqua, Cocamidopropyl Betaine, Propylene Glycol, Sodium Chloride, Hydroxypropyl Methylcellulose, Panthenol, Disodium EDTA, Hydroxypropyl Cyclodextrin, Iodopropynyl Butylcarbamate, Pantolactone, Phenoxyethanol, Sodium Hydroxide, Tocopheryl Acetate.\n\n-\n\nSimple foaming old formulation http://www.cosdna.com/eng/cosmetic_a146438079.html\n\nAqua, Sodium Laureth Sulfate, Decyl Glucoside, Cocamidopropyl Betaine, Glycerin, PEG-55 Propylene Glycol Oleate, Propylene glycol, PEG-7 Glyceryl Cocoate, Sodium chloride, Panthenol, Tocopheryl Acetate, Bisabolol, Pantolactone, Anthemis Nobilis Flower Oil, Pelargonium Graveolens Flower Oil, Glycol Distearate, Cocamide MEA, Laureth-10, Dipropylene Glycol, Polyquaternium-39, Disodium EDTA, Citric acid, Sodium Hydroxymethylglycinate, Methylparaben, Benzoic acid, Propylparaben.\n\n-\n\nSimple foaming new formulation http://www.cosdna.com/eng/cosmetic_04b8438081.html\n\nAqua, Sodium Laureth Sulfate, Decyl Glucoside, Cocamidopropyl Betaine, Glycerin, PEG-55 Propylene Glycol Oleate, Propylene Glycol, Sodium Chloride, PEG-7 Glyceryl Cocoate, Benzoic Acid, Bisabolol, Cocamide MEA, Disodium EDTA, Glycol Distearate, Hydroxypropyl Cyclodextrin, Iodopropynyl Butylcarbamate, Laureth-10, Panthenol, Pantolactone, Phenoxyethanol, Polyquaternium-39, Sodium Benzoate, Tocopheryl Acetate.\n\n---\n\nAldi have removed the preservative Phenoxyethanol (limited to 1% in the EU) and added (gel) /moved up(foaming) Tocopheryl Acetate (a form of vitamin E) while Simple have added Phenoxyethanol and moved Tocopheryl Acetate further down (so it’s likely less than they had before). \n\nFor the foaming wash Simple have also moved Benzoic Acid further up the list (possibly now higher in concentration), while Aldi removed it, and CosDNA tells me this is an acne causing irritant. Aldi replaced it with Formic Acid for which CosDNA has no irritant/acne score, but did replace Laureth-10 with Laureth-4 which is worse according to CosDNA (but it’s very low on the ingredients list). \n\nAldi foaming wash has added Lactic Acid lower down on the list (Moisturising in low concentrations).\n\nBoth kinds of Aldi wash have added Glycerin.\n\nAt first glance, Aldi improved their face wash while Simple made theirs possibly slightly worse. \n\nAll product images here https://imgur.com/a/Y2qE1LZ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "greasy_pee",
        "body": "I currently only have the old formulation Aldi foaming wash, but for completeness I’ll get the new one and update here at some point.\n\nEdit: got one and added it in. I’ve spotted an Asda face wash that’s low foaming, once I get one I’ll pH test it along with the Aldi, Tesco, Sainsbury’s, Waitrose, Boots and Simple micellar / some other branded non/low foaming face washes.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "specialbeefgoulash",
        "body": "My girlfriend will love this post. Thank you!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "MajorVI",
        "body": "Thank you for the detailed post! The Aldi one looks better than the simple face wash it's duping now.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "UnderTheHarvestMoon",
        "body": "Do you rate the Aldi face washes? Would you say they are dehydrating? I have oily but dehydrated skin.  Cosrx Low pH gel cleanser is a bit too drying for me, and most cream ones are too heavy, so I'm looking for a good second cleanser.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Kieran1845",
        "body": "The new one seems nice",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9bd0uz",
    "title": "Going against my dermatologist's recommendation (Help needed with finding the right shampoo and conditioner)",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9bd0uz/going_against_my_dermatologists_recommendation/",
    "score": 10,
    "num_comments": 1,
    "created": "2018-08-29T20:38:24+00:00",
    "body": "I am a male with thick hair and my dermatologist suggested **Curatio Triclenz Hair Cleanser** and **Triflow Hair Conditioner** when I was facing hair fall (Its under control now). I continue to use the product but it weighs my hair down and I don't think it removes much of the oils from my scalp as I find few pimples after some washes. \n\n**Curatio Triclenz Hair Cleanser**\n\n*Sodium Laureth Sulphate, Aqua,Cocoamide MEA, Acrylates crosspolymer, Glycearyl Stearate, Dimethicone, Cocoamidopropylbeatine, TEA Dodecylsulfonate, Polyquaternium-39, Sodium pentasiloxane, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Panthenol, Propylene Glycol, Laureth-3, Diquaternium-10, Methylchlorisothiazolinone and Methylisothiazole, Trietholamine, Perfume,C.I.42090,C.I.17200*\n\n\n**Triflow Hair Conditioner**\n\n*Aqua, Cyclopentasiloxane, Dimethyl Siloxane, Isoparaffic Hyrdrocrabon, Behentrimonium Methosulphate, Cetearyl Alcohol ,Hydrogenated Olive Oil, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Trimethicone, Amodimethicone, Trideceth-12, Cetrimonium Chloride, Polayquaternium-47, Bis-Hydroxy/methoxy Amodimethicone, Polyquaternium-10, Phenoxyethanol, Methylchlorisothiazalinone, Perfume.*\n\n\n\nAs I am abroad it's difficult to get in touch with my dermatologist. Is there an alternative to this shampoo/conditioner or whats the best mild shampoo that you can recommend in Europe (preferable Sweden). ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "illicitlizard",
        "body": "Wow. Unsurprising it weighs down your hair that's a butt load of silicones. But the SLES is a pretty harsh cleanser so kinda surprised it doesn't clean thoroughly, since that's the first ingredient in the shampoo. I don't really have any recs, but hopefully someone else will.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rosacea",
    "post_id": "14g5whq",
    "title": "Asian skincare cleansers to reduce redness",
    "url": "https://www.reddit.com/r/Rosacea/comments/14g5whq/asian_skincare_cleansers_to_reduce_redness/",
    "score": 6,
    "num_comments": 1,
    "created": "2023-06-22T15:03:02+00:00",
    "body": "Hi all,\n\nI have rosace type 1 and my main concern is redness on my cheeks and nose.\n\nI want to start trying to incorporate more asian skincare into my routine, and right now I am looking for a very gentle, anti redness cleanser!\n\nI have done some research and the following cleansers seem promising (ranked from most to least promising):\n\n1. SKIN1004 Madagascar Centella Ampoule Foam\n2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel\n3. Beauty of Joseon - Green Plum Refreshing Cleanser\n4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam\n5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam \\*(more for like 1-2x a week)\\*\n6. B\\_LAB - Matcha Hydrating Foam Cleanser \\*(also for 1-2x a week)\\*\n\nI am very interested in hearing about your experiences and advice regarding these products!\n\nOfcourse, any other product suggestions are more than welcome!\n\n**Ingredient list:**\n\n**1. SKIN1004 Madagascar Centella Ampoule Foam**\n\nCentella Asiatica Extract, Sodium Cocoyl Isethionate, Glycerine, Purified Water, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Poteassium Cocoyl Glycinate, 1,2-Hexanediol, Sodium Chloride, Potassium Cocoate, Potassium Benzoate, Polyquaternium-67, Citric Acid, Dextrin, Sodium Bicarbonate, Cacao Extract, Disodium EDTA, Sodium Acetate, Butylene Glycol, Coptis Chinensis Root Extract, Sodium Hyaluronate, Eclipta Extact, Coccinia Indica Fruit Extract\n\n**2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel**\n\nWater, Glycerin, Coco-Betaine, Propanediol, Pentylene Glycol, Sodium Chloride, 1,2-Hexanediol, Xanthan Gum, Hydroxyethylcellulose, Potassium Cocoyl Glycinate, Potassium Cocoate, Oryza Sativa (Rice) Extract, Phyllostachys Pubescens Shoot Bark Extract, Panax Ginseng Root Extract, Aspergillus Ferment Extract Filtrate, Beta-Glucan, Butylene Glycol, Trehalose, Citric Acid, Cyclodextrin, Zanthoxylum Piperitum Fruit Extract, Pulsatilla Koreana Extract, Usnea Barbata (Lichen) Extract, Ethylhexylglycerin\n\n**3. Beauty of Joseon - Green Plum Refreshing Cleanser**\n\nWater, Prunus Mume Fruit Water, Cocamidopropyl Hydroxysultaine, Phaseolus Radiatus Seed Extract, Sodium Cocoyl Isethionate, Glycerin, Sodium Chloride, Camellia Sinensis Leaf Extract, Houttuynia Cordata Extract, Nelumbo Nucifera Flower Extract, Oryza Sativa (Rice) Extract, Prunus Mume Fruit Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Guar Hydroxypropyltrimonium Chloride, Coconut Acid, Ethylhexylglycerin, Caprylyl Glycol, Sodium Isethionate, Citric Acid, Butylene Glycol, 1,2-hexanediol, Punica Granatum Extract, Clitoria Ternatea Flower Extract, Garcinia Mangostana Peel Extract, Propylene Glycol Laurate, Sodium Citrate, Disodium EDTA\n\n**4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam**\n\nThere is vaseline in this, isnt that weird? Lol.\n\nWater, BG, Disodium Cocoyl Glutamate, PEG-8, Cocamidopropyl Betaine, Cocamide DEA, PEG-80 Sorbitan Laurate, Glycerin, Sorbitol, Sodium Taurine Cocoyl Methyltaurate, Sodium Acetylated Hyaluronate(Super Hyaluronic Acid), Hydroxypropyltrimonium Hyaluronate(Skin-adsorbed Hyaluronic Acid), Vaseline, Citric Acid, Polyquaternium-7, EDTA-2Na, BHT, Methylparaben\n\n**5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam (more for like 1-2x a week)**\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Coconut Acid, Polyquaternium-67, 1,2-Hexanediol, Sodium Isethionate, Sodium Methyl Cocoyl Taurate, Litsea Cubeba (May Chang) Oil, Sodium Chloride, Disodium EDTA, Ethylhexylglycerin, Sodium Acetate, Butylene Glycol, Centella Asiatica (Gotu Kola) Extract, Portulaca Oleracea (Green Purslane) Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hamamelis Virginiana (Witch Hazel) Extract, Sodium Hyaluronate, Beta-Glucan, Melaleuca Alternifolia (Tea Tree) Leaf Extract, Pentylene Glycol, Caprylyl Glycol, Diatomaceous Earth, Isopropyl Alcohol, Citric Acid, Vigna Angularis Seed Extract\n\n**6. B\\_LAB - Matcha Hydrating Foam Cleanser (also for 1-2x a week)**\n\nWater, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, 1,2-Hexanediol, Camellia Sinensis Leaf Extract, Betaine, Hydroxypropyl Starch Phosphate, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Laminaria Japonica Extract, Eclipta Prostrata Leaf Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Ulmus Davidiana Root Extract, Amaranthus Caudatus Seed Extract, Hydrogenated Lecithin, Lauryl Betaine, Camellia Sinensis Leaf Powder, Sodium Chloride, Polyquaternium-39, Decylene Glycol, Allantoin, Butylene Glycol, Fructan, Fructooligosaccharides, Beta-Glucan, Ceramide NP, Hydrolyzed Hyaluronic Acid, Hydroxyacetophenone, Ethylhexylglycerin",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "qualified_to_be",
        "body": "As someone with moderate T1 Rosacea, I love Asian skincare, that said, I haven’t tried any of these personally. If you’ve done your research, just try the first one! I’ve heard nothing but great things about Skin1004 as a whole.\n\nI’d share this with the r/AsianBeauty peeps as well. I’ve noticed a lot of eczema, psoriasis, and rosacea girlies there too.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "njdgtg",
    "title": "Does Maui Moisture HIBISCUS WATER shampoo has protein in it?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/njdgtg/does_maui_moisture_hibiscus_water_shampoo_has/",
    "score": 5,
    "num_comments": 7,
    "created": "2021-05-23T18:12:21+00:00",
    "body": "These are the ingredients: \n\nUnfortunately I can't tell from the ingredients. I am using the bamboo one from maui moisture, and it works great. My hair is low porosity, and I love it but I want to try the hibiscus water one because it looks like it smells so much nicer. But my hair can't handle protein, so I just want to make sure.\n\n&#x200B;\n\n[Aloe Barbadensis (Aloe Vera)](https://kremmania.hu/osszetevok/aloe-barbadensis-aloe-vera)  ,  [Water / Aqua](https://kremmania.hu/osszetevok/water-aqua)  ,  [Sodium C14-16 Olefin Sulfonate](https://kremmania.hu/osszetevok/sodium-c14-16-olefin-sulfonate) [**ti**](https://kremmania.hu/osszetevok/funkciok/tisztitoszerek)  ,  [Cocamidopropyl Betaine](https://kremmania.hu/osszetevok/cocamidopropyl-betaine) [**ti**](https://kremmania.hu/osszetevok/funkciok/tisztitoszerek) I [**eu**](https://kremmania.hu/osszetevok/funkciok/emulgealoszerek)  ,  [Cocos Nucifera (Coconut) Water](https://kremmania.hu/osszetevok/cocos-nucifera-coconut-water)  ,  [Glycol Distearate](https://kremmania.hu/osszetevok/glycol-distearate) [**eo**](https://kremmania.hu/osszetevok/funkciok/emollientek) I [**eu**](https://kremmania.hu/osszetevok/funkciok/emulgealoszerek)  ,  [PPG-2 Hydroxyethyl Coco/ Isostearamide](https://kremmania.hu/osszetevok/ppg-2-hydroxyethyl-coco-isostearamide) [**ti**](https://kremmania.hu/osszetevok/funkciok/tisztitoszerek)  ,  [Cocos Nucifera (Coconut) Water](https://kremmania.hu/osszetevok/cocos-nucifera-coconut-water)  ,  [Hibiscus Abelmoschus Seed Water](https://kremmania.hu/osszetevok/hibiscus-abelmoschus-seed-water) ,  [Passiflora Incarnata (Maypops) Fruit Extract](https://kremmania.hu/osszetevok/passiflora-incarnata-fruit-extract) [**gy**](https://kremmania.hu/osszetevok/funkciok/gyulladas-csokkentok)  ,  [Citrullus Vulgaris (Watermelon) Fruit Extract](https://kremmania.hu/osszetevok/citrullus-vulgaris-watermelon-fruit-extract)  ,  [Polyquaternium-22](https://kremmania.hu/osszetevok/polyquaternium-22)  ,  [Linoleamidopropyl PG-Dimonium Chloride Phosphate](https://kremmania.hu/osszetevok/linoleamidopropyl-pg-dimonium-chloride-phosphate)  ,  [Polyquaternium-39](https://kremmania.hu/osszetevok/polyquaternium-39)  ,  [Undecane](https://kremmania.hu/osszetevok/undecane) [**eo**](https://kremmania.hu/osszetevok/funkciok/emollientek)  ,  [Tridecane](https://kremmania.hu/osszetevok/tridecane) [**i**](https://kremmania.hu/osszetevok/funkciok/illatanyagok)  ,  [Sodium Hydrolyzed Potato Starch Dodecenylsuccinate](https://kremmania.hu/osszetevok/sodium-hydrolyzed-potato-starch-dodecenylsuccinate) , [PEG-150 Pentaerythrityl Tetrastearate](https://kremmania.hu/osszetevok/peg-150-pentaerythrityl-tetrastearate) [**eu**](https://kremmania.hu/osszetevok/funkciok/emulgealoszerek)  ,  [PPG-2 Hydroxyethyl Cocamide](https://kremmania.hu/osszetevok/ppg-2-hydroxyethyl-cocamide) [**ti**](https://kremmania.hu/osszetevok/funkciok/tisztitoszerek) I [**eu**](https://kremmania.hu/osszetevok/funkciok/emulgealoszerek)  ,  [Glycerin](https://kremmania.hu/osszetevok/glycerin) [**h**](https://kremmania.hu/osszetevok/funkciok/hidratalok)  0 0 ,  [Propylene Glycol](https://kremmania.hu/osszetevok/propylene-glycol) [**h**](https://kremmania.hu/osszetevok/funkciok/hidratalok)  ,  [Maltodextrin](https://kremmania.hu/osszetevok/maltodextrin)  , [Hexylene Glycol](https://kremmania.hu/osszetevok/hexylene-glycol) [**ti**](https://kremmania.hu/osszetevok/funkciok/tisztitoszerek) I [**eu**](https://kremmania.hu/osszetevok/funkciok/emulgealoszerek)  1 1 ,  [Sodium Citrate](https://kremmania.hu/osszetevok/sodium-citrate)  ,  [Citric Acid](https://kremmania.hu/osszetevok/citric-acid) [**kh**](https://kremmania.hu/osszetevok/funkciok/kemiai-hamlasztok)  ,  [Sodium Hydroxide](https://kremmania.hu/osszetevok/sodium-hydroxide)  ,  [Sodium Benzoate](https://kremmania.hu/osszetevok/sodium-benzoate) [**ta**](https://kremmania.hu/osszetevok/funkciok/tartositoszerek)  ,  [Parfum/Fragrance](https://kremmania.hu/osszetevok/parfum-fragrance) [**i**](https://kremmania.hu/osszetevok/funkciok/illatanyagok)",
    "flair_text": "Advice Request",
    "flair_template_id": "e608b216-58be-11e4-9d10-12313b0ea4d6",
    "comments": [
      {
        "author": "jaehom",
        "body": "According to its [Curl Scan ](https://curlscan.com/product/1471), yes it does. However, it is noted that \n\n> We believe this product contains protein based on its listed ingredients. The amount of protein will depend where the ingredient appears in the product’s ingredient list. The closer it is to the beginning of the list, the higher the protein content of the product. Some ingredients, like flax seed or proteins that have not been hydrolyzed (made easier to absorb by the hair), can be present in a product without it being considered high in protein. **These products may be suitable for people that choose to avoid other proteins as their protein content would be minimal if no other protein-containing ingredients are present in the formula.** We recommend researching any ingredients you are unsure about.\n\n>Matching ingredients: \"sodium hydrolyzed potato starch dodecenylsuccinate\"",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "sweettooth214",
        "body": "Doesn’t look like it does",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "cowq2d",
    "title": "Warning: Tresemme Tres Gel Ultra Firm Control gel (#5) flaked badly",
    "url": "https://www.reddit.com/r/curlyhair/comments/cowq2d/warning_tresemme_tres_gel_ultra_firm_control_gel/",
    "score": 3,
    "num_comments": 11,
    "created": "2019-08-11T13:28:02+00:00",
    "body": "Ingredients: Water, Acrylic Acid/VP Crosspolymer, Propylene Glycol, PVP, VP/Methacrylamide/Vinyl Imidazole Copolymer, Aminomethyl Propanol, Poly-Quaternium-4, Oleth-20, Sorbitol, Fragrance, DMDM Hydantoin, Polyquaternium-39, Disodium EDTA, Ext Violet 2 (CI60730)  \n\n\nThis checked out as CG-Approved on curlsbot, but I just finished SOTC, and while I really like the softness, volume, and curl pattern, my hair is dull and has thousands of tiny flakes of dried gel in it.   \n\n\nWill SOTC with oiled hands keep this from happening? Has anyone ever tried this gel successfully?   \n\n\nI usually use Cantu products, but I don't get as much volume or softness from the Coconut Curling Creme. I cannot abide these flakes... I JUST recovered from a YEARS long bout of seborrheic dermatitis a few weeks ago! Any help appreciated.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "natthatt",
        "body": "i'm fairly sure it's those damn polyquats. they're in almost everything and they cause shit tons of buildup!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Thatwasahellofaday",
        "body": "I just started CG recently and did the whole clarifying wash, etc. first. The first gel I tried was this same one from Tresemme and I was MORTIFIED by the amount of flaking in my hair (especially near the roots) as I didn’t notice it until I was already meeting a friend. I’m going to play around with the amount I used (maybe less at the roots?) but I was super unimpressed.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "efultz76",
        "body": "Maybe you applied too much?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "y7rk96",
    "title": "Kirkland Signature Moisture Shampoo and Conditioner",
    "url": "https://www.reddit.com/r/curlyhair/comments/y7rk96/kirkland_signature_moisture_shampoo_and/",
    "score": 3,
    "num_comments": 4,
    "created": "2022-10-19T03:28:16+00:00",
    "body": "Hello everyone, onthe Costco Website, it states that the shampoo and conditioner are sulfate free and color safe. Does anyone have any experience using these on curly hair?? Or if not, can anyone tell me if these would be good for curly hair?? These would be such an affordable option since curly hair products can get pricey 😓\n\nIngredient list for shampoo: \nIngredients: Water/Aqua/Eau, Sodium Cocoyl Isethionate, Cocamidopropyl Hydroxysultaine, Potassium Cocoyl Glycinate, Disodium Cocoyl Glutamate, Sodium Lauroyl Methyl Isethionate, Sodium Lauroyl Sarcosinate, Decyl Glucoside, Potassium Cocoate, Glycereth-26, Glycol Distearate, Cocamidopropylamine Oxide, Phenoxyethanol, Fragrance (Parfum), Sodium Cocoyl Glutamate, PEG-120 Methyl Glucose Dioleate, Methyl Gluceth-20, Quaternium-91, Amodimethicone, Acrylates Copolymer, Citric Acid, Dicaprylyl Ether, Polyquaternium-10, Guar Hydroxypropyltrimonium Chloride, Chlorphenesin, Trisodium Ethylenediamine Disuccinate, PPG-3 Benzyl Ether Myristate, Glyceryl Oleate, C11-15 Pareth-7, Polyquaternium-39, Laureth-9, Phospholipids, Glycerin, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Polyquaternium-55, Sodium Benzoate, Panthenol, Trideceth-12, Glycine Soja (Soybean) Oil, Acetic Acid, Tetrasodium EDTA, Benzoic Acid, Sodium Hydroxide, Disodium Edta, Potassium Sorbate, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Caprylyl Glycol, Tocopheryl Acetate, Helianthus Annuus (Sunflower) Seed Oil, Alcohol, Tocopherol, Argania Spinosa Kernel Oil, Ascorbic Acid, Persea Gratissima (Avocado) Oil, Copaifera Officinalis (Balsam Copaiba) Resin, Passiflora Edulis Seed Oil, Isomalt, Euterpe Oleracea Fruit Oil, Aloe Barbadensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Quaternium-95, Propanediol, Camellia Sinensis Leaf Extract, Persea Gratissima (Avocado) Fruit Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract, Vitis Vinifera (Grape) Seed Extract, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate.\n\nIngredients for Conditioner: \nIngredients: Water/Aqua/Eau, Cetearyl Alcohol, Stearamidopropyl Dimethylamine, Glycerin, Propanediol, Behentrimonium Methosulfate, Cetrimonium Chloride, Dimethicone, Isododecane, Isohexadecane, Citric Acid, Fragrance (Parfum), Hydroxyethylcellulose, Phenoxyethanol, Caprylyl Glycol, Glyceryl Stearate, PPG-3 Benzyl Ether Myristate, Guar Hydroxypropyltrimonium Chloride, Amodimethicone, Polyquaternium-73, Sodium Benzoate, Quaternium-87, Isopentyldiol, Disodium EDTA, Butyrospermum Parkii (Shea) Butter, Sodium Stearoyl Glutamate, Jojoba Esters, C11-15 Pareth-7, Laureth-9, Trideceth-12, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Acetic Acid, Glycereth-26, Sodium Hydroxide, Etidronic Acid, Potassium Sorbate, Helianthus Annuus (Sunflower) Seed Oil, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Phospholipids, Argania Spinosa Kernel Oil, Persea Gratissima (Avocado) Oil, Ascorbic Acid, Tocopheryl Acetate, Copaifera Officinalis (Balsam Copaiba) Resin, Isomalt, Quaternium-95, Tocopherol, Panthenol, Passiflora Edulis Seed Oil, Glycine Soja (Soybean) Oil, Euterpe Oleracea Fruit Oil, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Aloe Barbadensis Leaf Extract, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Persea Gratissima (Avocado) Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Alcohol, Vitis Vinifera (Grape) Seed Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "PlumPearls",
        "body": "Not suitable. Both contain silicones.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "It's what I've been using for years. Works for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "They are rebranded major label. This says it's Pureology Hydrate.\n\n[https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/](https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "1enumza",
    "title": "Is this Aveeno Rose Water & Chamomile Shampoo for Dry Hair good?",
    "url": "https://www.reddit.com/r/Haircare/comments/1enumza/is_this_aveeno_rose_water_chamomile_shampoo_for/",
    "score": 2,
    "num_comments": 0,
    "created": "2024-08-09T08:38:56+00:00",
    "body": "I have a fairly oily scalp and I'm suffering from a bit of hair loss. is this shampoo gonna be any good for me  \n\ningredients: Colloidal Oatmeal Extract, Water (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Glycol Distearate, Rosa Damascena Flower Water, Chamomilla Recutita (Matricaria) Flower/Leaf Extract, Polyquaternium-22, Linoleamidopropyl PG-Dimonium Chloride Phosphate, PEG-7 Amodimethicone, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Polyquaternium-39, Sodium Hydrolyzed Potato Starch Dodecenylsuccinate, Laureth-4, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Propylene Glycol, Hexylene Glycol, Sodium Citrate, Citric Acid, Sodium Hydroxide, Sodium Benzoate, Fragrance (Parfum).\n\n  \n",
    "flair_text": "❄️ Dandruff/Scalp Advice ❄️",
    "flair_template_id": "43aa3944-4130-11ef-b48e-1ab4ca880cd1",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2gixeb",
    "title": "Help! Cera-Ve Foaming Facial Cleanser v.s Biore Combination Skin Balancing Cleanser",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2gixeb/help_cerave_foaming_facial_cleanser_vs_biore/",
    "score": 1,
    "num_comments": 4,
    "created": "2014-09-16T03:12:15+00:00",
    "body": "Hey SCA! I recently started doing the OCM with mineral oil, bought my first sunscreen specifically to go on my face (I've had SO MANY sunburns in my life... eek), and have been moisturising religiously. My skin is combination dry and not acne prone, and I've seen a big improvement just in how moisturized and plump my skin is. \n\nNow that I've been taught better than to use my St. Ives Apricot Scrub on my face, I've switched to using a sample of Biore's Combination Skin Balancing Cleanser to double cleanse along with the OCM. I'm trying to decide between keeping up with Biore (I live in Canada, it's a standard in our drugstores) or switching to Cera-Ve after seeing it recommended so much (harder for me to find, more expensive, but bigger bottle). I've never before used any Cera-Ve products and have had no issues with my current routine. So, is this up to personal preference or is there an advantage to either? Thanks a bunch!!\n\n\nEdit: \n\nIngredients: WATER, GLYCERIN, LAURETH-4 CARBOXYLIC ACID, SORBITOL, COCAMIDOPROPYL BETAINE, SODIUM LAURETH SULFATE, ETHYLHEXYLGLYCERIN, ACRYLATES COPOLYMER, SODIUM HYDROXIDE, FRAGRANCE, PROPYLENE GLYCOL, METHYLPARABEN, POLYQUATERNIUM-39, PROPYLPARABEN, DISODIUM EDTA, PEG-45M, METHYLISOTHIAZOLINONE",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "18rna0l",
    "title": "Advice on the new shampoo/conditioner for curly hair",
    "url": "https://www.reddit.com/r/curlyhair/comments/18rna0l/advice_on_the_new_shampooconditioner_for_curly/",
    "score": 1,
    "num_comments": 2,
    "created": "2023-12-27T00:47:46+00:00",
    "body": " Currently I use the OGX Coconut Curls Sulfate Free shampoo and conditioner yet I'm worried it is causing outbreaks and maybe hair loss. It defiantly causes outbreaks I know for sure. Here are the ingredients:\n\nConditioner:\n\nWater (Aqua), Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Glycerin, PPG-3 Benzyl Ether Myristate, Dimethicone, Polyquaternium-47, Steareth-20, Propylene Glycol, Disodium EDTA, Isopropyl Alcohol, Citric Acid, Sodium Hydroxide, Sodium Benzoate, Fragrance (Parfum).\n\nShampoo:\n\nWater (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Polyquaternium-22, Linoleamidopropyl PG-Dimonium Chloride Phosphate, PEG-7 Amodimethicone, Polyquaternium-39, Laureth-4, Glycol Distearate, Glycerin, Propylene Glycol, Potassium Chloride, Hexylene Glycol, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Citric Acid, Sodium Hydroxide, Sodium Citrate, Sodium Benzoate, Fragrance (Parfum). Water (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Polyquaternium-22, Linoleamidopropyl PG-Dimonium Chloride Phosphate, PEG-7 Amodimethicone, Polyquaternium-39, Laureth-4, Glycol Distearate, Glycerin, Propylene Glycol, Potassium Chloride, Hexylene Glycol, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Citric Acid, Sodium Hydroxide, Sodium Citrate, Sodium Benzoate, Fragrance (Parfum).\n\nNot gonna lie that's a whole bunch of ingredients.\n\nI personally have a lot of dandruff which I would like to also solve but other than that my hair is curly, decently healthy, not that dry and not that fine.\n\nAny help on my hair care and which shampoo and conditioner I should swap to would be greatly appreciated\n\nthank youuuuuu",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "ohsamn",
        "body": "ogx quality has def declined imo, i suggest trying local conditioners and products or going home made for a few washes\nit could also be buildup due to continuous use, so feel free to add changes after a clarifying routine for a few days",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "marbief",
        "body": "coconutv completely kills my waves/curls. when i tried coconut oil on my face i got huge hard zits. coconut best kept for eating only imo",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "18rn865",
    "title": "Trying to find a new shampoo/conditioner",
    "url": "https://www.reddit.com/r/Hair/comments/18rn865/trying_to_find_a_new_shampooconditioner/",
    "score": 1,
    "num_comments": 4,
    "created": "2023-12-27T00:45:16+00:00",
    "body": "Currently I use the OGX Coconut Curls Sulfate Free shampoo and conditioner yet I'm worried it is causing outbreaks and maybe hair loss. It defiantly causes outbreaks I know for sure. Here are the ingredients:\n\nConditioner:\n\nWater (Aqua), Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Glycerin, PPG-3 Benzyl Ether Myristate, Dimethicone, Polyquaternium-47, Steareth-20, Propylene Glycol, Disodium EDTA, Isopropyl Alcohol, Citric Acid, Sodium Hydroxide, Sodium Benzoate, Fragrance (Parfum).\n\nShampoo:\n\nWater (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Polyquaternium-22, Linoleamidopropyl PG-Dimonium Chloride Phosphate, PEG-7 Amodimethicone, Polyquaternium-39, Laureth-4, Glycol Distearate, Glycerin, Propylene Glycol, Potassium Chloride, Hexylene Glycol, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Citric Acid, Sodium Hydroxide, Sodium Citrate, Sodium Benzoate, Fragrance (Parfum). Water (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocos Nucifera (Coconut) Oil, Honey Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Dulcis (Orange) Fruit Extract, Polyquaternium-22, Linoleamidopropyl PG-Dimonium Chloride Phosphate, PEG-7 Amodimethicone, Polyquaternium-39, Laureth-4, Glycol Distearate, Glycerin, Propylene Glycol, Potassium Chloride, Hexylene Glycol, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Citric Acid, Sodium Hydroxide, Sodium Citrate, Sodium Benzoate, Fragrance (Parfum).\n\nNot gonna lie that's a whole bunch of ingredients.\n\nI personally have a lot of dandruff which I would like to also solve but other than that my hair is curly, decently healthy, not that dry and not that fine.\n\nAny help on my hair care and which shampoo and conditioner I should swap to would be greatly appreciated\n\nthank youuuuuu",
    "flair_text": "Help",
    "flair_template_id": "1fb23224-19ed-11e8-8598-0e09b1f8bce8",
    "comments": [
      {
        "author": "missyxm",
        "body": "What sort of outbreaks you mean? If these products cause issues (like e.g. allergic reaction) with your scalp you should discontinue using them, otherwise if they give you results you like you could continue with them.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Frequent-Zucchini-50",
        "body": "My partner has curly hair and dandruff, he uses the Shea Moistures's Jamaican Black Castor Oil shampoo and conditioner. It's helped his dandruff and he's been dandruff free for 5 years now. I'm not sure what about the combo of ingredients solves it for him but its better than anti-dandruff shampoo/conditioners because those were so drying.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "sce7d4",
    "title": "Thoughts about this Cantu Avocado Sulfate-free Shampoo?",
    "url": "https://www.reddit.com/r/curlyhair/comments/sce7d4/thoughts_about_this_cantu_avocado_sulfatefree/",
    "score": 1,
    "num_comments": 2,
    "created": "2022-01-25T13:51:04+00:00",
    "body": "here are the ingredients:\n\nWater (Aqua, Eau), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Acrylates Copolymer, Cocamide Dipa, Glycerin, Glycol Distearate, Steareth-4, Fragrance (Parfum), Persea Gratissima (Avocado) Oil, Butyrospermum Parkii (Shea) Butter, Phenoxyethanol, Peg-150 Distearate, Polyquaternium-39, Polyester-37, Sodium Hydroxide, Guar Hydroxypropyl Trimonium Chloride, Ethylhexylglycerin, Disodium Edta, Panthenol, Polysorbate-20, Sodium Choride, Citric Acid.\n\nI ran them through Curlsbot and it warned me about the sulfonate. what do you think about it? Is it safe for 3B hair? I also use semi permanent dyes on my hair, so I would love to replace my clarifying/co wash routine with something that doesn't strip my hair of colour.",
    "flair_text": "discussion",
    "flair_template_id": "8a0f6380-21dd-11e6-9e78-0ead3f7791ed",
    "comments": [
      {
        "author": "aubandjoe",
        "body": "I believe that C14-16 stuff is also in kinky curly come clean shampoo and it is definitely more on the gentle clarifying side of the scale.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "malehairadvice",
    "post_id": "9bejbu",
    "title": "Help needed with finding an alternative to my dermatologist's recommendation ( shampoo and conditioner)",
    "url": "https://www.reddit.com/r/malehairadvice/comments/9bejbu/help_needed_with_finding_an_alternative_to_my/",
    "score": 1,
    "num_comments": 0,
    "created": "2018-08-29T23:46:01+00:00",
    "body": "I am a male with thick hair and my dermatologist suggested **Curatio Triclenz Hair Cleanser** and **Triflow Hair Conditioner**when I was facing hair fall (Its under control now). I continue to use the product but it weighs my hair down and I don't think it removes much of the oils from my scalp as I find few pimples after some washes.\n\n**Curatio Triclenz Hair Cleanser**\n\nSodium Laureth Sulphate, Aqua,Cocoamide MEA, Acrylates crosspolymer, Glycearyl Stearate, Dimethicone, Cocoamidopropylbeatine, TEA Dodecylsulfonate, Polyquaternium-39, Sodium pentasiloxane, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Panthenol, Propylene Glycol, Laureth-3, Diquaternium-10, Methylchlorisothiazolinone and Methylisothiazole, Trietholamine, Perfume,C.I.42090,C.I.17200\n\n**Triflow Hair Conditioner**\n\nAqua, Cyclopentasiloxane, Dimethyl Siloxane, Isoparaffic Hyrdrocrabon, Behentrimonium Methosulphate, Cetearyl Alcohol ,Hydrogenated Olive Oil, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Trimethicone, Amodimethicone, Trideceth-12, Cetrimonium Chloride, Polayquaternium-47, Bis-Hydroxy/methoxy Amodimethicone, Polyquaternium-10, Phenoxyethanol, Methylchlorisothiazalinone, Perfume.\n\nAs I am abroad it's difficult to get in touch with my dermatologist. Is there an alternative to this shampoo/conditioner or what's the best mild shampoo that you can recommend in Europe (preferable Sweden).",
    "flair_text": "Advice requests",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "9bef0f",
    "title": "Help needed with finding an alternative to my dermatologist's recommendation ( shampoo and conditioner)",
    "url": "https://www.reddit.com/r/tressless/comments/9bef0f/help_needed_with_finding_an_alternative_to_my/",
    "score": 0,
    "num_comments": 0,
    "created": "2018-08-29T23:30:21+00:00",
    "body": "I am a male with thick hair and my dermatologist suggested **Curatio Triclenz Hair Cleanser** and **Triflow Hair Conditioner** when I was facing hair fall (Its under control now). I continue to use the product but it weighs my hair down and I don't think it removes much of the oils from my scalp as I find few pimples after some washes.\n\n**Curatio Triclenz Hair Cleanser**\n\nSodium Laureth Sulphate, Aqua,Cocoamide MEA, Acrylates crosspolymer, Glycearyl Stearate, Dimethicone, Cocoamidopropylbeatine, TEA Dodecylsulfonate, Polyquaternium-39, Sodium pentasiloxane, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Panthenol, Propylene Glycol, Laureth-3, Diquaternium-10, Methylchlorisothiazolinone and Methylisothiazole, Trietholamine, Perfume,C.I.42090,C.I.17200\n\n**Triflow Hair Conditioner**\n\nAqua, Cyclopentasiloxane, Dimethyl Siloxane, Isoparaffic Hyrdrocrabon, Behentrimonium Methosulphate, Cetearyl Alcohol ,Hydrogenated Olive Oil, Dimethiconol, Dimethicone Crosspolymer, Phenyl Trimethicone, Trimethicone, Amodimethicone, Trideceth-12, Cetrimonium Chloride, Polayquaternium-47, Bis-Hydroxy/methoxy Amodimethicone, Polyquaternium-10, Phenoxyethanol, Methylchlorisothiazalinone, Perfume.\n\nAs I am abroad it's difficult to get in touch with my dermatologist. Is there an alternative to this shampoo/conditioner or whats the best mild shampoo that you can recommend in Europe (preferable Sweden).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "17g6t2o",
    "title": "Help: dry scalp, constant flakes, hair loss, no time for excessive mechanical washes... what would you do?",
    "url": "https://www.reddit.com/r/NoPoo/comments/17g6t2o/help_dry_scalp_constant_flakes_hair_loss_no_time/",
    "score": 0,
    "num_comments": 8,
    "created": "2023-10-25T15:01:49+00:00",
    "body": "Hi all. Basically my (very thick, long) hair has been flaky for ages. It is kinda oily, small flakes (I don't think it's dandrufff). I also experience hair loss (could be due to under nutrition). \n\nCurrently I just wash it low poo once a month, and brush it. I don't do much else but I'm happy to wash it more often (if I can find a simple either no poo homemade wash, or low poo shampoo). I don't have much motivation for lots of mechanical cleaning. \n\nAlso - my hair looks kinda lank and mildly greasy most of the time, with dry-ish ends. \n\nI'm in the UK. Should I just wash it more often? I'm considering taking collagen to help with the hair loss, and of course I know that when I eat more it will improve (have not been eating enough this past year). \n\nI just bought Aveeno shampoo (defo SLS free but not sure if it is low poo), would love recommendations for other low / no poo shampoos. \n\n&#x200B;\n\nEven if you can't directly answer me, maybe you have some thoughts on how I could diagnose the actual problem? Like... is it dry scalp, or actually just build up. I think probably a combination. \n\n&#x200B;\n\n(Shampoo ingredients: Colloidal Oatmeal Extract, Aqua/Water/Eau, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Glycol Distearate, Sodium Chloride, Hydrolyzed Milk Protein, Prunus Amygdalus Dulcis (Sweet Almond) Seed Extract, PEG-7 Amodimethicone, Polyquaternium-22, Polyquaternium-39, Sodium Hydrolyzed Potato Starch Dodecenylsuccinate, Linoleamidopropyl PG-Dimonium Chloride Phosphate, Laureth-4, PEG-150 Pentaerythrityl Tetrastearate, PPG-2 Hydroxyethyl Cocamide, Propylene Glycol, Glycerin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hexylene Glycol, Citric Acid, Sodium Citrate, Sodium Hydroxide, Sodium Benzoate, Formic Acid, Tocopheryl Acetate, Leuconostoc/Radish Root Ferment Filtrate, Coconut Acid, Disodium Tetrapropenyl Succinate, Sodium Bicarbonate, Parfum/Fragrance)\n\n&#x200B;\n\nhttps://preview.redd.it/2fffjxsi5dwb1.png?width=640&format=png&auto=webp&s=9e7dd8a1a7a9d1b3785f57bc9704fdc0c6076a75",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "veglove",
        "body": "So... overall I agree with u/shonaich that it's important to focus on your health and not worry as much about finding the perfect hair routine. \n\nThe science is up in the air regarding whether collagen that you eat turns into collagen in your body, or whether it's just broken down by your digestive system into smaller components and then reformed into whatever purposes the body needs it for; for most food it's the latter.  However there are other nutrients in our diet that are critical for hair growth and may cause hair loss if you are deficient in them. Take a look at this science journal article about [nutrition and hair loss](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5315033/).  I think taking a good multivitamin might improve your hair loss and overall health, although depending on why you are undernourished, you might also want to look into Telogen Effluvium and see if that resonates with your situation.  Stress and/or illness can cause TE hair loss a few months after the triggering event.\n\nYour scalp issues also strike me as a possible cause of the hair loss; when the scalp is irritated, it will shed more hair.  The best thing to do is to go to a dermatologist to get it diagnosed and treated.  But I know the healthcare system in the UK is really struggling right now and that might be out of reach for you. With many scalp issues, at least one factor is a fungal overgrowth, because the yeast-like fungus that is part of our skin's microbiome (malassezia) feeds on oil, including our own sebum, and so allowing sebum to accumulate on the scalp instead of shampooing regularly can encourage the population to get out of control and irritate the scalp, cause dandruff, etc.  Using a medicated dandruff shampoo and shampooing more frequently in general to remove the oil from the scalp can help get that under control.  If you want to continue using a low-poo shampoo, you could try Giovanni Tea Tree Oil shampoo, or find another low-poo tea tree oil shampoo.  Tea tree oil is good for fighting dandruff.  You can focus the shampoo on the roots of the hair to prevent the length from drying out from more frequent shampooing if that's a concern.  The r/SebDerm community might be a good resource to help confirm if it's dandruff/Seborrheic Dermatitis, and there's also r/DermatologyQuestions.  [Dermnetnz.org](https://dermnetnz.org/) is another great dermatology resource.\n\nHere's another method that one person discovered through trial and error to resolve their dry scalp issues, however I'll add the caveat that there are numerous scalp conditions that can have similar symptoms; it sounds like this person had a scalp condition that was not diagnosed; yours may be different such that the treatment that worked for them might not work for you.  [https://www.reddit.com/r/HaircareScience/comments/a0udkh/ive\\_finally\\_cracked\\_the\\_dry\\_itchy\\_flaky\\_scalp/](https://www.reddit.com/r/HaircareScience/comments/a0udkh/ive_finally_cracked_the_dry_itchy_flaky_scalp/)",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kelowana",
        "body": "NoPoo is about no silicone at all and LowPoo as well I think. \n\nMay I ask why you wash your hair only once a month? Why just once? Also, what exactly is your goal? Do you want NoPoo or LowPoo? Have you read up on both? It seems you haven’t, due to your questions, but maybe you misunderstood something. NoPoo and LowPoo aren’t about washing as little as possible, though there is an oath in NoPoo that’s called Sebum Only. It’s just needs lots of manual cleaning and that’s not what you want. So my question is, what exactly do you want?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "shonaich",
        "body": "Amodimethicone doesn't build up, but it still coats the hair and can prevent moisture from moving into the shaft. This shampoo is probably fine though, I would imagine a big company like Aveeno would research things that would remove and then redeposit what they put in their products.\n\nIt's far more important for you to focus on becoming a healthy human than fretting about hair care. I'd encourage you to find something easy that works and spend your available energy working on what sounds like serious issues, whether mental or physical. \n\nI highly recommend collagen, especially if you already know that nutrient deficiency is a problem. \n\nMagnesium is usually a big help also, as it's a fundamental resource the body uses in a huge variety of ways. Chelated magnesium glycinate is the most bio-available version.\n\nAshwaganda is an excellent herb that soothes anxiety, calms the body and helps promote healthy sleep.\n\nIf you want to do something that has wide benefits, slow warming scalp massage with your fingertips can help a lot of things. It feels nice, can be soothing, stimulates and warms the scalp, bringing blood flow and nutrients to it, and can be done anywhere you have 5 minutes.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ill-Quantity-9909",
        "body": "Just saw that it has PEG-7 Amodimethicone - which is a silicone. That is super annoying.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  }
]