[
  {
    "subreddit": "Haircare",
    "post_id": "uteekw",
    "title": "Deep Conditioning Your Hair",
    "url": "https://www.reddit.com/r/Haircare/comments/uteekw/deep_conditioning_your_hair/",
    "score": 11,
    "num_comments": 0,
    "created": "2022-05-19T22:09:15+00:00",
    "body": "Deep conditioning is a best practice to incorporate into your hair routine. Even if you feel your hair is not damaged, deep conditioners still help maintain healthy looking hair over time. Choosing how often to deep condition and which products to use can be a challenge. Deep conditioners go by many names, but are often thicker and heavier in their ingredient concentration.\n\n(This is the entire text from my [original blog](https://www.thehairlooks.com/blog-deep-conditioning-your-hair.html))\n\n**What hair types and styles need deep conditioning?**\n\n* Long hair that feels dry\n* Chemically altered hair (examples: hair that has been lightened, permed, relaxed)\n* Naturally dry hair\n* [Damaged hair](https://www.thehairlooks.com/blog-hair-challenges-part-i---damage.html)\n* [Hair with frizz](https://www.thehairlooks.com/blog-hair-challenges-part-i---frizz.html)\n* Swimmers that expose their hair to chlorine often\n* Beach lovers with sun-bleached hair\n* People with hard water, or who use well water\n* Anyone who frequently uses high heat to style their hair (ex: flat iron)​\n\n**What is the goal of a deep conditioning treatment for hair?**  \n​The two goals here are (1) hydration and (2) slip. Both help with the appearance and overall longevity of your hair's strands.   \n\n\nHydration\n\n* Silky, flexible strands (versus dry, brittle ones) with more shine\n* Smooth ends (versus puffy and frayed)\n* On curly hair - curls that form evenly (versus inconsistently)\n\nSlip\n\n* Reduces [tangling](https://www.thehairlooks.com/blog-hair-challenges-part-ii---tangles.html)\n* Reduces friction from [traction damage](https://www.thehairlooks.com/blog-hair-challenges-part-i---damage.html) (to help hair grow)\n* Reduces[ frizz](https://www.thehairlooks.com/blog-hair-challenges-part-i---frizz.html)\n\n**How often should I deep condition?**  \nThis is unique to each person's hair type. Deep conditioning bi-monthly or monthly is common. If your hair is damaged, you can deep condition up to once a week. For more insights on how to fit deep conditioning into your routine, check out my post on [Hair Schedules](https://www.thehairlooks.com/blog-hair-schedules.html).\n\n**What are the best ingredients for deep conditioners?**  \nBelow I've shared common ingredients you'll find in conditioner and/or deep conditioners. It's helpful to know what these ingredients are in case a company doesn't use the term \"deep conditioner\" on the product label. Other terms used for deep conditioning-related products are:  hair treatment, hair tonic, hair lotion and hair masque. You can also check out my post on [Hair Oils](https://www.thehairlooks.com/blog-hair-oils.html) for more insights on ingredient lists.\n\n* Panthenol\n* Glycerin\n* Amino Acids\n* Peptides\n* Cetyl alcohol or cetyl alcohol\n* Hydrolyzed proteins (ex: wheat, soy, keratin protein)\n* Stearamidopropyl Dimethylamine\n* Quaternium-87\n* Behentrimonium Methosulfate\n* Behentrimonium Chloride\n* Dicetyldimonium Chloride\n* Distearyldimonium Chloride\n* Polyquaternium 55\n* Guar Hydroxypropyltrimonium Chloride \n* Polyquaternium-44 \n* Cetrimonium Bromide\n* Cetrimonium Chloride\n* Palmitamidopropyltrimonium Chloride\n* Laurdimonium hydroxypropyl hydrolyzed \n* Polyquaternium-4\n* Polyquaternium-10\n\n**How should you deep condition your hair?**  \nI've listed the process I recommend to my clients to help them get the best hydration and slip below.\n\n* Shampoo twice with clarifying shampoo, or use a regular shampoo plus a detox treatment, and rinse well.\n* Ring out most of the water from your hair, and/or soak it up with a towel.\n* Apply conditioner or deep conditioner from roots-to-ends.\n* Massage conditioner and water into your hair. Good coverage equals a better result. This can look like a combination of the techniques below. You can read more about the squeezing and scrunching technique [here](https://www.cosmopolitan.com/style-beauty/beauty/a37304107/squish-to-condish/) in Cosmopolitan.\n   * untangling\n   * working in sections\n   * pressing root to tip\n   * gentle squeezing\n   * scrunching\n   * combing\n   * gathering all the hair together​\n* Let the deep conditioner sit for between 10-20 minutes on thicker hair or 5 - 10 minutes on finer hair.\n* Dunk hair in water using a sink or cup, or just quickly rewet in the shower.\n* Use the techniques listed above to press more water into the hair.\n* Do a final rise. On drier hair, this can be a quick rinse that leaves more conditioner residue. On finer hair, you'll want to do a more thorough rinse to prevent the deep conditioner from weighing your hair down. \n* Add leave-in products.\n* End with drying and/or styling  method of your choice:\n   * ​Air dry (avoid this method if it will take more than one hour to dry)\n   * Diffuse or blowdry with cold air\n   * Diffuse or blowdry with hot air and [heat protection](https://www.thehairlooks.com/blog-protecting-your-hair-from-heat-damage.html)\n\n**Can you over-condition hair?**  \nIf you are experiencing hair that appears:\n\n* limp, flat or heavy\n* to have build up or residue\n* straighter than you'd like\n* greasy or too shiny\n\nthen you could be over-conditioning. Try cutting back on the amount of deep conditioning treatments in your routine, switching conditioners to one that is for volume, or lightly shampooing after you condition. You can also check out my post on [Hygral Fatigue](https://www.thehairlooks.com/blog-hygral-fatigue.html) to learn more about maintaining balance between moisture and protein in your hair. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "m2y8nj",
    "title": "I thought hard water specific products would help my hair, but they made it worse. Why?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/m2y8nj/i_thought_hard_water_specific_products_would_help/",
    "score": 5,
    "num_comments": 20,
    "created": "2021-03-11T19:14:03+00:00",
    "body": "**Background**\n\nI live in an area with very hard water (Minneapolis), and it’s definitely been tough on my hair. I had done the Malibu C hard water treatment packets in the past, and found them helpful. My tap water pH is 9 (!!!!! yes, nine!) and contains an average of 3.5 – 4.0ppm of chlorine (not sure how that stacks up).\n\n I have caucasian 2a wavy-ish hair that is very fine and splits easily and is very prone to frizz if I don’t use the right products. It's virgin but damages easily. I almost never blow dry it, and flat iron it occasionally - 1x a week at most. Despite being fine textured, it can take wayyy more product than you would expect. \n\n^(Extra: I was previously using the Cantu shampoo and conditioner, doing a CGM-ish routine, but have decided to switch it up my hair care this year. I think the shampoo caused buildup over time, despite me not using silicones, because I did a single wash with Malibu clarifying shampoo and swimmers treatment and holy hell did it make my hair so much lighter and bouncier! So I’ve decided to stop the CGM and look for a better routine for my hair. (That means anything goes as far as ingredients.)\n\n&#x200B;\n\n**The Problem**\n\nI got the Malibu C Hard Water Wellness Shampoo & Conditioner, thinking it would be the answer to all my life’s problems. I desperately wanted them to work for me, but I'm starting to realize that they are a total bust. :(\n\n**I’ve used them for 1.5 months and I wash my hair 1-2x a week. As soon as I started using them, my hair became *noticeably more frizzy*, and over time it seems to be getting worse, not better.** My hair hasn’t been this frizzy since I had a stint living in a very humid island climate. The conditioner also doesn’t feel particularly conditioning to me.\n\nAt this point I’m kind of at a loss on what to do, since I don’t have a go-to shampoo/conditioner to go back to. I’m trying to figure out what the problem is so that I know what direction to go in with my next product. \n\n&#x200B;\n\n**Theories**\n\nI also tried HealthySexyHair Moisturizing Conditioner for one use, and that didn’t help the frizz. It was about the same. I see they both have glycerin prominently on the list. Could that be it? Another hypothesis I have is the shampoo may be too harsh on my hair, even though it’s supposed to be “protective” according to the manufacturer, and the conditioner isn’t ~~moisturizing~~ conditioning enough to combat the harshness. The pH of the Malibu C shampoo is supposedly 6.0-6.8, but I got that info from an Amazon review and can’t verify (it cited the manufacturer’s website but I can’t find it). (Not sure that shampoo pH matters relative to my tap water anyway...). Malibu C claims their shampoo is not harsh, very gentle, and can be used daily. According to the site, the purpose of the shampoo is to prevent minerals from attaching to your hair, as opposed to removing them. So I honestly can’t tell if the shampoo is harsh, or the conditioner just sucks.\n\n&#x200B;\n\n**TL;DR:** I’m trying to figure out what it is about these products that made my hair suddenly frizzy, so I can figure out what to avoid and/or look for in a replacement. Thank you 🙏🏻🖤\n\n&#x200B;\n\n&#x200B;\n\n**Malibu C Hard Water Shampoo:** Water/Aqua/Eau, Sodium C14-16 Olefin Sulfonate, Cocamide DIPA, Disodium Laureth Sulfosuccinate, Butylene Glycol, Glycerin, Cocamidopropyl Betaine, PEG-120 Methyl Glucose Dioleate, Disodium EDTA, Sodium Lauryl Sulfoacetate, Panthenol, Hydrolyzed Rice Protein, PEG-16 Macadamia Glycerides, Polyquaternium 10, Linum Usitatissimum Seed Extract, Sodium Gluconate, Glucose, Citric Acid, Phenoxyethanol, Potassium Sorbate, Fragrance/Parfum, Limonene, Benzyl Benzoate, Linalool.\n\n**Malibu C Hard Water Conditioner:** Water/Aqua/Eau, Cetearyl Alcohol, Glycerin, Butylene Glycol, Isopropyl Myristate, Cetyl Alcohol, Stearalkonium Chloride, Dimethicone, Behentrimonium Chloride, Olea Europaea Fruit Oil, Tocotrienols, Tocopherol, Panthenol, Cyclopentasiloxane, Tocopheryl Acetate, Polyquaternium-4, Linum Usitatissimum Seed Extract, Hydrolyzed Rice Protein, C12-15 Alkyl Benzoate, Cetrimonium Chloride, Fragrance/Parfum, Citric Acid, Cyclohexasiloxane, Potassium Sorbate, Phenoxyethanol, Limonene, Benzyl Benzoate, Linalool.\n\n**HealthySexyHair Conditioner:** Water (Aqua, Eau), Behentrimonium Chloride, Glycerin, Stearyl Alcohol, Cetyl Alcohol, Stearamidopropyl Dimethylamine, Isopropyl Alcohol, Dimethicone, Polyquaternium-37, Lactic Acid, Propylene Glycol Dicaprylate/ Dicaprate, Polyglyceryl-3 Caprate, Silicone Quaternium-22, Dicetyldimonium Chloride, Hydroxy-ethylcellulose, Sodium PCA, Propylene Glycol, Quaternium-80, Butyrospermum Parkii (Shea) Butter, Trimethylsiloxyamodimethicone,Panthenol, PPG-1 Trideceth-6, C11-15 Pareth-7, Disodium EDTA, Dipropylene Glycol, C12-16 Pareth-9, Trideceth-12, Magnesium Nitrate, Cocamidopropyl Betaine, Argania Spinosa Kernel Oil, Glycine Soja (Soybean) Oil, Theobroma Cacao (Cocoa) Seed Butter, Palmitamidopro- pyltrimonium Chloride, Hydrolyzed Soy Protein, Magnesium Chloride, Trisodium HEDTA, Acacia Dealbata Flower Extract, Citric Acid, Moonstone Extract (lol), Fragrance (Parfum), Methylchloroisothiazolinone,Methylisothiazolinone, Phenoxyethanol, Sodium Benzoate, Glyoxal, Sodium Nitrate, Limonene.",
    "flair_text": "Product Question",
    "flair_template_id": "f0237a66-58bd-11e4-a1a9-12313b0e8234",
    "comments": [
      {
        "author": "thlaylirah17",
        "body": "I can’t use products with glycerin either, they dry my hair out so bad and cause a lot of frizz. Another thing it could potentially be is an imbalance between protein and moisture. It’s not super high up on the ingredient list for any of the products you listed, but they do contain either rice or soy protein. Your hair might need more moisture to balance it out. Do you ever use a deep conditioner or a leave-in conditioner?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "curlygang",
        "body": "You may be protein, butter or humectant sensitive (e.g panthenol, glycerin, niacinamide).",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "SailorSin77",
        "body": "I would also recommend a leave-in conditioner as well as a smoothing oil like argan oil. This is 100% anecdotal: I live in the middle of nowhere and have very hard water in my well. I noticed almost immediately after moving in (from city water) that my hair got brittle and frizzy. After investing in a good shampoo/conditioner, a leave-in and a good smoothing oil, that has somewhat rectified itself. I also installed a hard water filter on my shower head which has helped as well.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Tess47",
        "body": "I boight the same items.  I used the shampoo and conditioner once and stopped.  I called and they refunded me.  Yea!    I also bought and used the one treatment and it did not work for me. \nLast year I wanted to do the malibu c but I could not find it so I used the Sally's version Ion.   It worked better for me.   In fact I finally ordered some and did it yesterday.  It definitely worked better for me.     \nSo-  Sally's beauty, Ion brand single treatment.   Very good.  My hair is also fine and thick,  wavy.     \nAny body want an unopened set of shampoo and conditioner?  I bought 2.  They told me to keep the products.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "icantreadcat",
        "body": "Hey I know this post is a month old but I gotta point out that the shampoo and conditioner have protein in it. Kind of sounds like we have similar hair and protein basically fries my hair and becomes a brittle, tangled frizzy mess.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "b9z8ok",
    "title": "FYI: Aussie Instant Freeze Gel Has Been Reformulated",
    "url": "https://www.reddit.com/r/curlyhair/comments/b9z8ok/fyi_aussie_instant_freeze_gel_has_been/",
    "score": 7,
    "num_comments": 7,
    "created": "2019-04-06T01:23:00+00:00",
    "body": "I picked up a new bottle of Aussie Instant Freeze Hair Gel, my HG gel that I've been using for years now, and noticed that the packaging had changed. I still had a bottle with the old packaging, so I compared the ingredients list to see if formula had been changed as well, and yes, it has.\n\nHere is the ingredients list for the *old* formula:\n\nWater/Eau, Laureth-23, Polyquaternium-4, Hydroxyethylcellulose, Benzyl Alcohol, Acrylates/Beheneth-25 Methacrylate Copolymer, Aminomethyl Propanol, DMDM Hydantoin, Fragrance/Parfum, Acrylates Copolymer, Disodium EDTA, Aloe Barbadensis Leaf Extract, Ecklonia Radiata Extract, Simmondsia Chinensis (Jojoba) Seed Oil\n\nHere is the ingredients list for the *new* formula:\n\nWater, Laureth-23, Polyquaternium-4, Aloe Barbadensis Leaf Extract, Simmondsia Chinensis (Jojoba) Seed Oil, Ecklonia, Radiata Extract, Fragrance, Hydroxyethylcellulose, Benzyl Alcohol, Acrylates/Beheneth-25 Methacrylate, Copolymer, Aminomethyl Propanol, DMDM Hydantoin, Acrylates Copolymer, Disodium EDTA\n\nBoth formulas have identical ingredients, so the new formula is still CG friendly, but the order of the ingredients has changed. In the old formula, the aloe leaf and Australian sea kelp extracts and jojoba oil were the last three ingredients. In the new formula, the extracts and jojoba oil have moved to the top of the ingredients list after the first three ingredients, which are the same in both formulas (water, laureth-23, and polyquaternium-4).\n\nFor reference, I took a photo of both bottles side-by-side, [front](https://imgur.com/72OIjeF) and [back](https://imgur.com/NFD47G7). Old packaging is on the left, new packing on the right. If you can't view the images, the old packing was in a mostly transparent tube, and the new packaging is solid purple. Both bottles claim 20 hour \"maximum\" hold. The size of the bottle has remained the same (7 oz).\n\nI haven't had the chance to test out new formula yet, so I can't attest to how the performance has changed. I did squirt out about a dime-sized amount for a quick comparison, though. The texture, consistency, and fragrance seems to be the same. This has been my HG gel for years now, I've even recommended it several times on this sub, and I'm really hoping that the reformulation doesn't drastically affect how it performs on my hair. If is drastically different and doesn't give me as much hold as the old formula, I'm going to be very disappointed and will probably have to start looking for a new gel. I'll try to post a full review of the new formula once I have an opportunity to really test it out.\n\nHas anyone used the new formula yet? What do you think about it?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "icanadultlater",
        "body": "I’ve heard many folks complaining about the new formula.  Have you tried the la looks blue gel?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "amandaunbidden",
        "body": "Aw man! That’s my fav cheap gel. I hate reformulations! I guess I’ll have to finally try the LA Looks",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "chromejelly",
        "body": "I used it, didn't pay enough attention that it had been reformulated. It straightened my hair way more than normal. Maybe it was just a bad hair day, but I've taken to mixing it with my Deva curl cream and that seems to have helped.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "CoffeeBulbasaur",
        "body": "I thought they just had two different kinds? I have both, I assumed one had kelp and one didn’t. Are the phasing the other one out?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Zygonsbzygons",
        "body": "I used to use this gel in high school but recently found out that the new formula doesn't work for me. I've been using the Garnier Pure Clean Gel with good results! Not sure if it's 100% CG friendly but it's silicone and paraben free.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "tangerines-are-tasty",
        "body": "I never got a chance to use the old one, but the new formulation seems to actually be straightening my hair now.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "givemebeans",
        "body": "Just bought this and it's extremely flaky/fibery after breaking my gel cast :/",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1cunkaa",
    "title": "About to Lose My Favorite Mousse...Please Help",
    "url": "https://www.reddit.com/r/curlyhair/comments/1cunkaa/about_to_lose_my_favorite_mousseplease_help/",
    "score": 6,
    "num_comments": 1,
    "created": "2024-05-18T03:00:39+00:00",
    "body": "Hi there! So I have been a long time user of the [original Tresemmé Flawless Curls Mousse](https://m.media-amazon.com/images/I/518ty7PJlEL.jpg). A couple of years ago they changed the formula and I've been buying boxes of old cans ever since. However, it looks like I'm about to run out forever. I cannot switch to their new formula because it has coconut oil and avocado oil. I'm a oily hair gal, so both a no go for me. Does anyone know of any alternatives that are close or have worked for them personally? Would appreciate any help here! \n\nAlso sharing the list of ingredients here in case it may be helpful: water (aqua), isobutane, hydrofluorocarbon 152a, vp/va copolymer, propane, polyquaternium-11, polysorbate 20, polyquaternium-4, pvp, fragrance (parfum), ppg-12-peg-50, lanolin, olealkonium chloride, polyquaternium-7, sodium benzoate, propylene glycol, cyclopentasiloxane, sorbitol, glycerin, cocamidopropyl betaine, cyclohexasiloxane",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Purple_Penguin73",
        "body": "Same! I’m allergic to coconut so I had to switch too. I’ve been using their extra hold volumizing mousse instead. I just looked at my can and the ingredients look similar to the ones you listed. I started off with a travel size just in case which I can regularly find at Walmart and Target in the travel section if you’re in the US and want to give it a chance.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "henna",
    "post_id": "1gvyxdk",
    "title": "Aura Bold Sonoma Red over Henna",
    "url": "https://www.reddit.com/r/henna/comments/1gvyxdk/aura_bold_sonoma_red_over_henna/",
    "score": 5,
    "num_comments": 0,
    "created": "2024-11-20T20:10:28+00:00",
    "body": "https://preview.redd.it/fzrjzdrh542e1.jpg?width=2048&format=pjpg&auto=webp&s=def17defdc5058048e86c7718535ab39ec4d04d4\n\nI used direct dyes (see our [FAQ](https://www.reddit.com/r/henna/wiki/hair-faq/#wiki_.1F58D.FE0F_what_are_direct_dyes_and_how_do_they_work_with_henna.3F) for more info) over my henna to blend roots and tone the color. A few weeks ago I used [Overtone Espresso](https://www.reddit.com/r/henna/comments/1gg42bd/before_and_after_espresso_overtone_conditioning/) and this week I used Aura Bold Sonoma red. I've been using these over henna for over two years and they don't seem to affect dye uptake when I eventually henna the roots, but I do clarify with a sulfate shampoo and do hard water treatment before doing henna. The Aura masque certainly added some color and does help the roots blend even if it doesn't fully cover grey. However, it dyes the scalp much worse than Overtone does and overall the color is a bit dull for my taste. I probably won't repurchase this particular color and I'm planning on experimenting with other direct dye companies anyway.  \n  \n  \nMy henna blend ingredients are: amla, Ancient sunrise Rajasthani Twilight henna, Ancient Sunrise Sudina indigo\n\nAura masque is: Water/Aqua/Eau, Polyquaternium-37, Cetearyl Alcohol, Propylene Glycol Dicaprylate/Dicaprate, Brassica Alcohol, Quaternium-80, Propylene Glycol, Glycerin, Benzyl Alcohol, Isopropyl Palmitate, Isopropyl Myristate, Brassicyl Valinate Esylate, Dicetyldimonium Chloride, Sodium PCA, Caprylyl Glycol, Orbignya Oleifera Seed Oil, Dipropylene Glycol, Glyceryl Stearate, Jojoba Esters, Glycine Soja Extract, Guar Hydroxypropyltrimonium Chloride, Basic Red 51, Calcium Gluconate, PPG-1 Trideceth-6, Simmondsia Chinensis (Jojoba) Seed Oil, Benzoic Acid, Basic Orange 31, Behenamidopropyl Dimethylamine, Dimethicone, Citric Acid, Sodium Stearoyl Glutamate, Helianthus Annuus (Sunflower) Seed Wax, Phenyl Trimethicone, Ethylhexyl Olivate, Polyquaternium-4, Isohexadecane, Isododecane, HC Blue 16, Polyquaternium-73, Niacinamide, Bis-(Isostearoyl/Oleoyl Isopropyl) Dimonium Methosulfate, Crambe Abyssinica Seed Oil, 1,2-Hexanediol, Plukenetia Volubilis Seed Oil, Arginine, Argania Spinosa Kernel Oil, Stearamidopropyl Dimethylamine, Sodium Lactate, Sodium Polyaspartate, Lecithin, Salvia Hispanica Seed Oil, Tocopheryl Acetate, Phenoxyethanol, Aspartic Acid, Trimethylsiloxysilicate, PCA, Cetrimonium Chloride, Butylene Glycol, Polyglycerin-3, Squalane, Glycine, Alanine, Sodium Benzoate, Ethyl Lauroyl Arginate HCl, Tetrasodium Glutamate Diacetate, Dehydroacetic Acid, Serine, Ethylhexylglycerin, Valine, Dimethiconol, Threonine, Proline, Isoleucine, Phenylalanine, Histidine, Disodium EDTA, Tocopherol  \n",
    "flair_text": "Henna + Other Dyes",
    "flair_template_id": "c798b05a-a779-11ef-a7eb-2ed8957281e9",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "55m2nm",
    "title": "Anyone have time to help with a mousse ingredient check?",
    "url": "https://www.reddit.com/r/curlyhair/comments/55m2nm/anyone_have_time_to_help_with_a_mousse_ingredient/",
    "score": 4,
    "num_comments": 11,
    "created": "2016-10-03T04:23:44+00:00",
    "body": "It seems learning what to look for on hair product labels will be a lot like learning the diet I have to follow for IBS - overwhelming and requires lots of referencing at the start, but eventually becomes second nature. I appreciate everyone's time and help!\n     \n[**John Frieda Luxurious Volume Mousse**](http://www.ulta.com/luxurious-volume-thickening-mousse?productId=xlsImpprod650014)\nWater, Isobutane, Vp/Methacrylamide/Vinyl Imidazole Copolymer, Polyquaternium-46, Panthenol, Propane, Laureth-3, Cocotrimonium Methosulfate, Ceteareth-25, Benzophenone-4, Propylene Glycol, Diazolidinyl Urea, Methylparaben, Propylparaben, Fragrance\n     \n*I had this ^^ from awhile back and tried it yesterday - hair was amazing and got loads of compliments. The formula I used is different than [what is being sold now.](http://www.johnfrieda.com/en-US/ProductDetail/Hair-Care/Luxurious-Volume/Building-Mousse) Panicking. Any thoughts on the ingredient changes?*\n    \n[**Tresemme Thermal Creations Volume Boosting Mousse**](http://www.ulta.com/volumizing-mousse?productId=prod2143799) \nWater, Isobutane, Hydrofluorocarbon 152A, VP/VA Copolymer, Propane, Polyquaternium-11, Polysorbate 20, PVP, Polyquaternium-4, PPG-12-PEG-50 Lanolin, Cyclopentasiloxane, Cyclohexasiloxane, Tocopheryl Acetate, Niacinamide, Biotin, Ascorbic Acid, Panthenol, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltr, Cocamidopropyl Betaine, Olealkonium Chloride, PPG-9 Diethylmonium Chloride, Sodium Benzoate, Propylene Glycol, Sorbitol, Glycerin, Alpha Isomethyl Ionone, Benzyl Benzoate, Butylphenyl Methyl Propional, Citronellol, Geraniol, Hexyl Cinnamal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Linalool, Fragrance.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Curlygirlgreen",
        "body": "Dont use neither of them. They have quats (act like silicone --> build up) and paraben (coul lead to cancer) in them.  Logona and Weleda are safe for the CG-method.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "oh_my_glob_22",
        "body": "Cyclopentasiloxane is a silicone. If you're looking to follow the CG method, then it's best to stay away from that one.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1cplquy",
    "title": "What ingredient(s) hold a curling iron curl?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1cplquy/what_ingredients_hold_a_curling_iron_curl/",
    "score": 5,
    "num_comments": 8,
    "created": "2024-05-11T16:49:36+00:00",
    "body": "Hi all,\n\nI was wondering if anyone could tell me what kind of ingredients in leave-in creme/gel products are responsible for creating hold?\n\nThe only product that gets my very fine, straight hair to hold a curl is the original formula of Aveda Smooth Infusion Nourishing Styling Creme. Unfortunately, I am almost out and need to find something similar.\n\nThese are the ingredients in the formula I love:  \nWater, Propanediol, Dimethicone, Glycerin, Hydroxypropyl Starch, C14-22 Alcohols, Caprylyl Glycol, Aloe Barbadensis Leaf, Perilla Ocymoides Seed Extract, Shea Butter, Theobroma Grandiflorum Seed Butter, Astrocaryum Murumuru Seed Butter, Pomegranate Seed Oil, Sisymbrium Irio Seed Oil, Adansonia Digitata Seed Oil, Hydroxypropyltrimonium Hydrolyzed Corn Starch, Hydrolyzed Wheat Protein PG-Propyl Silanetriol, Orbignya Speciosa Kernel Oil, Hydroxyethylcellulose, Glyceryl Stearate, Ethyl Macadamiate, Dimethiconol, Bis-Cetearyl Amodimethicone, Decyl Glucoside, PEG-100 Stearate, Polyquaternium-4, C12-20 Alkyl Glucoside, Oryzanol, Guar Hydroxypropyltrimonium Chloride, Sodium Chloride, Fragrance, Farnesol, Linalool, Citronellol, Citral, Limonene, Benzyl Benzoate, Geraniol, Phenoxyethanol.",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "litttlejoker",
        "body": "Get the right parents… bc hair that doesn’t hold a curl is genetic. Or extensions",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "veglove",
        "body": "I'm not sure it can be narrowed down to a specific ingredient. [Episode 356](https://www.patreon.com/posts/episode-356-hair-97988795) of The Beauty Brains discusses a lot of factors that affect how well hair can hold styled curls.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Strangewhine88",
        "body": "Ye old dippity do.  Your grandma used with her curlers.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "SwimmingIron5498",
        "body": "spray a texturizing spray before you curl your hair and it’ll hold",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "nae8ti",
    "title": "Styling gel",
    "url": "https://www.reddit.com/r/HaircareScience/comments/nae8ti/styling_gel/",
    "score": 3,
    "num_comments": 4,
    "created": "2021-05-12T02:25:13+00:00",
    "body": "I have been trying to find a simple styling gel that contains polyquaternium-4 along with some form of silicone and without glycerine. Searching is difficult because everything is coming back as “silicone-free” and CGM related even when I get specific about my search. I’d consider trying to make my own gel but I think it might be beyond my skills. I haven’t found any good diy recipes that aren’t flaxseed or the like. Does anyone know of a gel or recipe they could direct me to?",
    "flair_text": "Advice Request",
    "flair_template_id": "e608b216-58be-11e4-9d10-12313b0ea4d6",
    "comments": [
      {
        "author": "thewintertype",
        "body": "herbal essences set me up gel has poly quat 4, and is without glycerin, no silicones :/. maybe pair with a curl cream before and finish with the gel? that’s what i do and my curls really like it! (medium density, coarse 3b/c)",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Clayhoeee",
        "body": "Pillow curls brand has a good gel u should try",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "315eew",
    "title": "Tres Mousse cheap and good?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/315eew/tres_mousse_cheap_and_good/",
    "score": 3,
    "num_comments": 0,
    "created": "2015-04-02T03:07:12+00:00",
    "body": "I've been reading the care guide and have decided to start taking better care if my hair.  \n\nI'm a guy and I use mousse in my hair for extra volume in the mornings because I have thin hair.  I use tresemmes mouse..  Tres mousse..  Which has the following ingredients\n\nWater (Aqua, Eau), Isobutane, Hydrofluorocarbon 152A, VP/VA Copolymer, Polyquaternium-11, Propane, Polysorbate 20, PVP, Polyquaternium-4, Fragrance (Parfum), PPG-12-PEG-50 Lanolin, Olealkonium Chloride, Polyquaternium-7, PPG-9 Diethylmonium Chloride, Sodium Benzoate, Propylene Glycol, Cyclopentasiloxane, Hexyl Cinnamal, Butylphenyl Methylpropional, Cyclohexasiloxane, Sorbitol, Glycerin, Benzyl Benzoate, Cocamidopropyl Betaine, Citronellol, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Hydroxycitronellal, Geraniol, Hydrolyzed Elastin, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Amyl Cinnamal.\n\nI noticed that the ingredients sort of sound like heat protectants .  Such as the PVP and polyquartenum (the video in the haircare guide recommends quartenum). \n\nIs there anything bad in this that I'm missing?\n\nCan I safely blow dry on low without damaging? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "oz6i53",
    "title": "herbal essences mousse?",
    "url": "https://www.reddit.com/r/curlyhair/comments/oz6i53/herbal_essences_mousse/",
    "score": 3,
    "num_comments": 6,
    "created": "2021-08-06T13:20:50+00:00",
    "body": "hello babes! i am changing my products and switching to a new shampoo, conditioner, mousse etc. a lot of people recommended herbal essences’ mousse.\n\nmy last mousse was by gliss and it caused some hair loss, probably bc of the sodium chloride in it? (i will put the ingredients in the bottom)\n\ni have low porosity and fine wavy hair and a lot of people seem to love this mousse (Body Envy Mousse by Herbal Essences) but checking the ingredients I saw it had DMDM hydantoin? \nApparently tresemme was sued for the ingredient and some say it’s okay while others avoid it like the plague. Should I still use it? Is there anyone who uses it? I would love to hear your thoughts and experiences. Have a good day xx\n\nmy old mousse ingredients:\n\nAqua, propylene glycol, VP/VA copolymer, Glycerin, peg-8, Cocamidopropyl Betaine, Sodium Benzoate, PEG-40 Hydrogenated Castor Oil, Cetrimonium Chloride, PEG-32, Acrylamidopropyltrimonium, Chloride/Acrylamide Copolymer, Parfum, Lactic Acid, Sodium Chloride, Citric Acid, Phenoxyethanol, Sodium Metabisulfite, Benzyl Alcohol\n\nherbal essences body envy mousse ingredients\n\nWater/Eau, Isobutane, Polyquaternium-4, Propane, Fragrance/Parfum, Propylene Glycol, C9-11 Pareth-8, Dmdm Hydantoin, Disodium Edta, Citric Acid\n\n\ni would also like conditioner recommendations if you can xx",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Beep boop! It looks like you're asking about or discussing DMDM hydantoin. We have some information we want to share with you.\n\nDMDM hydantoin is a formaldehyde-releasing preservative that's in some hair and skin products. Most people don't have issues with this, but it is possible to be allergic to formaldehyde, which means you'll [likely](https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1600-0536.1988.tb02802.x) also react to DMDM hydantoin. Your doctor or an allergist would be able to confirm this. We obviously don't know if that's what's happening here, but hair loss is a known side effect of allergic reactions that cause contact dermatitis.\n\nFormaldehyde is a known carcinogen, but in tiny amounts in a rinse off product, it's not likely to have a health impact in the grand scheme of things unless you are allergic.\n\nUnlike the DevaCurl allegations, the DMDM hydantoin controversy (and any related lawsuits) is tied to this specific ingredient. If you do happen to have issues with hair loss and DMDM hydantoin, you should consider checking for a formaldehyde allergy just in case, as there are [several other ingredient](https://www.contactdermatitisinstitute.com/formaldehyde.php) you might be sensitive to as well.\n\nIf I'm wrong, I probably just picked up on a keyword in your title (Please ignore me!).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/curlyhair) if you have any questions or concerns.*",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "foldinthequeso",
        "body": "I can't speak to the ingredient in question, but I use this mousse occasionally, on days it's a little more humid where I live. I comb it into my hair with a wide toothed comb and either air-dry or diffuse and then SOTC. I love the results! Dry days I use Aussie Instant Freeze gel (no glycerine). \n\nHonestly, for conditioner I like the Aussie Moist. Admittedly, for the daily/heavy use stuff I like to use pretty cheap options. For leave ins and deep conditioners I shell out a little more. \n\nI have 2c/3a fine hair and live in a desert.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "354tnn",
    "title": "Tresemme Flawless Curls Mousse and l'Oreal Curling Spritz?",
    "url": "https://www.reddit.com/r/curlyhair/comments/354tnn/tresemme_flawless_curls_mousse_and_loreal_curling/",
    "score": 3,
    "num_comments": 2,
    "created": "2015-05-07T02:49:58+00:00",
    "body": "So I'm new and trying to find a good mousse and/or gel to use in my routine.  After looking around the house turns out I had bought some products a few years ago that I never tried.  They don't seem to have silicones but wondering if you guys have given them a try or if they are worth keeping around.  I've listed the products and ingredients below.\n\nTresemme Flawless Curls mousse:\nWater (Aqua, Eau), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polysorbate 20, Polyquaternium-4, Pvp, Ppg-12ppg-50 Lanolin, Olealkonium Chloride, Polyquaternium-7, Ppg-9 Diethlymonium Chloride, Sodium Benzoate, Cyclopentasiloxane, Propylene Glycol, Sorbitol, Glycerin, Cyclohexasiloxane, Cocamidopropyl Betaine, Gelatin/Keratin Amino Acids/Lysine Hydroxy- Propyltrimonium Chloride, Fragrance (Parfum), Hexyl Cinnamal, Benzyl Benzoate, Limonene, Butylphenyl Methylpropional, Linalool, Citronellol, Geraniol, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Alpha-Isomethyl Ionone. Water (Aqua), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polyquaternium-4, Pvp, Polyquaternium-7, Cyclopentasiloxane, Cyclohexasiloxane, Polysorbate 20, Olealkonium Chloride, Cocamidopropyl Betaine, Peg-12-Peg-50 Lanolin, Ppg-9 Diethylmonium Chloride, Glycerin, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Propylene Glycol, Sorbitol, Sodium Benzoate, Fragrance (Parfum).\n\nL'oreal Studio Silk & Gloss Curling Spritz: \naqua, glycerin, propylene glycol, sodium polystyrene sulfonate, PPG-5-ceteth-20, PPG-5-ceteth-10 phosphate, phenoxyethanol,caprylyl glycol, triethanolamine, hexyl cinnamal, linalool, limonene, butylphenyl, methylpropional, citronellol, amyl cinnamal, hydrolyzed silk, parfum",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ImaCheeseMonkey",
        "body": "Silicones in the mousse are: Cyclopentasiloxane, Cyclohexasiloxane, Cyclopentasiloxane, Cyclohexasiloxane \n\nin the Curling Spritz I don't see any 'cones,  but there is a lot of glycerin which could lead to frizz in humid areas.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MuddledMeggie",
        "body": "Tresemme Flawless Curls Mousse is the only thing I have ever found at the drug store that keeps my curls how I like them. It keeps them well controlled and minimizes frizz. It can leave the hair a bit crunchy depending on how much you use, but I would definitely recommend it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "1gwobmn",
    "title": "The shampoo im currently using",
    "url": "https://www.reddit.com/r/SebDerm/comments/1gwobmn/the_shampoo_im_currently_using/",
    "score": 2,
    "num_comments": 6,
    "created": "2024-11-21T19:44:14+00:00",
    "body": "so the ingredients are: Aqua-water, sodium coceth sulfate,disodium lauryl sulfosuccinate, cocamidopropyl betaine, sodium chloride, polyquaternium-4, polyquaternium-7, menthol, camphor, melaleuca alternifolia essential oil, pinus sylvestris essential oil, melaleuca viridiflora essential oil, mentha piperita essential oil, citric acid, benzyl alcohol, limonene.  \nI wanted to know whether it's the good shampoo for seborrheic dermatitis because i pasted them on [sezia.co](http://sezia.co) and it seems there are safe but im not sure. So if you know i will really appreciate.",
    "flair_text": "New or Need Help",
    "flair_template_id": "0bc3fbba-47be-11eb-a5b8-0e747f060801",
    "comments": [
      {
        "author": "CrissBliss",
        "body": "I think sezia might’ve been debunked recently, right?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MotherOfFelines8",
        "body": "Menthol , Camphor & other essential oils can be irritating (i know from experience) and not good for seb derm or folliculitis.\n\nPipette makes an unscented baby shampoo that i use. Honestly, pretty much every shampoo irritates me but this one does so significantly less than every other i have tried 🙏🏻",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bigpharmaistrash",
        "body": "Thats a lot of chemicals. Personally I would not use it. Have you tried removing wheat from your diet as it can reduce inflammation a lot?",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2d1kdc",
    "title": "Does anyone know of a cheaper alternative to Murad's AHA/BHA Exfoliating Cleanser?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2d1kdc/does_anyone_know_of_a_cheaper_alternative_to/",
    "score": 2,
    "num_comments": 6,
    "created": "2014-08-09T03:45:06+00:00",
    "body": "I received a free trial size bottle a few months ago and I've finally used it all up. It's such an amazing product, but kinda pricey at $36 a bottle. If there aren't any alternatives I'll buy the Murad one but I thought I'd check here and see if you guys knew of anything comparable :) Thanks!\n\nHere are the ingredients: Water (Aqua), Sodium Laureth Sulfate, Cocamidopropyl Betaine, Jojoba Esters, Acrylates Copolymer, Glycol Stearate, Butylene Glycol, Sodium PCA, Dipotassium Glycyrrhizate, Sodium Ascorbyl Phosphate, Glycolic Acid, Lactic Acid, Salicylic Acid, Polyquaternium-4, Sodium Hydroxide, Sodium Chloride, Citric Acid, Disodium EDTA, Phenoxyethanol, Methylparaben, Propylparaben",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "missblonde",
        "body": "The Neutrogena pore refining cleanser is almost identical but at a fraction of the cost.It's the same size of tube. I agree the price for Murad is ridiculous .As much as I loved it I won't buy it again. It's just not worth it. The pore refining does have fragrance but it's minimal. Strangely enough Paula rates the Neutrogena as a best product and the Murad as good. I would have said other way around.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "manateens",
        "body": "Aren't cleansers washed off too quickly to actually exfoliate?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1kan86i",
    "title": "Alternate to Carol's daughter coco creme gel?",
    "url": "https://www.reddit.com/r/curlyhair/comments/1kan86i/alternate_to_carols_daughter_coco_creme_gel/",
    "score": 2,
    "num_comments": 1,
    "created": "2025-04-29T12:54:45+00:00",
    "body": "I absolutely love this product. I've been following the modified curly method for 4 years now and I've never found a product that defined my curls this nicely with little effort. \n\nThe problem is that it has a lot of build up. Wayyy too much build up. Now I want to find an alternative but I don't know what's so special about this product. \n\nThese are the ingredients: \n\nAqua / Water, Butylene Glycol, Vp/Va Copolymer, Hydroxypropyl Guar, Phenoxyethanol, Polyquaternium-4, Citric Acid, Parfum / Fragrance, Peg-40 Hydrogenated Castor Oil, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Mangifera Indica Seed Butter / Mango Seed Butter, Cocos Nucifera Oil / Coconut Oil, Astrocaryum Murumuru Seed Butter, Ethylhexylglycerin, Glycerin, Linalool, Benzyl Alcohol, Cocos Nucifera Fruit Extract / Coconut Fruit Extract, Coumarin, Limonene, Citronellol, Tocopherol, Xanthan Gum, Potassium Sorbate\n\nFor context, I have wavy to curly hair (3aish) and I think it's medium to low porosity. (Takes a while to dry) \n\nThe styling products I've tried in my routine in the past: \n\n1. Aunt Jackie's curl la la custard and flaxseed gel (didn't do much)  \n\n2. NYM's curl talk gel and cream \n\n3. Wella hair gel (red) (too drying) \n\n4. Paul Mitchell the conditioner\n\n5. Shea moisture hibiscus smoothie \n\n6. Cantu curl activator (hated this) \n\nI use a diffuser to dry my hair but I don't think it does much except create frizz. ",
    "flair_text": "Help!",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi there! I'm a bot, and I've been summoned to help.\n\n**If you have not seen our [WIKI](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/) yet:** Please check it out! It's nearly 100 pages full of curated information to help answer all of your curl-related questions. You can use the included Table of Contents (page 2), the side bar, or CTRL-F to search for keywords and help navigate the document.\n\n**Reminder:** [Curl type](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit?tab=t.0#bookmark=kix.e9uk1qyai8oh) is NOT your hair type! Whether you are wavy, curly, or coily - you have texture and you belong here. More than that, your curl type doesn't dictate how you care for your hair. To help your curls thrive, we recommend instead using the wiki link above to learn about your porosity, texture, and density.\n\n**If this is a photo submission:** Please include your detailed routine for your post to remain active! This MUST include the *brands* of ALL products used, *order* of application and *technique* used to apply them, how you dried your hair, and anything else that you might find useful for people to know.\n\n**If you received this message in error:** Please disregard this comment! I probably just picked up on a keyword in your title.\n\nThank you. Wishing you many happy, wonderfully curly hair days!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/curlyhair) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Cosmetics",
    "post_id": "mre6zk",
    "title": "What ingredients are contributing to my dry scalp?",
    "url": "https://www.reddit.com/r/Cosmetics/comments/mre6zk/what_ingredients_are_contributing_to_my_dry_scalp/",
    "score": 2,
    "num_comments": 1,
    "created": "2021-04-15T13:02:36+00:00",
    "body": "I’ve been using a mousse that’s drying my hair. Not sure which ingredients are contributing to my dry scalp: here are the ingredients:\n\nWater, Alcohol Denat., Isobutane, Butane, Propane, Quaternium-87, Triacetin, Aminomethyl Propanol, Trideceth-12, Polyquaternium-4, Polysorbate 20, Limonene, Benzyl Salicylate, Amodimethicone, 2-Oleamido-1,3–Octadecanediol, Acrylates Copolymer, Butylphenyl Methylpropional, Cetrimonium Chloride, Citronellol, Hexyl Cinnamal, Fragrance, (F.I.L. C19928/3).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Jastook",
        "body": "Quick google search comes up with :    \n\n\nAlcohol Denat -\n\n* It can be very drying if it's in the first few ingredients on an ingredient list",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CosmeticChemistry",
    "post_id": "mre667",
    "title": "Can you please tell me which ingredients here are contributing to my dry scalp",
    "url": "https://www.reddit.com/r/CosmeticChemistry/comments/mre667/can_you_please_tell_me_which_ingredients_here_are/",
    "score": 2,
    "num_comments": 5,
    "created": "2021-04-15T13:01:17+00:00",
    "body": "I’ve been using a mousse that’s drying my hair. Not sure which ingredients are contributing to my dry scalp: here are the ingredients:\n\nWater, Alcohol Denat., Isobutane, Butane, Propane, Quaternium-87, Triacetin, Aminomethyl Propanol, Trideceth-12, Polyquaternium-4, Polysorbate 20, Limonene, Benzyl Salicylate, Amodimethicone, 2-Oleamido-1,3–Octadecanediol, Acrylates Copolymer, Butylphenyl Methylpropional, Cetrimonium Chloride, Citronellol, Hexyl Cinnamal, Fragrance, (F.I.L. C19928/3).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "colorsourcepar",
        "body": "Denatured alcohol is the most likely culprit. It’s a volatile solvent (also known as ethanol) and evaporates extremely quickly, often pulling water with it. Seeing it that high on the INCI means that there is a lot there. \n\nOther materials could cause dryness as well.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "chronicnope",
        "body": "While I agree that the denatured alcohol is highly drying, I'm dubious that your mousse is causing dry scalp unless you're applying it directly to the hair at the roots, and it's coming into physical contact with your scalp.  Why do you think that the mousse is the culprit?  Have you had any other changes recently to your routine?  Maybe you moved and you're living somewhere with harder or softer water than you were used to?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "CPhiltrus",
        "body": "How often do you shampoo or condition? A lot of dry scalps are caused by shampooing too much without conditioning, or in a what where the conditioner isn't hydrating enough to replace the necessary oils. \n\nTry shampooing once every 3-5 days and see if it improves.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "DekuChan95",
        "body": "I agree with the shampoo. You should shampoo less and use a hydrating conditioner. My scalp is very dry so I use a deep conditioner instead and a weekly hair mask.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FancyFollicles",
    "post_id": "1j656h",
    "title": "Are there silicones and sulfates in these products? (Pictures + read for more info)",
    "url": "https://www.reddit.com/r/FancyFollicles/comments/1j656h/are_there_silicones_and_sulfates_in_these/",
    "score": 2,
    "num_comments": 4,
    "created": "2013-07-27T17:59:37+00:00",
    "body": "Once I dye my hair an unnatural color again, I will go sulfate (and silicone) free. However I have a lot of hair products. I checked their ingredients and *many* of them contain silicones, so I will not be using them. However, I'm left with these three that I can't seem to figure out. **Do these have silicones in them?** I searched all I could but I couldn't find an answer. Thank you! \n\n1. [**Aussie Spray Gloss**](http://i.imgur.com/rHefJvT.jpg) *Ingredients:* Water/EAU, PEG-40 Hydrogenated Castor Oil, Dipropylene Glycol, Polyquaternium-16, Panthenol, Fragrance/Parfum, DMDM Hydantoin, Panthenyl Ethyl Ether, Ethylhexylglycerin, Phenoxyethanol.\n\n2. [**Aussie Miraculously Smooth Styling Mousse**](http://i.imgur.com/MSz0I30.jpg) *Ingredients:* Water, Isobutane, Propane, PVP, VP/VA Copolymer, Chitosan, Phenoxyethanol, Polyquaternium-16, Fragrance, Prunus Serotina (Wild Cherry) Bark Extract, Mangifera Indica (Mango) Fruit Extract, Disodium Edta, Polyquaternium-4, Laureth-4, Cetrimonium Chloride, Formic Acid, Methylparaben.\n\n3. [**Aussie Sydney Smooth 12 hr Anti-Humidity hair spray**](http://i.imgur.com/mFIaytv.jpg) *Ingredients:* Alcohol Denat., Water, Acrylates Copolymer, Aminomethyl Propanol, Fragrance, Triethyl Citrate, PEG 12 Dimethicone, Panthenol, Silk Extract.\n\nI am also using extra virgin coconut oil, but it would be nice to know if I can use this leftover product without worry or not too! Thank you so much. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "MicroPixel",
        "body": "The third one does have silicone (dimethicone, a water soluble silicone)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "nanjala",
        "body": "As far as I know, everything that ends in -cone (or maybe -one, I´m not sure) is some kind of silicone.\n\nJust for future questions :)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "cv8h2o",
    "title": "Is this TREsumme mousse CG approved?",
    "url": "https://www.reddit.com/r/curlyhair/comments/cv8h2o/is_this_tresumme_mousse_cg_approved/",
    "score": 2,
    "num_comments": 3,
    "created": "2019-08-25T13:26:46+00:00",
    "body": "Water (Aqua) Isobutane Hydrofluorocarbon 152A VP/VA Copolymer Hydrolyzed Elastin Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride Propane Polyquaternium-11 Polysorbate 20 PVP Polyquaternium-4 Fragrance (Parfum) PPG-12-PEG-50 Lanolin Olealkonium Chloride Polyquaternium-7 Sodium Benzoate Propylene Glycol Cyclopentasiloxane Glycerin Sorbitol Cocamidopropyl Betaine Cyclohexasiloxane\n\nThis is for TRESumme extra firm mousse which seems to really work for my hair (2a/2b) but cant help but notice all the buildup by the end of the day.\n\nAlso I'm curious how often do people no-poo or co-wash? My hair seems unfixable in the mornings",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ftr-mmrs",
        "body": "Seconding the isitcg tool.\n\nFor the first time ever I have second day hair, and I wasn't planning on it. I'm helping someone unpack from moving, so last night I took an evening shower from getting sweaty all day. I used cowashed, rinseout, leave-in as usual and airdried before going to bed. This morning I wokeup with hair pointing in different directions but didnt want to wash it again. So decided to put in a few drops of grapeseed oil to make it workable to tie up. Except it looks great now! Will be tying up anyway when we start working this morning, but I may have found my new refresh product.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "WeAreStarless",
        "body": "[curlsbot](https://www.curlsbot.com/) and [isitcg](http://www.isitcg.com/) won't be able to read those ingredient lists because the ingredients aren't separated by commas, but i can, and it's not approved! those two cyclo-something-siloxane ingredients towards the end are silicones",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "173rg2x",
    "title": "Question about curlsmith curl defining souffle",
    "url": "https://www.reddit.com/r/curlyhair/comments/173rg2x/question_about_curlsmith_curl_defining_souffle/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-10-09T13:11:14+00:00",
    "body": "Hi everyone!\nJust wanted to know a thing: I recently bought the curlsmith souffle, because I saw that a good number of people had good results with it.\nSo I was very excited and started trying it out, but... turns out my hair got a quite strongish, but FLEXIBLE (literally!) cast, that was so flexible that I couldn't scrunch it, so my hair looked so stringy and wet even though it wasn't!\nThe previous gel that I used is one that they sell only here in Italy, I think (it's the \"oh my curls! Styling cream\" from \"Capello point\". they call it styling cream but it's actually a gel, and its main ingredients are PvP/va and polyquaternium-4, no glycerin though), and I had way better results with it... major difference: the cast was much stronger, but it was scrunchable!\nNow before you think: \"why don't you use the previous one... like why are you even asking\" I have to tell you this. My parents HATE the smell of that gel (the one I used before curlsmith), and honestly, I kind of hate it too, so I'm looking for an alternative...\nSo am I doing something wrong? The method I use to apply the product is the same for both of the gels: after rinsing out conditioner, I grab a spoon of product, melt it in my hands, and lightly use the praying hands method, some scrunching in, and some finger coiling. Diffuse/air dry 50% and 50%. Then when completely dry scrunch the cast.\nOr is it that something in the gel is not working right for me?\nShould I try the in shower style fixer, maybe that will give me a cast that I'm able to scrunch?\nBtw, I have kind of a pixie cut.\nThank you all for your patience!",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "hch458",
        "body": "That happens to me sometimes (not that product in particular but) when I use too much product, so maybe try using less next time?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Perfumes",
    "post_id": "1g3zc9j",
    "title": "Perfume that smells like this TreSemme Mousse? ",
    "url": "https://www.reddit.com/r/Perfumes/comments/1g3zc9j/perfume_that_smells_like_this_tresemme_mousse/",
    "score": 1,
    "num_comments": 4,
    "created": "2024-10-15T04:09:59+00:00",
    "body": "It’s TRESemme’s “flawless curls moisturizing mousse” with coconut and avocado oil. I tried looking on that site linked in the rules but nothing came up with avocado and coconut. Anyway, I LOVE this scent so bad but I hate the feeling of mousse in my hair so I never get to smell it. Apologies if this post doesn’t fit the rules. Let me know if more information is needed. Thanks! \n\nNot sure if it helps, but the ingredients are: WATER (AQUA), ISOBUTANE, HYDROFLUOROCARBON 152A, VP/NA COPOLYMER, PROPANE, POLYOUATERNIUN-11, PERSEA GRATISSIMA (AVOCADO) OIL, COCOS NUCIFERA (COCONUT) OIL, POLYSORBATE 20, POLYQUATERNIUM-4, PVP, SODIUM BENZOATE, FRAGRANCE (PARFUM), PPG-12-PEG-50 LANOLIN, OLEALKONIUM CHLORIDE, POLYQUATERNIUM-7, DISODIUM EDTA, SORBITOL, GLYCERIN, PROPYLENE GLYCOL, COCAMIDOPROPYL BETAINE, SODIUM CHLORIDE, AMYL CINNAMAL, BENZYL ALCOHOL, BENZYL BENZOATE, CITRONELLOL, GERANIOL, HEXYL CINNAMAL, HYDROXYCITRONELLAL, LIMONENE, LINALOOL",
    "flair_text": "Recommendation Request :hamster:",
    "flair_template_id": "76396a96-c21e-11ea-b6d1-0ecfc40fba79",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Welcome to r/perfumes! We would like to remind everyone of our Rules, especially Rule 2: be appropriate, kind, and on topic. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Perfumes) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Glojoe13",
        "body": "I've also been trying to fund a spray or perfume with this scent.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ChemicalInsightReport",
    "post_id": "f6rlc7",
    "title": "Global Polyquaternium Market Growth, Analysis and Industry Forecast (2020-2025): Evonik, Solvay, AkzoNobel, etc.",
    "url": "https://www.reddit.com/r/ChemicalInsightReport/comments/f6rlc7/global_polyquaternium_market_growth_analysis_and/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-02-20T11:12:12+00:00",
    "body": " \n\n# Polyquaternium Market Report 2020\n\nAn in-depth market research study titled Global [**’Polyquaternium Market’**](https://www.empiricaldatainsights.com/industry-report/polyquaternium-market/2373/) highlights several significant facets related to the Polyquaternium market encompassing industry environment, segmentation analysis, and competitive landscape. The report details key statistics on the market position of the Polyquaternium manufacturers is a proven ***valuable trajectory of guidelines and direction*** for companies and individuals interested in consolidating their position in the market. Realistic concepts of the market are explained lucidly in this report.  \n\n\nThe segment also provides ***company profiles, capacity, product specifications, contact information, production value and market shares for the company.*** The report provides a basic overview of the Polyquaternium industry, including its definition, applications and manufacturing technology. The report documents all global key industry players, coupled with their company profiles, capacity, production value, product specifications and 2020-2025 market shares occupied by each company are mentioned. The total market is further segmented by country, by the company and by application/type for the competitive landscape analysis.   \n\n\n***Click Here To Access The Sample Report:*** [**https://www.empiricaldatainsights.com/sample-request/2373/**](https://www.empiricaldatainsights.com/sample-request/2373/)  \n\n\nMajor Market Players Covered In This Report:  ***Evonik, Solvay, AkzoNobel, Dow, Ashland, KCI, Clariant***  \n\n\n**The key product type of Polyquaternium market are:**  Polyquaternium-4, Polyquaternium-6, Polyquaternium-7, Polyquaternium-10, Others  \n\n\n**Polyquaternium Market Outlook by Applications:**  Hair Care, Facial Care, Skin Cleansing, Others  \n\n\n  \n***To Get This Report At Beneficial Rates:*** [**https://www.empiricaldatainsights.com/discount-request/2373/**](https://www.empiricaldatainsights.com/discount-request/2373/)   \n\n\nhttps://preview.redd.it/3trpeb9sa2i41.jpg?width=700&format=pjpg&auto=webp&s=e85d9f88f32fccb31fc24428ce91c022d02a8f2f\n\nThe study offers important statistics on the market status of producers and offers valuable advice and direction for businesses and individuals interested in consolidating their position in the industry. The report then estimates the 2020-2025 market development trends of the Polyquaternium industry. Analysis of upstream raw materials, downstream demand and current market dynamics is also included in the report. The research was conducted for documenting leading growth status, developments, segmentation, landscape analysis, product types, and applications.   \n\n\n**From the Polyquaternium market research reports, the following points are available with detailed study at every point:**   \n\n\n**Production Analysis –** Initiation of this Polyquaternium is analyzed based on top countries, types, and applications. Here, the report is expected to extensively focus on the price analysis of varied Polyquaternium market key players.   \n\n\n**Profit and Sales Evaluation —** Both earnings and sales are verified for various components of this international Polyquaternium market. The reports focus on the price that plays a vital role in sales development for several regions.   \n\n\n**Segments and Advantages —** In continuation of using earnings, this report studies the design and ingestion of its Polyquaternium market. This report also highlights the difference between usage and supply, export, and import data.   \n\n\n**Competition —** In this section, many global Polyquaternium industry-top players have been studied based on their company profile, product portfolio, ability, price, cost, and revenue.   \n\n\n**Other Analysis —** Besides the aforementioned information, demand, and supply scrutiny to the Polyquaternium economy, contact information from leading producers, suppliers, and major consumers, can also be procured from the report.   \n\n\n**Polyquaternium Market by Region Segmentation:**   \n**North America Country**  (United States, Canada)   \n**Asia Country**  (China, Japan, India, Korea)   \n**Europe Country**  (Germany, UK, France, Italy)   \n**Other Country** (Middle East, Africa, GCC)   \n\n\n**Global Polyquaternium Market Study Report 2020 also provides brief details As:**   \n**1\\]** Industry Overview  \n**2\\]**  Manufacturing Cost Structure Analysis  \n**3\\]**  Technical Data and Manufacturing Plants Analysis  \n**4\\]**  Global Market Overview  \n**5\\]**  Overall Regional Market Analysis  \n**6\\]**  Global Market Analysis by Type  \n**7\\]**  Global Market Analysis by Application  \n**8\\]**  Development Trend Analysis  \n\n\n***To Know More About The Assumptions in This Market Report:*** [**https://www.empiricaldatainsights.com/industry-report/polyquaternium-market/2373/**](https://www.empiricaldatainsights.com/industry-reports/polyquaternium-market/2373/)  \n\n\n**Why Buy This Report?**   \nThe research report provides a complete analysis of the global Polyquaternium market to help players create powerful growth strategies and achieve a strong position in the industry. The report presents a complete mapping of the market participants and the competitive landscape. Information on important sustainability strategies adopted by key companies along with their impact on market growth and competition has been provided in this report. All players can use the report to prepare themselves for facing impending market challenges and facing further competition in the global market.   \n\n\nThe overview of crucial Polyquaternium organizations concerning their assets, such as enhancements, cost, and client satisfaction discussed, is detailed in the analysis report.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "k10ngb",
    "title": "What does CASSIA ANGUSTIFOLIA lesf extract does in hair dye?",
    "url": "https://www.reddit.com/r/HairDye/comments/k10ngb/what_does_cassia_angustifolia_lesf_extract_does/",
    "score": 1,
    "num_comments": 4,
    "created": "2020-11-25T20:53:45+00:00",
    "body": "Hi, i want to dye my hair with Hairwonder[Hairwonder](https://www.amazon.com/Colour-Care-Espresso-3-50-Ounces/dp/B00UAO4SQI/ref=mp_s_a_1_9?c=ts&dchild=1&keywords=Hair+Coloring+Products&qid=1606337557&refinements=p_4%3AHair+Wonder+by+Nature&s=beauty&sr=1-9&ts_id=11057451), wiuldn’t it coat my hair like henna? Thanks\n\nINCI:\nColour& Care: Aqua, Cocamide Mea, Ceteareth-6, Ethanolamine, Polysorbate-80, Cetearyl Alcohol, Toluene-2,5-Diamine Sulfate, Parfum, Sodium Sulfite, Resorcinol, Glycerin, 2-Methylresorcinol, Ascorbic Acid, Trisodium HEDTA, Panthenol, Argania Spinosa Oil1, 5-Amino-6-Chloro-O-Cresol, M-Aminophenol, Hydrolyzed Corn Protein, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Aspalathus Linearis (Rooibos) Leaf Extract1, Camellia Sinensis Leaf Extract1, Cassia Angustifolia Leaf Extract1, Chamomilla Recutita Flower Extract1, Humulus Lupulus Flower Extract1, Melissa Officinalis Leaf Extract1, Panax Ginseng Root Extract1, Rosmarinus Officinalis Leaf Extract1 Colour& Care Activator: Aqua, Hydrogen Peroxide, Ceteth-2, Ceteareth-6, Steareth-20, Cetearyl Alcohol, Lauryl Pyrrolidone, Tetrasodium Etidronate, Salicylic Acid, EDTA, Phosphoric Acid Colour Fix Conditioner: Aqua, Paraffinum Liquidum, Cetyl Alcohol, Stearyl Alcohol, Cetrimonium Bromide, Glycerin, Sodium Benzoate, Lactic Acid, Parfum, Polyquaternium-4, Oleyl Erucate, Panthenol, Dimethylpabamidopropyl Laurdimonium Tosylate, Polysorbate-20, Linoleic Acid, Hydroxypropyltrimonium Corn/Wheat/Soy Amino Acids, Melissa Officinalis Extract1, Rosmarinus Officinalis Extract1, Panax Ginseng Root Extract1, Aspalathus Linearis (Rooibos) Leaf Extract1, Humulus Lupulus Flower Extract1, Camellia Sinensis Leaf Extract1, Cassia Angustifolia Leaf Extract1, Chamomilla Recutita Flower Extract1",
    "flair_text": ":txt: Answered",
    "flair_template_id": "62db0b06-6de8-11ea-9540-0e3141a1bd85",
    "comments": [
      {
        "author": "pHPlexAddict",
        "body": "I think you can safely say, these plant extracts do close to nothing in this formula.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "glaciergirly",
        "body": "Cassia can bring out golden tones",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "[Arctic Fox 10% Off](https://prz.io/Va88rqIV) coupon code, if you're considering buying from their website. Or even better, [50% Off Arctic Fox](https://www.reddit.com/user/TestPostPleaseIgnore/comments/jcw9eb/selling_30_usd_arctic_fox_hair_dye_gift_cards_for/) while supplies last!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HairDye) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "haircoloring",
    "post_id": "jnh0zo",
    "title": "Is Hairwonder color&care (dark brown) semi/demi permanent or permanent?",
    "url": "https://www.reddit.com/r/haircoloring/comments/jnh0zo/is_hairwonder_colorcare_dark_brown_semidemi/",
    "score": 1,
    "num_comments": 5,
    "created": "2020-11-03T19:30:38+00:00",
    "body": "Is Hairwonder[Hairwonder color&care](https://www.amazon.com/Colour-Care-Dark-Brown-Ounces/dp/B005ZR025G/ref=mp_s_a_1_1?dchild=1&keywords=hair+wonder+color+care+brown&qid=1604428080&sr=8-1) color&care (dark brown) semi/demi permanent or permanent? On the box says it’s permanent but lasts for 6-8weeks. I contact todays the manufacturer, not responded yet. Does anyone tried this color? I just want to darken my hair but don’t i want the color to completely wash off after a while. I wash my hair with Vichy/LRPosay, not using any color-treating stuff. Thanks\n\nHairwonder Colour & Care Dark brown 3\n\nColour& Care: Aqua, Cocamide Mea, Ceteareth-6, Ethanolamine, Polysorbate-80, Cetearyl Alcohol, Toluene-2,5-Diamine Sulfate, Parfum, Sodium Sulfite, Resorcinol, Glycerin, Ascorbic Acid, M-Aminophenol, Trisodium HEDTA, Panthenol, Argania Spinosa Oil1, 2,4-Diaminophenoxyethanol HCL, Hydrolyzed Soy Protein, Hydrolyzed Wheat Protein, Hydrolyzed Corn Protein, Cassia Angustifolia Leaf Extract1, Humulus Lupulus Flower Extract1, Chamomilla Recutita Flower Extract1, Melissa Officinalis Leaf Extract1, Rosmarinus Officinalis Leaf Extract1, Panax Ginseng Root Extract1, Aspalathus Linearis (Rooibos) Leaf Extract1, Camellia Sinensis Leaf Extract1 \n\nColour& Care Activator: Aqua, Hydrogen Peroxide, Ceteth-2, Ceteareth-6, Steareth-20, Cetearyl Alcohol, Lauryl Pyrrolidone, Tetrasodium Etidronate, Salicylic Acid, EDTA, Phosphoric Acid Colour Fix \n\nConditioner: Aqua, Paraffinum Liquidum, Cetyl Alcohol, Stearyl Alcohol, Cetrimonium Bromide, Glycerin, Sodium Benzoate, Lactic Acid, Parfum, Polyquaternium-4, Oleyl Erucate, Panthenol, Dimethylpabamidopropyl Laurdimonium Tosylate, Polysorbate-20, Linoleic Acid, Hydroxypropyltrimonium Corn/Wheat/Soy Amino Acids, Melissa Officinalis Extract1, Rosmarinus Officinalis Extract1, Panax Ginseng Root Extract1, Aspalathus Linearis (Rooibos) Leaf Extract1, Humulus Lupulus Flower Extract1, Camellia Sinensis Leaf Extract1, Cassia Angustifolia Leaf Extract1, Chamomilla Recutita Flower Extract1",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "lettucealone",
        "body": "It's henna. Henna is pretty much permanent and also really really hard to get off the hair later. Don't buy hair color of any brand off amazon.\n\n&#x200B;\n\nedit: \n\nalso, all hair color fades- permanent or not",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "[Arctic Fox 10% Off](https://prz.io/Va88rqIV) coupon code, if you're considering buying from their website.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/haircoloring) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "1g300kr",
    "title": "Normal hair dye after Henna?",
    "url": "https://www.reddit.com/r/HairDye/comments/1g300kr/normal_hair_dye_after_henna/",
    "score": 1,
    "num_comments": 8,
    "created": "2024-10-13T21:14:12+00:00",
    "body": "Hello guys! \n\nMy girlfriend is using henna right now and she wants to go to normal hair dye again.\n\nNow I've heard it's a bad idea to use normal hair dye if Henna contained metallic salts.\n\nCan anyone check the ingredients and give me any other advice is greatly appreciated.\n\nIngredients:\nLong Lasting Colour Black 1 Aqua (Water), Cocamide MEA, Ceteareth-6, Polysorbate 80, Toluene-2,5-Diamine Sulfate, Ammonium Hydroxide, Resorcinol, Cetearyl Alcohol, Parfum (Fragrance), Sodium Sulfite, 2-Amino-4-Hydroxyethylaminoanisole Sulfate, 2,4-Diaminophenoxyethanol HCL, Glycerin, Ascorbic Acid, m-Aminophenol, Propylene Glycol, Trisodium HEDTA, DimethylPABAmidopropyl Laurdimonium Tosylate, 4-Amino-2-Hydroxytoluene, Helianthus Annuus (Sunflower) Seed Extract*, Chamomilla Recutita (Matricaria Flower) Extract*, Camellia Sinensis (Leaf) Extract*, Melissa Officinalis (Leaf) Extract*, Humulus Lupulus (Hops Flower) Extract*, Aspalathus Linearis Leaf Extract*, Panax Ginseng (Root) Extract*, Cassia Angustifolia (Leaf) Extract*, Rosmarinus Officinalis (Rosemary Leaf) Extract*. Ingredients Long Lasting Colour Activator Aqua (Water), Hydrogen Peroxide, Ceteth-2, Steareth-20, Ceteareth-6, Cetearyl Alcohol, Lauryl Pyrrolidone, Tetrasodium Etidronate, Salicylic Acid, Phosphoric Acid, EDTA. Ingredients Colour Fix Conditioner Aqua (Water), Cetearyl Alcohol, Paraffinum Liquidum (Mineral Oil),Cetrimonium Chloride, Glycerin, Sodium Benzoate, Lactic Acid, Parfum (Fragrance), Polyquaternium-4, Oleyl Erucate, Panthenol, Polysorbate 20, Linoleic Acid, Hydroxypropyltrimonium Corn/Wheat/Soy Amino Acids, Melissa Officinalis (Leaf) Extract*, Rosmarinus Officinalis (Rosemary Leaf) Extract*, Panax Ginseng (Root) Extract*, Aspalathus Linearis Leaf Extract*, Humulus Lupulus (Hops Flower) Extract*, Camellia Sinensis (Leaf) Extract*, Cassia Angustifolia (Leaf) Extract*, Chamomilla Recutita (Matricaria Flower) Extract*, Phenoxyethanol. ",
    "flair_text": ":txt: Answered",
    "flair_template_id": "62db0b06-6de8-11ea-9540-0e3141a1bd85",
    "comments": [
      {
        "author": "missyxm",
        "body": "Are these ingredients for “henna” that has been used? What exact product this was?",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]