[
  {
    "subreddit": "antiMLM",
    "post_id": "7xnpdn",
    "title": "What's in Monat?",
    "url": "https://www.reddit.com/r/antiMLM/comments/7xnpdn/whats_in_monat/",
    "score": 61,
    "num_comments": 23,
    "created": "2018-02-15T03:23:23+00:00",
    "body": "All right I did it. So here's all the crap they're putting in their \"Revive\" shampoo. And I'm not one to be all \"Oooh! Spooky chems!\" but for a company that screams MODERN NATURE!!! and PURE INGREDIENTS!!! every other page on their website there sure is a lot of shit in their shampoo.\n\nJust so you know, you're buying shiney, smelly bubbles when you buy this shit... and it's costing you $35.00 fucking dollars. I could buy a year's worth of Suave for the same amount of money (by the way, Suave has an awesome ingredients page for each of their products.)\n\nAnyway, here's the breakdown of what's in this trite bullshit called Monat Revive Shampoo:\n\nWater, anti-static stuff, foaming agent, adhesive, foaming surfactant, cleanser, more anti-static stuff, even more anti-static stuff, cleanser again, EVEN MORE anti-static, pea extract, skin protectant, \n\n**(this is a stupid list of plants that were squeezed for oils)** clover extract, meadowfoam seed oil, mustard seed oil, camellia seed oil, tomato see oil, carrot seed oil, lemon peel oil, lime oil, bergamot fruit oil, Baobab seed oil, buriti fruit oil, coconut oil, gardenia extract, drumstick tree seed oil, pequi fruit oil, sunflower seed oil,\n\nsolvant/denaturant, synthetic Vitamin E, basically a blood thinner, acid... the kind used in chemical peels, thinner, pearlescent thickening agent/foamer, MOAR FOAM!, really long name for **EVEN MOOOAR FOAMMMM**, thickening-anti-static-FOAM-booster, sigh foam, thickener, silicone, emulsifying agent, preservative, pH adjuster, vague reference to fragrance, surfactant, fragrant preservative, anti-dandrufff smelly stuff, fragrance again.\n\n**EDIT:** Here's the original ingredients list directly from their website. Water (Aqua),Lauramidopropyl Betaine, Sodium C14-16 Olefin Sulfonate, Acrylates Copolymer, Sodium Methyl Cocoyl Taurate, Sodium Cocoamphoacetate, Guar Hydroxypropyltrimonium Chloride, Cinnamidopropyltrimonium Chloride, Stearyldimoniumhydroxypropyl Decylglucosides Chloride, Polyquaternium-11, Pisum Sativum (Pea) Extract, Acetyl Tetrapeptide-3, Trifolium Pratense (Clover) Flower Extract, Limnanthes Alba (Meadowfoam) Seed Oil, Crambe Abyssinica Seed Oil, Camellia Oleifera Seed Oil, Solanum Lycopersicum (Tomato) Seed Oil, Daucus Carota Sativa (Carrot) Seed Oil, Citrus Limon (Lemon) Peel Oil, Citrus Aurantifolia (Lime) Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Adansonia Digitata Oil, Mauritia Flexuosa Fruit Oil, Cocos Nucifera (Coconut) Oil, Gardenia Tahitensis Flower Extract, Moringa Oleifera Seed Oil, Caryocar Brasiliense Fruit Oil, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Tocopherol, Dextran, Citric Acid, Propanediol, Glycol Distearate, Cocamidopropyl Hydroxysultaine, Sodium Hydroxypropylphosphate Decylglucoside Crosspolymer, Lauramide MIPA,Sodium Hydroxypropylphosphate Laurylglucoside Crosspolymer, Cocamidopropyl Betaine, Butylene Glycol, Propoxytetramethyl Piperdinyl Dimethicone, Trideceth-6, Centrimonium Chloride, Aminomethyl Propanol, Fragrance (Parfum), C11-15 Pareth-7, Phenethyl Alcohol, Undecyl Alcohol, Benzyl Alcohol",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fishymcswims",
        "body": "Adhesive??  What’s the point of putting adhesive in your hair?  It could be in other shampoos...I don’t know, just never seen an ingredients list broken down like this to know what all the chemicals do (thank you for the breakdown, btw!).",
        "score": 29,
        "is_top_level": true
      },
      {
        "author": "girlslikesciencetoo",
        "body": "Doesn't this shampoo make people's hair fall out? And the ingredients aren't that much different than normal drugstore shampoo, so definitely not worth $40 a bottle.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "juel1979",
        "body": "Grateful to see sunflower oil in there. That’s my out if I ever get approached by these folks and want to try to not launch into “YOU ARE LITERALLY BALDING PEOPLE!” tirades.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "lavenderhoneysarah",
        "body": "That's a ton of chemicals. I have very sensitive skin and that would absolutely burn me. You can throw as many pretty sounding oils as you want in there Monat, it's not gonna cover up from the amount of nasty ass stuff on there too.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "whimsyNena",
        "body": "H2O gets em every time.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "advcthrwy",
        "body": "It seems incredibly ironic that they're marketing this as something \"cleaner and more natural\" than drugstore shampoo when it actually contains *MORE* ingredients (scary, hard-to-pronounce ones at that! 🙄) than any other shampoo I've seen.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9m7dk8",
    "title": "Would this conditioner work as a substitute for heat protectant spray?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9m7dk8/would_this_conditioner_work_as_a_substitute_for/",
    "score": 17,
    "num_comments": 7,
    "created": "2018-10-07T18:26:09+00:00",
    "body": "It's Garnier [Whole Blends Repairing Conditioner](https://www.garnierusa.com/about-our-brands/whole-blends/honey-treasures-repairing/repairing-conditioner-honey-treasures). The fourth ingredient is amodimethicone (following water, cetearyl alcohol, and behentrimonium chloride). I'd use it with a shampoo containing cocamidopropyl betaine. I saw a gentle shampoo from Cantu that looks like it could work really well, but for some reason the listed ingredients differ between websites. \n\nMy question is, would this conditioner work as a substitute for heat protectant spray? I flat iron on occasion. What if I were to use it as a leave-in? (This might be too heavy for my hair though). I'm not a huge fan of sprays because the spray usually gets on my face and can cause breakouts, and it's hard to get even coverage. \n\nEDIT: I also found this leave-in that supposedly only contains water-soluble silicones - [Bed Head Control Freak Serum](https://www.ulta.com/bed-head-control-freak-serum?productId=xlsImpprod4750119) - but it's a little pricey, and I also don't know if the water-soluble silicones are strong enough or high enough in the ingredient list to offer adequate heat protection. Ingredients: Aqua (Water/Eau), Polyacrylamidomethylpropane Sulfonic Acid, Polyquaternium-11, Glycerin, Propylene Glycol, Triethanolamine, Oleth-20, Dimethicone Copolyol, Dimethicone Copolyol Meadowfoamate, Hydroxyethylcellulose, DMDM Hydantoin, Parfum (Fragrance), Linalool, Hexyl Cinnamal, Limonene, Carbomer, Methylparaben, Disodium EDTA, Benzophenone-4, Actinidia Chinensis (Kiwi) Fruit Extract, Jasminum Officinale (Jasmine) Extract, CI 77019 (Mica), CI 77891 (Titanium Dioxide), CI 19140 (Yellow 5), CI 42090 (Blue 1), CI 17200 (Red 33).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Laurentoya",
        "body": "No, conditioner is designed to close the cuticle of the hair and restore ph levels that are changed from shampoo.  Heat protection sprays are designed to protect from heat settings that get up to 450 degrees (depending on the product).\n You can test heat protection sprays and how well they buffer the heat.  1. Simply spray the product on one hand and leave the other hand free from product. I like a liquid spray. 2. Take a blow dryer and apply heat to the hand that has the spray. Count how many seconds you can withstand the heat from the dryer. 3. Next apply heat to the hand that doesn’t have product and count how long you can stand the heat.\n There should be a noticeable difference between the  heat. This will give you an idea of how effective your product is working. \n Also with liquid sprays you can spray the product your hand and apply to avoid contact with your face. Hope this helps.",
        "score": 36,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9846un",
    "title": "Having doubts about DevaCurl Buildup Buster after reading the INCI",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9846un/having_doubts_about_devacurl_buildup_buster_after/",
    "score": 12,
    "num_comments": 1,
    "created": "2018-08-17T17:24:38+00:00",
    "body": "So, I bought the [DevaCurl Buildup Buster](https://www.devacurl.com/buildup-buster.html\n) and used it, but it didn't leave my scalp or hair feeling particularly clean or refreshed. After reading the ingredients, I cannot find anything that clears buildup (for me this would mean buildup caused by polyquats and guar) except maybe the mIcELLaR wAtEr which I doubt works the same way on hair as it does on skin. What's more, it has two ingredients, albeit low on the INCI, that can cause buildup: guar and polyquaternium-11. At most, it has surfactants that DevaCurl's cleansers also have.\n\nHere is the INCI:\n\nWater (Aqua, Eau), Lactamide MEA, Glycerin, Crambe Abyssinica Seed Oil, Limonium Gerberi Extract, Cynara Scolymus (Artichoke) Leaf Extract, Hydrolyzed Jojoba Esters, Hydrolyzed Pea Protein, Panthenol, Melissa Officinalis Extract, Humulus Lupulus (Hops) Extract, Cymbopogon Schoenanthus Extract, Chamomilla Recutita (Matricaria) Extract, Rosmarinus Officinalis (Rosemary) Extract, Achillea Millefolium Extract, Caprylic/Capric Triglyceride, Hydroxypropyl Guar Hydroxyproplytrimonium Chloride, Hydroxyethylcellulose, Cocamidopropyl PG-Dimonium Chloride Phosphate, Cetrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Polyacrylate-1 Crosspolymer, Polyquaternium-10, Polyquaternium-11, PPG-26-Buteth-26, Propanediol, Disodium EDTA, Citric Acid, Phenoxyethanol, Fragrance (Parfum).\n\nCan someone who is better versed in chemistry than me assuage or confirm my doubts?",
    "flair_text": "Truth Check",
    "flair_template_id": "097fa660-58be-11e4-810c-12313b0d5c3d",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "malehairadvice",
    "post_id": "bn1icb",
    "title": "Does Toni & Guy's sea salt spray have harmful ingredients?",
    "url": "https://www.reddit.com/r/malehairadvice/comments/bn1icb/does_toni_guys_sea_salt_spray_have_harmful/",
    "score": 8,
    "num_comments": 7,
    "created": "2019-05-10T17:59:18+00:00",
    "body": "I plan on using it and I was wondering if anyone mention if there are harmful ingredients/chemicals I should be cautious with. Huge thanks ahead!\n\n&nbsp;\n\nWater, sodium chloride, glycerin, peg-40 hydrogenated castor oil, polyquaternium-11, parfum, dmdm hydantoin, disodium edta, phenoxyethanol, methylparaben, ethylparaben, butylparaben, propylparaben, isobutylparaben, alpha-isomethyl ionone, benzyl alcohol, bezyl salicylate, butylphenyl methylpropional, citral, citronellol, coumarin, geranoil, hexyl cinnamal, hydroxycitronellal, limonene, linalool.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "average_chungus",
        "body": "I use it, but damn I've never thought about it🤔. I find that my hair gets really dry after using it for many weeks though, so I suggest that you take breaks from it, from time-to-time, if that helps?",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7bldnx",
    "title": "[Product Question] Different versions of La Roche Posay Lipikar Syndet?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7bldnx/product_question_different_versions_of_la_roche/",
    "score": 6,
    "num_comments": 12,
    "created": "2017-11-08T13:44:17+00:00",
    "body": "After hearing wonders about using Syndet as a face cleanser I set out to purchase it, however here in Europe I only find the [AP+ version](http://www.laroche-posay.com/products-treatments/Lipikar/Lipikar-Syndet-AP-p21564.aspx) which has the following ingredient list:  \n\n>AQUA / WATER, GLYCERIN, SODIUM LAURETH SULFATE, PEG-200 HYDROGENATED GLYCERYL PALMATE, COCO-BETAINE, POLYSORBATE 20, PEG-7 GLYCERYL COCOATE, NIACINAMIDE, ACRYLATES COPOLYMER, BUTYROSPERMUM PARKII BUTTER / SHEA BUTTER, CITRIC ACID, COCAMIDE MEA, DISODIUM EDTA\nMANNOSE, POLYQUATERNIUM-11, SODIUM BENZOATE, SODIUM CHLORIDE, SODIUM HYDROXIDE, STYRENE/ACRYLATES, COPOLYMER, VITREOSCILLA FERMENT  \n\nHowever the ['regular' version](http://www.laroche-posay.com.au/products-treatments/Lipikar/Lipikar-Syndet-p6931.aspx) I see everyone use has slightly different ingredients:  \n\n>AQUA / WATER, GLYCERIN, DISODIUM COCOAMPHODIACETATE, \n COCO-BETAINE, PEG-7 GLYCERYL COCOATE, SODIUM CHLORIDE, SODIUM LAURETH SULFATE, GLYCOL DISTEARATE, SODIUM GLYCOLATE, ACRYLATES COPOLYMER, CITRIC ACID, NIACINAMIDE, PEG-55 PROPYLENE GLYCOL OLEATE, PEG-75 SHEA BUTTER GLYCERIDES, POLYQUATERNIUM-7, PPG-5-CETETH-20, PROPYLENE GLYCOL, SODIUM BENZOATE, SODIUM HYDROXIDE  \n\nHas anyone tried both (if it's a case of reformulation) or is it just a different version because of FDA or something?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "cultrevolt",
        "body": "Why not just use one of their facial cleansers? The AP line is formulated for eczema. Their hydrating cleanser is a skincare staple for me; gentle, non-stripping, imparts nice looking skin.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Penguins_Polar_Bears",
        "body": "Just to add, I'm currently using the Lipikar Baum which is AMAZING (20% Shea Butter, 4% niacinamide and other goodies).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "pethatcat",
        "body": "Oh, you solved the mystery for me! I was thinking to buy LRP cleanser, but it seemed to contain SLS as main ingridient, so I thought it would be too harsh for me. I seriously was wondering what was everyone was raving about, so you solved a mystery for me!\n\nThe second one is based on coconut oil-derived mild surfactant with some SLS, while the first one is SLS-based. So the first version should be much more harsh on the skin.\n\n\nYou know what the second ingridient list reminds me of? Do not judge, please. Bioderma Atoderm shower oil, which I currently use for my face :) it is quite gentle, while taking off any make up( Estee Lauder Doublewear foundation included). I do not use it on my eyes though:\n\nAqua (Water), Glycerin, Peg-7 Glyceryl Cocoate, Sodium Cocamphoacetate, Lauryl Glucoside, Coco-Glucoside, Glyceryl Oleate, Citric Acid, Peg-90 Glyceryl Isostearate, Fragrance (Parfum), Mannitol, Polysorbate 20, Xylitol, Laureth-2, Rhamnose, Niacinamide, Fructooligosaccharides, Tocopherol, Hydrogenated Palm Glycerides Citrate, Lectihin, Ascorbyl Palmitate.\n\n\nGiven my face is very sensitive, prone to drying out and breakouts, I was able to use up a 200 ml bottle of it with no adverse effects. But it does leave your face squeaky clean, so I'm waiting for Hada Labo order to reach me and see of that works even better.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CurlyHairUK",
    "post_id": "tjeaio",
    "title": "Anyone tried the Umberto Giannini Curl Jelly Care Conditioner? 😯",
    "url": "https://www.reddit.com/r/CurlyHairUK/comments/tjeaio/anyone_tried_the_umberto_giannini_curl_jelly_care/",
    "score": 7,
    "num_comments": 5,
    "created": "2022-03-21T15:23:32+00:00",
    "body": "Hi, \n\nI wanted to try this conditioner but noticed that it has isopropyl alcohol in it (although its lower down the ingredients list). \nHas anyone found the conditioner drying at all? Or had any other effects of use overtime? \n\n\nIngredients list on UG Website:\n\nAqua, Cetearyl alcohol, Propylene glycol, Glycerin, Behentrimonium chloride, Hydroxyethylcellulose, Cetrimonium chloride, Phenoxyethanol, Polyquaternium-37, Quaternium-80, Polyquaternium-11, Sodium benzoate, Dipropylene glycol, Citric acid, Isopropyl alcohol, Parfum, Tetrasodium EDTA, Coumarin, Alpha-isomethyl ionone, Linalool, Limonene, Geraniol, 4-tert-butyldihydrocinnamaldehyde, Cinnamal, Eugenol, Citral, Citronellol, Benzyl benzoate, Trans-2-hexenal, Farnesol, Estragole, CI17200, CI 19140.\n\nOther version example on Waitrose website:\n\nAqua (Water), Cetearyl Alcohol, Propylene Glycol, Behentrimonium Chloride, Hydroxyethylcellulose, Cetrimonium Chloride, Phenoxyethanol, Quaternium-80, Polyquaternium-37, Polyquaternium-11, Sodium Benzoate, Dipropylene Glycol, Citric Acid, Isopropyl Alcohol, Parfum (Fragrance), Tetrasodium EDTA, CI 17200 (Red 33), CI 19140 (Yellow 5)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ausernamebyany_other",
        "body": "I use this conditioner fairly regularly and like it. It's maybe a little drying over time, but a regular deep condition helps a lot. It's by no means the perfect answer for me - I still haven't found my perfect products - but I'd definitely recommend trying it. Especially if you're going to use the whole set - shampoo, conditioner and gel - together as I found other conditioners didn't mix well with their gel.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kbrdthenerd",
        "body": "I just started using it a couple of weeks ago and am liking it so far! I generally struggle with 2nd day curls and have actually had better luck with them since I’ve started using it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "PurpleBlueberryMochi",
        "body": "I used the conditioner and really didn't like it, I found it very drying. Different strokes / different folks",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "t33ybn",
    "title": "Protecting Your Hair from Heat Damage",
    "url": "https://www.reddit.com/r/Haircare/comments/t33ybn/protecting_your_hair_from_heat_damage/",
    "score": 5,
    "num_comments": 3,
    "created": "2022-02-28T02:00:32+00:00",
    "body": "# Protecting Your Hair from Heat Damage\n\nProducts that claim to reduce damage to your hair when used during styling with heat tools like blow dryers, curling irons and flat irons are considered heat protection. They can come in the form of sprays, creams, lotions and/or serums. In this post, I break down how to think about the temperature of your heat styling tools and the product ingredients that are best for heat protection.​ (This is the full blog beside a diagram of all the heats listed below, the post is a bit better organized on my [original blog](https://www.thehairlooks.com/blog-protecting-your-hair-from-heat-damage.html))\n\n&#x200B;\n\n**The Effects of Heat Damage**The diagram below shows how hair reacts to different blowdryer temperatures. A good blowdryer can be judged by (1) how strong the air flow, or blow force, is from the device and (2) how hot that air can get. The cost of a blowdryer can range anywhere from $20 to $250+, with the more expensive brands often offering better quality tooling that produces those effects to a greater degree. Those factors matter because they can contribute to cutting your blowdry time in half, which is a life saver when you have an 8am meeting to get to. However, more powerful tools are only useful if you know how to use them. Often people mistakenly abuse a higher quality blowdryer by overheating areas of their hair, or by not concentrating on certain spots for long enough.  \n\n\nAt work and at home, I use a [Dyson Supersonic](https://www.dyson.com/hair-care/hair-dryers/supersonic) blowdryer. I frequently use the \"fast drying and styling\" temperature (shown on the diagram below) on my own hair and with clients.  The \"cooler drying and diffusing\" setting is more commonly used on curly hair, while \"constant cold\" is for smoothing your blowdry with a blast of cool air right after it's done.  \n\n\nWhen considering the diagram below, imagine what a strand of hair looks like under a microscope (visual [here](https://www.google.com/search?q=hair+under+microscope&oq=hair+under+microscope&aqs=chrome.0.0i433i512j0i512l5j0i22i30l4.2387j0j7&sourceid=chrome&ie=UTF-8)). A healthy strand will appear smooth, while a damaged strand will appear rough and as though jagged shingles are coating the outside. Those jagged shingles are cracks in the hair's cuticle that are caused by overuse of heat and chemicals. I give an overview of the risks of different types of hair damage in my post [Hair Challenges: Part I](https://www.thehairlooks.com/blog-hair-challenges-part-i---dry-hair.html) and [Part II](https://www.thehairlooks.com/blog-hair-challenges-part-ii---build-up.html). In general, with heat damage your hair is more likely to break, tangle, have unexpected reactions to color, and adopt casts of green or orange by soaking up minerals from your tap water. These conditions make it harder to grow and maintain your hair over time. \n\n**​Heat Protection Ingredients**Now that we have a little insight on how heat affects hair, let's look at some ingredients that can help create a barrier from that heat. According to [L'Oréal](https://www.lorealparisusa.com/beauty-magazine/hair-care/damaged-hair/heat-protectant-for-hair.aspx), their products are \"often formulated to protect hair from temperatures as high as 450 degrees\", which means some products are designed to protect from heat all the way up to the \"danger zone\". There is more to maintaining healthy hair than heat protection alone, but when that is top of mind for you below is a list of ingredients that will help, plus a few to avoid.\n\n**Protein:** found to prevent cuticle cracking \n\n* P/DMAPA Acrylates Copolymer \n* Protein polysiloxane copolymer\n* 2% glycerin (that is a lot for any formulation) \n* Polyquaternium-55 \n* Hydrolyzed wheat protein \n* Hydrolyzed vegetable protein PG-propyl silanetriol \n* Hydrolyzed wheat protein PG-propyl silanetriol\n\n​  \n**Oils and Silicones:** products that disperse heat, found to prevent cuticle cracking \n\n* Sodium polystyrene sulfonate ([stable up to 576°F](https://salonkhouri.com/blog/2018/04/10/whats-inside-killer-curls/))\n* Sodium laureth-40 maleate/styrene sulfonate copolymer \n* Dimethicone\n* Amodimethicone\n\n**Conditioning Agents:** not found to prevent cuticle cracking \n\n* Polyquaternium-11\n* Cetrimonium chloride\n* Stearalkonium chloride\n* Quaternium 70 (Stearamidopropyl Dimethyl Ammonium Chloride)\n* Stearamidopropyl Dimethylamine\n* Triglycerides, silicones, mineral oils and petrolatum\n\n*Sources:* [*How Hot is Too Hot for Healthy Hair?* ](https://science-yhairblog.blogspot.com/2012/02/how-hot-is-too-hot-for-healthy-hair.html)*by the Science-y Hair Blog*  \n[*The Cracking of Human Hair Cuticles by Cyclical Thermal Stresses*](https://www.researchgate.net/publication/286849276_The_cracking_of_human_hair_cuticles_by_cyclical_thermal_stresses)*, Manuel Gamez-Garcia*",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "dumplingkisses",
        "body": "Do you have products you recommend?\nAlso can you use heat protectant on dry hair when you’re using a straightener or curler? They all say damp hair…",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "helgathehorr",
        "body": "Thank you for that. I read it all even if I didn’t understand it all. My hair is so dry and broken. I do use a high heat hair dryer and high heat flat iron. I didn’t see the effects of color treatment on hair though(?) I do get my roots done every 4 weeks.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1cunkaa",
    "title": "About to Lose My Favorite Mousse...Please Help",
    "url": "https://www.reddit.com/r/curlyhair/comments/1cunkaa/about_to_lose_my_favorite_mousseplease_help/",
    "score": 4,
    "num_comments": 1,
    "created": "2024-05-18T03:00:39+00:00",
    "body": "Hi there! So I have been a long time user of the [original Tresemmé Flawless Curls Mousse](https://m.media-amazon.com/images/I/518ty7PJlEL.jpg). A couple of years ago they changed the formula and I've been buying boxes of old cans ever since. However, it looks like I'm about to run out forever. I cannot switch to their new formula because it has coconut oil and avocado oil. I'm a oily hair gal, so both a no go for me. Does anyone know of any alternatives that are close or have worked for them personally? Would appreciate any help here! \n\nAlso sharing the list of ingredients here in case it may be helpful: water (aqua), isobutane, hydrofluorocarbon 152a, vp/va copolymer, propane, polyquaternium-11, polysorbate 20, polyquaternium-4, pvp, fragrance (parfum), ppg-12-peg-50, lanolin, olealkonium chloride, polyquaternium-7, sodium benzoate, propylene glycol, cyclopentasiloxane, sorbitol, glycerin, cocamidopropyl betaine, cyclohexasiloxane",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Purple_Penguin73",
        "body": "Same! I’m allergic to coconut so I had to switch too. I’ve been using their extra hold volumizing mousse instead. I just looked at my can and the ingredients look similar to the ones you listed. I started off with a travel size just in case which I can regularly find at Walmart and Target in the travel section if you’re in the US and want to give it a chance.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "6nfcis",
    "title": "Using shea butter as styling cream.",
    "url": "https://www.reddit.com/r/curlyhair/comments/6nfcis/using_shea_butter_as_styling_cream/",
    "score": 4,
    "num_comments": 5,
    "created": "2017-07-15T10:55:35+00:00",
    "body": "Hey guys, so currently I am using this Every Strand styling cream I found at the grocery store lol but I am really not convinced about the ingredients, these are them:\n\n\nWater (Aqua), Polyquaternium-72, Polyquaternium-37, Propylene Glycol Dicaprylate/Dicaprylate, PPG-1 Trideceth-6, Propylene Glycol, Diazolidinyl Urea, Methylparaben, Propylparaben, Fragrance (Parfum), Amodimethicone, Trideceth-12, Cetrimonium Chloride, Tetrasodium EDTA, Polyquaternium-11, Cocos Nucifera (Coconut) Oil, Butyrospermum Parkii (Shea) Butter, Aminopropyl Phenyl Trimethicone.\n\n\n\nSo anyways, I have 2 blocks of shea butter in the fridge and I was thinking maybe I should just use that but I don't know if using straight up shea butter might be too heavy and hold my hair down so I was wondering if anyone knew of any good recipes for like homemade hair products using shea butter. Or should I not use the butter? I just figured since so many products have it it might be good. \nI also have coconut oil, avocado oil, almond oil, castor oil, olive oil, aloe vera gel, vitamin E, etc. I was thinking of just mixing everything together and seeing what happens lol",
    "flair_text": "help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "the_bird_or_the_cage",
        "body": "I thought this video might help! She makes two types of cream using Shea butter so you can use whichever you want! Also it seems like you have all of the ingredients so it's worth to give it a try :) \nhttps://youtu.be/X3Ok14CgADM",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ahnahnah",
        "body": "I definitely wouldn't mix everything together because if it winds up not working now you gotta go back and figure what individual ingredient may have been the problem. Some oils are too heavy, some hair really doesn't like aloe.. it sucks and it takes forever but I try to isolate ingredients as much as I can so I know almost exactly what my hair is reacting to.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "minniesnowtah",
        "body": "I think people mostly use raw shea butter as a deep moisturizer rather than a styling product, but that doesn't mean it wouldn't work as one. Also check out online DIY shea butter hair product recipes like [this hair cream](http://beautymunsta.com/homemade-shea-butter-hair-cream/) or [this shea+aloe+glycerin gel/cream](http://www.humblebeeandme.com/homemade-shealoe-butter-cream/)!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1zbjlk",
    "title": "Is this protein free? (ingredients-list of KMS Tame Frizz creme)",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1zbjlk/is_this_protein_free_ingredientslist_of_kms_tame/",
    "score": 4,
    "num_comments": 1,
    "created": "2014-03-02T03:57:02+00:00",
    "body": "Hey!\nSo, I've got some leave in creme stored that I bought in june 2013. Back then I didn't think it helped much with my hair, but I was also using some shampoos and conditioner with protein (and cones)\n\nAs of now I'm using Aubreys Honeysuckle rose conditioner or something, the protein free one. It's not super, but it's alright. I'm willing to use the whole bottle and maybe buy again.\n\nI am also currently using Kinky Curly Knot today, but to be honest it does little to nothing for my hair. If I use just a bit too much, my hair looks really weird and dirty, and it doesn't give any bounce to my hair.\n\nI've been using Head and shoulders the past three weeks as I think I might have Seborrheic dermatitis. The shampoo is drying my hair, but my scalp seems pretty satisfied (less sebum build up, no irritation, and my scalp is pretty sensitive to even good brands). I will not continue to use H&S, but maybe periodically if there seems to be a sebum issue again.\n\nIdeally I would not be using much shampoo. Maybe just ACV and baking soda rinse now and then.\n\nI'm waiting for a Giovanni shampoo bought on Iherb to bring out the colour of my blonde hair, which I will be using only now and then. (It's got cones, the one called amodimethicone (supposedly a \"good\" quality cone?)\n\nI'd prefer my hair would be cone free, and I will try to keep it fairly cone light atleast. I don't mind cones much, I just hate the build up on blonde hair and feeling like I rely on cones, haha. But mainly I want to stear clear from protein.\n\n\nMy hair is btw 2a/2b, mousey blonde during winters, thick and extremely coarse, and also very frizzy.\n\nThese are the ingredients in the KMS Tame Frizz creme. Can anyone tell me if there are any sort of proteins in it? I will try to only use a small amount of this just to see how my hair will respond now that I don't use the same shampoo/conditioner as I did last summer.\n\nWater / Aqua / Eau, Cetearyl Alcohol, Isopropyl Palmitate, Myristyl Alcohol, Cetyl Acetate, VP/VA Copolymer, Isopropyl Myristate, Sorbitan Oleate, Lanolin Alcohol, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Behentrimonium Chloride, Butyl Stearate, Lanolin Oil, Chitosan, Glycerin, Tocopheryl Acetate, Panthenol, Caryocar Brasiliense Fruit Oil, Acacia Seyal Gum Extract, Silicone Quaternium-22, Oleyl Acetate, Acetylated Lanolin Alcohol, Glycyl Glycine, Lactic Acid, Citric Acid, Acetamide MEA, Stearyl Acetate, Propylene Glycol, Stearamidopropyl Dimethylamine, Dipropylene Glycol, Polyquaternium-11, Ethylhexyl Methoxycinnamate, Ethylhexylglycerin, Tetrasodium EDTA, PPG-3 Myristyl Ether, BHT, Phenoxyethanol, Fragrance / Parfum.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "sesamesoda",
        "body": "nope. glycine is an amino acid. also the gum extract contains a small amount of protein - acacia seyal gum is another name for gum arabic which contains 2g of protein per 100g. the dimethylamine may or may not be a protein, that is what i am currently researching.\n\nedit: [dimethylamine is not a protein!](https://www.reddit.com/r/NoStupidQuestions/comments/f1fcr6/id_dimethylamine_an_amino_acid/)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Pomade",
    "post_id": "l22908",
    "title": "Ingredient Feedback - Gatsby",
    "url": "https://www.reddit.com/r/Pomade/comments/l22908/ingredient_feedback_gatsby/",
    "score": 4,
    "num_comments": 4,
    "created": "2021-01-21T16:49:18+00:00",
    "body": "Hi guys, I'm a big fan of Gatsby hair wax, but for some reason, the ingredients (below) make me feel gross, can anyone help me figure out what makes it so hard to wash off my hands and which ingredients are really bad for my hair ? Is it the candelilla wax? \n\n&#x200B;\n\nINGREDIENTS: WATER, EUPHORBIA CERIFERA (CANDELILLA) WAX, ETHYLHEXYL PALMITATE, PARAFFIN, CYCLOPENTASILOXNE, SORBITAN, STEARATE , MICROCRYSTALLINE WAX, MINERAL OIL, CETETH-20, PPG-10 SORBITOL, STEARIC ACID, STEARYL ALCOHOL, CAPRYLYL GLYCOL, TRIETHANOLAMINE, DIMETHICONE, CARBOMER, FRAGRANCE, PANTHENOL, POLYQUATERNIUM-11, RED 33(CI 17200), BLUE 1(CI 42090)\n\n&#x200B;\n\n&#x200B;\n\nThanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "an_PR",
        "body": "Paraffin, microcrystalline wax, mineral Oil are petroleum derivative and hard to wash off. These are the culprits.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "m18b4w",
    "title": "Pantene Pro-V Air-Light & Non-Sticky Soufflé For Curls - very cheap creamier foam formula",
    "url": "https://www.reddit.com/r/curlyhair/comments/m18b4w/pantene_prov_airlight_nonsticky_soufflé_for_curls/",
    "score": 6,
    "num_comments": 2,
    "created": "2021-03-09T15:07:17+00:00",
    "body": "I wanted to share this product up here with you guys, because I was so lost in our drugstores (Central Europe / Teta drugstore)  and finally found something cheap and what's working nicely! \n\nIngredients: silicone free, not paraben free \n\nAqua, Propane, Butane, Polyquaternium-11, Isobutane, Phenoxyethanol, Panthenol, Parfum, Laureth-4, Disodium EDTA, Methylparaben, Cetrimonium Chloride, Caprylyl Glycol, Benzyl Benzoate, Benzyl Alcohol, Linalool, Citric Acid, Hydroxycitronellal, Citronellol\n\nThis line also offers this foam in formula for wavies as well! (so if you are on the wavy side that one is for you)\n\nThoughts:\n\n I used it so far only for refresh but it worked amazingly. My hair is very very soft after one pump, it dries to more of a stiff consistence but if you break down the cast a bit. The hair felt afterwards extremely soft and moistured. I just got it so I need to experiment with it on wash day.\n\nBut for those people who have hard times landing their hands on well-known curly hair products and need to stay on budget, this product is really nice option.\n\nI apologize if this product was here already before mentioned but I haven't seen it around yet.\n\nhttps://preview.redd.it/epqctv1no0m61.png?width=540&format=png&auto=webp&s=aa057b01a9858d8e37c55bb66d228f258d951a07",
    "flair_text": "product review",
    "flair_template_id": "8421d7be-21dd-11e6-9582-0e44af8cb2cb",
    "comments": [
      {
        "author": "WW76kh",
        "body": "Be really careful with Pantene products. They'll work great the first few times and then they just don't. Most of my worst hair days are times when I had to use Pantene products.\n\nGranted I'm in the US, so maybe it's only the US brand that just sucks so much.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "7ftvst",
    "title": "Are any of these ingredients red flags?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/7ftvst/are_any_of_these_ingredients_red_flags/",
    "score": 4,
    "num_comments": 5,
    "created": "2017-11-27T08:58:38+00:00",
    "body": "I want to try some pink Gatsby hair wax, and I've made sure it's sulfate-free since I've heard sulfates can harm the hair in the long term. Can you guys please look through these ingredients and tell me if anything else can contribute to balding or other poor hair outcomes? This is from the first Amazon link on Google when searching pink Gatsby.\n\nWater, Euphorbia Cerifera (Candelilla) Wax, Ethylhexyl Palmitate, Paraffin, Cyclopentasiloxne, Ceteth-20, Mineral Oil, Microcrystalline Wax, Sorbitan Stearate, Butylene Glycol, Alcohol, Stearic Acid, Stearyl Alcohol, Ppg-10 Sorbitol, Triethanolamine, Caprylyl Glycol, Dimethicone, Carbomer, Fragrance, Peg-90m, Panthenol, Polyquaternium-11, Red 33(Ci 17200).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "thebunbunspeaks",
        "body": "Mineral oil coats your hair and can be difficult to wash off, preventing your hair from getting the nutrients and moisture it needs. Which can make it brittle and fall out or break off.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Kalleefornia",
        "body": "Sulfates are a cleansing agent used in shampoo! You’re fine on the sulfate part. I️ don’t know much about waxes on the hair but it might build up on your hair without a sulfate shampoo.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2h1b8y",
    "title": "How do these ingredients look?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2h1b8y/how_do_these_ingredients_look/",
    "score": 3,
    "num_comments": 4,
    "created": "2014-09-21T14:36:07+00:00",
    "body": "My 16 year old brother was using the original proactiv with terrible results, so when the new Proactiv plus came out he wanted to try it. It seems to be more gentle than the original, at least it's marketed that way. I just wanted to make sure the ingredients list looked okay before he tried it since he hasn't had the best track record with Proactiv.  I've been trying to get him to follow the beginners routine from here but I haven't had any luck. I just wanted you guys to look at the ingredients and let me know how it looks. I know everyone's skin is different and will react differently to products, I just want to get a general feel for the product. Thanks in advance!\n\nThis is what he is looking to order: \n\nStep One: Skin Smoothing Exfoliator\n\nActive Ingredient(s): benzoyl peroxide 2.5%\n\nInactive Ingredients: water, sodium cocoyl isethionate, glycerin, polyethylene, lauryl/myristyl benzoate, linoleic acid, linolenic acid, butylene glycol, dimethicone, ethylhexylglycerin, acrylates/C10-30 alkyl acrylate crosspolymer, glycolic acid, sodium hydroxide, phenoxyethanol, fragrance.\n\nStep Two: Pore Targeting Treatment\n\nActive Ingredient(s): benzoyl peroxide 2.5%\n\nInactive Ingredients: water, ethoxydiglycol, glycerin, prunus amygdalus dulcis (sweet almond) oil, polysorbate 80, polysorbate 60, sorbitan stearate, carbomer, potassium hydroxide, disodium EDTA, fragrance.\n\nStep Three: Complexion Perfecting Hydrator\n\nActive Ingredient(s): salicylic acid 0.5%\n\nInactive Ingredients: water, butylene glycol, cetearyl alcohol, dimethicone, sodium polyacrylate, scutellaria baicalensis root extract, sophora angustifolia root extract, morus alba root extract, glycyrrhiza glabra (licorice) root extract, arctostaphylos uva ursi leaf extract, kojic acid, zinc gluconate, alpha-glucan oligosaccharide, sodium hyaluronate, bisabolol, allantoin, squalane, safflower oil/palm oil aminopropanediol esters, C12-15 alkyl lactate, caprylic/capric triglyceride, caprylyl glycol, ethylhexylglycerin, glycerin, ethylhexyl palmitate, hydrogenated polydecene, hydroxypropyl cyclodextrin, PPG-5-laureth-5, polyquaternium-11, ceteareth-20, aluminum starch octenylsuccinate, polysorbate 60, hexylene glycol, PPG-2 myristyl ether propionate, sodium hydroxide, disodium EDTA, phenoxyethanol, fragrance.\n\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "mastiii",
        "body": "polyethylene - This does some physical exfoliation because it is a plastic microbead.  There is a big movement to stop using microbeads because they are polluting waterways\n\nThe salicylic acid \"hydrator\" has some potentially beneficial ingredients like the licorice root extract, but it also has dimethicone which could break some people out.  Also, the salicylic acid is only 0.5%, when usually we recommend 2%.  We also don't know if the pH is low enough to actually be effective.\n\nI'm personally just not a fan of benzoyl peroxide. It definitely works for some people, but it can dry out your skin and bleach your towels.  So I stay away.  I think using BHA/AHA products and/or a Pocketderm prescription, along with a gentle cleanser and moisturizer is so much better than Proactiv.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "goldenframe",
        "body": "Have you tried using cosdna?  (Link in side bar.) It's a data base of the safety,  comedogenicity and irritation of ingredients in different skincare products.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "8abn3y",
    "title": "Curlisto Sturcture Lotion Plus: Absolute beginner looking for feedback and where to go next.",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/8abn3y/curlisto_sturcture_lotion_plus_absolute_beginner/",
    "score": 4,
    "num_comments": 3,
    "created": "2018-04-06T17:56:32+00:00",
    "body": "Hello,\n\nI haven't spent much time thinking about chemistry since I was in high school so I am jumping into the deep end here. I am trying to recreate Curlisto Sturcture Lotion Plus hair stying cream/gel. \n\nthe ingredients list is:\nWater, polyquaternium-11, panthenol, cetrimonium chloride, hydrolyzed soy protein, peg-60 almond glycerides, hydroxyethylcellulose, polysorbate 20, triethanolamine, benzophenone-4, methylparaben, DMDM, hydantoin, fragrance. \n\nI have been trying to use swiftcraftymonkey method for figuring out the percentage. I have researched what each ingredient is used for \nand this is what I figured out so far:\n\nPercentage estimate:\n\nWater\nPolyquaternium-11\nPanthenol\ncetrimonium chloride \nhydrolyzed soy protein\npeg-60 almond glycerides\nHydroxyethylcellulose\npolysorbate 20\nTriethanolamine\nBenzophenone-4\nmethylparaben (1%)\nDMDM hydantoin (1%)\nfragrance (1%)\n\nI haven't bought the ingredients yet because I want to have a more refined recipe before beginning experimenting.  \n   ",
    "flair_text": "question",
    "flair_template_id": "51c2fb6e-2823-11e4-b071-12313b0e52a2",
    "comments": [
      {
        "author": "_DorothyZbornak_",
        "body": "If you're using the Point of Interest method for dupes, I believe you're on the right track. \n\nI'm not familiar with the product you're trying to dupe, and moreover I don't really make hair products, so I'm afraid I can't offer any specific advice. However, on your ingredients list I would put the 1% mark at Triethanolamine. TEA is primarily used in cosmetics as a pH adjustor, so it would be unusual for it to be present at greater than a 1% concentration. Just ahead of TEA on the ingredients list is the emulsifier Polysorbate 20, and it's a safe bet that's present at greater than 1%. So I would guess TEA and everything below it on the ingredients list is used at less than 1%. Note that anything present <1% may be listed in random order; that's permitted under US and EU labeling regulations.\n\nSome of these ingredients will probably not be available from suppliers that serve the DIY/maker market, so you may need to figure out substitutions. Again, I don't know much about hair products, but I know POI has lots of hair product formulas and advice, so you won't go wrong using it as a resource.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1xdcoa",
    "title": "Question about new products.",
    "url": "https://www.reddit.com/r/curlyhair/comments/1xdcoa/question_about_new_products/",
    "score": 4,
    "num_comments": 2,
    "created": "2014-02-08T18:24:28+00:00",
    "body": "Before going shopping last week, I checked out \"Wonderful CG Friendly Drugstore Product List\" from the sidebar. The list declared that anything by Organix was CG friendly. Awesome! So I bought Smooth Hydration Argan Oil & Shea Butter shampoo, conditioner, and the curl enhancing yogurt. \n\nI love the smell, I love the texture, and I love my curls! My only problem is that the yogurt does not enhance my second day curls, and I'm noticing more frizz than when I previously co-washed with Tresseme products. \n\nUnfortunately, I can't get the \"Search ingredients - what do they do? Are they bad for my hair?\" link on the sidebar to work, and \"Search for product reviews, ingredients, etc\" does not have this particular formula. Has anyone else tried these products? Have you had success? Was it just not for you? This is only week one, so it may change, but I am slightly disappointed.\n\nRegimen:\n\nDay 1) Lightly shampoo\nThoroughly condition\nRinse gently, but leave some conditioner in, scrunch\nPlop while getting dressed/during skincare routine\nScrunch curl enhancing yogurt (previously just more conditioner) into hair\nLeave it alone to dry.\n\nDay 2) Correct part\nFinger-colmb some tangles\nScrunch in yogurt (previously conditioner)\nLeave alone.\n\nEdit; I forgot the ingredients!\n\nShampoo: DI Water, Disodium Laureth Sulfosuccinate, Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocamidopropyl Hydroxysultaine, Dimethicone Copolyol, Cocamide DEA, Glycol Distearate, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Parfum, Coconut Oil (Cocos Nucifera), Avocado Oil (Parsea Gratissima), Aloe Leaf Extract (Aloe Baradensis), Panthenal, Polyquaternium-11, DMDM Hydantoin, Cetyl Alcohol, Guar Hydroxypropyltrimonium Chloride, PEG-23M, FD&C Yellow No.5, FD&C Red No. 40.\n\nConditioner: DI Water, Behentrimonium Chloride, Cetyl Alcohol, Glycol Stearate, Glycerin, Dimethicone, Ceteareth-20, Parfum, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Hydrolyzed Wheat Protein, Cocoa Butter (Theobroma Cacao), Parfum, Coconut Oil (Cocos Nucifera), Avocado Oil (Persea Gratissima), Aloe Leaf Extract (Aloe Baradensis), Panthenol, Tetrasodium EDTA, DMDM Hydanatoin, Methylchlorothiazolinone, Methylisothiazolinone, Red 40, Yellow 5.\n\nCurl Enhancing Yogurt: \nWater, Behentrimonium Chloride, Cetearyl Alcohol, Cetyl Alcohol, Dimethicone, Glycerin, Glyceryl, Stearate, Ceteareth-20, Cyclomethicone, Polyquaternium-11, Dimethiconol, Parfum, Argan Oil (Argania Spinosa), Butyrospermum Parkii (Shea Butter) Fruit, Lanolin Oil, Jojoba Seed Oil (Simmondsia Chinensis), Panthenol, DMDM, Hydantoin, Tetrasodium EDTA, Methylchloroistothizaolinone, Methylisothiazolinone.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jollibhe",
        "body": "Unfortunately, that \"Wonderful CG Friendly Drugstore Product List\" isn't so wonderful anymore.  I don't think it's been updated for a while.  Two of those Organix products you listed have Dimethicone, which is a silicone.  Can't tell if the shampoo is ok but I have checked a few Organix shampoos at my local drugstore and I found a few with sulfates.  \n\nYes to Carrots Nourishing Shampoo is also listed there but has sulfates.  I found out after I've been using it for almost 2 months :(.  The YTC conditioner is ok though. There is also a Garnier Fructis that I made the mistake of buying but thankfully I verified the ingredients before using it.  \n\nThat \"search ingredients\" link is sadly another site that hasn't been maintained for a while :(\n\nIf you need product recommendations, try the pinned post at the top of this subreddit and scroll towards the bottom for the product recommendations.  There is also a product recommendation link at the sidebar in /r/haircarescience.  But before you buy, google the ingredients just in case the manufacturer changed ingredients",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Wavyhair",
    "post_id": "18ixot8",
    "title": "Syoss mousse?",
    "url": "https://www.reddit.com/r/Wavyhair/comments/18ixot8/syoss_mousse/",
    "score": 5,
    "num_comments": 4,
    "created": "2023-12-15T11:06:24+00:00",
    "body": "I know it’s not CG approved but it’s the only mousse that makes my hair look good. Here are the ingredients:\n\nAqua, Alcohol denat., Butane, Propane, VP/VA Copolymer, Polyquaternium-11, Sodium Benzoate, Cetrimonium Chloride, Lactic Acid, Isobutane, Parfum, Hydrolyzed Collagen, Panthenol, Phenoxyethanol, Caprylyl Glycol, Citric Acid, Linalool, Limonene, Benzyl Alcohol, Citronellol, Geraniol, Pantolactone\n\nSo do you think I can get away with using this or is it damaging for my hair?",
    "flair_text": "discussion",
    "flair_template_id": "fdcd96a6-c1fd-11ea-a77b-0edb3abc2fc5",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi! What is your routine? Please be as detailed as possible (both the names of your products and the techniques that you used). Also, if you could let us know your hair characteristics (porosity, strand thickness, density), that would be greatly appreciated. Routine is required within one hour of posting, otherwise your post will be removed. \n\nDo not post inquiring about your hair type or whether your hair is wavy. Your post will be removed. You should be asking in the designated pinned post.\n\nDo not post asking for a routine or products. There is plenty of information in the \"Welcome\" pinned post. If you post asking for a routine or products without first utilizing the information in the pinned post (and providing details), your post will be removed. Thank you!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Wavyhair) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "55m2nm",
    "title": "Anyone have time to help with a mousse ingredient check?",
    "url": "https://www.reddit.com/r/curlyhair/comments/55m2nm/anyone_have_time_to_help_with_a_mousse_ingredient/",
    "score": 4,
    "num_comments": 11,
    "created": "2016-10-03T04:23:44+00:00",
    "body": "It seems learning what to look for on hair product labels will be a lot like learning the diet I have to follow for IBS - overwhelming and requires lots of referencing at the start, but eventually becomes second nature. I appreciate everyone's time and help!\n     \n[**John Frieda Luxurious Volume Mousse**](http://www.ulta.com/luxurious-volume-thickening-mousse?productId=xlsImpprod650014)\nWater, Isobutane, Vp/Methacrylamide/Vinyl Imidazole Copolymer, Polyquaternium-46, Panthenol, Propane, Laureth-3, Cocotrimonium Methosulfate, Ceteareth-25, Benzophenone-4, Propylene Glycol, Diazolidinyl Urea, Methylparaben, Propylparaben, Fragrance\n     \n*I had this ^^ from awhile back and tried it yesterday - hair was amazing and got loads of compliments. The formula I used is different than [what is being sold now.](http://www.johnfrieda.com/en-US/ProductDetail/Hair-Care/Luxurious-Volume/Building-Mousse) Panicking. Any thoughts on the ingredient changes?*\n    \n[**Tresemme Thermal Creations Volume Boosting Mousse**](http://www.ulta.com/volumizing-mousse?productId=prod2143799) \nWater, Isobutane, Hydrofluorocarbon 152A, VP/VA Copolymer, Propane, Polyquaternium-11, Polysorbate 20, PVP, Polyquaternium-4, PPG-12-PEG-50 Lanolin, Cyclopentasiloxane, Cyclohexasiloxane, Tocopheryl Acetate, Niacinamide, Biotin, Ascorbic Acid, Panthenol, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltr, Cocamidopropyl Betaine, Olealkonium Chloride, PPG-9 Diethylmonium Chloride, Sodium Benzoate, Propylene Glycol, Sorbitol, Glycerin, Alpha Isomethyl Ionone, Benzyl Benzoate, Butylphenyl Methyl Propional, Citronellol, Geraniol, Hexyl Cinnamal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Limonene, Linalool, Fragrance.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Curlygirlgreen",
        "body": "Dont use neither of them. They have quats (act like silicone --> build up) and paraben (coul lead to cancer) in them.  Logona and Weleda are safe for the CG-method.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "oh_my_glob_22",
        "body": "Cyclopentasiloxane is a silicone. If you're looking to follow the CG method, then it's best to stay away from that one.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "6y4194",
    "title": "Is this Aveda styling foam safe from harsh ingredients?",
    "url": "https://www.reddit.com/r/NoPoo/comments/6y4194/is_this_aveda_styling_foam_safe_from_harsh/",
    "score": 4,
    "num_comments": 0,
    "created": "2017-09-04T23:27:36+00:00",
    "body": "Aveda Phomollient Styling Foam\n\n\nIngredients:\nAqueous (Water\\Aqua\\Eau) Extracts\\Extraits Aqueux:Arctium Lappa (Burdock) Root Extract, Althaea Officinalis (Marshmallow) Root Extract, Polysorbate 20, Glycerin, Polyquaternium-11, Polyquaternium-10, Honey\\Mel\\Miel, Oryzanol, Tocopherol, Glycine Soja (Soybean) Oil, Fragrance (Parfum), Geraniol, Linalool, Farnesol, Benzyl Benzoate, Amyl Cinnamal, Benzyl Salicylate, Citronellol, Eugenol, Limonene, Citric Acid, Sodium Gluconate, Potassium Sorbate, Phenoxyethanol.\n\n\nhttp://shop.nordstrom.com/s/aveda-phomollient-styling-foam/3411350?cm_mmc=Linkshare-_-partner-_-10-_-1&siteId=XlJR_Jk2BTQ-u9rRtlrnIUU3PFtvCC1ETA",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "finehair",
    "post_id": "1jn5wiq",
    "title": "Folks that use thickening spray, what's your favorite?",
    "url": "https://www.reddit.com/r/finehair/comments/1jn5wiq/folks_that_use_thickening_spray_whats_your/",
    "score": 3,
    "num_comments": 5,
    "created": "2025-03-30T05:46:16+00:00",
    "body": "Hey everyone.\n\nSaw a comment here not long ago recommending thickening spray to bring out waves/loose curls. Unfortunately, the exact one (R+Co BLEU Magnifier) happens to be rather fragrant. Not looking for a dupe per se, but would love to know what other sprays work for finer hair? (can be fragranced, the R+Co was just a bit much)\n\nINCI for the Bleau Magnifier:\n\n>Alcohol denat., aqua/water/eau, vp/va copolymer, fragrance (parfum), trimethylsiloxyamodimethicone, cetrimonium chloride, polyquaternium-11, c11-15 pareth-7, glycerin, c12-16 pareth-9, trideceth-12, benzophenone-4, biotin, polyquaternium-59, phenoxyethanol, hydrolyzed pea protein, hydrolyzed vegetable protein pg-propyl silanetriol, butylene glycol, silica, tapioca starch, disodium edta, potassium sorbate, ethyl linoleate, ethyl oleate, cyclodextrin, ethylhexyl methoxycinnamate, persea gratissima (avocado) oil, crambe abyssinica seed oil, helianthus annuus (sunflower) seed oil, benzyl alcohol, caprylyl/capryl glucoside, caprylic acid, guar hydroxypropyltrimonium chloride, xylitol, tocopherol, limonene, citral.",
    "flair_text": "Product Help",
    "flair_template_id": "bb8d5d74-589c-11ee-b690-1221113bcd5f",
    "comments": [
      {
        "author": "Absolutely_Regular",
        "body": "Oh man, I still haven’t tried any thickening sprays and I’ve heard this one is amazing, but I’m also sensitive to some fragrances. Bummer!\n\nSorry this is super unhelpful. I know Aveda makes a Thickening Tonic but haven’t tried it. They’re usually not outlandishly scented. Or maybe the Resken Volume Maximizer?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "DefiantThroat",
        "body": "I use Kenra Thickening spray or R+Co Dallas spray. I really like both, they both have fragrance. I’ve not tried R+Co BLEU Magnifier so I can’t speak to how they compare.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "xolfy1",
    "title": "Can i dissolve finasteride pills in this?",
    "url": "https://www.reddit.com/r/tressless/comments/xolfy1/can_i_dissolve_finasteride_pills_in_this/",
    "score": 3,
    "num_comments": 4,
    "created": "2022-09-26T14:50:13+00:00",
    "body": "Im no specialist, i know people recommended loreal stemoxydine, but i want something cheaper.  \n\n\nL'Oréal Paris Elvital Hyaluron Plump Leave-In Spray 150 ml  \nContent: \n\nAqua / water, quaternium-87, cocos nucifera oil / coconut oil, sodium benzoate, sodium hyaluronate, stearyl alcohol, ppg-1 trideceth-6, behentrimonium chloride, polyquaternium-37, polysorbate 20, polyquaternium-11, limonene, candelilla cera / candelilla wax, pentaerythrityl tetra-di-t-butyl hydroxyhydrocinnamate, propylene glycol dicaprylate/dicaprate, propylene glycol, isopropyl alcohol, caprylyl glycol, sorbitan oleate, citric acid, coumarin, glycine soja oil / soybean oil, parfum / fragrance",
    "flair_text": "Finasteride/Dutasteride",
    "flair_template_id": "5438ef14-216b-11e6-a07f-0ebfe7658481",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "It looks like this post is about **Finasteride**/Propecia.\n\nBefore asking any questions,\n\n1. Read the [wiki on Finasteride](https://reddit.com/r/tressless/wiki/index#wiki_finasteride).\n2. [Search posts for Finasteride](https://reddit.com/r/tressless/search?q=flair%3Afinasteride&restrict_sr=on&sort=new&t=all), because your question has probably been asked before.\n3. If this is a question asking if you are now or will experience side effects, see a doctor, nobody on the internet can answer that for you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lenim42118",
        "body": "It's impossible to tell.\n\nFinasteride is soluble to about 83mg/ml in isopropyl alcohol (IPA). and to about 50mg/ml in propylene glycol (PG). But it's close to insoluble in water. The rest I don't know.\n\nBut... We don't know how much IPA/PG is in the mixture. it's not high on the ingredient list, so probably not that much.\n\nWhy use this product anyway? If you want cheap, just buy ethanol (or IPA) and PG mix about 70% to 30% (respectively). That's that's maybe 3 dollars per month, can't get much cheaper.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "354tnn",
    "title": "Tresemme Flawless Curls Mousse and l'Oreal Curling Spritz?",
    "url": "https://www.reddit.com/r/curlyhair/comments/354tnn/tresemme_flawless_curls_mousse_and_loreal_curling/",
    "score": 3,
    "num_comments": 2,
    "created": "2015-05-07T02:49:58+00:00",
    "body": "So I'm new and trying to find a good mousse and/or gel to use in my routine.  After looking around the house turns out I had bought some products a few years ago that I never tried.  They don't seem to have silicones but wondering if you guys have given them a try or if they are worth keeping around.  I've listed the products and ingredients below.\n\nTresemme Flawless Curls mousse:\nWater (Aqua, Eau), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polysorbate 20, Polyquaternium-4, Pvp, Ppg-12ppg-50 Lanolin, Olealkonium Chloride, Polyquaternium-7, Ppg-9 Diethlymonium Chloride, Sodium Benzoate, Cyclopentasiloxane, Propylene Glycol, Sorbitol, Glycerin, Cyclohexasiloxane, Cocamidopropyl Betaine, Gelatin/Keratin Amino Acids/Lysine Hydroxy- Propyltrimonium Chloride, Fragrance (Parfum), Hexyl Cinnamal, Benzyl Benzoate, Limonene, Butylphenyl Methylpropional, Linalool, Citronellol, Geraniol, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Alpha-Isomethyl Ionone. Water (Aqua), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polyquaternium-4, Pvp, Polyquaternium-7, Cyclopentasiloxane, Cyclohexasiloxane, Polysorbate 20, Olealkonium Chloride, Cocamidopropyl Betaine, Peg-12-Peg-50 Lanolin, Ppg-9 Diethylmonium Chloride, Glycerin, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Propylene Glycol, Sorbitol, Sodium Benzoate, Fragrance (Parfum).\n\nL'oreal Studio Silk & Gloss Curling Spritz: \naqua, glycerin, propylene glycol, sodium polystyrene sulfonate, PPG-5-ceteth-20, PPG-5-ceteth-10 phosphate, phenoxyethanol,caprylyl glycol, triethanolamine, hexyl cinnamal, linalool, limonene, butylphenyl, methylpropional, citronellol, amyl cinnamal, hydrolyzed silk, parfum",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ImaCheeseMonkey",
        "body": "Silicones in the mousse are: Cyclopentasiloxane, Cyclohexasiloxane, Cyclopentasiloxane, Cyclohexasiloxane \n\nin the Curling Spritz I don't see any 'cones,  but there is a lot of glycerin which could lead to frizz in humid areas.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MuddledMeggie",
        "body": "Tresemme Flawless Curls Mousse is the only thing I have ever found at the drug store that keeps my curls how I like them. It keeps them well controlled and minimizes frizz. It can leave the hair a bit crunchy depending on how much you use, but I would definitely recommend it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "1iz5u8e",
    "title": "Topical Finasteride that doesn’t go systematic is the cure",
    "url": "https://www.reddit.com/r/tressless/comments/1iz5u8e/topical_finasteride_that_doesnt_go_systematic_is/",
    "score": 3,
    "num_comments": 3,
    "created": "2025-02-27T02:57:34+00:00",
    "body": "It’s as simple as the title. I don’t know why nobody has successfully made a topical that doesn’t penetrate skin or stay topical in the scalp. I know that there was someone who mixed topical Finasteride with lipids to give it a higher molecular weight, but that still goes systematic. My other post was about a hydrophobic topical Finasteride which would be harder to do, but why not just mix topical Finasteride with something that physically cannot penetrate the scalp. Like the molecule pp405 is using. They claim that their solution will stay topical in the scalp. Why not use that molecule with topical Finasteride. \n\n I asked chat gpt for some other examples of bases and they gave me this: Polyquaternium-11 (or Polyquaternium-7):\n\t•\tPolyquaternium compounds are large-molecule, water-soluble polymers that are commonly used in hair and skin products. They form a thick, non-penetrating layer on the skin and hair. Polyquaternium-11, in particular, has a high molecular weight and is often used for conditioning, moisturizing, and forming protective barriers.\n\t•\tIt creates a flexible, smooth layer that doesn’t allow active ingredients or environmental elements to penetrate deeply.\nHydrolyzed Silk Protein:\n\t•\tSilk proteins have a high molecular weight and can help condition and protect the scalp without deep absorption. When hydrolyzed (broken into smaller fragments), they still have large molecular structures and stay on the surface, providing a smooth coating effect.\n\t•\tThese proteins also help improve the appearance of hair without penetrating deeply into the skin.\n\nWe quite literally have the mechanism that stops hairloss but 1-5% of people get sides from them (some think higher). Why is no company exploring a side effect free Finasteride?! Please someone poke holes into this argument. Not sure why a bunch of different bases with a topical Finasteride wasn’t tested or at the very least the molecule that pp405 is using can’t be used in topical Finasteride ",
    "flair_text": "Treatment",
    "flair_template_id": "fe3884ac-25d5-11e6-a82b-0ecb21004af1",
    "comments": [
      {
        "author": "bentreehorn",
        "body": "I do think that it’s an underrated avenue of treating hair loss. Stuff like topical liposomal finasteride or dutasteride or dutasteride mesotherapy is really promising but there just isn’t enough good data that I’ve been able to find. I’m okay with oral fin for now but it would be nice to have other options if I start having problems with it down the road. Something that nukes scalp dht by like 99% but serum dht by less than five percent would be very welcome.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Unlikely-Blacksmith1",
        "body": "Not a cure but a treatment",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "dyou897",
        "body": "One big issue is that treating hair loss is more complicated than other topical treatments like for acne, dandruff etc. because it’s not just applied to the skin but it needs ingredients that increase absorption to get it to the hair follicles which is a few Mm under that. Increasing absorption leads to higher levels in the blood\n\nPersonally I don’t think reducing dht with Finasteride is harmful because it’s not completely suppressed. There are benefits like better skin and less oiliness because Dht ages you. Prostate health and avoiding future enlarged prostate complications. Also the hair benefits",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "315eew",
    "title": "Tres Mousse cheap and good?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/315eew/tres_mousse_cheap_and_good/",
    "score": 3,
    "num_comments": 0,
    "created": "2015-04-02T03:07:12+00:00",
    "body": "I've been reading the care guide and have decided to start taking better care if my hair.  \n\nI'm a guy and I use mousse in my hair for extra volume in the mornings because I have thin hair.  I use tresemmes mouse..  Tres mousse..  Which has the following ingredients\n\nWater (Aqua, Eau), Isobutane, Hydrofluorocarbon 152A, VP/VA Copolymer, Polyquaternium-11, Propane, Polysorbate 20, PVP, Polyquaternium-4, Fragrance (Parfum), PPG-12-PEG-50 Lanolin, Olealkonium Chloride, Polyquaternium-7, PPG-9 Diethylmonium Chloride, Sodium Benzoate, Propylene Glycol, Cyclopentasiloxane, Hexyl Cinnamal, Butylphenyl Methylpropional, Cyclohexasiloxane, Sorbitol, Glycerin, Benzyl Benzoate, Cocamidopropyl Betaine, Citronellol, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Hydroxycitronellal, Geraniol, Hydrolyzed Elastin, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Amyl Cinnamal.\n\nI noticed that the ingredients sort of sound like heat protectants .  Such as the PVP and polyquartenum (the video in the haircare guide recommends quartenum). \n\nIs there anything bad in this that I'm missing?\n\nCan I safely blow dry on low without damaging? ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "iludd2",
    "title": "LA ROCHE-POSAY CICAPLAST LAVANT B5 GEL - is it OK to use as cleanser everyday?",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/iludd2/la_rocheposay_cicaplast_lavant_b5_gel_is_it_ok_to/",
    "score": 3,
    "num_comments": 4,
    "created": "2020-09-03T14:25:05+00:00",
    "body": "This cleanser is formulated with zinc, copper and manganese. I was wondering if it is safe for everyday use. I read somewhere it's not recommended to use products with copper peptides everyday, only for broken or injured skin. But this is a wash off product, so maybe it wouldn't be so bad.  \n\nAny thoughts? Has anyone tried it? Here are the ingredients:\n\nAqua (Water), Sodium Laureth Sulfate, Panthenol, Peg-200 Hydrogenated Glyceryl Palmate, Glycerin, Coco-Betaine, Sodium Chloride, Polysorbate 20, Peg-7 Glyceryl Cocoate, Citric Acid, Cocamide Mea, Copper Gluconate, Manganese Gluconate, Peg-55 Propylene Glycol Oleate, Peg-60 Hydrogenated Castor Oil, Polyquaternium-11, Ppg-5-Ceteth-20, Propylene Glycol, Prunus Amygdalus Dulcis Oil/Sweet Almond Oil, Sodium Benzoate, Sodium Hydroxide, Zinc Gluconate.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chattykitten97",
        "body": "I am currentlu using it as a face wash. I really like it! It foams gently and cleanses/rinses very well. It leaves my skin comfortable. However if you have dry skin I think you should look for something a bit more nourishing as this is not the most hydrating cleanser.\nIt does sting my eyes a bit.\nThis is a good choice for normal to oily &acne prone skin in my opinion (+it is super affordable and has a convenient pump! )\n\nHope this helps you out!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "ina_raw",
        "body": "Believe me, I have the equivalent of this one range in the Avène brand (which is Cicalfate) and I use the cream which has copper and zinc and it's made for hurt skin, surgical procedure recovery... i just use it in industrial amounts when I have any skin wound or irritation\n\nSo yeah I Guess you can use it on your skin as it's meant to be anti bacterial and it doesn't have any pharmaceutically active ingredient",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "witic",
        "body": "Have you tried using this on the scalp?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ouraring",
    "post_id": "o1igty",
    "title": "Electrical burn from oura ring",
    "url": "https://www.reddit.com/r/ouraring/comments/o1igty/electrical_burn_from_oura_ring/",
    "score": 4,
    "num_comments": 7,
    "created": "2021-06-16T23:18:14+00:00",
    "body": "I've worn my ring for more than 2 years while doing dishes, taking a shower, cleaning the house with various cleaners.....  I don't use much for caustic cleaners or things that leave a lot of residue due to the number of pets we have so I rarely have to worry about damaging the ring and only occasionally take it off first.\n\nSomehow while giving the fluffy husky a bath I rather severely burnt my finger.  I don't have anything that can focus well enough to take a pic and my husband has not been interested in helping with his amazing quality phone camera.  The dog shampoo had not arrived yet so I used plain unscented dawn dish soap to get the worst dirt off and then human moisturizing shampoo and conditioner.  The problem happened before I applied the new dog specific after bath coat conditioner for helping her excess fluff slide out and that was a spray I didn't really get on myself so everything I used was the same as I have repeatedly in other situations.  \n\n\nInitially I thought the flexible plastic brush with it's hand strap and finger loop were merely pushing the bulky ring into my finger.  I have very small hands and this is the widest and sharpest edged ring I've ever worn.  So I assumed despite trying to keep my finger farther back and avoid pushing on the ring the occasional times it did were the reason for the mild discomfort and red line on the back of my finger.  \n\n\nThe next morning that red line was a huge raised red welt in a strip as wide a the ring with larger areas that matched the spacing of the electrodes.  I decided it was most definitely not just from the ring digging in.  I moved my ring to my other hand.  It's continued to work as normal.  By evening I had 3 large blisters that broke and scabbed over.  While those healed during the next several days little itchy blisters appeared along the edges of the still large raised red welt across the back of my finger.  I heal fast so it was slightly concerning that this wound showed practically no sign of improving.  \n\n\nFinally over a week later new blisters stopped forming, the raised area suddenly went down practically overnight, and the damaged skin is peeling off.  I've always had a tendency to find ways to burn myself while cooking, fireworks(even sparklers), and once I melted some fine copper wire strands to the side of my finger in a rewiring oopsy on a low voltage device.  I'm pretty sure I have never managed to get a burn this severe.    \n\n\nUnfortunately I can't really tell you what the catalyst was given I've used all the same products in other situations and rinsed each one off thoroughly before the next.  The only unique thing in this incident was dog fur.  Doing dishes for hours, taking long showers with soaps, scrubbing the dogs with dry shampoo spray or wipes, wiping off the kitchen counters with mild chlorine based disinfectant (not at all similar to bleach), dusting with pledge, and mopping the floor with an oura ring on has not resulted in any problems.    \n\n\nMaybe soap covered dog fur can short out an oura ring?  Don't know but of all the things you do while wearing an oura ring apparently don't wash the dog. :P   \n\n\n  \n\n\nShampoo and conditioner used:  \n OGX coconut milk nourishing shampoo- Active Ingredients: Aqua (Water); Disodium Laureth Sulfosuccinate;  Cocamidopropyl Betaine; Cocamidopropyl Hydroxysultaine; Parfum; Glycol  Distearate; Dimethicone Copolyol; Cetyl Alcohol; Cocamide DEA; Guar  Hydroxypropyltrimonium Chloride; Polyquaternium-11; DMDM Hydantoin;  Panthenol; Silk Amino Acids; Cocos Nucifera (Coconut) Extract; Albumen;  Cocos Nucifera (Coconut) Oil; Hydrolyzed Milk Protein; Tocopheryl  Acetate (Vitamin E); Coumarin \n\n&#x200B;\n\nogx coconut milk conditioner- Water (Aqua), Cetearyl Alcohol, Cetyl Alcohol, Behentrimonium Chloride,  Glycerin, Cocos Nucifera (Coconut) Oil, Cocos Nucifera (Coconut) Fruit  Extract, Glycol Stearate, Glycol Distearate, Ceteareth-20, Isopropyl  Alcohol, Dimethicone, Cyclotetrasiloxane, Citric Acid,  Cyclopentasiloxane, Panthenol, Ovum (Egg Powder), Propylene Glycol,  Tetrasodium EDTA, DMDM Hydantoin, Methylchloroisothiazolinone,  Methylisothiazolinone, Fragrance (Parfum).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Oura_Ring",
        "body": "Hi u/Keighan, thank you for sharing this story and we hope you are okay; we have messaged you for more information! - The Oura Ring Team :)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "warmweatherbluesky",
        "body": "I've been wearing the ring now for about 6 months. I received it as a birthday gift. I woke up this morning with with a large, discolored welt on my finger, underneath one of the rings sensors. I almost could not remove the ring due to the swelling.\n\nI thought, perhaps, it was a spider bite but that didn't make sense, especially because no other \"bites\" were found on my exposed skin. \n\nI also believe that the ring burned me. Perhaps, in my sleep, the sensors twisted toward the top of my finger where the delicate skin is as opposed to staying positioned underneath on the palm side my hand.\n\n I seem to recall when I initially received the ring that the literature stated to keep the sensors on the under side of your hand. Is that because they know it has the potential to burn the sensitive skin on the top of your hand?\n\nThis is unfortunate. I love my ring.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "InexperiencedCoconut",
        "body": "I sure hope you contacted Oura!! Glad it's feeling better now",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ScoutyMonster",
        "body": "I have a burn as well and I didn't give my dog a bath. LOL I take it off to shower; so it must have happened over time while washing my hands or some such.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "9m7noo",
    "title": "Using conditioner as a replacement for heat protectant spray?",
    "url": "https://www.reddit.com/r/curlyhair/comments/9m7noo/using_conditioner_as_a_replacement_for_heat/",
    "score": 2,
    "num_comments": 3,
    "created": "2018-10-07T18:55:00+00:00",
    "body": "Is this something that could work? I have naturally wavy hair (mix of 1b/1c). I find that going silicone free makes my hair frizzy and stringy. Sometimes I like to flat iron my hair so make it straighter, sometimes I use a curling iron to add more waves. \n\nThe conditioner I was looking at is Garnier [Whole Blends Repairing Conditioner](https://www.garnierusa.com/about-our-brands/whole-blends/honey-treasures-repairing/repairing-conditioner-honey-treasures). The fourth ingredient is amodimethicone (following water, cetearyl alcohol, and behentrimonium chloride). I'd use it with a shampoo containing cocamidopropyl betaine. I saw a gentle shampoo from Cantu that looks like it could work really well, but for some reason the listed ingredients differ between websites. \n\nWould this conditioner work as a substitute for heat protectant spray? What if I were to use it as a leave-in? (This might be too heavy for my hair though). I'm not a huge fan of sprays because the spray usually gets on my face and can cause breakouts, and it's hard to get even coverage. I would love to find a conditioner or leave in with water-soluble silicones to replace heat protectant spray, but finding any product (conditioners, sprays, leave-ins, you name it) that has water-soluble silicones *only*, and *high up in the ingredient list* has been nearly impossible... So I've kind of given up on that. \n\nEDIT: I did find this leave-in that supposedly only contains water-soluble silicones - [Bed Head Control Freak Serum](https://www.ulta.com/bed-head-control-freak-serum?productId=xlsImpprod4750119) - but it's a little pricey, and I also don't know if the water-soluble silicones are strong enough or high enough in the ingredient list to offer adequate heat protection. Ingredients: Aqua (Water/Eau), Polyacrylamidomethylpropane Sulfonic Acid, Polyquaternium-11, Glycerin, Propylene Glycol, Triethanolamine, Oleth-20, Dimethicone Copolyol, Dimethicone Copolyol Meadowfoamate, Hydroxyethylcellulose, DMDM Hydantoin, Parfum (Fragrance), Linalool, Hexyl Cinnamal, Limonene, Carbomer, Methylparaben, Disodium EDTA, Benzophenone-4, Actinidia Chinensis (Kiwi) Fruit Extract, Jasminum Officinale (Jasmine) Extract, CI 77019 (Mica), CI 77891 (Titanium Dioxide), CI 19140 (Yellow 5), CI 42090 (Blue 1), CI 17200 (Red 33).",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "VictoriaENTP",
        "body": "When you use a conditioner with oils as your \"heat protectant\" you are literally frying your hair",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "lsjaff",
    "title": "Are these ingredients in my curl enhancing cream from Aveda good?",
    "url": "https://www.reddit.com/r/curlyhair/comments/lsjaff/are_these_ingredients_in_my_curl_enhancing_cream/",
    "score": 2,
    "num_comments": 1,
    "created": "2021-02-25T22:53:48+00:00",
    "body": "Water\\\\Aqua\\\\Eau, Cetearyl Alcohol, Cetyl Alcohol, Phenyl Trimethicone, Linum Usitatissimum (Linseed) Seed Extract, Althaea Officinalis (Marshmallow) Root Extract, Aloe Barbadensis Leaf Juice, Behentrimonium Chloride, Hydrolyzed Wheat Protein, Panthenol, Quaternium-95, Polyquaternium-11, Glycerin, Tocopherol, Propanediol, Fragrance (Parfum), Geraniol, Linalool, Amyl Cinnamal, Citronellol, Limonene, Maltodextrin, Phenoxyethanol\n\n&#x200B;\n\nDo these look okay?",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "yourworkmom",
        "body": "[aveda on curlscan](https://curlscan.com/?search=aveda)",
        "score": 6,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "wx1fd9",
    "title": "Help with what ingredient is causing bumps on scalp & neck",
    "url": "https://www.reddit.com/r/curlyhair/comments/wx1fd9/help_with_what_ingredient_is_causing_bumps_on/",
    "score": 2,
    "num_comments": 6,
    "created": "2022-08-25T01:55:33+00:00",
    "body": "I recently purchased the Zotos All About Curls Line as a Deva knockoff and after the first couple of uses I developed 3-4 large pimple-like bumps on the nape of my neck and around my hairline by my ear.  I experienced these same bumps several years ago with the LUS line (I loved what it did to my hair, but couldn't deal with the bumps!).  These are both supposed to be very ingredient-friendly lines, so I'm trying to compare and figure out what I apparently reacting to.  I analyzed the ingredient lists from both brands' conditioners and found the following matching ingredients (see below).  I also ran the ingredients through CosDNA to see if anything dinged as a problem.\n\nNothing I'm doing is healing these bumps (other than time I guess).  I've tried tea tree, clay masks, anti-fungal shampoo, neosporin.  They don't pop like pimples.  \n\nI cut everything out the last week, and last night I added in the Zotos conditioner only to try to narrow down the issue and I have a couple new sore bumps on my scalp.\n\nClearly I have to avoid one (or several) of these ingredients, but I need help narrowing it down and seeing if anyone else has had experience with this?\n\n&#x200B;\n\nZotos Daily Conditioner:\n\nWATER/AQUA/EAU, CETEARYL ALCOHOL, ISOAMYL LAURATE, BEHENTRIMONIUM CHLORIDE, GLYCERIN, GLYCERYL STEARATE SE, COCOS NUCIFERA (COCONUT) OIL, HONEY/MEL/MIEL, BUTYROSPERMUM PARKII (SHEA) BUTTER EXTRACT, HYDROLYZED SOY PROTEIN, PRUNUS AMYGDALUS DULCIS (SWEET ALMOND) FRUIT EXTRACT, SCLEROCARYA BIRREA SEED OIL, GLYCINE SOJA (SOYBEAN) OIL, PHENOXYETHANOL, POLYQUATERNIUM-67, GLYCERYL LAURATE, SODIUM GLUCONATE, CITRIC ACID, LECITHIN, ISOPROPYL ALCOHOL, LIMONENE, COUMARIN, LINALOOL, ALPHA-ISOMETHYL IONONE, FRAGRANCE/PARFUM.\n\n&#x200B;\n\nLUS Conditioner:\n\n Aqua/Water/Eau, Cetyl Alcohol, Cetearyl Alcohol, Ceteareth-20, Glycerin, Cetrimonium Chloride, Polyquaternium-11, Butyrospermum Parkii (Shea) Butter, Moringa Oleifera Seed Oil, Polyquaternium-7, Polyquaternium-37, Citric Acid, Phenoxyethanol, Ethylhexylglycerin, Fragrance/Parfum. \n\n&#x200B;\n\nShared ingredients from both products:\n\nCETEARYL ALCOHOL, glycerin, BUTYROSPERMUM PARKII (SHEA) BUTTER EXTRACT, PHENOXYETHANOL, Citric Acid",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "manderly808",
        "body": "Photo of the bumps on my nape\n\nhttps://i.imgur.com/QOIm3O4.jpghttps://i.imgur.com/S3GcqD5.jpg",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "manderly808",
        "body": "https://i.imgur.com/VTevGjH.jpg",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lavender_and_teal",
        "body": "It’s unlikely that glycerin or cetearyl alcohol is causing this, at least in my eyes. I do notice that both products have fragrance which can irritate the skin and cause reactions, so fragrance sensitivity or allergy is a possibility. Phenoxyethanol is a preservative that can cause skin irritation or allergies in some people, but it’s likely in other products you use as well. If you have skincare with it and don’t have that issue, I would rule this out as a culprit. It’s very common and wouldn’t be in a very high concentration based on the ingredient list. Same with citric acid, I don’t think that’s it. It’s a ph adjustor in a very small concentration.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bisi30",
        "body": "If they are pimples and not allergic reaction, it could be the almond oil or coconut oil. Both of those cause breakouts for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thebouncingcupcake",
        "body": "Definitely one of the oils, coconut oil is a known comedogenic.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "overwhelmed_housecat",
        "body": "Behentrimonium chloride in eva NYC protein mask. Ruined my scalp felt like a chemical burn. Unfortunately I Google it and apparently its toxic at high concentrations could just be contact dermatitis but its regulated in Europe apparently not in US.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "1dkmae9",
    "title": "Water content in hair and the role of glycerin and sodium hyaluronate in \"hydrating\" dry and damaged hair",
    "url": "https://www.reddit.com/r/HaircareScience/comments/1dkmae9/water_content_in_hair_and_the_role_of_glycerin/",
    "score": 2,
    "num_comments": 14,
    "created": "2024-06-20T20:57:36+00:00",
    "body": "I've started using a shampoo and conditioner from the L'Oreal Elvive Hydra Hyaluronic range recently. The products are advertised for dry hair and contain ingredients such as glycerin and sodium hyaluronate, typically used as humectants in skincare.\n\nMy understanding of glycerin and sodium hyaluronate is that they are water-based ingredients, so I was sceptical if this is just marketing and if they'd do anything meaningful or simply be washed out.\n\nThe formula does include silicones, so perhaps the active ingredients could be trapped underneath that, but on the other hand, perhaps the silicones would be stopping them from penetrating the hair? (I'm not sure if the glycerol or hyaluronate are the right molecular size to enter the hair shaft in the first place.)\n\nSuppose they could bypass the cuticle would they provide any benefit?\n\nI've been looking at diagrams of hair anatomy and can't tell if dry healthy hair is meant to contain a certain amount of water. Assuming it is, and that a damaged cuticle leads to a reduction of this as water is escaping, leaving hair feeling \"dry\", would such ingredients be able to increase the water content in hair?\n\nIf so, is there such a thing as too much water, where this could help damaged hair, but make healthy hair limp or fragile? \n\n\"Dry\" hair is fragile too, ie. inflexible and prone to snapping, but it's not clear if increasing water content can alleviate this if oils and silicones haven't been enough.\n\nMy understanding of humectants in skincare is that they work by either drawing in water from the air or pulling it up from the skin surface, but neither of those seem to apply here, so are hair humectants doing anything, particularly when used with silicones? Would it maybe make sense to apply silicones afterwards?\n\nThe hair range also includes a leave-in product with a lot more hyaluronate, and oil instead of silicone, but I don't know about penetration when it comes to applying this on dry hair (presumably on a layer of silicones from the conditioner).\n\nI'd love if someone could weigh in on the science here.\n\n--\n\nList of the ingredients in this range for reference:\n\nShampoo:  \nAQUA / WATER • SODIUM LAURETH SULFATE • GLYCOL DISTEARATE • SODIUM CHLORIDE • COCAMIDOPROPYL BETAINE • DIMETHICONE • CI 60730 / EXT. VIOLET2 • GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE • COCAMIDE MEA • COCO-BETAINE • SODIUM BENZOATE • SODIUM HYDROXIDE • SODIUM HYALURONATE • PHENOXYETHANOL •STEARETH-6 • ACETIC ACID • PEG-100 STEARATE• TRIDECETH-10 • TRIDECETH-3 • SALICYLIC ACID • FUMARIC ACID • AMODIMETHICONE • CARBOMER • CITRIC ACID • HEXYLENE GLYCOL • PARFUM / FRAGRANCE.\n\nConditioner:  \nAQUA / WATER • CETEARYL ALCOHOL • DIMETHICONE • GLYCERIN • BEHENTRIMONIUM CHLORIDE • CI 60730 / EXT. VIOLET 2 • LACTIC ACID • SODIUM LAURETH SULFATE • SODIUM HYALURONATE • SODIUM HYDROXIDE • PHENOXYETHANOL • LIMONENE • AMODIMETHICONE • ISOPROPYL ALCOHOL • CETRIMONIUM CHLORIDE • PARFUM /FRAGRANCE\n\nMask:  \nAQUA / WATER • GLYCERIN • CETEARYL ALCOHOL • DISTARCH PHOSPHATE • QUATERNIUM-87 • DIMETHICONE • CI 60730 / EXT. VIOLET 2 • LACTIC ACID • SODIUM HYALURONATE • PHENOXYETHANOL • STEARETH-6 • ACETIC ACID • PEG-150/DECYL ALCOHOL/SMDI COPOLYMER • PEG-100 STEARATE • BEHENTRIMONIUM CHLORIDE • TRIDECETH-10 • TRIDECETH-3 • CHLORHEXIDINE DIGLUCONATE • PROPYLENE GLYCOL • AMODIMETHICONE • ISOPROPYL ALCOHOL • PARFUM / FRAGRANCE •\n\nLeave-in:  \nAQUA / WATER • QUATERNIUM-87 • COCOS NUCIFERA OIL / COCONUT OIL • SODIUM BENZOATE • SODIUM HYALURONATE • STEARYL ALCOHOL • PPG-1 TRIDECETH-6 • BEHENTRIMONIUM CHLORIDE • POLYQUATERNIUM-37 • POLYSORBATE 20 • POLYQUATERNIUM-11 • LIMONENE • CANDELILLA CERA / CANDELILLA WAX • PENTAERYTHRITYL TETRA-DI-T-BUTYL HYDROXYHYDROCINNAMATE • PROPYLENE GLYCOLDICAPRYLATE/DICAPRATE • PROPYLENEGLYCOL • ISOPROPYL ALCOHOL • CAPRYLYLGLYCOL • SORBITAN OLEATE • CITRIC ACID • COUMARIN • GLYCINE SOJA OIL / SOYBEAN OIL • PARFUM / FRAGRANCE.",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "Unfair_Finger5531",
        "body": "What they do is perform as humectants.  They hydrate as all humectants do to some extent.  HYA and glycerin won’t remain on your hair when washed out, but in a conditioner, they may linger a bit, as most conditioners leave behind a film by design.  It is good to have humectants in a formulation for many reasons.  But not every ingredient in a formulation is going to perform independently as it would if you were using separately.  In other words, in a formulation it does one thing, while if you were put a HYA serum directly on your hair, it would do something else (or have a different effect rather).  \n\nFwiw, you can always a drop or two of HYA or glycerin to your leave-in conditioner if you want more humectants in your hair.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "veglove",
        "body": "The relationship between hair and water is complicated.  When most people talk about \"moisturizing\" or \"hydrating\" their hair, they're really talking about the benefits of using conditioner, which mostly forms a coating of conditioning agents on the hair that make it softer and smoother rather than adding water.  It's a mis-application of skincare concepts to hair.  Hair is quite different from skin.  If there's too much water in the hair, it actually feels more dry, which is what the moisture bot that this comment will trigger says.  Porous hair, especially if there is chemical or heat or sun or chlorine damage, will usually allow too much water into the hair shaft, so conditioners offer the benefit of decreasing (but not completely blocking) the amount of water that passes through.\n\nHowever there has been a bit of an overcorrection of this idea in some hair science circles to give the impression that hair doesn't benefit from any water at all, and that's not true either.  [This video](https://www.instagram.com/reel/C1qFlgNSgLp/) is information-dense and just scratches the surface of the topic, and I wish I had additional resources to share but that's all I've found that's made for a general audience.\n\nIn your situation, your hair feels dry (rough/brittle) to you, so it may actually have too much water in it and would benefit from products with oils, silicones and other polymers that help reduce water passing through.  L'Oreal has a big budget for product development and testing, so I trust that their products are good for the hair type they say they are, but exactly how & why may not match what the label says, that's just marketing that is aimed to appeal to customer's *perceptions*, not reflect scientific reality.  It could be the silicones in the product and other ingredients you're not familiar with that offer a lot of the benefits that the product promises.  You might find some of the [LabMuffin Beauty articles/videos on silicones](https://labmuffin.com/?s=silicones) useful, it's important to understand that they don't create an impermeable barrier on the hair to block anything from getting through.\n\nI share the skepticism of the other commenter that humectants in a shampoo would do much for hair, since it's meant to remove stuff from the hair and then is rinsed out.  Conditioners are formulated to stick to the hair, however it's still very possible that the hyaluronic acid is featured mainly for marketing purposes.  There has been a recent fad in marketing to highlight skincare actives in the products, but hair and skin are very different and those actives don't necessarily behave the same way for hair or help hair at all.  Glycerin may be useful if the product leaves it on the hair, but people's experiences with glycerin in hair products vary wildly, because it depends a lot on your local climate and the humidity level of the air around your hair.  It's also possible that glycerin was added to the product to change the product consistency rather than its effect on the hair, or simply because people *associate* it with moisture/hydration even though that's not the role it plays in the product.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "We noticed you mentioned ingredients that some influencers have branded as 'harmful' or 'bad'. Please note that we try not to spread chemophobia in this sub and none of these ingredients have actually been found to be harmful. If you have any studies to share, message the mods. If your post is not related to this comment, please disregard.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/HaircareScience) if you have any questions or concerns.*",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "finehair",
    "post_id": "1eilslb",
    "title": "Verb Sea Texture Cream (Discontinued) - Dupe?",
    "url": "https://www.reddit.com/r/finehair/comments/1eilslb/verb_sea_texture_cream_discontinued_dupe/",
    "score": 2,
    "num_comments": 4,
    "created": "2024-08-02T21:28:07+00:00",
    "body": "Texture: Straight (slight wave) // Density: Medium // Treated: half-head of babylights 3-4x/year\n\nHello my fellow fine-haired folks :) Wondering if any of you have used the now discontinued '**Sea Texture Cream' by Verb** (ingredient list below)**,** and can suggest a similar product.\n\nHaving fine, shoulder blade-length hair I generally avoided anything labelled 'cream' but I was blown away by this unique (to me) thin, watery \"cream\" styling product. It somehow made my hair look better and fuller as the day went on, which has NEVER happened before or since lol.\n\nHelp! Open to any and all suggestions of soft, touchable, fuller texture styling products for fine hair.\n\nhttps://preview.redd.it/ljerc4mbkbgd1.png?width=1076&format=png&auto=webp&s=257542cf32754eccc1c40b7092652be0bc947987\n\n'Verb Sea Texture Cream' Full ingredient list:\n\nWater (Aqua), VP/DMAPA Acrylates Copolymer, Hexamethydisiloxane, Polyquaternium-11, Glyceryl Stearate, Cetearyl Alcohol, Propylene Glycol Dibenzoate, Polyquaternium-37, Dicaprylyl Carbonate, Fragrance (Parfum), Caprylyl Methicone, Lauryl Glucoside, Hydrolyzed Quinoa, Glycol Distearate, Phenoxyethanol, Panthenol (Pro-Vitamin B5), Hydroxyethyl Cellulose, Isopropyl Palmitate (Palm Oil), Algae (Seaweed) Extract, Propylene Glycol, Calluna Vulgaris (Heather) Extract, Ascophyllum Nodosum (Kelp) Extract, Ethylhexylglycerin, Aloe Barbadensis Leaf Juice, Camellia Sinensis (Green Tea) Leaf Extract, Orbignya Oleifera Seed (Babasu Nut) Oil, Octinoxate, Crambe Abyssinica (Abyssinian) Seed Oil, Glycerin, Sea Water, Sea Salt, Helianthus Annus (Sunflower) Seed Extract, Citric Acid.",
    "flair_text": "Product Help",
    "flair_template_id": "bb8d5d74-589c-11ee-b690-1221113bcd5f",
    "comments": [
      {
        "author": "tish247",
        "body": "Found your post on my semi-annual internet search for any remaining jars of this stuff.  Every once in awhile, I get lucky, but no luck in the last year.  I think all that’s left are the crazy people on eBay, but I draw the line at $200.  Sadly, I haven’t found anything that even comes close to it.  Right now, I’m using this stuff, DevaCurl Curl Heights cream, that at least gives me texture and defined curl, but it doesn’t have the lightness/softness.  It’s crunchy/sticky.  If it helps, I already tried the “Not Your Mother’s” line, and it was not even close.  You can at least cross that one off your list.  Good luck.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "kelceylovescents",
        "body": "It's the BASSABU OIL, it did the same for me!! Nowadays I use Function of Beauty Wavy Hair Leave-In Treatment Base with Babassu Oil - 7 fl oz (purple bottle, I got it from Target). VERY similar texture like you described!! That almost a cream, watery (in a positive way) thing going on. I use that all over right after I wash, then use VERB ghost oil just on my ultra bleach damaged tips (has heavier (?) Argan oil, very thick stuff, lasts FOREVER because I need so little!!)\n\nFound your post looking for this too, deciding between switching 100% to VERB products or keep this. This Function of Beauty one is too good, I wish Verb hadn't discontinued the sea cream cuz I'd prefer to stay brand loyal once I find something that works!! My finger is hovering on BUY (at fragrance net) button on like 1/2 their products to see if the rest of their line is as good as the 3 I've tried by them. Hope this helps! :)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "121x1ud",
    "title": "Can I add rosemary oil to my hair lotion?",
    "url": "https://www.reddit.com/r/tressless/comments/121x1ud/can_i_add_rosemary_oil_to_my_hair_lotion/",
    "score": 2,
    "num_comments": 9,
    "created": "2023-03-25T19:51:16+00:00",
    "body": "Hello, I’ve bought herbal lotion and there isn’t rosemary oil in ingredients. I’m thinking about adding few drops, but does it have any sense? Will rosemary fit with other ingredients? I will list them below. I’m not balding at all, just like 5-10 hair while washing. I want prevent future hairloss, but mianly to keep my hair healthy.\n\nIngredients: \n\nAqua, Polysorbate 20, Trigonella Foenum-Graecum Seed Extract, Raphanus Sativus Root Extract, Hydrolyzed Soy Protein, Propanediol, Glycerin, Panthenol, Zinc PCA, Glucose, Ornithine HCL, Niacinamide, Arginine HCL, Panax Ginseng Root Extract, Citrulline, Glucosamine HCL, Pyridoxine HCL, Allium Cepa Bulb Extract, Biotin, Vanillyl Butyl Ether, Mentha Arvensis Leaf Oil, Polyquaternium-11, Propylene Glycol, Sodium Hydroxide, Salicylic Acid, Sorbic Acid, Sodium Benzoate, Potassium Sorbate, Benzoic Acid, Parfum, Benzyl Alcohol, Limonene, Linalool",
    "flair_text": "Product",
    "flair_template_id": "406d510a-4ba1-11ea-8492-0e4320351cb3",
    "comments": [
      {
        "author": "ItsToboLads",
        "body": "To be honest, it just sounds like you've wasted your money",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "JimmyHP1",
        "body": "I would go ahead an add the rosemary. It didn’t make me grow any new hair, but after using rosemary oil in my hair for about four months I saw a huge decrease in the number of hairs I was losing in the shower and my hair has looked fuller as a result .",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "cv8h2o",
    "title": "Is this TREsumme mousse CG approved?",
    "url": "https://www.reddit.com/r/curlyhair/comments/cv8h2o/is_this_tresumme_mousse_cg_approved/",
    "score": 2,
    "num_comments": 3,
    "created": "2019-08-25T13:26:46+00:00",
    "body": "Water (Aqua) Isobutane Hydrofluorocarbon 152A VP/VA Copolymer Hydrolyzed Elastin Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride Propane Polyquaternium-11 Polysorbate 20 PVP Polyquaternium-4 Fragrance (Parfum) PPG-12-PEG-50 Lanolin Olealkonium Chloride Polyquaternium-7 Sodium Benzoate Propylene Glycol Cyclopentasiloxane Glycerin Sorbitol Cocamidopropyl Betaine Cyclohexasiloxane\n\nThis is for TRESumme extra firm mousse which seems to really work for my hair (2a/2b) but cant help but notice all the buildup by the end of the day.\n\nAlso I'm curious how often do people no-poo or co-wash? My hair seems unfixable in the mornings",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ftr-mmrs",
        "body": "Seconding the isitcg tool.\n\nFor the first time ever I have second day hair, and I wasn't planning on it. I'm helping someone unpack from moving, so last night I took an evening shower from getting sweaty all day. I used cowashed, rinseout, leave-in as usual and airdried before going to bed. This morning I wokeup with hair pointing in different directions but didnt want to wash it again. So decided to put in a few drops of grapeseed oil to make it workable to tie up. Except it looks great now! Will be tying up anyway when we start working this morning, but I may have found my new refresh product.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "WeAreStarless",
        "body": "[curlsbot](https://www.curlsbot.com/) and [isitcg](http://www.isitcg.com/) won't be able to read those ingredient lists because the ingredients aren't separated by commas, but i can, and it's not approved! those two cyclo-something-siloxane ingredients towards the end are silicones",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "i0no2h",
    "title": "What caused hair reaction to this shampoo?",
    "url": "https://www.reddit.com/r/curlyhair/comments/i0no2h/what_caused_hair_reaction_to_this_shampoo/",
    "score": 2,
    "num_comments": 7,
    "created": "2020-07-30T15:07:58+00:00",
    "body": "I want to start CG because I believe my hair health will benefit, but I have a concern about a reaction I have to a particular shampoo. I want to understand why so I can avoid that happening again when I get new CG approved products.\n\nShampoo disaster- In August 2019 I unintentionally tried a CG approved shampoo according to isitcg: Soapbox Coconut Oil Shampoo (see ingredients  below). The first two times were okay, but every time since then my hair has a terrible reaction. It makes my hair ridiculously tangled and matted, almost gummy? Yet simultaneously dry as straw at the bottom? No amount of conditioner helps. It makes it terribly difficult to brush/comb and consequently I lose a bunch of hair. \n\nWhy might this have happened? It is very confusing and makes me very nervous to switch to a CG shampoo, despite the non-CG one I am currently using causing some other smaller issues.  \n\nSomeone else suggested maybe my hair doesn’t like coconut oil, but I’ve always used products with it since 2012. They also said it sounds like protein overload, which it does sound like that, but the Soapbox shampoo does not have protein as far as I can tell...?  \n\nFor context, I think I have 2A-2B wavy hair that has low porosity at the top and maybe medium at the bottom. I have very thick, fine hair that gets very frizzy in humidity. Where I live has 90% humidity most of the time. It basically doesn’t grow beyond my shoulders and just breaks off. It’s very prone to oil and grease at the top, but always dry at the bottom. Products cause nasty build up at the top, and sometimes are absorbed a little at the bottom and it is gross. It takes at least 2.5 hours to air dry, usually closer to 4. I live in a mostly hot, very humid climate. CG approved shampoo I unintentionally used in the past had a lot of protein and glycerin in it. Sometimes glycerin was the second ingredient.\n\n\nSoapbox Coconut Shampoo Ingredients:\n\nWater (Aqua), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Betaine, Cocamidopropyl Hydroxysultaine, Sodium Lauryl Sulfoacetate, Disodium Laureth Sulfosuccinate, Glycerin, Cetrimonium Chloride, Cocos Nucifera (Coconut) Oil, Butyrospermum Parkii (Shea Butter), Simmondsia Chinensis (Jojoba) Seed Oil, Panthenol, Polyquaternium-11, Polyquaternium-7, Aloe Barbadensis (Aloe) Leaf Juice, Guar Hydroxypropyltrimonium Chloride, Fragrance (Parfum), Sodium Chloride, Citric Acid, Dehydroacetic Acid, Benzyl Alcohol",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "pooh8402",
        "body": "It's probably the coconut.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1lkpajn",
    "title": "[Routine Help] Shiseido Tsubaki Premium Volume Shampoo&Conditioner/Ex Repair Mask Is Breaking Me Out",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1lkpajn/routine_help_shiseido_tsubaki_premium_volume/",
    "score": 1,
    "num_comments": 1,
    "created": "2025-06-26T02:58:41+00:00",
    "body": "Switched from my old haircare routine products (a local brand) to the Shiseido Tsubaki Premium Volume set. I suddenly had a breakout of mostly closed comedones and some cystic acne all over my cheeks, forehead, jawline, and some even up to my neck.\n\nIt’s done wonders to my hair - literally life-changing. I suspect it’s the one breaking me out though since it’s the only thing I’ve changed in my routine. So it’s a huge bummer :(\n\nThese are the ingredients:\n\nTsubaki Premium Volume Conditioner: Water, Isopentyldiol, Behentrimonium Chloride, Glycerin, Stearyl Alcohol, Behenyl Alcohol, Dimethicone, Cetanol, Aminopropyl Dimethicone, Steartrimonium Chloride, Polysilicone-13, Squalane, Aspartic Acid, Camellia Seed Oil, Polyquaternium-11, Lactic Acid, sodium dilauroyl glutamate lysine, Taurine, Di(Phytosteryl/​Octyldodecyl) Lauroyl Glutamate, Macadamia Nut Fatty Acid Phytosteryl, Isopropanol, DPG, Isopropyl Myristate, PEG-2 Laurate, Amodimethicone, Sodium Methyltaurate, Salicylic Acid, PPG-2-Deceth-12, Laurtrimonium Chloride, C13-16 Isoparaffin, Disodium EDTA, C10-13 Isoparaffin, Cetrimonium Chloride, Tocopherol, Sodium Benzoate, Phenoxyethanol, Fragrance, Bisethylhexyloxyphenol Methoxyphenyl Triazine, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine\n\nTsubaki Premium Volume Shampoo: Water, Sodium Laureth Sulfate, Cocamidopropyl Betaine, PEG-2 Laurate, Sodium Sulfate, Fragrance, Dipropylene Glycol, Isostearyl Alcohol, Phenoxyethanol, Guar Hydroxypropyltrimonium Chloride, Sodium Benzoate, PEG-60 Hydrogenated Castor Oil, Polyquaternium-10, Salicylic Acid, Disodium EDTA, Citric Acid, Phytosteryl/​Octyldodecyl Lauroyl Glutamate, Camellia Japonica Seed Oil, Sodium Dilauramidoglutamide Lysine, Butylene Glycol, Royal Jelly Extract, Glycine Soja Seed Extract, Tocopherol\n\nTsubaki Premium Ex Repair Mask: Water, Glycerin, Dimethicone, Isopentyldiol, Hydrogenated Rapeseed Alcohol, Behentrimonium Chloride, Stearyl Alcohol, Sorbitol, Aminopropyl Dimethicone, Hydroxyethyl Urea, Hydroxypropyl Arginine Lauryl/​Myristyl Ether HCL, Steartrimonium Chloride, Lactic Acid, Camellia Japonica Seed Oil, Phytosteryl/​Octyldodecyl Lauroyl Glutamate, Sodium Dilauramidoglutamide Lysine, Royal Jelly Extract, Sodium Acetylated Hyaluronate, Hydrolyzed Conchiolin Protein, Isopropanol, Cetyl Alcohol, Octyldodecanol, Ethanol, Citric Acid, Ammonium Lactate, Butylene Glycol, Dipropylene Glycol, Amp, Amodimethicone, PPG-2-Deceth-12, Tocopherol, Phenoxyethanol, Sodium Benzoate, Fragrance, Red 227, Yellow 4\n\nWhat could possibly be breaking me out? Are there any alternative shampoo/conditioner/hair masks that would be good for Asian, low porosity hair?\n\nTIA!",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guides [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and if it is, we might remove your post).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "3wy3uy",
    "title": "question about organix/ogx renewing argan oil shampoo",
    "url": "https://www.reddit.com/r/curlyhair/comments/3wy3uy/question_about_organixogx_renewing_argan_oil/",
    "score": 1,
    "num_comments": 1,
    "created": "2015-12-15T15:12:17+00:00",
    "body": "Hi curlies! \n\nI've been playing around with the CG method for the last few weeks and I'm loving it. I'm aiming to be low-poo for the time being, as I am a bit of a shampoo addict. Microfibre towel and wide toothed comb have changed my life though, as has Lush's 'R'n'B' hair moisturiser.\n\nA number of forums and websites have recommended Organix Renewing Argan Oil Shampoo (OGX in the UK) as being CG-friendly. I've been using it followed by a no-cone conditioner (Superdrug extracts) and enjoying the results but I'm still unsure if it is truly suitable for a low-poo approach? Does anyone have any thoughts on this? \n\nI know some sulfates are less problematic than others and the one that sticks out on the ingredients list is Sodium C14-16 Olefin Sulfate. Full ingredients posted below. Any advice appreciated!\n\nAqua (Water)\nDisodium Laureth Sulfosuccinate\nSodium C14-16 Olefin Sulfonate\nCocamidopropyl Betaine\nCocamidopropyl Hydroxysultaine\nDimethicone Copolyol\nCocamide DEA\nGlycol Distearate\nArgania Spinoza (Argan) Kernel Oil\nTheobroma Cacao (Cocoa Butter) Extract\nParfum\nCocos Nucifera (Coconut) Oil\nPersea Gratissima (Avocado) Oil\nAloe Barbadensis (Aloe) Leaf Extract\nPanthenol\nPolyquaternium-11\nCetyl Alcohol\nGuar Hydroxypropyltrimonium Chloride\nPEG-23M\nDMDM Hydantoin\nCI 16035 (Red 40)\nCI 19140 (Yellow 5)\nBenzyl Benzoate\nLimonene\nLinalool\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "OfTheHawk",
        "body": "That's not a sulfate by name, but it is as harsh as any sulfate. So, it's not really CG.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "lsjbdy",
    "title": "Are the ingredients in my curl enhancing cream from Aveda good or bad?",
    "url": "https://www.reddit.com/r/Haircare/comments/lsjbdy/are_the_ingredients_in_my_curl_enhancing_cream/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-02-25T22:54:59+00:00",
    "body": "Water\\\\Aqua\\\\Eau, Cetearyl Alcohol, Cetyl Alcohol, Phenyl Trimethicone, Linum Usitatissimum (Linseed) Seed Extract, Althaea Officinalis (Marshmallow) Root Extract, Aloe Barbadensis Leaf Juice, Behentrimonium Chloride, Hydrolyzed Wheat Protein, Panthenol, Quaternium-95, Polyquaternium-11, Glycerin, Tocopherol, Propanediol, Fragrance (Parfum), Geraniol, Linalool, Amyl Cinnamal, Citronellol, Limonene, Maltodextrin, Phenoxyethanol\n\n&#x200B;\n\nDo these look okay?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "1aglq5f",
    "title": "This curl cream works with no poo?",
    "url": "https://www.reddit.com/r/NoPoo/comments/1aglq5f/this_curl_cream_works_with_no_poo/",
    "score": 1,
    "num_comments": 4,
    "created": "2024-02-01T21:09:28+00:00",
    "body": "Does morrocan oil curl defining cream work with no poo? I really need my cutls back that got away after haircut and I wanna try this cream again. Heres the Ingredients:\n\n\nWater/aqua, cetearyl alcohol, glycol stearate, cetyl alcohol, behentrimonium methosulfate, fragrance, dimethicone, phenyl trimethicone, polyquaternium-11, steareth-2, argania spinosa (argan) kernel oil, hydrolyzed vegetable protein pg-propyl silanetriol, cellulose, hydroxyethylcellulose, pg-hydroxyethylcellulose cocodimonium chloride, glucose, cetearyl glucoside, sorbitan oleate, diphenyl dimethicone, acrylates copolymer, polyquaternium-10, polyquaternium-37, polyquaternium-55, ppg-1 trideceth-6, butylene glycol, caprylyl glycol, propylene glycol dicaprylate/dicaprate, citric acid, disodium edta, c10-40 isoalkylamidopropylethyldimonium ethosulfate, sodium acetate, potassium sorbate, chlorphenesin, phenoxyethanol, alpha-isomethyl ionone, benzyl benzoate, hydroxycitronellal, linalool.\n\n\nThanks in advance!",
    "flair_text": "Troubleshooting (HELP!)",
    "flair_template_id": "427aea9e-bea4-11eb-abf5-0ed12a1a3c6b",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Welcome! If you're new, get started here: [Natural Haircare Quick Start Guide](https://www.reddit.com/r/NoPoo/wiki/index/quickstart) \n\nPlease answer the following questions to help us help you. \n\nDo you have hard water? If you don't know what it is, there's an [article in the wiki](https://www.reddit.com/r/NoPoo/wiki/index/hardwater) that discusses it. \n\nWhat is the porosity of your hair? If you don't know, there's a quiz linked in the sidebar. \n\nHow long have you been doing nopoo? \n\nNo-poo can mean many different things. Describe in detail how you wash your hair. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoPoo) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "shonaich",
        "body": "It has dimethicone (a silicone), so unlikely. All the polyquats are questionable as well.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Fungalacne",
    "post_id": "1iv6lra",
    "title": "Hi! Are there any trigger ingredients in this green tea moisturizer?",
    "url": "https://www.reddit.com/r/Fungalacne/comments/1iv6lra/hi_are_there_any_trigger_ingredients_in_this/",
    "score": 1,
    "num_comments": 4,
    "created": "2025-02-22T00:43:19+00:00",
    "body": "I use this on my face at night and sometimes during the day if I am not wearing makeup. \n\nI am using ketoconazole 2% at night on areas that are itchy and red. And I use the green tea moisturizer around it. \n\nIngredients: water, glycerin, butylene glycol, dimethicone, sodium polyacrylate, camellia sinensis leaf extract, iris florentina root extract, macadamia ternifolia seed oil, epigallocatechin gallate, hydrogenated polydecene, trideceth-6, sodium hyaluronate, squalane, caprylic/capric triglyceride, ethylhexyl palmitate, PPG-2 myristyl ether propionate, alcohol, allantoin, propanediol, C12-15 alkyl lactate, polyquaternium-11, disodium EDTA, ethylparaben, methylparaben, propylparaben, phenoxyethanol, fragrance.",
    "flair_text": "skincare - help",
    "flair_template_id": "525706be-93a0-11ed-86d9-b282e09a3553",
    "comments": [
      {
        "author": "endlessmoonriver",
        "body": "The macadamia ternifolia seed oil isnt safe",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1hrteu3",
    "title": "Hello, are these ingredients in the cantu mousse considered bad?",
    "url": "https://www.reddit.com/r/curlyhair/comments/1hrteu3/hello_are_these_ingredients_in_the_cantu_mousse/",
    "score": 1,
    "num_comments": 6,
    "created": "2025-01-02T13:13:54+00:00",
    "body": "Aqua (Water), PEG-25 Hydrogenated Castor Oil, PEG-7 Glyceryl Cocoate, Cocamidopropyl Betaine, Phenoxyethanol, Benzyl Alcohol, Parfum (Fragrance), Cetrimonium Chloride, Polyquaternium-11, Polyquaternium-55, Sodium Chloride, Panthenol (Vitamin B5), Citric Acid, Butyrospermum Parkii (Shea) Butter, Coumarin, Benzyl Benzoate, Hexyl Cinnamal.\n\n",
    "flair_text": "Discussion",
    "flair_template_id": "8a0f6380-21dd-11e6-9e78-0ead3f7791ed",
    "comments": [
      {
        "author": "RidiculousRex89",
        "body": "They can be for specific hair types. For me, those oils and the alcohol would overload my hair while drying it out. If you have high porosity hair, they should be fine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi there! I'm a bot, and I've been summoned to help.\n\n**If you have not seen our [WIKI](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/) yet:** Please check it out! It's nearly 100 pages full of curated information to help answer all of your curl-related questions. You can use the included Table of Contents (page 2), the side bar, or CTRL-F to search for keywords and help navigate the document.\n\n**Reminder:** [Curl type](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit?tab=t.0#bookmark=kix.e9uk1qyai8oh) is NOT your hair type! Whether you are wavy, curly, or coily - you have texture and you belong here. More than that, your curl type doesn't dictate how you care for your hair. To help your curls thrive, we recommend instead using the wiki link above to learn about your porosity, texture, and density.\n\n**If this is a photo submission:** Please include your detailed routine for your post to remain active! This MUST include the *brands* of ALL products used, *order* of application and *technique* used to apply them, how you dried your hair, and anything else that you might find useful for people to know.\n\n**If you received this message in error:** Please disregard this comment! I probably just picked up on a keyword in your title.\n\nThank you. Wishing you many happy, wonderfully curly hair days!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/curlyhair) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "pregnancy_care",
    "post_id": "1dp6jop",
    "title": "Pregnancy product question",
    "url": "https://www.reddit.com/r/pregnancy_care/comments/1dp6jop/pregnancy_product_question/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-06-26T19:00:56+00:00",
    "body": "Anyone really good at reading product labels to know if they’re pregnancy safe? Having issues with dandruff and psoriasis on my scalp. My sister who is a hairdresser recommended Kerastase Nutritive Hydrating Scalp Serum but I can’t find any info. Here are the ingredients: \n-Aqua / Water / Eau ● Glycerin ● Citric Acid ● Polyquaternium-37 ● Paraffinum Liquidum / Mineral Oil / Huile Minerale ● Amodimethicone ● Phenoxyethanol ● Polysorbate 20 ● Quaternium-87 ● Stearyl Alcohol ● Behentrimonium Chloride ● Panthenol ● Niacinamide ● Ascorbyl Glucoside ● Butylene Glycol ● Propylene Glycol ● Candelilla Cera / Candelilla Wax / Cire De Candelilla ● Ppg-1 Trideceth-6 ● Chlorhexidine Digluconate ● Isopropyl Alcohol ● Trideceth-6 ● Acrylates Copolymer ● Sorbitan Oleate ● Polyquaternium-11 ● Linalool ● Hydrolyzed Wheat Protein ● 2-Oleamido-1,3-Octadecanediol ● Hydroxycitronellal ● Benzyl Salicylate ● Hydrolyzed Corn Protein ● Hydrolyzed Soy Protein ● Cetrimonium Chloride ● Benzyl Alcohol ● Hexyl Cinnamal ● Citronellol ● Iris Florentina Root Extract ● Alpha-Isomethyl Ionone ● Coumarin ● Limonene ● Parfum / Fragrance",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "drbxzg",
    "title": "Can anyone recommend me a CG approved replacement for the John Frieda Frizz Ease Daily Styling Spray?",
    "url": "https://www.reddit.com/r/curlyhair/comments/drbxzg/can_anyone_recommend_me_a_cg_approved_replacement/",
    "score": 1,
    "num_comments": 3,
    "created": "2019-11-04T03:39:06+00:00",
    "body": "Before starting CG, I actually loved how this product made my curls look. I still have 1/2 my bottle and am SO tempted to just keep using it, but I am really trying to stick with CG approved products. So far everything else I have tried weighs down my hair way too much and my curls just don't look as nice. I have thin, low porosity hair, and the John Frieda spray was never too heavy. \n\nThe ingredients are as follows:\n\nAqua, Glycerin, VP/VA Copolymer, Amodimethicone, Dimethicone PEG-8 Meadowfoamate, Olive Oil PEG-7 Esters, Magnesium Sulfate, Phenoxyethanol, VP/Dimethylaminoethylmethacrylate Copolymer, Panthenol, Polysorbate 20, Caprylhydroxamic Acid, Parfum, Polyquaternium-11, Cetrimonium Chloride, Trideceth-12, Methylpropanediol, Crambe Abyssinica, Citric Acid, Laurtrimonium Chloride.\n\nThe Amodimethicone and Dimethicone are not CG approved. If anyone has found a lightweight CG approved spray please please drop it down below!",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Strayblackcat21",
        "body": "This stuff is great. https://www.curls.biz/Lavish-curls-moisturizer.html",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "CurlyHairUK",
    "post_id": "1d82v7t",
    "title": "Why did my hair react like this to Twist by Ouidad Weather Up Gel? ",
    "url": "https://www.reddit.com/r/CurlyHairUK/comments/1d82v7t/why_did_my_hair_react_like_this_to_twist_by/",
    "score": 1,
    "num_comments": 2,
    "created": "2024-06-04T17:28:23+00:00",
    "body": "I bought a bottle of this in TKMAXX. I loved it on wash day and thought it would be a great and way cheaper dupe for the Ouidad Climate Control gel. My hair was so defined and I got an amazing cast. With a hard hold gel I can get some 3A curls. On a bad wash day with a jelly or medium-hold, it's only 2B/barely 2C. So I'm upset it didn't work for me. \n\nThe next day my hair was a dry ratty mess. It was so frizzy, tangled, and knotty. And detangling in the shower with conditioner was just awful, I could barely get the brush through it even with lots of conditioner. I was trying not to rip my hair out. My hair felt terrible. \n\nMy hair is fine and high porosity because it's been balayaged, so the roots are virgin but the lengths are blonde. \n\nI really want this product to work for me!  One thing I will note is that I did not shampoo it out with a clarifying shampoo, I used the Curlsmith purple protein one (can't remember the name). Maybe that was not cleansing enough to get the gel out? I tried using the gel with the Curlsmith protein curl cream, then tried again with the weightless leave in air dry cream. \n\n  \nAny suggestions as to why this didn't work for my hair or how to make it work? I'll post the ingredients below: \n\n  \nAqua/Water/Eau, Polyquaternium-11, Polyquaternium-37, Phenoxyethanol, Hydroxyethylcellulose, PPG-3 Benzyl Ether Myristate, PVP, Isoceteth-20, Polyquaternium-7, Hydroxypropyl Bis-Hydroxyethyldimonium Chloride, Glycerin, Parfum/Fragrance, Argania Spinosa (Argan) Kernel Oil, Panthenol, Disodium EDTA, Citric Acid, Iodopropynyl Butylcarbamate, Hydrolyzed Wheat Protein, Sericin, Guar Hydroxypropyltrimonium Chloride, Cetrimonium Chloride, Behentrimonium Chloride, Benzyl Salicylate, Hydroxycitronellal, Limonene.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ohelloitspip",
        "body": "You might find that your hair is sensitive to protein? The Twist gel has some protein in, and you cleansed with a shampoo that has protein in too. Another alternative could be the amount of humectants in the Twist gel doesn't sit well with your hair - polyquats etc. I get a similar issue with Trepadora Ginseng Glaze and Boucleme where the amount of polyquats is too heavy and it makes my hair feel super gunky!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "1lkpflt",
    "title": "Shiseido Tsubaki Premium Volume Shampoo&Conditioner, Ex Repair Mask making my skin break out.",
    "url": "https://www.reddit.com/r/Haircare/comments/1lkpflt/shiseido_tsubaki_premium_volume/",
    "score": 1,
    "num_comments": 1,
    "created": "2025-06-26T03:05:44+00:00",
    "body": "Switched from my old haircare routine products (a local brand) to the Shiseido Tsubaki Premium Volume set. I suddenly had a breakout of mostly closed comedones and some cystic acne all over my cheeks, forehead, jawline, and some even up to my neck.\n\nIt’s done wonders to my hair - literally life-changing. I suspect it’s the one breaking me out though since it’s the only thing I’ve changed in my routine. So it’s a huge bummer :(\n\nThese are the ingredients:\n\nTsubaki Premium Volume Conditioner: Water, Isopentyldiol, Behentrimonium Chloride, Glycerin, Stearyl Alcohol, Behenyl Alcohol, Dimethicone, Cetanol, Aminopropyl Dimethicone, Steartrimonium Chloride, Polysilicone-13, Squalane, Aspartic Acid, Camellia Seed Oil, Polyquaternium-11, Lactic Acid, sodium dilauroyl glutamate lysine, Taurine, Di(Phytosteryl/​Octyldodecyl) Lauroyl Glutamate, Macadamia Nut Fatty Acid Phytosteryl, Isopropanol, DPG, Isopropyl Myristate, PEG-2 Laurate, Amodimethicone, Sodium Methyltaurate, Salicylic Acid, PPG-2-Deceth-12, Laurtrimonium Chloride, C13-16 Isoparaffin, Disodium EDTA, C10-13 Isoparaffin, Cetrimonium Chloride, Tocopherol, Sodium Benzoate, Phenoxyethanol, Fragrance, Bisethylhexyloxyphenol Methoxyphenyl Triazine, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine\n\nTsubaki Premium Volume Shampoo: Water, Sodium Laureth Sulfate, Cocamidopropyl Betaine, PEG-2 Laurate, Sodium Sulfate, Fragrance, Dipropylene Glycol, Isostearyl Alcohol, Phenoxyethanol, Guar Hydroxypropyltrimonium Chloride, Sodium Benzoate, PEG-60 Hydrogenated Castor Oil, Polyquaternium-10, Salicylic Acid, Disodium EDTA, Citric Acid, Phytosteryl/​Octyldodecyl Lauroyl Glutamate, Camellia Japonica Seed Oil, Sodium Dilauramidoglutamide Lysine, Butylene Glycol, Royal Jelly Extract, Glycine Soja Seed Extract, Tocopherol\n\nTsubaki Premium Ex Repair Mask: Water, Glycerin, Dimethicone, Isopentyldiol, Hydrogenated Rapeseed Alcohol, Behentrimonium Chloride, Stearyl Alcohol, Sorbitol, Aminopropyl Dimethicone, Hydroxyethyl Urea, Hydroxypropyl Arginine Lauryl/​Myristyl Ether HCL, Steartrimonium Chloride, Lactic Acid, Camellia Japonica Seed Oil, Phytosteryl/​Octyldodecyl Lauroyl Glutamate, Sodium Dilauramidoglutamide Lysine, Royal Jelly Extract, Sodium Acetylated Hyaluronate, Hydrolyzed Conchiolin Protein, Isopropanol, Cetyl Alcohol, Octyldodecanol, Ethanol, Citric Acid, Ammonium Lactate, Butylene Glycol, Dipropylene Glycol, Amp, Amodimethicone, PPG-2-Deceth-12, Tocopherol, Phenoxyethanol, Sodium Benzoate, Fragrance, Red 227, Yellow 4\n\nWhat could possibly be breaking me out? Are there any alternative shampoo/conditioner/hair masks that would be good for Asian, low porosity hair?\n\nTIA!",
    "flair_text": "🚩 Advice Needed 🚩",
    "flair_template_id": "fb6ae90e-af6c-11ed-b65a-9ae950aefbfe",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hey u/phain0n_, thanks for your submission to r/Haircare!\n\nFeel free to engage in discussions and explore posts similar to yours.\n\n- [**New Posts**](/r/Haircare/new) - The latest posts in our community.\n- [**Rising Posts**](/r/Haircare/rising) - Posts that are quickly gaining attention.\n- [**Top Posts (Today)**](/r/Haircare/top/?t=day) - The most popular posts of today.\n- [**Top Posts (Week)**](/r/Haircare/top/?t=week) - The most popular posts of the week.\n- [**Top Posts (Month)**](/r/Haircare/top/?t=month) - The most popular posts of the month.\n\nWe hope these links help you connect with more of our community and find what you're looking for! ❤️\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Haircare) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "u6m0gf",
    "title": "[Misc] la roche posay lipikar syndet AP + Anti Irritation Body Wash",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/u6m0gf/misc_la_roche_posay_lipikar_syndet_ap_anti/",
    "score": 0,
    "num_comments": 2,
    "created": "2022-04-18T19:59:20+00:00",
    "body": "This might be a stupid Q, but can I use this body wash as my face cleanser too? Help\n\nPRODUCT INGREDIENTS\nAQUA / WATER • GLYCERIN • SODIUM LAURETH SULFATE\nPEG-200 • HYDROGENATED GLYCERYL PALMATE • COCO-\nBETAINE • POLYSORBATE 20 • CITRIC ACID • PEG-7 .\nGLYCERYL COCOATE • NIACINAMIDE • ACRYLATES\nCOPOLYMER • BUTYROSPERMUM PARKII BUTTER / SHEA\nBUTTER • COCAMIDE MEA • DISODIUM EDTA • GLYCOL\nDISTEARATE • MANNOSE • POLYQUATERNIUM-11 • SODIUM\nBENZOATE • SODIUM CHLORIDE • SODIUM HYDROXIDE •\nVITREOSCILLA FERMENT C223382/1\n\nNo soap, no fragrance, no paraben.",
    "flair_text": "Miscellaneous",
    "flair_template_id": "56f33ba0-35e0-11e5-9715-0ee61c357d3b",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]