[
  {
    "subreddit": "AsianBeauty",
    "post_id": "c6fso3",
    "title": "[Guide] Hwahae Rankings: Top 10 Cleansing Balms/Milks/Creams & Foams (06/27/2019)",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/c6fso3/guide_hwahae_rankings_top_10_cleansing/",
    "score": 176,
    "num_comments": 28,
    "created": "2019-06-28T04:38:11+00:00",
    "body": "Finally downloaded Hwahae. It's a review/ranking app for Koreans for beauty-related things. I'm making some top 10-20s for each category for those of you guys who cannot read Korean or don't use the app. Thanks!\n\nIngredients from various websites, double checked with ones from Hwahae, or typed straight from Hwahae.\n\n&#x200B;\n\nHwaHae bundles cleansing balms, milks, and creams together. The category name is just \"Cleansing lotion/creams\". Balms don't have a separate category.\n\n&#x200B;\n\nCLEANSING MILKS/BALMS/CREAMS\n\n&#x200B;\n\n**1.** [**\\[BIOTURM\\] Cleansing Milk Nr 10**](https://www.bioturm.org/.cms/cleansing-milk/644-2-266) **- 75ml/2.5 oz - 4.34/5 (1,866 Reviews)**\n\nAqua, Helianthus Annuus Hybrid Oil\\*, Lac\\*, Glycerin, Pentylene Glycol\\*\\*, C14-22 Alcohols, Cetearyl Alcohol, Glyceryl Stearate, Coco-Glucoside, Panthenol, C12-20 Alkyl Glucoside, Xanthan Gum, Polyglyceryl-6 Palmitate/Succinate, Tocopherol, Helianthus Annuus Seed Oil, Oryzanol, Lactic Acid, Vanilla Planifolia Fruit Extract, Citrus Aurantium Bergamia Fruit Oil\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/flo02xlkp2731.png?width=352&format=png&auto=webp&s=dc8927b3a917a6267bfa841c2bee1eb4ff40029e\n\n&#x200B;\n\n**2. \\[SIDMOOL\\] Dr. Troub Skin Returning Cleansing Milk (1st Cleanser - use on dry skin) 200ml/6.8 oz - 4.19/5 (1,408 Reviews)**\n\n13,600 KRW/11.75 USD/9.28 GBP\n\nWater, Helianthus Annuus (Sunflower) Seed Oil, Glycerin, Decyl Glucoside, Scutellaria Baicalensis Root Extract, Paeonia Suffruticosa Root Extract, Arachidyl Alcohol, Behenyl Alcohol, Arachidyl Glucoside, Glyceryl Stearate, Cetearyl Alcohol, Diheptyl Succinate, Capryloyl Glycerin/Sebacic Acid Copolymer, Panthenol, Sodium Hyaluronate, Milk Protein Extract, Allantoin, Tocopherol, Citric Acid, Xanthan Gum\n\nhttps://preview.redd.it/owj33zvqp2731.png?width=500&format=png&auto=webp&s=4c4e9cd835016cd1934815f839a8a033d7ee94c6\n\n&#x200B;\n\n**3. \\[BanilaCo\\] Clean It Zero Cleansing Balm (Original) 100ml/3.4 oz - 4.10/5 (573 Reviews)**\n\n18,000 KRW/15.56 USD/12.28 GBP\n\nEthylhexyl Palmitate, Cetyl Ethylhexanoate, PEG-20 Glyceryl Triisostearate, PEG-10 Isostearate, Synthetic Wax, Onsen-Sui, Phenoxyethanol, Butylene Glycol, Lithospermum Erythrorhizon Root Extract, Tocopheryl Acetate, Fragrance, Ethylhexylglycerin, Water, 1,2-Hexanediol, Bambusa Vulgaris Leaf/Stem Extract Aspalathus Linearis Extract, Angelica Archangelica Root Extract, Malpighia Glabra (Acerola) Fruit Extract, Polydiethyleneglycol Adipate/IPDI Copolymer, Acrylates/Ammonium Methacrylate Copolymer, Acrylates/Methoxy PEG-15 Methacrylate Copolymer\n\n&#x200B;\n\nhttps://preview.redd.it/hdotui7tp2731.png?width=521&format=png&auto=webp&s=16a7e0175579de9acc562fd146ba92580772fd56\n\n&#x200B;\n\n**4. \\[Sioris\\] Cleanse Me Softly Milk Cleanser (1st Cleanser - use on dry skin) 120ml/4.1 oz - 4.33/5 (202 Reviews)**\n\n24,000 KRW/20.73 USD/16.36 GBP\n\nCitrus Junos Fruit Water (61%) or \\*Prunus Mume Fruit Water (61%), Macadamia Integrifolia Seed Oil (10%), Water, Lauryl Glucoside, Glycerin, Isoamyl Laurate, Polyglyceryl-10 Oleate, Hydrogenated Vegetable Oil, Cetearyl Alcohol, Glyceryl Oleate, Cetearyl Olivate, Aloe Barbadensis Leaf Extract, Bioflavonoids, Brassica Oleracea Italica (Broccoli) Extract, Propanediol, Allantoin, Tocopherol, Sorbitan Olivate, Glyceryl Stearate Citrate, Xanthan Gum, Citric Acid, Arginine, p-Anisic Acid, Scutellaria Baicalensis Root Extract, Paeonia Suffruticosa Root Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Helianthus Annuus (Sunflower) Seed Oil, Pelargonium Graveolens Flower Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Amyris Balsamifera Bark Oil, Anthemis Nobilis Flower OilÂ (\\* indicates organic farming)\n\n&#x200B;\n\nhttps://preview.redd.it/vgec4mnup2731.png?width=1000&format=png&auto=webp&s=97ecfa7b231c3e6d55c7c44cf232ab2047ac7c31\n\n&#x200B;\n\n&#x200B;\n\n**5. \\[SOONNOC\\] Sensitive Cleansing Milk (1st Cleanser - use on dry skin) 200ml/6.8 oz - 3.68/5 (354 Reviews)**\n\n20,000 KRW/17.27 USD/13.64 GBP\n\nPurified water, Sunflower seed oil, Glycerine, Panthenol, Cetearyl Alcohol, 1-2 Hexanediol, Glyceryl Stearate, Pentylene Glycol, Diheptyl Succinate, Capryloyl Glycerin/Sebacic Acid Copolymer, Sodium Hyaluronate, Allantoin, Centella Asiatica Extract, Portulaca Oleracea Extract, Aloe Barbadensis Leaf Powder, Milk Protein Extract, Vanilla Planifolia Fruit Extract, Arachidyl Alcohol, Behenyl Alcohol, Arachidyl Glucoside, Coco-glucoside, Tocopheroi; Vitamin E, Xanthan Gum, Lavandula Angustifolia (Lavender) Oil, Citric Acid.\n\n&#x200B;\n\nhttps://preview.redd.it/kfkj6y3wp2731.png?width=1200&format=png&auto=webp&s=b44e4d3eca2868e2558f17f0d4f153b4130a6190\n\n&#x200B;\n\n**6. \\[Heimish\\] All Clean Balm 120ml/4.1 oz - 4.16/5 (158 Reviews)**\n\n18,000 KRW/15.55 USD/12.27 GBP\n\nEthylhexyl Palmitate, Cetyl Ethylhexanoate, PEG-20 Glyceryl Triisostearate, Polyethylene, PEG-8 Isostearate, Butyrospermum Parkii (Shea) Butter, Cocos Nucifera (Coconut) Fruit Extract, Citrus Aurantifolia (Lime) Fruit Extract, Freesia Refracta Extract, Iris Versicolor Extract, Jasminum Officinale (Jasmine) Extract, Lilium Tigrinum Extract, Leontopodium Alpinum Extract, Nelumbium Speciosum Flower Extract, Narcissus Pseudo-Narcissus (Daffodil) Flower Extract, Rose Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Pelargonium Graveolens Flower Oil, Amyris Balsamifera Bark Oil, Citrus Paradisi (Grapefruit) Peel Oil, Eucalyptus Globulus Leaf Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Juniperus Mexicana Oil, Boswellia Carterii Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Tocopheryl Acetate, 1, 2-Hexanediol\n\nhttps://preview.redd.it/tpjzxkbzp2731.png?width=480&format=png&auto=webp&s=9995f828e46102c13d849f72e93062b23461d4fb\n\n&#x200B;\n\n**7. \\[PHYTOMER\\] Rosee Visage Toning Cleansing Lotion (1st Cleanser, Rinse-free formula) 250ml/8.5 oz - 3.74/5 (323 Reviews)**\n\n50,000 KRW/43.18 USD/34.08 GBP\n\nAqua (Water)/Eau, Rose Centifolia Flower Water, Propylene Glycol, PEG-7 Glyceryl Cocoate, PEG-40 Hydrogenated Castor Oil, Trideceth09, Chlorphenesin, Methylparaben, Cetrimonium Bromide, Dipotassium EDTA, Triethanolamine, Phenoxyethanol, Parfum (Fragrance), Maris Sal (Sea Salt)/Sel Marin, Butylparaben, Ethylparaben, Isobutylparaben, Propylparaben, Ulex Europaeus (Furze) Extract, Geraniol, Citronellol, CI 17200 (D&C Red No. 33).\n\n&#x200B;\n\nhttps://preview.redd.it/kno61m01q2731.png?width=800&format=png&auto=webp&s=d13521b93fe10cf5b897eadd608c7305fda9cf1f\n\n&#x200B;\n\n**8. \\[DARPHIN\\] Aromatic Cleansing Balm With Rosewood 40ml/1.4 oz - 4.17/5 (199 Reviews)**\n\n65,000 KRW/56.15 USD/44.32 GBP\n\nHydrogenated Polydecene Oleic/Linoleic/Linolenic, Polyglycerides Glycerin Hydroxystearic/Linolenic/Oleic, Polyglycerides Sorbitan Oleate Peg-10 Laurate Peg-100, Stearate Glyceryl Behenate/Eicosadioate Polyglyceryl-10, Behenate/Eicosadioate Decyl Glucoside Polyglyceryl-10, Hydroxystearate/Stearate/Eicosadioate Simmondsia Chinensis, (Jojoba) Seed Oil Aniba Rosaeodora (Rosewood) Wood Oil, Cananga Odorata Flower Oil Salvia Officinalis (Sage) Oil, Sclerocarya Birrea Seed Oil Vanilla Planifolia Fruit Extract, Water\\\\Aqua\\\\Eau Beta-Carotene Cetearyl Alcohol Glyceryl, Stearate Se Behenyl Alcohol Alcohol Tocopherol Dextrin, Palmitate Benzyl Benzoate Linalool Benzyl Salicylate\n\n&#x200B;\n\nhttps://preview.redd.it/cfr0t2b2q2731.png?width=400&format=png&auto=webp&s=044939c9d1d543215c86c19fce449981430e5504\n\n&#x200B;\n\n**9. \\[AROMATICA\\] Orange Cleansing Sherbert 180g/16.9 oz - 4.21/5 (135 Reviews)**\n\n25,000 KRW/21.60 USD/17.05 GBP\n\nHelianthus Annuus Seed Oil(conditioner), Sorbeth-30 Tetraoleate(plant-derived emulsifying agent), Polyethylene(viscosity controlling agent), Prunus Armeniaca Kernel Oil(conditioner), \\*Orbignya oleifera seed oil, \\*\\*Limonene, Cananga Odorata Flower Oil(conditioner), Cedrus Atlantica Wood Oil(soothing agent), Tocopherol, Citrus Aurantium Dulcis (Orange) Peel Oil(conditioner), \\*\\*Benzyl benzoate, \\*\\*Linalool\n\n&#x200B;\n\nhttps://preview.redd.it/nfp5kdh3q2731.png?width=1024&format=png&auto=webp&s=38719773a1ee2984bdf44f98464bcc5130936776\n\n&#x200B;\n\n10. \\[CLINIQUE\\] Take the Day Off Cleansing Balm 135ml/4.6 oz - 4.25/5 (112 Reviews)\n\n42,000 KRW/36.29 USD/28.65 GBP\n\nEthylhexyl Palmitate , Carthamus Tinctorius (Safflower) Seed Oil , Caprylic/Capric Triglyceride , Sorbeth-30 Tetraoleate , Polyethylene , Peg-5 Glyceryl Triisostearate , Water\\\\Aqua\\\\Eau , Tocopherol , Phenoxyethanol\n\n&#x200B;\n\nhttps://preview.redd.it/ua0j0zt4q2731.png?width=270&format=png&auto=webp&s=b431a39b25dc01f1accad4ba1c63398a32412e02\n\n&#x200B;\n\n**11. NUXE Petal Rose Cleansing Milk 3.82/5 (213 Reviews)**\n\n**12. LU'PIUM Vitamin Cleansing Balm 3.96/5 (74 Reviews)**\n\n**13. EVELOM Cleanser (balm) 3.88/5 (159 Reviews)**\n\n**14. Neutrogena Deep Clean Cleansing Lotion 3.62/5 (231 Reviews)**\n\n**15. boh Melting Clear Cleansing Balm 3.83/5 (52 Reviews)**\n\n**16. BIODERMA Sensibio Lait Cleansing Milk 3.86/5 (130 Reviews)**\n\n**17. FARMACY Green Clean Cleansing Balm 4.25/5 (80 Reviews)**\n\n**18. BOBBI BROWN Extra Balm Rinse 3.83/5 (154 Reviews)**\n\n**19. NATURE REPUBLIC Himalaya Salt Cleansing Balm Pink Salt 3.92/5 (77 Reviews)**\n\n**20. INNOLAB California Aesthetic Cleansing Lotion 4.24/5 (41 Reviews)**\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n**CLEANSING FOAMS**\n\n&#x200B;\n\n**1. \\[makeprem\\] Safe Me Relief Moisture Cleansing Foam 150ml/5.1 oz - 4.32/5 (6,697 Reviews)**\n\n16,000 KRW/13.82 USD/10.91 GBP\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate, Sodium Chloride, Polyquaternium-67, Potassium Cocoate, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citric Acid, Disodium EDTA, Salvia Officinalis (Sage) Oil, Sodium Acetate, Rubus Idaeus (Raspberry) Fruit Extract, 1,2-Hexanediol, Sodium Hyaluronate, Ethylhexylglycerin\n\n&#x200B;\n\nhttps://preview.redd.it/a2rns79rq2731.png?width=1024&format=png&auto=webp&s=d5d8501de1ae38e558c9d3d6bf21a466c0f56696\n\n&#x200B;\n\n**2. \\[ROUNDLAB\\] 1025 Dokdo Cleanser 150ml/5.1 oz - 4.32/5 (3,982 Reviews)**\n\n13,000 KRW/11.23 USD/8.86 GBP\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate,Sodium Chloride, Polyquaternium-67, Citric Acid, Fructooligosaccharides, Saccharide Hydrolysate, Disodium EDTA, Pullulan, 1,2 Hexanediol, Allantoin, Panthenol, Sea Water, Sodium Acetate, Butylene Glycol, Anthemis Nobilis Flower Oil, Caprylic/Capric Triglyceride, Beta-Glucan Phosphatidylcholine, Hyaluronic Acid, Ethylhexylglycerin, Ceramide NP, Glycine, Hydrolyzed Hyaluronic Acid, Glutamic Acid, Serine, Sodium Hyaluronate, Lysine, Alanine, Arginine, Threonine, Proline.\n\n&#x200B;\n\nhttps://preview.redd.it/v8tcdxwoq2731.png?width=470&format=png&auto=webp&s=61b8f668387184a1a7a4fbf297297c722575d30f\n\n&#x200B;\n\n**3. \\[SRB\\] Stabilized Rice Bran Enzyme Powder Wash 70g/2.5 oz - 4.35/5 (2,764 Reviews)**\n\n25,000 KRW/21.59 USD/17.05 GBP\n\nZea Mays (Corn) Starch, Sodium Cocoyl Isethionate, Sodium Lauroyl Glutamate, Oryza Sativa (Rice) Bran Extract, Citrus Grandis (Grapefruit) Seed Extract, Pollen Extract, Allantoin, Collagen, Betaine, Aloe Barbadensis Leaf Juice, Sorbitol, Isopropyl Prlmitate, Asocorbyl Palmitate, Titanium Dioxide (CI77891), Citric Acid, Disodium EDTA, Papain.\n\n&#x200B;\n\nhttps://preview.redd.it/gqiu8o89q2731.png?width=1000&format=png&auto=webp&s=a0b7e078987bab521cf564f21d2e5d36d897a3d6\n\n&#x200B;\n\n**4. \\[SCINIC\\] Avocado Cleansing Foam 150ml/5.1 oz - 4.26/5 (1,620 Reviews)**\n\n9,000 KRW/7.77 USD/6.14 GBP\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Coco-Betaine, Sodium Methyl Cocoyl Taurate, Glycerin, Coco-Betaine, Sodium Methyl Cocoyl Taurate, Potassium Cocoyl Glycinate, Sodium Chloride, Potassium Cocoate, Polyquaternium-67, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Butylene Glycol, Citric Acid, Persea Gratissima (Avocado) Fruit Extract, Fructooligosaccharides, Saccharide Hydrolysate, Salvia Officinalis (Sage) Oil, Disodium EDTA, Pullulan, 1,2 Hexanediol, Allantoin, Chamomilla Recutita (Matricaria) Leaf Extract, Panthenol, Sodium Acetate, Aloe Barbadensis Leaf Extract, Sodium Hyaluronate, Ethylhexylglycerin.\n\nhttps://preview.redd.it/pdsrf7gaq2731.png?width=280&format=png&auto=webp&s=5389d48e02fded2b8534007ef28c5b4e88723be3\n\n&#x200B;\n\n&#x200B;\n\n**5. \\[MANYO FACTORY (Witch Factory)\\] Deep Pore Cleansing Soda Foam 150ml/5.1 oz - 4.07/5 (3,238 Reviews)**\n\n20,000 KRW/17.28 USD/13.63 GBP\n\nCamellia Sinensis Leaf Water, Myristic Acid, Glycerin, Sodium Hyaluronate, Lauric Acid, Caprylic/Capric Triglyceride, Aloe Barbadensis Leaf Water, Stearic Acid, Potassium Hydroxide, Diatomaceous Earth, Kaolin, Isoamyl Laurate, Sodium Bicarbonate, Zea Mays (Corn) Starch, Sodium PCA, Glycol Distearate, Beeswax, Glyceryl Stearate, Saponaria Officinalis Leaf Extract, Decyl Glucoside, Olea Europaea (Olive) Fruit Oil, Camellia Sinensis Leaf Powder, Morus Alba Root Extract, Chlorella Vulgaris Powder, Red Ginseng Extract, Carica Papaya (Papaya) Fruit Extract, Phaseolus Radiatus Seed Powder, Anthemis Nobilis Flower Powder, Lactuca Scariola Sativa (Lettuce) Leaf Extract, Phaseolus Radiatus Seed Extract, Citrus Limon (Lemon) Fruit Water, Glycyrrhiza Glabra (Licorice) Root Extract, Portulaca Oleracea Extract, Zanthoxylum Piperitum Fruit Extract, Pulsatilla Koreana Extract, Usnea Barbata (Lichen) Extract, Dioscorea Opposita (Wild Yam) Root Extract, Oryza Sativa (Rice) Bran Extract, Lavandula Angustifolia (Lavender) Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Camellia Sinensis Leaf Extract, Citrus Aurantium Dulcis (Orange) Oil.\n\n&#x200B;\n\nhttps://preview.redd.it/g0bomrjcq2731.png?width=470&format=png&auto=webp&s=21b742cdfc885568292766ffbb68124a2976b02a\n\n&#x200B;\n\n&#x200B;\n\n**6. \\[PAULA'S CHOICE\\] Skin Balancing Cleanser 237ml/8 oz - 4.16/5 (2,533 Reviews)**\n\n26,000 KRW/22.46 USD/17.73 GBP\n\nWater (Aqua), Sodium Cocoyl Isethionate (cleansing), Sodium Lauroamphoacetate (cleansing), Stearic Acid (texture-enhancing), Glycerin (hydration/skin replenishing), Glycol Distearate (texture-enhancing), Helianthus Annuus Seed Oil (sunflower oil/non-fragrant oil/antioxidant), Acrylates Copolymer (texture-enhancing), Cetearyl Alcohol (texture-enhancing), Aloe Barbadensis Leaf Extract (hydration/skin-soothing), Sodium Chloride (stabilizer), Sodium Hydroxide (pH balancing), Xanthan Gum (texture-enhancing), Caprylyl Glycol (preservative), Hexylene Glycol (preservative), Disodium EDTA (stabilizer), Phenoxyethanol (preservative).\n\n&#x200B;\n\nhttps://preview.redd.it/6uv816xsq2731.png?width=355&format=png&auto=webp&s=220a922e9d8a42f97e347daee1ca938658a2b7c5\n\n&#x200B;\n\n&#x200B;\n\n**7. \\[Innisfree\\] Superfood Blueberry Rebalancing 5.5 Cleanser 100ml/3.4 oz - 3.94/5 (5,584 Reviews)**\n\n5,000 KRW/4.32 USD/3.41 GBP\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Diglycerin, Diethylhexyl Sodium Sulfosuccinate, Hydroxypropyl Starch Phosphate, Vaccinium Angustifolium (Blueberry) Fruit Extract, Allantoin, Butylene Glycol, Citrus Aurantium Dulcis(Orange) Peel Oil, Lavandula Angustifolia (Lavender) Oil, Raspberry Ketone, Sodium Methyl Cocoyl Taurate, Benzyl Glycol, Potassium Cocoyl Glycinate, Potassium Cocoate, Citric Acid, Sodium Chloride, EthylhexylglycerinDisodium Edta, 1,2-Hexanediol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Polyquaternium-67, Sodium Acetate\n\n&#x200B;\n\nhttps://preview.redd.it/iknvibnuq2731.png?width=1000&format=png&auto=webp&s=9ec9bb37ef61021ddbdcea8693cd7c10928a90b8\n\n&#x200B;\n\n**8. \\[ETUDE HOUSE\\] Soon Jung pH 6.5 Whip Cleanser 150ml/5.1 oz - 4.12/5 (1,225 Reviews)**\n\n11,000 KRW/9.50 USD/7.50 GBP\n\nWater, Glycerin, Sorbitol, Propanediol, Lauryl Glucoside, Disodium Cocoyl Glutamate,Panthenol, Madecassoside, Camellia Sinensis Leaf Extract, Butylene Glycol, Citric Acid, Glyceryl Caprylate, Ethylhexylglycerin\n\n*Fun fact: \"Soon Jung\" means innocence =)*\n\n&#x200B;\n\nhttps://preview.redd.it/82b398awq2731.png?width=550&format=png&auto=webp&s=2b6997d61ba8ebf99ece70140039cea301a4f1c8\n\n&#x200B;\n\n&#x200B;\n\n**9. \\[ROUNDAROUND\\] Green Tea Pure Cleansing Foam 150ml/5.1 oz - 3.94/5 (1,623 Reviews)**\n\n12,000 KRW/10.37 USD/8.18 GBP\n\nWater, camellia sinensis water, potassium laureth phosphate, glycerin, lauryl hydroxysultaine, acrylates/C10-30 alkyl acrylate crosspolymer, pelargonium graveolens flower oil, citrus nobilis (mandarin orange) peel oil, rose flower oil, quillaja saponaria bark extract, pyrus malus (apple) fruit extract, agave tequilana leaf extract, C12-14 pareth-12, potassium cocoyl glutamate, coco-glucoside, citric acid, methylrpopanediol, sodium chloride, caprylyl glycol, tromethamine, sodium cocoyl glutamate, sodium cocoyl isethionate, 1,2 hexanediol, pentylene glycol, butylene glycol, octanediol, ethylhexylglycerin, disodium EDTA.\n\n*(Sorry I got too lazy to capitalize everything at this point lmao.)*\n\n&#x200B;\n\nhttps://preview.redd.it/nzy9r69xq2731.png?width=355&format=png&auto=webp&s=3f47ab0595ef240a5e94a879c7d9eaf8ca700b28\n\n&#x200B;\n\n**10. \\[SIDMOOL\\] Kakadu Amino Cleanser 500ml/16.9 oz - 4.01/5 (1,466 Reviews)**\n\n19,800 KRW/17.11 USD/13.51 GBP\n\n[Potassium Cocoyl Glycinate](https://incidecoder.com/ingredients/potassium-cocoyl-glycinate), [Water](https://incidecoder.com/ingredients/water), [Glycerin](https://incidecoder.com/ingredients/glycerin), [Panthenol](https://incidecoder.com/ingredients/panthenol), [Xanthan Gum](https://incidecoder.com/ingredients/xanthan-gum), [Terminalia Ferdinandiana Fruit Extract](https://incidecoder.com/ingredients/terminalia-ferdinandiana-fruit-extract), [Hydrolyzed Collagen](https://incidecoder.com/ingredients/hydrolyzed-collagen), [Citric Acid](https://incidecoder.com/ingredients/citric-acid), [Arginine](https://incidecoder.com/ingredients/arginine), [Olibanum](https://incidecoder.com/ingredients/olibanum)\n\n&#x200B;\n\nhttps://preview.redd.it/rx35587yq2731.png?width=355&format=png&auto=webp&s=bdc564cc385078409167497357b2810d184343d2\n\n&#x200B;\n\n**11. Papa Recipe Eggplant Clearing 5.5 Cleansing Foam 4.19/5 (599 Reviews)**\n\n**12. Mentholatum Acnes Derma Relief Moisture Foam Cleanser 4.11/5 (695 Reviews) (This is a Japanese brand.)**\n\n**13. Innisfree Sea Salt Perfect Cleanser 3.81/5 (1,397 Reviews)**\n\n**14. La Roche-Posay Toleriane Purifying Foaming Cream 4.02/5 (577 Reviews)**\n\n**15. LUSH Angels on Bare Skin 4.07/5 (798 Reviews)**\n\n**16. SENKA Perfect Whip Special Wash 3.41/5 (4,468 Reviews)**\n\n**17. Innisfree Jeju Volcanic Pore Cleansing Foam 3.5/5 (3,132 Reviews)**\n\n**18. SIDMOOL Awsungcho Ampoule Soap 3.91/5 (381 Reviews)**\n\n**19. RealBarrier Control T Cleansing Foam 3.71/5 (536 Reviews)**\n\n**20. Dr. G Red Blemish Moisture Cleansing Foam 3.71/5 (477 Reviews)**\n\n\\-------------------------------------------------------------------------------------\n\n&#x200B;\n\nThis weekend I'll cover Essence/Ampoule/Serum and Cream sections. There are also Cleansing Waters, Lip/Eye Remover, Skin/Toner section, Lotion/Emulsion, Gel, Mist, and Face Oil sections, but I'm not sure if I'm going to cover all of them. Let me know if you do want a section covered. I'll try to cover them.\n\n&#x200B;\n\nIn the future I want to cover:\n\n\\- Top 20 sun lotions/creams (maybe also Sun sticks section and Sun Cushions)\n\n\\- Sleeping packs!\n\n\\- BB/CC Creams (separate from Foundations, Cushions, Tone Up Creams)\n\n\\- Makeup Base (there is a separate section for primers)\n\n\\- Shading (contouring products)\n\n\\- Eyebrow makeup (maybe also Eyeliners)\n\n\\- Lip tints\n\n\\- Lip balms/Lip Care\n\n&#x200B;\n\n[Top 10-20 Cleansing Oils & Gels](https://www.reddit.com/r/AsianBeauty/comments/c6dqq7/guide_hwahae_rankings_top_10_cleansing_oils_gels/)\n\n[Top 30 Essences/Ampoules/Serums PART ONE](https://www.reddit.com/r/AsianBeauty/comments/c6v3bv/guide_hwahae_rankings_top_30_essenceampouleserum/)\n\n[Top 30 Essences/Ampoules/Serums PART TWO](https://www.reddit.com/r/AsianBeauty/comments/c6v4lk/guide_hwahae_rankings_top_30_essenceampouleserum/)\n\nTop 40 Skins/Toners PART ONE:\n\n[https://www.reddit.com/r/AsianBeauty/comments/c76i6x/guide\\_hwahae\\_rankings\\_top\\_40\\_skinstoners\\_06282019/](https://www.reddit.com/r/AsianBeauty/comments/c76i6x/guide_hwahae_rankings_top_40_skinstoners_06282019/)\n\nTop 40 Skins/Toners PART TWO:\n\n[https://www.reddit.com/r/AsianBeauty/comments/c77ku5/guide\\_hwahae\\_rankings\\_top\\_40\\_skinstoners\\_06292019/](https://www.reddit.com/r/AsianBeauty/comments/c77ku5/guide_hwahae_rankings_top_40_skinstoners_06292019/)\n\nTop 30 Creams & Emulsions/Lotions PART ONE:\n\n[https://www.reddit.com/r/AsianBeauty/comments/c7ah7w/guide\\_hwahae\\_rankings\\_top\\_30\\_creams/](https://www.reddit.com/r/AsianBeauty/comments/c7ah7w/guide_hwahae_rankings_top_30_creams/)",
    "flair_text": "Guide",
    "flair_template_id": "a77b0496-cd68-11e7-8a57-0eba7e80ccec",
    "comments": [
      {
        "author": "royalsincognito",
        "body": "foolish knee air voracious act fact point resolute deranged work\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "jaderabbit22",
        "body": "Thanks for the effort! Very useful",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "MajorVI",
        "body": "Thank you for these two posts, lots of interesting products I've never come across before. Looking forward to the next ones! \n\nAlso, anyone tried the Dr Troub skin returning cleansing milk?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "elusnuga",
        "body": "I wish Sidmool products were more accessible :( The kakadu amino cleanser and the Dr. Troub cleansing milk sound great...\n\nI've had my eye on Aromatica's cleansing balm for a while. Has anyone used it before?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "stardewspirit",
        "body": "Thank you for this!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "swimminggaladriel",
        "body": "This is so handy! Thank you so much, I'm excited for the upcoming categories!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "mvynbeauty",
        "body": "This is amazing thanks for sharing!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Bev_May",
        "body": "Fantastic!  I read your earlier post on Top 10-20 Cleansing Oils & Gels also. \n\nI'm looking to introduce a new cleanser to my daily routine and was playing with the idea of an oil cleanser.  So much choice, but this should make it easier.  Ideally, I'm looking for something without propylene glycol. butylene glycol, essential oils or added fragrance.  And no parabens - was shocked to see Phytomer still incorporating these!  The ATrue Black Tea Cleanser in your previous post looked interesting; simple list of ingredients, although ironically green tea is the first ingredient in the list, rather than black tea!  Aromatica Orange Cleansing Sherbet looks interesting, as does Clinique - so simple but effective.  Have you any idea what Kakadu (reference Sidmool) means??\n\nWhich do you use incidentally?  You are probably more geared up than most to recommend?  Thanks again.  Bev",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "slipsaway",
        "body": "Thanks so much for taking the time to do this. Nice to see some of my faves on the list and some new ones to try.  That orange sherbert looks divine. I want to try it.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "feathereddinos",
        "body": "Papa Recipe Eggplant Cleansing Foam got cut off juuuust at the end there (no pic), but it also looks to be a good, gentle cleanser. Itâ€™s pH balanced, has thick creamy texture with gentler surfectants and bubbles well. \n\nI want to try it and the Dokdo foam.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Gulistan_",
        "body": "Thank you for all your efforts. I really love these posts. So surprised to see a German cleanser as #1 in Korea.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "mellouise",
        "body": "Thanks for all of your posts! Iâ€™d love it if you could cover lip/eye removers- theyâ€™re not mentioned that often, and lâ€™d like to start using AB ones.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "bericoco",
        "body": "Thank you! found lots of new things to investigate :-)\n\nI'd love to see the sleeping packs too.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "YT-Rei",
        "body": "Thank you - that looks interesting - but how exactly do they rank the products? Are they filtering the reviews, and if yes, what are the criteria? I've heard about Hwahae many times, but I'm not sure how it works (yes, I'm one of those folks who can't read Korean), is it a yearly report? or something else?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ran_chan17",
        "body": "Thank you (again) <3  \nGlad to see some of the products I use here lol",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 15,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "13r9qy4",
    "title": "[Review] Round Lab vs Bring Green Mugwort Cleansers",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/13r9qy4/review_round_lab_vs_bring_green_mugwort_cleansers/",
    "score": 151,
    "num_comments": 13,
    "created": "2023-05-25T06:16:11+00:00",
    "body": "I have been a long time devoted user of the Round Lab Mugwort Calming Cleanser, and would consider it my HG. I can't even remember how many tubes of it I've gone through. Recently I've noticed that it's started going up in price (last time I bought it I had to pay $26 CAD), and it's become increasingly hard to justify that price for a cleanser. So when I saw this Bring Green Artemisia pH Balancing Foam at my local kbeauty shop for $13.99 CAD I had to try it!\n\n\nSkin type: combination, dehydrated, acne and clog prone\n\n\nRound Lab Ingredients:\n\nWater, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, Butylene Glycol, Coco-Betaine, Betaine, Hydroxypropyl Starch Phosphate, Artemisia Vulgaris Extract, Aspartic Acid, Citric Acid, Sodium Chloride, Caprylyl Glycol, Polyquaternium-67, Artemisia Princeps Leaf Extract, Melia Azadirachta Leaf Extract, Malt Extract, 1,2- Hexanediol, Melia Azadirachta Flower Extract, Camellia Sinensis Leaf Extract, Salvia Officinalis (Sage) Oil, Ethylhexylglycerin, Allantoin, Madecassoside, Panthenol, Asiaticoside, Asiatic Acid\n\n\nBring Green Ingredients:\n\nGlycerin, Purified Water, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, 1,2-Hexanediol, Lauryl Betaine, Hydroxypropyl Starch Phosphate, Artemisia Capillaris Extract (8,000ppm), Melia Azadirachta Leaf Extract, Malt Extract, Melia Azadirachta Flower Extract, Coccinia Indica Fruit Extract, Solanum Melongena (Eggplant) Fruit Extract, Aloe Barbadensis Flower Extract, Ocimum Sanctum Leaf Extract, Curcuma Longa (Turmeric) Root Extract, Corallina Officinalis Extract, Ulmus Davidiana Root Extract, Centella Asiatica Extract, Portulaca Oleracea Extract, Houttuynia Cordata Extract, Amaranthus Caudatus Seed Extract, Lavender Oil, Citrus Nobilis (Mandarin Orange) Peel Oil, Rosemary Leaf Oil, Juniperus Virginiana Oil, Orange Peel Oil, Polyquaternium-39, Artemisia Princeps Leaf Powder (800ppm), Butylene Glycol, Propanediol, Panthenol, Madecassoside, Ethylhexylglycerin, Linalool, Limonene \n\n\nBoth cleansers claim to be pH balanced at 5.5 and gentle on the skin. That I will say is true, I never had irritation using the Round Lab, and in the 4 times I've used the Bring Green I didn't either. They both leave my skin feeing properly cleansed without being stripped or dry. \n\n\nTexture wise I prefer the Round Lab. It has a slightly thicker texture which foams up to a nice rich foam. However at times it can take a little extra effort to rinse away. The Bring Green does foam up just as well, but it isn't as rich of a foam. It contains very tiny visible bits of mugwort, but they're so small you don't feel them. It also rinses away much cleaner and faster. \n\n\nIn terms of scent the Round Lab doesn't really have one, it smells very faintly of mugwort. The Bring Green however has a light citrus scent due to the essential oils, but it isn't overpowering and doesn't linger once rinsed. \n\n\nOverall I think I might end up switching to the Bring Green. Although the user experience might not be as pleasant as when using the Round Lab, for almost half the price it's definitely worth keeping in my routine.",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "PeptideWitch",
        "body": "Hello fellow Canadian! Where did you get this cleanser from? Iâ€™m also struggling with raising prices for the most basic skincare.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "amneiu",
        "body": "Bookmarking this! Ty for the reviews",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "iamtyan",
        "body": "Love the bring green cleanser! It leave my skin feeling clean and glowy without being stripped. I have oily combi skin btw. & its soo affordable.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "l3yres",
    "title": "Roundlab Dokdo Cleanser Review",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/l3yres/roundlab_dokdo_cleanser_review/",
    "score": 86,
    "num_comments": 46,
    "created": "2021-01-24T12:43:24+00:00",
    "body": "A quick review right before I shower HAHAHA.\n\nInfo:\nI have combination skin leaning towards oily. My skin is acne and clog prone and I do have some KP on my bottom cheeks/jaws. My skin is also a sensitive and moody chicken if anyoneâ€™s wondering so Iâ€™m super picky about the products I use. \n\n\nRoutine:\n\nAM: Splash with water -> Vanicream daily facial moisturiser -> some sunscreen sample lol\nPM: Dokdo cleanser -> vanicream daily facial moisturiser\n\n\nIngredients:\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate, Sodium Chloride, Polyquaternium-67, Potassium Cocoate, Citric Acid, Fructooligosaccharides, Saccharide Hydrolysate, Disodium EDTA, Pullulan, 1,2-Hexanediol, Allantoin, Panthenol, Sea Water, Sodium Acetate, Butylene Glycol, Anthemis Nobilis Flower Oil, Caprylic/â€‹Capric Triglycerides, Beta-Glucan, Phosphatidylcholine, Hyaluronic Acid, Ethylhexylglycerin, Ceramide NP, Glycine, Hydrolyzed Hyaluronic Acid, Glutamic Acid, Serine, Sodium Hyaluronate, Lysine, Alanine, Arginine, Threonine, Proline\n\n\nThis cleanser had a very creamy and sticky texture. It foams a little when you rub your hands together with water. As the whole line is targeted towards sensitive skin, it is a very gentle cleanser.\n\n\nThoughts:\n\nOkay I actually didnâ€™t really expect much from this product when I first used it. It was a huge impulse buy and I actually regretted buying it. Prior to using this cleanser, I was using the Rovectin Conditioning Cleanser and letâ€™s just say that it was one big roller coaster haha. I switched over to this cleanser in hopes to save my skin and also because it was just collecting dust on my desk lol.\n\nThe texture is sooooo fun to play with. Even though itâ€™s creamy, itâ€™s also rather sticky. Itâ€™s nothing like the other cleansers Iâ€™ve tried before. It doesnâ€™t foam up too much so my skin doesnâ€™t feel stripped.\n\nWhile it doesnâ€™t have any added fragrances, it does have a smell. Personally to me it smells like someone threw up in it, but some people say it smells herbal like or plastic like or mineral like. Yeah lots of different smells LOL. I thought I had bought a fake so I went and bought another cleanser (travel version) from the official store and it smells the same so rip ;-;. \n\nItâ€™s a no nonsense kind of cleanser, does what it needs to do and does it well. It doesnâ€™t remove makeup that well because itâ€™s quite gentle, so you might need a first cleanser for that. For sunscreen it depends, but Iâ€™ve heard some people just cleanse their face twice with the cleanser just to be safe. \n\nCompared to the previous cleanser I used, this one was so nice to use. It made me feel so excited to shower LOL. I didnâ€™t get any reactions from this and in fact, some of my CCs and pimples actually went down when I started using this. \n\nIs this HG? I guess it is. Iâ€™m genuinely hesitant to call something a HG because Iâ€™m scared that my skin will go no u on me. But I guess at this moment? It is close to being one. I bought mine off of SHOPEE and it cost about SGD$18-$20+ with discount. I think the original price is about $30? I might actually repurchase this once Iâ€™m done HAHAHA.  9/10\n\nRoundlab is also well known for their Dokdo toner and Iâ€™m really tempted to try it LOL. But I have my pyunkangyul essence toner coming in soon for me to try so ummmm one day one day. My friend actually bought it and said that itâ€™s such a good toner.",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "yaois",
        "body": "I like this cleanser too! It smells like day old wet towel to me ðŸ˜‚",
        "score": 23,
        "is_top_level": true
      },
      {
        "author": "eggless_",
        "body": "Oh wow, coincidently Iâ€™m currently using the Rovectin cleanser and have the Dokdo cleanser as my backup after I finish the Rovectin one, and we have the same skin type! Pretty keen to start using the dokdo cleanser after reading your review on it :D",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "nelonpan",
        "body": "The texture is the whackiest out of all cream foam cleanser I've tried. It kinda reminds me of the perfect whip, sticky and velvety foam but the dokdo has good ph unlike the senka whip lol. This is that cleanser that weirdly moisturizes your skin?? It feels nice but it seems to be giving me some clogs, im thinking if its because it doesnt cleanse enough or if its leaving a moisturizing film behind(i break out from certain forms of hyaluronic acid and this cleanser seems to have various forms of it). If it wasnt breaking me out, it would have been an hg. such a gentle velvety formula :(",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "pocelyn",
        "body": "yes the dokdo toner is really good! its super lightweight and mildy exfoliates. it would fit well for oilier skin types in sg weather.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "lifeofmatcha",
        "body": "Similar skin type and I love both the Rovectin and Round Lab Dokdo cleansers. The Dokdo Cleanser is so insanely creamy, I love the experience of using it more than anything. You can often get this for $9 USD on Jolse which is about $12 SGD",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "itsjustpham",
        "body": "Even though this is old, thanks for the review. I am currently using the Rovectin and trying to see if I should switch to the Round Lab or not",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "violet_m00n",
        "body": "Has anyone used the roundlab Dokdo oil cleanser and the Dokdo foam cleanser together? Like I feel like they are designed to Â work together best but I canâ€™t find any reviews on that that arenâ€™t sponsored.,.I have type one rosacea/ combination skin and which is in good condition no flare ups just dry from the winter and I do have large pores Â ..Iâ€™m so scared to try double cleansing but seeing review of it cleaning out pores so well I wanna try ..but Iâ€™m hesitant ..I came across this brand seem gentle and love the ingredients and was to try should iiii idkkk",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Successful_Owl_8932",
        "body": "I saw this as top selling on Olive Young website and I'm tempted to try... But I can't decide between this or the COSRX low PH morning cleanser. Anyone can comment or have tried both? Thanks!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "mmaaaggg",
        "body": "Thanks for the review! How was your skin reacting to the Rovectin cleanser? I have both in my closet to try, so I'm curious!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "daertistic_blabla",
        "body": "chiming in after three years and itâ€™s such a good cleanser for my dry skin but man it stinks like rancid oil",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "G-en",
        "body": "Someone suggest similar cleansers like Round Lab Dokdo Cleanser.\n\nI've used it for months and thus want to change the brand for some change to my skin. Suggest something which is creamy, foamy and ectracts all the oil from my skin. (I have an oily skin and RL Dokdo works wonders)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "iiskraa_",
        "body": "is this cleanser good for oily and sensitive skin that has active acne on it? im currently using la roche posay one and its not doing much",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AorticRaven380",
        "body": "Our skin types are almost exactly the same so I gotta ask smth so I started using the dokdo cleanser it's been 2 weeks and my skin got worse I think it's purging but I haven't experienced this kind of thing earlier so I can't be so sure if it's purging or breakout did you have a similar experience in the beginning or is it abnormal to have symptoms like that",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Soft_Feedback3310",
        "body": "Hey OP, 4 years later are you still using the dokdo cleanser??? LOL",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 14,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "1hoqr19",
    "title": "First impression review: Round Lab 1025 Dokko Cleanser",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/1hoqr19/first_impression_review_round_lab_1025_dokko/",
    "score": 83,
    "num_comments": 39,
    "created": "2024-12-29T07:15:54+00:00",
    "body": "Ive been searching for a replacement for a good cleanser for my dry-dehydrated-sensitive skin. I thought I found my HG cleanser this year with the B Lab Matcha Cleanser which left my skin clean but soft. I fell in love just from trying a free sample from Stylevana. Unfortunately B Lab changed the formula and packaging for this cleanser. I bought the new version and hated it. It was dry and stripping like the Senka whip cleanser. \n\nSo I went through some suggestions from this sub and made a list. I was browsing a local shop today and saw the Round Lab Dokko cleanser for $11 for 150 ml and bought it. Beauty of Josean Green Plum cleanser was also on my to try list but it was $12 for 100 ml so I went with the Round Lab just cuz of the better price per ml.\n\nOverall rating: 4/5\n\nScent: mild soapy scent. Nothing offensive. Barely noticeable. \n\nI latered a dollop in my hands with water then washed my face and rinsed with water. It doesnt really foam up. It cleaned off my skincare, Etude eyebrow pencil, Lilybyred blush, Romand water tint, and Stila eyeliner well.\n\nMy skin didnt fee taut/tight. The cleanser didnt leave a weird filmy layer either. It was just my skin but clean. Its light but I wouldnâ€™t call it hydrating â€” probably because of my dry skin. Best of all, no irritation. \n\n It didnt feel as soft as the og B Lab matcha cleanser though. I might explore other options after I use up this Round Lab one, but this is going to be my fallback cleanser from now on as long as the formula didnt change. \n\nIngredients: Water, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate, Sodium Chloride, Polyquaternium-67, Potassium Cocoate, Citric Acid, Fructooligosaccharides, Saccharide Hydrolysate, Disodium EDTA, Pullulan, 1,2-Hexanediol, Allantoin, Panthenol, Sea Water, Sodium Acetate, Butylene Glycol, Anthemis Nobilis Flower Oil, Caprylic/â€‹Capric Triglycerides, Beta-Glucan, Phosphatidylcholine, Hyaluronic Acid, Ethylhexylglycerin, Ceramide NP, Glycine, Hydrolyzed Hyaluronic Acid, Glutamic Acid, Serine, Sodium Hyaluronate, Lysine, Alanine, Arginine, Threonine, Proline",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "chau-a-not-chau-bcdf",
        "body": "Ranking cleansers Ive tried:\n\n1. BLab matcha cleanser - OG version\n\n2. Hazeline strawberry cleanser (random cleanser in Vietnam that I fell in love with and cant find in America)\n\n3. Round Lab 1025 Dokko cleanser\n\n4. The Face Shop rice cleanser.\n\n5. Neutral: too mild to fully clean. Soon Jung foam cleanser (old version). Hanyul gel cleanser. Missha Ultra Hyaluron cleanser. Laneige bright dew foam cleanser. Sulwhasoo gentle cleanser.\n\n6. Slight stripping and drying: Innisfree bija cleanser, Kracie Naive peach/yuzu. Cosrx good morning gel cleaner -- also stinky, Innisfree green tea cleanser.\n\n7. Super stripping and harsh: Senka whip cleanser in blue tube, Sungboon Editor green tomato cleanser, B Lab mathca cleanser - new version, Kikumasamune foam cleanser. Cosrx salicylic cleanser.",
        "score": 25,
        "is_top_level": true
      },
      {
        "author": "Nabi_05",
        "body": "I absolutely love this cleanser Iâ€™ve being using for a year and it does wonders on my skin I donâ€™t feel it tight and I havenâ€™t had any breakouts from it.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "water_lily",
        "body": "I am one of the odd one out because I did not really like this cleanser. Combo skin in desert dry climate and this didnâ€™t feel hydrating for me. \n\nI found it very foamy, like a velvety foam, which I enjoyed, but less than a minute after rinsing off, my face was tightening up. \n\nI did find it has good cleansing power, more than I need since I double cleanse and find my oil cleanser doesnâ€™t leave much residue on my skin.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "ditzyan",
        "body": "I actually enjoy this cleanser, it helped smoothen my skin so much. I was using the BOJ Green Plum cleanser before this and I find this better for me. \n(I have oily acne prone (fungal and hormonal) skin)",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "snuffles125",
        "body": "I like how this cleanser feels on my face but it made my eyes feel really dry and sensitive, even if it just was in the slight vicinity of them. Not so much that it was a huge issue but enough for it to be annoying",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Lazaraleen",
        "body": "This is my go to cleanser and I absolutely love it. It cleanser thoroughly and doesn't strip the skin.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "love-at-third-sight",
        "body": "Thanks for the review! I think you have a super similar skintype to me... I also enjoyed the former blab cleanser in 2022 (I think I bought it at the end of 2021), so sad it's reformulated to something worse ðŸ˜”\n\nNow I wanna try the hazeline ðŸ˜‚ too bad I'm not living in Asia anymore ðŸ¤£",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutechreBitch",
        "body": "I really love this foaming cleanser. Really effective with a pleasant soapy smell thatâ€™s not too overpowering. \n\nFor me it takes like a finger of it to actually form the type of foam I like to lather in my face, which may be a bit much compared to say Senka Perfect Whip (uuugh) but even with that much product Iâ€™ve never had a cleanser as gentle as this one. My skin  is combination to oily.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "rainsong2023",
        "body": "Just washed my face with Round Lab Dokdo 1025 cleanser. Not drying at all. Face is clean without anything deposited on it. My face cleanser is not my moisturizer.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Naive-Animal4394",
        "body": "NOOOOoooooo\n\n(I mean this nicely, as I've had multiple instances of disgusting the negatives of this with other members over the last few days aha)\n\nGlad it works for you!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ImBunBoHue",
        "body": "Mine smells like puke so I stopped using it :( It might have given me pimples too, but I am not sure since I started multiple new products at the same time and have narrowed the culprit down to either this cleanser or the Kaine chaga serum",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "definitelynapping",
        "body": "Does it have a scent at all?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "XH0RK",
        "body": "i hated it so much! it destroyed my skin barrier within a week of using it (and to this day i domt know what would be the potential cause of this reaction) I gave it away to my boyfriend",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "zcakemasterz",
        "body": "Next time try Torriden dive in cleansing foam. I think you'll like it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "jjjjjjjjmmmm",
        "body": "i love this cleanser but you def need to moisturize after so i only use it on days when i put on makeup",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "VividSherbert2228",
        "body": "Iâ€™ve been using this cleanser for about 2 months now, and itâ€™s pretty nice! My only problem is that it stings when it gets in my eyes, which my BOJ green plum cleanser didnâ€™t do. I donâ€™t find it to be stripping whatsoever and it foams really nicely for me. I have really dry skin and live in CA so the weathers all over the place lol",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 16,
      "top_level": 16,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "17aqkq5",
    "title": "PSA - Etude House SoonJung 10-Free Moist Emulsion Reformulation",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/17aqkq5/psa_etude_house_soonjung_10free_moist_emulsion/",
    "score": 51,
    "num_comments": 38,
    "created": "2023-10-18T13:16:46+00:00",
    "body": "&#x200B;\n\n[RIP pump bottle. ðŸ˜ž ](https://preview.redd.it/ng64s0dwpyub1.jpg?width=1000&format=pjpg&auto=webp&s=77ec6d0308705eae83ea283a5ad21c4e26a6070a)\n\nThis is my HG moisturizer and I wanted to warn everyone.\n\n**Original INCI List:** Water, Glycerin, Propanediol, Pentaerythrityl Tetraethylhexanoate, Squalane, Panthenol, Cetearyl Alcohol, Bis-Diglyceryl Polyacyladipate-2, Ammonium Acryloyldimethyltaurate / VP Copolymer, Polyglyceryl-3 Methylglucose Distearate, Glyceryl Stearate, **Stearic Acid**, Hydrogenated Lecithin, Xanthan Gum, Glyceryl Caprylate, Disodium EDTA, Hydroxypropyl Starch Phosphate, Ethylhexylglycerin, Madecassoside, Butylene Glycol, Tocopherol, Camellia Sinensis Leaf Extract.\n\n**New INCI List:** Water, Glycerine, Propanediol, Pentaerythrityl Tetraethylhexanoate, **1,2-Hexanediol**, Squalane, Panthenol, Cetearyl Alcohol, Bis-Diglyceryl Polyacyladipate-2, Glyceryl Stearate, Polyglyceryl-3 Methylglucose Distearate, Ammonium Acryloyldimethyltaurate / VP Copolymer, Hydrogenated Lecithin, **Acrylates / â€‹C10-30 Alkyl Acrylate Crosspolymer**, Xanthan Gum, Glyceryl Caprylate, Hydroxypropyl Starch Phosphate, Disodium EDTA, Ethylhexylglycerin, Madecassoside, **Tromethamine**, Butylene Glycol, Tocopherol, Camellia Sinensis Leaf Extract.\n\n**REMOVED:** Stearic Acid (emollient / fatty acid). **ADDED:** 1,2-Hexanediol (humectant / emollient), Acrylates/â€‹C10-30 Alkyl Acrylate Crosspolymer (thickener / emulsion stabilizer), Tromethamine (pH balancing).\n\n**ALSO REFORMULATEDâ€¦**\n\n**pH 5.5 Foam Cleanser** â€” *REMOVED:* Coco-Betaine,Â Potassium Benzoate,Â Acrylates / C10-30 Alkyl Acrylate Crosspolymer,Â Tromethamine, Pentylene Glycol. *ADDED:* Hydroxypropyl Starch Phosphate, Sodium Methyl Cocoyl Taurate, Devyl Glucoside, Potassium Cocoyl Glycinate, Cetearyl Alcohol, Glyceryl Stearate, Sorbitan Olivate, Glycol Distearate, Potassium Cocoate, Caprylyl Glycol, Polyquaternium-67, Glyceryl Caprylate, Sodium Acetate.\n\n**Hydro Barrier Cream** â€” *REMOVED:* Ammonium Acryloyldimethyltaurate / VP Copolymer, Trehalose, Glucose. *ADDED:* Carbomer, Tromethamine.\n\n**Barrier Intensive Cream** â€” *REMOVED:* Glycerine, Butyrospermum Parkii (Shea) Butter, Potassium Hydroxide, Butylene Glycol. *ADDED:* Hydrogenated Vegetable Oil, Glyceryl Caprylate, Tromethamine, Ethylhexylglycerine, Lecithin, Tocopherol (Vitamin E).\n\n**UNCHANGED:**\n\n* pH 6.5 Whip Cleanser\n* pH 5.5 Relief Toner\n* 10-Panthensoside Cica Balm\n* Panthensoside Sheet Mask\n\nCurrently on the fence as to whether I should stock up on the Emulsion on YesStyle, but Iâ€™m not sure if itâ€™ll be the new one. There are 2 options \"120ml (sold out)\" or \"130ml - 2021 NEW\". I've been using the 130ml pump bottles with the 2021 minor font change, but the 2023 reformulation is in 130ml tubes, and YesStyle doesn't specify the type of packaging, just \"2021 NEW\", and 2021 could be a typo... The reformulation seems fairly minor, but Iâ€™m scared, y'all! ðŸ’”\n\n(Edit: formatting.)",
    "flair_text": "Discussion",
    "flair_template_id": "f5703f4a-459e-11e4-bd43-12313b0e84f5",
    "comments": [
      {
        "author": "questionskiddo",
        "body": "Comparing the reformulations of the other products, this one doesnâ€™t seem too bad tbf. The new bottle looks alright, but yes I prefer the pump bottle like the pre 2023 one â˜¹ï¸.\n\nAll Iâ€™m glad is that itâ€™s still 130ml and not a cheeky 40ml like most European emulsions.",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "idratherbeinside",
        "body": "Wow I never thought I would see the day where one of holy grails was reformulated lol\n\nWell, it happens to the best of us ðŸ¤·ðŸ»â€â™€ï¸",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "lovemed45",
        "body": "I recently bought the 2021 new emulsion from YesStyle and I have it in the pump bottle! I ordered around the 19th and received my stuff maybe a week ago. I hope that can serve as some consolation. \n\nThese reformulations are kinda stressing me out. I found a lot of comfort with Soon Jung because of my flaky dry skin. I'm especially nervous for the intensive barrier cream. It has been the best moisturizer I have ever used. At the moment, I am using the Purito Oat-in Intensive Cream, and apart from the terrible pump, I like the cream.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "heynewonlyangel",
        "body": "I got into Korean skincare when I visited South Korea in April and this is the first moisturizer I got so I donâ€™t know what the old formula was like but this new one is great for my skin.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "doraemon_1998",
        "body": "NOOOOOOO. this is literally the only thing I'm obsessed with . why is the new packaging so ugly. Give me the pump bottle back ;-;",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "purorum",
        "body": "I had to switch back to this after they reformulated the x2 intense barrier cream and then i went to order another few and i was met with this horrorâ€¦.. \n\nHas much changed compared to the previous formula? they ATLEAST were gracious enough to keep glycerin, but after they ruined the other cream iâ€™m scared to even try this new one",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Tough_Advisor_7703",
        "body": "Hey, did you tried the reformulates version? What was your experience.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Opposite-Sentence-16",
        "body": "Any update as to whether the emulsion reformulation was ok? Iâ€™ve seen other posts where people didnâ€™t like it. One said it was thicker and made their skin greasy. Thank you.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Zeretaaa",
        "body": "Do you know of any alternatives to this moisturiser? It's also my holy grail",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "norkhog",
        "body": "I have quite sensitive skin and so far the soonjung line is one of the only things I've used that's worked for me.\n\nI don't really understand ingredients ect is it a massive change likely to effect performance?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 10,
      "top_level": 10,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "14m4bnj",
    "title": "Thoughts on the SKIN1004 Centella Ampoule Foam?",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/14m4bnj/thoughts_on_the_skin1004_centella_ampoule_foam/",
    "score": 49,
    "num_comments": 63,
    "created": "2023-06-29T12:55:53+00:00",
    "body": "Whatâ€™s the community consensus on this cleanser so far?\n\n**INGREDIENTS:**\n\nCentella Asiatica Extract(33%), Sodium Cocoyl Isethionate, Glycerin, Water, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, 1,2-Hexanediol, Sodium Chloride, Potassium Cocoate, Potassium Benzoate, Polyquaternium-67, Citric Acid, Dextrin, Sodium Bicarbonate, Theobroma Cacao (Cocoa) Extract, Disodium EDTA, Sodium Acetate, Butylene Glycol, Coptis Chinensis Root Extract, Sodium Hyaluronate, Eclipta Prostrata Extract, Coccinia Indica Fruit Extract",
    "flair_text": "Discussion",
    "flair_template_id": "f5703f4a-459e-11e4-bd43-12313b0e84f5",
    "comments": [
      {
        "author": "reallybadandsad",
        "body": "I have seen many people recommend this for dry skin folks. As someone with dry-ish skin this was NOT gentle, it was so stripping I think I would've been better off using hand soap for my face. Genuinely the most stripping cleanser I've ever used. Now, this type of stuff is very personal and my skin just generally hates cleansers, it could definitely work for some people, but maybe it's more suitable for people with more combo-oily skin!\n\nList of drying cleansers for my skin, for reference: krave matcha hemp hydrating cleanser (old formula), fresh soy face cleanser, celimax dual barrier mild gel cleanser (the least stripping one), cerave foaming cleanser (non-AB), simple micellar facial gel wash (non-AB), bioderma sensibio micellar water (non-AB) and I think a few more but I can't remember",
        "score": 37,
        "is_top_level": true
      },
      {
        "author": "technicoleor",
        "body": "Very similar to the Roundlab Dokdo Cleanser, using the same base surfactants and producing the same thick foam. All in all a cleanser that just does its job. Would recommend.",
        "score": 20,
        "is_top_level": true
      },
      {
        "author": "lhaluu",
        "body": "I have 3 cleansers open at the moment (1 non-Ab). The latest 2 I couldnâ€™t resist and opened them as soon as I got them. I got the BoJ green plum cleanser in my shower and the Skin1004 on my sink. The BoJ is a gel type cleanser, reminds me of Pyunkang Acne facial cleanser. Despite being a gel, it is non stripping. BoJ left my skin hydrated actually. While Skin1004 is a cream foam cleanser. It is a basic foam cleanser but made my skin smoother and fresh. It didnâ€™t feel tight, but it feels like itâ€™s going to be drying if I donâ€™t immediately follow up with a toner. Other than that, I think itâ€™s also a great cleanser especially for double cleanse. I think BoJ is more suitable to dry skin than Skin1004 in my opinion. I have combination skin which gets combo dry during winter and combo oily in summer.",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "Russellpenis",
        "body": "If I wanted to make my face burn as bad as it did with this product, I wouldâ€™ve just lit it on fire",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "Tuies_Cooking",
        "body": "This is my all-time favorite cleanser, I have acne-prone skin that leans on the drier side and I find this to be the perfect gentle yet deeply cleaning wash! Make sure to foam it up before applying and it feels great and always leaves my skin feeling happy after. I've used about  4 so far and with its price, I think ill be sticking with it for a while!",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Vmv_cuT",
        "body": "I tried it 4 times and it ruined my skin, dried out my skin immensely and caused breakouts all over my face. Too stripping/strong! Would not recommend",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "somebd",
        "body": "I liked it. It foamed up & cleansed well without stripping my skin, and smelled pleasant.\n\nNothing truly special for me to repurchase, though.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Top_Intern_5337",
        "body": "I have oily but Dehydrated skin. I love this one ! Although my skin is resilient, some cleansers can really be stripping for me (most BHAs are ! Go figure !). But this one was great. I love it.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Dejena",
        "body": "Stylevana has a travel kit from skin1004 with five pieces in it. If youâ€™re unsure, and want to try some things from the brand, itâ€™s a good way to go. \n\nIâ€™m personally a dehydrated, mostly combo in summer and dry in winter. I enjoyed it both summer and winter, using a pea sized amount. \n\nAnother winter cleanser I like is Sioris Cleanse Me Softly milk cleanser. For some people it leaves a film, but I think Iâ€™m too dry for that lol",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "FastTangerine5449",
        "body": "My face would have patches of elevated red skin and would feel warm after washing with this foam cleanser. I think I am having allergic reaction. did anyone experienced this too?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Diligent_Leg_164",
        "body": "I currently use this. I have the cleansing oil I use first (which has a scent but itâ€™s not be an issue) and although this is a pretty heavy cleanser, I love it. I have dry skin. But I feel like I need this if I do an oil cleanse before, just to ensure I get the oil off and donâ€™t clog my pores. It may be a mental thing. If I wasnâ€™t wearing makeup or didnâ€™t need a double cleanse, I would not use this to wash my face. Id find something gentler.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Adventurous_Low5376",
        "body": "I know this is an old post but in case anyone sees this:  \nThis cleanser was absolute garbage. It wasn't stripping for me (normal/balanced), wasn't hydrating, it didn't break me out, didn't irritate and it also did nothing.  \nMy skin was the same if I didn't use any cleanser (tested this), I used this cleanser daily and saw no improvement in my skin. It also smells horrendous, I got this in store so I know it's authentic. It's literally useless, I probably could've used unscented bar soap and gotten better results.\n\nRemember that everyone's skin is different, so if it seems good to you, try it, it just really didn't work for me.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Ok_Variation_2126",
        "body": "I didnâ€™t like it. Didnâ€™t foam enough. Overall meh. Will not repeat. Itâ€™s not at all like the Dokodo one. I have both at the same time and the dokodo one foams much better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MrGrumplestiltskin",
        "body": "I have dry/dehydrated skin and don't use it daily but it's not as harsh as my previous cleanser. I like that it doesn't have fragrance and that it rinses away easily. Oh, and it doesn't seem to irritate my sensitive skin either but I imagine it might if I used it daily due to the baking soda.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "JellyfishAromatic89",
        "body": "does this cleanser get rid of blackheads?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "letsdrabbro",
        "body": "OP what cleanser do you use now?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Striking_Ad9303",
        "body": "Meh. \nIt's way too overhyped imo. I like that you only need a small amount, and it foams up, but it's too drying for my skin type. I think this is good for teens or people with oily/acne-prone skin. \n\nAfter I finish it, I'm going back to my usual Cetaphil gentle foaming cleanser. No-nonsense, simple and gentle on my skin.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 17,
      "top_level": 17,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "146guwe",
    "title": "When Garnier finally comes out with a real Vitamin C serum",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/146guwe/when_garnier_finally_comes_out_with_a_real/",
    "score": 36,
    "num_comments": 23,
    "created": "2023-06-11T01:22:22+00:00",
    "body": "Because seriously, their last vitamin C serum was a total joke, they really tried to mislead consumers by saying 3,5% vitamin C, which was a deritative and we didn't know the actual percentage because it was the total amount of vitamin C + niacinamide + salicylic acid, what a shame.\n\nBut this one looks kinda good, a little bit similar to the l'Oreal one, this one also have salicylic acid.\n\nIngredients : AQUA / WATER,\nASCORBIC ACID, PENTYLENE GLYCOL, GLYCERIN, SODIUM HYDROXIDE, HYDROXYACETOPHENONE, SALICYLIC ACID, CAPRYLYL GLYCOL, CAPRYLYL/\nCAPRYL GLUCOSIDE, POLYQUATERNIUM-67, ADENOSINE, TRISODIUM ETHYLENEDIAMINE DISUCCINATE.\nSODIUM HYALURONATE,\nLINALOOL, LIMONENE, GERANIOL, PARFUM /FRAGRANCE.",
    "flair_text": "Vitamin C",
    "flair_template_id": "e063de9c-f539-11ec-98c6-26420e22eac3",
    "comments": [
      {
        "author": "Happy_Direction_3825",
        "body": "Do they have to put parfum in everything? I just don't get it. Even in a Vit C?",
        "score": 48,
        "is_top_level": true
      },
      {
        "author": "Julia_Ruby",
        "body": "The previous formula was really a pigmentation serum, with the phenylethyl resorscinol, niacinamide, HEPES, and salicylic acid pulling a lot of the weight.\n\nHeaps of brands have been using C as a selling point for their pigmentation products, IMO due to its overhyped status as a brighter.\n\nThe more brands have kept doing this over the years instead of focusing on the more effective pigmentation ingredients in their formulas, the more they've reinforced this idea. It's become an avalanche at this point.",
        "score": 20,
        "is_top_level": true
      },
      {
        "author": "daantjedp82",
        "body": "Still with salicylic acid and a lot of irritants, doesn't look like a nice serum. Also labeled for night...",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "ovelnk",
        "body": "Why, why, why all these fragrances?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Tamarishka",
        "body": "Why did they put salicilic acid? That shouldnt be put in the mornings because it makes skin photosensitive. As far as Ive heard. So this serum is only for evening routine.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thebouncingcupcake",
        "body": "> all those fragrances\n\n> salicylic acid\n\ninto the trash it goes",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ethanhigh85",
        "body": "It's a night serum!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "1ays2t5",
    "title": "a lot of Reviews + some things i will be reviewing/ am currently trying",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/1ays2t5/a_lot_of_reviews_some_things_i_will_be_reviewing/",
    "score": 33,
    "num_comments": 6,
    "created": "2024-02-24T11:08:58+00:00",
    "body": "**Personal Info:**\n\nI live in nothern europe, so currently cold, windy and dry Climate. My Skintype is sahara desert dry, prone to closed comedones plus some light hormonal acne. Sadly im also super prone to hyperpigmentation. My main Goals are barrier health, hydration, acne & Hyperpigmentation management and getting rid of the damn stubborn CC\\`s... I also follow a kinda skincycling routine wich includes a non AB Retinal product.\n\nIn **Bold** will be the product name + how long i have been using it\n\nin *italic* will be the ingredients i liked\n\n\n\n**Axis-Y Sunday morning cleanser: (using for a month now)** *green tea extract, centella extract, allatonin*\n\nIngredients:\n\nWater, Glycerin, Sodium Cocoyl Isethionate, Sodium Methyl Cocoyl Taurate, Potassium Cocoyl Glycinate, Coco-Betaine, Butylene Glycol, Potassium Cocoate, Sodium Chloride, Potassium Benzoate, Polyquaternium-67, Xylitylglucoside, Citric Acid, Anhydroxylitol, Propanediol, Xylitol, Betula Platyphylla Japonica Juice, Glucose, Camellia Sinensis Leaf Extract, Disodium EDTA, Glycyrrhiza Glabra (Licorice) Root Extract, Agrimonia Eupatoria Extract, 1,2-Hexanediol, Centella Asiatica Extract, Dipropylene Glycol, Allantoin, Perilla Frutescens Leaf Extract, Saponaria Officinalis Extract, Sodium Acetate, Pentylene Glycol, Calendula Officinalis Flower Extract, Kigelia Africana Fruit Extract, Caprylyl Glycol, Natto Gum, Sodium Hyaluronate, Chamomilla Recutita (Matricaria) Flower Extract, Ethylhexylglycerin, Hydroxycinnamic Acid, Rutin\n\nTexture:\n\na balmy texture, foams up to a dense and soft foam\n\nExpirience:\n\nI picked this up because I wanted to change from my old clenaser to something that felt like it had a bit more cleansing power, yet was not stripping. As far as i can tell it seems to accomplish that. It foams up nicely, cleans well and doesent seem to strip my Skin. After washing it off it feels almost as if there is a slight layer on my Skin, but i dont mind it/ think that it contributes to the non stripping?\n\n(4/5)\n\n**Cosrx Propolis Toner: (about a month 1/2 of use)** *propolis, honey extract, panthenol*\n\nIngredients:\n\nPropolis Extract, Honey Extract, Butylene Glycol, 1,2-Hexanediol, Glycerin, Betaine, Cassia Obtusifolia Seed Extract, Panthenol, Polyglyceryl-10 Laurate, Polyglyceryl-10 Myristate, Ethylhexylglycerin, Sodium Hyaluronate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Caprylic/Capric Triglyceride\n\nTexture:\n\na waterlike texture, thats just a bit thicker\n\nExpirience:\n\nTo be honest im not overly impressed... its a nice hydrating toner for sure but i didnt notice anything outstanding that would have me choose it again. But it gets a pluspoint for being reasonably priced so i migth pick it up again to reach free shipping...\n\n(3/5)\n\n**Holika Holika Aloe Waterproof Sungel (3 Months of use)** *Aloe*\n\nIngredients:\n\nAqua, Dibutyl Adipate, Propanediol, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Polymethylsilsesquioxane, Ethylhexyl Triazone, Niacinamide, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Coco-Caprylate/Caprate, Caprylyl Methicone, Diethylhexyl Butamido Triazone, Glycerin, Butylene Glycol, 1,2-Hexanediol, Hippophae Rhamnoides Fruit Extract, Daucus Carota Sativa (Carrot) Root Extract, Rosa Canina Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Aloe Ferox Leaf Extract, Artemisia Capillaris Extract, Prunus Armeniaca (Apricot) Juice, Hydrogenated Lecithin, Pentylene Glycol, Behenyl Alcohol, Poly C10-30 Alkyl Acrylate, Polyglyceryl-3 Methylglucose Distearate, Decyl Glucoside, Tromethamine, Carbomer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Stearoyl Glutamate, Polyacrylate Crosspolymer-6, Ethylhexylglycerin, Adenosine, Xanthan Gum, T-butyl Alcohol, Tocopherol, Ascorbic Acid, Moringa Oleifera Seed Oil, Ceramide Np, Phytosphingosine, Parfum\n\nTexture:\n\na thin cream Texture, not runny but almost there\n\nExpirience:\n\nIt comes in quite a big size for a Sunscreen, you can find 80 - 100 ml Tubes online for around 15-17 Euros! Wich honestly was the sole reason why i bougth it xD i figured my skin would be fine with the Ingredients and i just hate tiny sunscreens! And well... that was exactly what it is like, its decently moisturizing and doesnt irritate my Skin. But if you have sensitive Skin be careful, it does have Fragrance, smells kinda like very artificial Aloe. You can smell it but only upon first apllication, it doesnt linger. I have been using 1 bottle for 3 months and still have enough for another month at min. so a win!\n\n(3.5/5)\n\n**Purito Dermide Cica Barrier Sleeping Mask: (3 months of use)** *Squalane, Centella Extract, Jojoba oil, Panthenol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Ceramide*\n\nIngredients:\n\nWater, Centella Asiatica Extract(250,000Ppm), Caprylic/â€‹Capric Triglyceride, Glycerin, Squalane, Simmondsia Chinensis (Jojoba) Seed Oil, Cetearyl Alcohol, Potassium Cetyl Phosphate, Helianthus Annuus (Sunflower) Seed Oil, Butylene Glycol, Polyglyceryl-3 Methylglucose Distearate, 1,2-Hexanediol, Madecassoside, Asiaticoside, Madecassic Acid, Asiatic Acid, Panthenol, Ceramide NP(3,000Ppm), Sodium Hyaluronate, Hydroxyacetophenone, Sodium Carbomer, Hydrogenated Lecithin, Hydroxyethylcellulose, Camellia Sinensis Leaf Extract\n\nTexture:\n\nA thick Cream, feels quite emmolient\n\nExpirience:\n\nI love, love, loe this! Its the first moisturizer that i found that feels like it actually does its job well on my Skin. As a nigthtime moisturizer it keeps my Skin hydrated all through the Night and has my wake up nicely glowy. I love to use this when my Skin is irritated, it really soothes it quickly. Always have this on my Shelf, you would have to pry it out of my dead cold hands, to seperate me from it. One Bottle last me about 2 months.\n\nHG!\n\n(5/5)\n\n**Mary & May Blackberry Cream Essence: (4 months of use)** *Jojoba oil, ceramides, lotus water, centella*\n\nIngredients:\n\nWater, Nymphaea Caerulea Flower Water, Simmondsia Chinensis (Jojoba) Seed Oil, Hydrogenated Poly(C6-14 Olefin), Rubus Fruticosus (Blackberry) Fruit Extract, 1,2-hexanediol, Methlypropanediol, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Hydrolyzed Gardenia Florida Extract, Sodium Hyaluronate, Hydrogenated Lecithin, Butylene Glycol, Glycerin, Trilaureth-4 Phoshate, Sodium Polyacrylate, Pvm/Ma Copolymer, Cyanocobalamin, Ceramide Np, Maltodextrin, Ethylhexylglycerin, Tocopherol\n\nTexture:\n\nthin, watery but creamy? (just realized i suck at describing textures haha)\n\nExpirience:\n\nA really nice hydrating and moisturizing Toner, feels like a great balance of the two. Acts nicely as a layer with other Skincare because it absorbs really well. I like it, a bottle lasts me about 2 months.\n\n(4/5)\n\n**Abib Quick Sunstick Protection Bar: ( 3 months of use)** *Aloe, Centella, Ceramides*\n\nIngredients:\n\nOctyldodecanol, Butylene Glycol Dicaprylate/Dicaprate, Ethylhexyl Methoxycinnamate, Dibutyl Ethylhexanoyl Glutamide, Dibutyl Lauroyl Glutamide, Diisostearyl Malate, Ethylhexyl Salicylate, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Dextrin Palmitate, Octocrylene, Camellia Sinensis Leaf Extract, Centella Asiatica Extract, Aloe Barbadensis Leaf Juice, Cucumis Sativus (Cucumber) Fruit Extract, Aloe Barbadensis Leaf Extract, Glycerin, Water, Butylene Glycol, Saccharide Isomerate, Maltodextrin, Hydrolyzed Vegetable Protein, Caprylic/Capric Triglyceride, Hydrogenated Lecithin, Ethyl Hexanediol, Ceramide NP, Citric Acid, Sodium Citrate, Ethylhexylglycerin, Phenoxyethanol\n\nTexture:\n\nA translucent stick, glides on smooth, feels a bit occlusive on skin\n\nExpirience:\n\nNicely moisturizing Sunstick, feels good on my Skin and well... does its Job xD I really like the curved shape of it, it relly helps with the application. I just use it for reapplication of my sunscreen, but also sometimes when my Skin gets really dry during the day ( tho its not the best for that)\n\n(3.5/5)\n\n**Numbuzin No.2 Protein 43% creamy Serum: ( 4 months of use)** *Oat protein, Ceramides, cholesterol, fatty acids, ferments, Rice protein*\n\nIngredients:\n\nAvena Sativa Protein Extract, Water, Cyclopentasiloxane, Butylene Glycol, Cetearyl Ethylhexanoate, Cyclohexasiloxane, Phenyl Trimethicone, Cetyl PEG/PPG-10/1 Dimethicone, Hydrogenated Poly C6-14 Olefin, Niacinamide, Panthenol, 1,2-Hexanediol, Glycerin, Erythritol, Limnanthes Alba Seed Oil, Sodium Chloride, Allantoin, Ethylhexylglycerin, Tocopheryl Acetate, Adenosine, Dextrin, Theobroma Cacao Extract, Pantolactone, Ceramide NP, Cholesterol, Palmitic Acid, Oryza Sativa Seed Protein Extract, Stearic Acid, Hydrolyzed Milk Protein, Lactobacillus Ferment, Glycine Soja Protein, Hydrolyzed Lupine Protein, Glucose, Hydrolyzed Corn Protein, Hydrolyzed Rice Protein, Hydrolyzed Soy Protein, Hydrolyzed Sweet Almond Protein, Hydrolyzed Vegetable Protein, Myristic Acid, Hydrolyzed Pea Protein, Arachidic Acid, Lauric Acid, Sodium Succinate, Disodium EDTA, Fragrance\n\nTexture:\n\nVery thick serum, really is creamy like the name says\n\nExpirience:\n\nSooo repairing and soothing, does wonders for my barrier. It really helps keep my Skin moisturized and helps keep my transepidermal waterloss in check. Love it so much! HG!\n\n(5/5)\n\n**Purito Aha Bha Refreshing Solution: (1 month of use)** *Glycolic acid, Salcylic Acid*\n\nIngredients:\n\nSalix Alba (Willow) Bark Water, Butylene Glycol, Dipropylene Glycol, Glycolic Acid (7%), Tromethamine, Water, Salicylic Acid(2%), 1,2-Hexanediol, Sodium Citrate, Arginine, Caprylyl Glycol, Citric Acid(0.28%), Hydroxyacetophenone, Pentylene Glycol, Allantoin, Dipotassium Glycyrrhizate, Disodium EDTA\n\nTexture:\n\nlike water, it put 2-3 drops on a thin cotton pad and swipe over my Face with it\n\nExpirience:\n\nSince it has only been a month i cannot say too much about how it has worked (and i feel its hard to tell what effects on my skin is retinal and whats from this product) but my comedones are reducing in size and developing into breakouts. But the effects of these ingredients are well studied in these concentrations so i would say its save to say it works. Its my first time using glycolic acid and i can say it packs a punch for sure! So be careful, its intense, so far im using it once a week on my exfoliation day and i dont think ill be moving up.... Might also be the fact that its a combo product, but i have been using salcylic acid and mandelic acid in combo before, and that felt less sensitizing. So im attributing that factor to the 7 percent glycolic acid, since it is the smallest molecule size of all Aha\\`s.\n\n(3.5/5)\n\n-----------------------------------------------------------------------------------------------------------------------------------------------------\n\nNow lets move to quick first impressions of a few products i just started trying, wich i have seperated from the review portion because i just havent been using them long enough to really speak about the effects on my Skin: (these will also be shorter impressions with less info)\n\n\n\n**Neo:labs liquid enhancer Pycogenol:**\n\nIngredients:\n\nWater, Propanediol, Hydrogenated Poly C6-14 Olefin, 1.2-Hexanediol, Methylpropanediol, Glycerin, Chondrus Crispus Extract, Saccharum Officinarum Extract, Jojoba Esters, Melia Azadirachta Flower Extract, Salvia Sclarea Oil, Ocimum Sanctum Leaf Extract, Melia Azadirachta Leaf Extract, Curcuma Longa Root Extract, Anthemis Nobilis Flower Oil, Corallina Officinalis Extract, Theobroma Cacao Seed Extract, Melaleuca Altemifolia Extract, Centella Asiatica Extract, Melaleuca Alternifolia Leaf Oil, Pinus Pinaster Bark Extract, Caprylic/Capric Triglyceride, Glyceryl Stearate, C18-36 Acid Triglyceride, Coprylyl Glycol, Hydrogenated Lecithin, C12-18 Acid Triglyceride, Squalene, Sodium Polyacrylate, Tromethamine, Albatreus Contuena Extract, Paimitic Acid, Stearic Acid, Phytasteryl Macadamiate, Citric Acid, Phytosterol, Dextrin, Tocopherol, Butylene Glycol, 4-Terpineol, Pentylene Glycol, Octonediol, Ethylhexylglycerin, Cetearyl Alcohol, Carbomer, Xanthan Gum\n\nExpirience:\n\nBougth this because of the tea tree extract, oil and 4- terpineol for the antimicrobial and antiinflammatory benefits , plus it also promised balancing the water-oil contend of the skin. So far i have been using it for a week and it feels nicely moisturizing, but i cannot say if it has helped with my breakouts. Smells strongly like tea tree, wich i dont mind.\n\n**Isntree Spotsaver Mugwort Ampoule:**\n\nIngredients:\n\nArtemisia Princeps Extract, Glycerin, Butylene Glycol, Glycereth-26, Erythritol, Betaine, Glycyrrhiza Glabra (Licorice) Root Extract, Calendula Officinalis Flower Extract, Piper Methysticum Leaf/Root/Stem Extract, Panthenol, Propanediol, Beta-Glucan, Dipotassium Glycyrrhizate, Hydrogenated Lecithin, Ceramide NP, Allantoin, Carbomer, Tromethamine, 1,2-Hexanediol\n\nExpirience:\n\nThis i got because i heard amazing things about mugwort and it was on a 50 % Sale, so i got it for a steal! So far i like the simple ingredient list an it seems soothing and hydrating.\n\n**RNW Der.Ceramide Cream:**\n\nIngredients:\n\nWater, Butylene Glycol, Ceramide NP, Panthenol, Caprylyl Methicone, Glycerin, C12-16 Alcohols, 1,2-Hexanediol, Cetearyl Alcohol, Pentaerythrityl Tetraisostearate, Limnanthes Alba (Meadowfoam) Seed Oil, Cetyl Ethylhexanoate, Polyglyceryl-3 Distearate, Ceramide NS, Phytosphingosine, Cholesterol, Ceramide AS, Ceramide AP, Oligopeptide-1, Ceramide EOP, Sodium Hyaluronate, Hydroxypropyltrimonium Hyaluronate, Hydrolyzed Hyaluronic Acid, Palmitic Acid, Hydrogenated Lecithin, Caprylic/Capric Triglyceride, Betaine, Arginine, Arachidyl Alcohol, Behenyl Alcohol, Glyceryl Stearate Citrate, Carbomer, Butyrospermum Parkii (Shea) Butter, Arachidyl Glucoside, Citrus Aurantium Dulcis (Orange) Peel Oil, Stearic Acid, Adenosine, Lavandula Angustifolia (Lavender) Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Cedrus Atlantica Bark Oil, Caprylyl Glycol, Sodium Phosphate, Disodium EDTA\n\nExpirience:\n\nIm really intriged by this brand an was debating between this and the Ceramide serum, but got this Cream. At first i was intimitaded by the essential oils and the strong smell it has (herbal, but to my nose very pleasant) so i patchtested it on my cheek. The Patchtests went fine and i have been using it on my whole face for 4 days now and i must say im impressed.\n\nIf you have oily skin i feel you could hate it but for my dry skin... the texture is amazing. Its a THIIICK cream, like an ointment, very balmy. Upon apllication it feels nice to spread it and it sinks in so well for the thick texture. The cream surprisingly dries down velvety and leaving a protective shield over the Skin. I also love that it has 3 % Panthenol, 3% ceramides and cholesterol and fatty acids.... so perfect ingrdients for skin barrier repair! Really a potential HG...\n\n\n\n",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "pollypetunia",
        "body": "I love the sound of the purito sleep mask! My skin sounds very similar to yours and I've been looking for a sleeping pack because I just can't deal with sheet masks. Does it have any kind of scent?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "ktli1",
        "body": "I think there's a typo, the propolis toner is made by cosrx. ðŸ˜…\n\nUnless I've missed something and there's a new propolis toner by Purito. In that case, I'd be very interested in trying it as well ðŸ˜",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeautyAdvice",
    "post_id": "fnyxj2",
    "title": "[Review]: Make p:rem Safe Me. Relief Cleansing Foam",
    "url": "https://www.reddit.com/r/AsianBeautyAdvice/comments/fnyxj2/review_make_prem_safe_me_relief_cleansing_foam/",
    "score": 12,
    "num_comments": 0,
    "created": "2020-03-24T04:31:40+00:00",
    "body": "Alright, this was both a very easy and very hard review to put together as my views on this Water Based Cleanser are probably a little biased LOL! You seeâ€¦this Cleanser saved my lifeâ€¦\n\nLOL, not that dramatic but pretty close. If you remember (or donâ€™t) I decided about a month ago that it would be an excellent idea to use an â€œall-naturalâ€ Bar Soap that had been listed as okay for use on the face. WRONG LOLâ€¦over the two plus weeks I used it I ended up stripping my Skin, clogging my pores, inviting breakouts, and generally messing everything up.\n\nWell, after that experience I really needed to switch to something that was going to reverse what I had done to myself. This Make P:rem Cleansing Foam jumped out since it has been recommended by a few bloggers as being great for Sensitive Skin. \n\nThe first thing that I surprised me about this Product was just how creamy/foamy it truly is. Most pH Balanced Cleansers do a decent job (at best) of foaming upâ€¦but this one feels really thick and luxurious. Especially after mixing it in my Nooni Whip Makerâ€¦WOW! The closest pH Balanced Cleanser I can compare it to is the Sulwhasoo EX Brightening Cleansing Foam. \n\nAs for the Formulaâ€¦there are a couple of Ingredients that do raise some concern. The Coconut Based Surfactants (not an issue) followed by a few Essential Oils (can be an issue). I didnâ€™t have a problem with them but I would hesitate from recommending this as the ultimate gentle Cleanser as Essential Oils pose a problem for some. Bergamot Oil and Sage Oil are both here. In addition to the Oils we also have Raspberry Fruit Extract, Sodium Hyaluronate, and Citric Acid (which I assume is there to help lower the pH). \n\nEssential Oils asideâ€¦this Cleanser brought my Skin back from the brink so fast I was truly shocked. The foam feels so comfortable and luxuriousâ€¦and the mild herbal scent was relaxing. Just after a few uses my Skin seemed to be less red and the few angry red bumps I had developed were much more calm.\n\nOver the past few weeks I have fallen in love with this Product LOL! Usually I am not a fan of such a â€œbasicâ€ Cleanser. Give me some antioxidants, give me some brighteningâ€¦something! But, this Make P:rem Safe Me Cleanser was exactly what I needed in the moment. I came in and quietly said â€œIâ€™m just gonna pop in here and fix this.â€ and went on its way.\n\nMy struggle with wholeheartedly recommending this Product (aside from the plastic bottle) is that I think my view is a victim of circumstance. If my Skin was happy and healthy at the time I brought this into my Routine I could totally see myself as calling it boring, basic, or not doing that much. And again, those Essential Oils would keep from saying its the new go-to for Sensitive Skin peeps.\n\nPersonally, I plan to keep the rest of this bottle as my â€œIn Case Of Emergencyâ€¦Use Thisâ€ Cleanser. For those that arenâ€™t particularly triggered by Essential Oils (LOL)â€¦this is an excellent go to for days when your Skin is feeling overworked or (in my case) you made a bad call with another Product. I feel like I would even put this one above my other favorites from Peach & Lily and Youth To The People (for the purpose of bringing Skin back to a happy state) as its creamy consistency adds a bit of comfort/luxury that Gel Style Cleansers have a hard time matching.\n\nFull Ingredients List: \n\nWater, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate, Sodium Chloride, Polyquaternium-67, Potassium Cocoate, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citric Acid, Disodium EDTA, Salvia Officinalis (Sage) Oil, Sodium Acetate, Rubus Idaeus (Raspberry) Fruit Extract, 1,2-Hexanediol, Sodium Hyaluronate, Ethylhexylglycerin\n\nhttps://preview.redd.it/4bm67gdhtjo41.jpg?width=1240&format=pjpg&auto=webp&s=451d64d229f10607a1c6d82b5ef104d11f6adfdb",
    "flair_text": "REVIEW",
    "flair_template_id": "62e1292e-4166-11e8-9ee1-0eb6a157035e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "78oqmj",
    "title": "What makes a split end sealer a sealer?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/78oqmj/what_makes_a_split_end_sealer_a_sealer/",
    "score": 12,
    "num_comments": 9,
    "created": "2017-10-25T16:17:18+00:00",
    "body": "I am so happy to have stumbled upon this community! I had several inches cut off my hair and the stylist recommended [Redken Extreme Lengths Sealer](http://www.ulta.com/extreme-length-sealer?productId=xlsImpprod11951117). \n\nI couldn't afford it so decided to hold off, and I wondered what sets sealers apart from other products aimed toward avoiding/minimizing the appearance of split ends. \n\n**Ingredients:** Water, Amodimethicone, Cetearyl Alcohol, Trideceth-5, Polyquaternium-37, Phenoxyethanol, Propylene Glycol Dicaprylate / Dicaprate, Steareth-20, Parfum / Fragrance, Glycerin, Phenyl, Trimethicone, Cetyl Hydroxyethylcellulose, Trideceth-10, Cetyl Alcohol, PPG-1 Trideceth-6, Prunus Amygdalus Dulcis Oil / Sweet Almond Oil, Biotin, Polyquaternium-67, Arginine, Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate,Benzyl Benzoate, 2-Oleamido-1, 3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate Benzyl Benzoate, 2-Oleamido-1,3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid.\n\nI am also curious if [Not Your Mother's Way to Grow Leave In Conditioner](http://www.ulta.com/way-grow-leave-in-conditioner?productId=xlsImpprod6340354&sku=2270344&cmpid=PS_Non!google!Product_Listing_Ads&cagpspn=pla&CATCI=pla-195671275470&CAAGID=17996762790&CAWELAID=330000200000108699&catargetid=330000200000773138&cadevice=m&gclid=CjwKCAjw7MDPBRAFEiwAppdF9KAqiW1sDct8rIom3o5Yhh4loq8lEcyl_1sOPdgtIszBtET81iKRORoCZMcQAvD_BwE) has any ingredients with sealing properties. They state they have a top secret \"procapify\" formula but they don't delve into, what that means.\n\n**Ingredients:** Water, Butylene Glycol, Cetearyl Alcohol, Cetyl Triethylmonium Dimethicone PEG-8 Succinate, Fragrance, Quaternium-91, Propylene Glycol, Diazolidinyl Urea, Myristyl Myristate, Hydrolyzed Keratin, PPG-26-Buteth-26, Behentrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Iodopropynyl Butylcarbamate, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Citric Acid.\n\nThanks for any clarity you guys can bring to this! ",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "graythunderclouds",
        "body": "The only product on the market right now that will specifically mend split ends is b3 from Brazilian blowout. However, this is an in salon additive to a dye or flossing treatment. The simplest way to explain it is that the b3 works like doubled sided tape inside each hair strand and helps the strands reform as one strand. This treatment is only designed to last 6ish weeks, and is not a permanent long term fix.\nAlmost all products sold as a split end â€œrepairâ€ treatment will not actually repair the split ends. Theyâ€™re most likely smoothing the hair shaft to give the appearance of less split ends, and it washes out when you wash your hair. The emollients concentration in these products is heavy, so they can be very challenging to people with oily hair, because you are essentially adding more oil to the hair.  These products will not help repair the split ends, they more likely mask the problem. \n\nThe only way to get rid of split ends once they are actually splitting is to get a haircut.",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "graythunderclouds",
        "body": "The hydrolyzed keratin in  the not your motherâ€™s product should essentially act as a very mild sealant, but they wonâ€™t actually repair anything",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Peanutswithcream",
        "body": "Remember seeing somewhere that the best thing for split ends is cutting them off...",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "94cfge",
    "title": "Shampoo and conditioner ingredient check",
    "url": "https://www.reddit.com/r/HaircareScience/comments/94cfge/shampoo_and_conditioner_ingredient_check/",
    "score": 7,
    "num_comments": 2,
    "created": "2018-08-03T19:04:13+00:00",
    "body": "Are there any bad stuff that stick out in these products, or are they all good? I have fine hair and a little sensitive scalp\n\nDavines calming shampoo:\n\nWATER, SODIUM LAUROYL METHYL ISETHIONATE, DISODIUM COCOAMPHODIACETATE, GLYCERIN, SODIUM LAUROYL SARCOSINATE, PROPANEDIOL, POLYSORBATE 20, SODIUM OLIVAMPHOACETATE, SODIUM CHLORIDE, 1,2-HEXANEDIOL, ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER, PARFUM / FRAGRANCE, COCO-GLUCOSIDE, GLYCERYL OLEATE, SODIUM BENZOATE, TRISODIUM ETHYLENEDIAMINE DISUCCINATE, POLYQUATERNIUM-10, OLEYL ALCOHOL, CAPRYLHYDROXAMIC ACID, TETRASODIUM GLUTAMATE DIACETATE, SODIUM HYDROXIDE, POLYQUATERNIUM-67, ZANTHOXYLUM BUNGEANUM FRUIT EXTRACT, VACCINIUM MYRTILLUS LEAF EXTRACT, CITRIC ACID, CI 17200 / RED 33\n\nDavines well-being conditioner:\n\nWATER, GLYCERIN, CETYL ALCOHOL, CETEARYL ALCOHOL, CETRIMONIUM CHLORIDE, ECHINACEA PALLIDA EXTRACT, SIMMONDSIA CHINENSIS SEED OIL / SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL, CITRIC ACID, BENZYL ALCOHOL, SODIUM BENZOATE, DISODIUM EDTA, LIMONENE, BENZYL SALICYLATE, FRAGRANCE",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "thebunbunspeaks",
        "body": "The perfume is a bit higher on the shampoo list than I would like, but it all looks ok to me",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rosacea",
    "post_id": "14g5whq",
    "title": "Asian skincare cleansers to reduce redness",
    "url": "https://www.reddit.com/r/Rosacea/comments/14g5whq/asian_skincare_cleansers_to_reduce_redness/",
    "score": 6,
    "num_comments": 1,
    "created": "2023-06-22T15:03:02+00:00",
    "body": "Hi all,\n\nI have rosace type 1 and my main concern is redness on my cheeks and nose.\n\nI want to start trying to incorporate more asian skincare into my routine, and right now I am looking for a very gentle, anti redness cleanser!\n\nI have done some research and the following cleansers seem promising (ranked from most to least promising):\n\n1. SKIN1004 Madagascar Centella Ampoule Foam\n2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel\n3. Beauty of Joseon - Green Plum Refreshing Cleanser\n4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam\n5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam \\*(more for like 1-2x a week)\\*\n6. B\\_LAB - Matcha Hydrating Foam Cleanser \\*(also for 1-2x a week)\\*\n\nI am very interested in hearing about your experiences and advice regarding these products!\n\nOfcourse, any other product suggestions are more than welcome!\n\n**Ingredient list:**\n\n**1. SKIN1004 Madagascar Centella Ampoule Foam**\n\nCentella Asiatica Extract, Sodium Cocoyl Isethionate, Glycerine, Purified Water, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Poteassium Cocoyl Glycinate, 1,2-Hexanediol, Sodium Chloride, Potassium Cocoate, Potassium Benzoate, Polyquaternium-67, Citric Acid, Dextrin, Sodium Bicarbonate, Cacao Extract, Disodium EDTA, Sodium Acetate, Butylene Glycol, Coptis Chinensis Root Extract, Sodium Hyaluronate, Eclipta Extact, Coccinia Indica Fruit Extract\n\n**2. HaruHaru WONDER - Black Rice Moisture 5.5 Soft Cleansing Gel**\n\nWater, Glycerin, Coco-Betaine, Propanediol, Pentylene Glycol, Sodium Chloride, 1,2-Hexanediol, Xanthan Gum, Hydroxyethylcellulose, Potassium Cocoyl Glycinate, Potassium Cocoate, Oryza Sativa (Rice) Extract, Phyllostachys Pubescens Shoot Bark Extract, Panax Ginseng Root Extract, Aspergillus Ferment Extract Filtrate, Beta-Glucan, Butylene Glycol, Trehalose, Citric Acid, Cyclodextrin, Zanthoxylum Piperitum Fruit Extract, Pulsatilla Koreana Extract, Usnea Barbata (Lichen) Extract, Ethylhexylglycerin\n\n**3. Beauty of Joseon - Green Plum Refreshing Cleanser**\n\nWater, Prunus Mume Fruit Water, Cocamidopropyl Hydroxysultaine, Phaseolus Radiatus Seed Extract, Sodium Cocoyl Isethionate, Glycerin, Sodium Chloride, Camellia Sinensis Leaf Extract, Houttuynia Cordata Extract, Nelumbo Nucifera Flower Extract, Oryza Sativa (Rice) Extract, Prunus Mume Fruit Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Guar Hydroxypropyltrimonium Chloride, Coconut Acid, Ethylhexylglycerin, Caprylyl Glycol, Sodium Isethionate, Citric Acid, Butylene Glycol, 1,2-hexanediol, Punica Granatum Extract, Clitoria Ternatea Flower Extract, Garcinia Mangostana Peel Extract, Propylene Glycol Laurate, Sodium Citrate, Disodium EDTA\n\n**4. Rohto Mentholatum - Hada Labo Gokujyun Super Hyaluronic Face Foam**\n\nThere is vaseline in this, isnt that weird? Lol.\n\nWater, BG, Disodium Cocoyl Glutamate, PEG-8, Cocamidopropyl Betaine, Cocamide DEA, PEG-80 Sorbitan Laurate, Glycerin, Sorbitol, Sodium Taurine Cocoyl Methyltaurate, Sodium Acetylated Hyaluronate(Super Hyaluronic Acid), Hydroxypropyltrimonium Hyaluronate(Skin-adsorbed Hyaluronic Acid), Vaseline, Citric Acid, Polyquaternium-7, EDTA-2Na, BHT, Methylparaben\n\n**5. Pyungkang Yul - Low pH Pore Deep Cleansing Foam (more for like 1-2x a week)**\n\nWater, Sodium Cocoyl Isethionate, Glycerin, Coconut Acid, Polyquaternium-67, 1,2-Hexanediol, Sodium Isethionate, Sodium Methyl Cocoyl Taurate, Litsea Cubeba (May Chang) Oil, Sodium Chloride, Disodium EDTA, Ethylhexylglycerin, Sodium Acetate, Butylene Glycol, Centella Asiatica (Gotu Kola) Extract, Portulaca Oleracea (Green Purslane) Extract, Camellia Sinensis (Green Tea) Leaf Extract, Hamamelis Virginiana (Witch Hazel) Extract, Sodium Hyaluronate, Beta-Glucan, Melaleuca Alternifolia (Tea Tree) Leaf Extract, Pentylene Glycol, Caprylyl Glycol, Diatomaceous Earth, Isopropyl Alcohol, Citric Acid, Vigna Angularis Seed Extract\n\n**6. B\\_LAB - Matcha Hydrating Foam Cleanser (also for 1-2x a week)**\n\nWater, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, 1,2-Hexanediol, Camellia Sinensis Leaf Extract, Betaine, Hydroxypropyl Starch Phosphate, Centella Asiatica Extract, Ficus Carica (Fig) Fruit Extract, Laminaria Japonica Extract, Eclipta Prostrata Leaf Extract, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Ulmus Davidiana Root Extract, Amaranthus Caudatus Seed Extract, Hydrogenated Lecithin, Lauryl Betaine, Camellia Sinensis Leaf Powder, Sodium Chloride, Polyquaternium-39, Decylene Glycol, Allantoin, Butylene Glycol, Fructan, Fructooligosaccharides, Beta-Glucan, Ceramide NP, Hydrolyzed Hyaluronic Acid, Hydroxyacetophenone, Ethylhexylglycerin",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "qualified_to_be",
        "body": "As someone with moderate T1 Rosacea, I love Asian skincare, that said, I havenâ€™t tried any of these personally. If youâ€™ve done your research, just try the first one! Iâ€™ve heard nothing but great things about Skin1004 as a whole.\n\nIâ€™d share this with the r/AsianBeauty peeps as well. Iâ€™ve noticed a lot of eczema, psoriasis, and rosacea girlies there too.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "fnywya",
    "title": "[Review]: Make p:rem Safe Me. Relief Moisture Cleansing Foam",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/fnywya/review_make_prem_safe_me_relief_moisture/",
    "score": 5,
    "num_comments": 4,
    "created": "2020-03-24T04:30:29+00:00",
    "body": "Alright, this was both a very easy and very hard review to put together as my views on this Water Based Cleanser are probably a little biased LOL! You seeâ€¦this Cleanser saved my lifeâ€¦\n\nLOL, not that dramatic but pretty close. If you remember (or donâ€™t) I decided about a month ago that it would be an excellent idea to use an â€œall-naturalâ€ Bar Soap that had been listed as okay for use on the face. WRONG LOLâ€¦over the two plus weeks I used it I ended up stripping my Skin, clogging my pores, inviting breakouts, and generally messing everything up.\n\nWell, after that experience I really needed to switch to something that was going to reverse what I had done to myself. This Make P:rem Cleansing Foam jumped out since it has been recommended by a few bloggers as being great for Sensitive Skin. \n\nThe first thing that I surprised me about this Product was just how creamy/foamy it truly is. Most pH Balanced Cleansers do a decent job (at best) of foaming upâ€¦but this one feels really thick and luxurious. Especially after mixing it in my Nooni Whip Makerâ€¦WOW! The closest pH Balanced Cleanser I can compare it to is the Sulwhasoo EX Brightening Cleansing Foam. \n\nAs for the Formulaâ€¦there are a couple of Ingredients that do raise some concern. The Coconut Based Surfactants (not an issue) followed by a few Essential Oils (can be an issue). I didnâ€™t have a problem with them but I would hesitate from recommending this as the ultimate gentle Cleanser as Essential Oils pose a problem for some. Bergamot Oil and Sage Oil are both here. In addition to the Oils we also have Raspberry Fruit Extract, Sodium Hyaluronate, and Citric Acid (which I assume is there to help lower the pH). \n\nEssential Oils asideâ€¦this Cleanser brought my Skin back from the brink so fast I was truly shocked. The foam feels so comfortable and luxuriousâ€¦and the mild herbal scent was relaxing. Just after a few uses my Skin seemed to be less red and the few angry red bumps I had developed were much more calm.\n\nOver the past few weeks I have fallen in love with this Product LOL! Usually I am not a fan of such a â€œbasicâ€ Cleanser. Give me some antioxidants, give me some brighteningâ€¦something! But, this Make P:rem Safe Me Cleanser was exactly what I needed in the moment. I came in and quietly said â€œIâ€™m just gonna pop in here and fix this.â€ and went on its way.\n\nMy struggle with wholeheartedly recommending this Product (aside from the plastic bottle) is that I think my view is a victim of circumstance. If my Skin was happy and healthy at the time I brought this into my Routine I could totally see myself as calling it boring, basic, or not doing that much. And again, those Essential Oils would keep from saying its the new go-to for Sensitive Skin peeps.\n\nPersonally, I plan to keep the rest of this bottle as my â€œIn Case Of Emergencyâ€¦Use Thisâ€ Cleanser. For those that arenâ€™t particularly triggered by Essential Oils (LOL)â€¦this is an excellent go to for days when your Skin is feeling overworked or (in my case) you made a bad call with another Product. I feel like I would even put this one above my other favorites from Peach & Lily and Youth To The People (for the purpose of bringing Skin back to a happy state) as its creamy consistency adds a bit of comfort/luxury that Gel Style Cleansers have a hard time matching.\n\nFull Ingredients List: \n\nWater, Sodium Cocoyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Potassium Cocoyl Glycinate, Potassium Benzoate, Sodium Chloride, Polyquaternium-67, Potassium Cocoate, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citric Acid, Disodium EDTA, Salvia Officinalis (Sage) Oil, Sodium Acetate, Rubus Idaeus (Raspberry) Fruit Extract, 1,2-Hexanediol, Sodium Hyaluronate, Ethylhexylglycerin\n\n&#x200B;\n\nhttps://preview.redd.it/eqlgae0atjo41.jpg?width=1240&format=pjpg&auto=webp&s=ea705dc9de5e8a1293e4b9371c2ced4d8c677813",
    "flair_text": "Review",
    "flair_template_id": "9297aa06-d015-11e3-b9a1-12313d18e5cd",
    "comments": [
      {
        "author": "labellavita1985",
        "body": "I absolutely love this cleanser.\n\nIt's the Number 1 cleanser in Korea according to Hwahae. \n\nI swear it helps with redness and evenness. My skin looks better after cleansing.\n\nI agree about the soft luxurious foam.\n\nMy problem is it's a bit outside of my target price range for cleanser. I don't like to spend $15 on products that don't get left on the skin.\n\nThank you for the review â˜ºï¸",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/fnykv1/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "weenkles",
        "body": "Great review \n\nnever mind my comment about ingredients, I was talking about the milk not the foam... Sorry about that..",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Vegetable-Store-3252",
        "body": "for my skin this one left a film that just didn't seem to wash off, definitely due to the  Polyquaternium in this",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Accutane",
    "post_id": "1ep60iq",
    "title": "Why am I still getting clogged pores on Accutane ðŸ˜­",
    "url": "https://www.reddit.com/r/Accutane/comments/1ep60iq/why_am_i_still_getting_clogged_pores_on_accutane/",
    "score": 5,
    "num_comments": 7,
    "created": "2024-08-10T23:07:59+00:00",
    "body": "My skin tends to clog and then inflame (and then leave scars). I accumulated quite a bit of scarring and this is the main reason Iâ€™m on Accutane. I just started my third month (first month 40, second month 40, third month 60 g). In the past few weeks, Iâ€™ve gotten some new clogged pores on my cheek/chin. I donâ€™t understand. I tried to curate my skincare to be non-comedogenic and this still happens. Am I using too much moistuizer? Hereâ€™s the skincare Iâ€™m using. Both products have been really good for me, aside from the clogged pore thing. The weather *is* warm, so maybe that has to do with it?\n\nRound Lab Mugwort Calming Cleanser\nIngredients: Water, Glycerin, Sodium Cocoyl Glycinate, Sodium Lauroyl Glutamate, Butylene Glycol, Coco-Betaine, Betaine, Hydroxypropyl Starch Phosphate, Artemisia Vulgaris Extract (10,045ppm), Artemisia Princeps Leaf Extract 800pm, Madecassoside, Asiaticoside, Asiatic Acid, Madecassic Acid, Panthenol, Allantoin, Melia Azadirachta Leaf Extract, Malt Extract, Camellia Sinensis Leaf Extract, Melia Azadirachta Flower Extract, Sodium Chloride, Aspartic Acid, Caprylyl Glycol, Polyquaternium-67, 1,2-Hexanediol, Ethylhexylglycerin, Citric Acid, Salvia Officinalis (Sage) Oil\n\nPurito B5 Panthenol Re-barrier Cream\nIngredients: Centella Asiatica Extract, Panthenol (10%), Squalane, Butylene Glycol, Water, 1,2-Hexanediol, Niacinamide, Hydrolyzed Jojoba Esters, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Ammonium Acryloyldimethyltaurate/VP Copolymer, Hydroxyacetophenone, Tromethamine, Dipotassium Glycyrrhizate, Ethylhexylglycerin, Disodium EDTA, Xanthan Gum, Sodium Hyaluronate, Madecassoside, Asiaticoside, Asiatic Acid, Copper Tripeptide-1, Madecassic Acid\n\nI also use the Hanskin PHA oil cleanser as the first step in my double cleansing routine occasionally, but I donâ€™t go out much these days so I donâ€™t double cleanse too much.",
    "flair_text": "Side Effects",
    "flair_template_id": "a00e6f80-e185-11ee-9bce-f23e7c57ab30",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Please read the rules before posting and remember to abide by them!\nPosts and comments not following the rules will immediately be removed!\n\nHave you tried using the search bar?  \nMany questions are asked daily, and your question may have already \nbeen answered!  \nIf so, your post will be subject to deletion.\n\nPlease refer to the following commonly discussed \ntopics:\n\n1) No one can predict whether or not you will purge! \nStatistically, most people DO NOT purge.  \nThat is what the science and medical literature says.\n\n2) No one can predict how long your purge will last \nnor when it could start. \nBe patient, the purge can be tough but so many people have gotten through it - \nyou can too!\n\n3)  Any questions related about dosage MUST include DOSE and WEIGHT(lbs or kg).  \nOtherwise, that is considered LOW EFFORT and will subsequently be REMOVED.   \n\n4)  Most people DO NOT replase when Accutane is taken until cumulative dosage is reached.\n\n5) HOWEVER, cumulative dosage is a guideline.  \nEveryone is different.  Some may need more Accutane, and others may need less.  Your dermatologist \nevaluates you as an individual.  \nThis also applies to your prescription.  Everyone is different, so no comparing of doses or asking why your dose is low or high.\nIf you do not trust your dermatologist, you should find a different one.\n\n6) When in doubt, please consult a medical \nprofessional(dermatologist, doctor, pharmacist).  \nDO NOT solicit medical advice from this subreddit.  \nRemember Reddit is a bunch of strangers on the internet.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Accutane) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "galactilicious",
        "body": "Purging.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTreatmentTesters",
    "post_id": "1kgeo78",
    "title": "Looking into the best DHT-blocking shampoos",
    "url": "https://www.reddit.com/r/HairTreatmentTesters/comments/1kgeo78/looking_into_the_best_dhtblocking_shampoos/",
    "score": 3,
    "num_comments": 0,
    "created": "2025-05-06T20:22:05+00:00",
    "body": "If you've ever browsed through hair loss threads here on Reddit you've probably already seen a bucketful of posts on DHT-blocking shampoos. \n\nSome posters say they can do everything except make you breakfast in the morning. Others say these products are nothing more than snake oil.\n\nIf you're just looking to be kind to your scalp, this makes life super difficult. With so much hype here and on the interwebs, how the hell do you tell which shampoos are legit (if any)?\n\nThat's why I, your balding best friend, decided to be a guinea pig for your benefit by digging through the latest lists and testing a few of these shampoos myself.\n\nHere's the real talk on which DHT-blocking shampoos are worth your time and money, as well as who they work best for.\n\nJust in case you're wondering, DHT (dihydrotestosterone) is the hormone that's most responsible for male pattern hair loss, though it can also sometimes cause hair loss in women.\n\nWhile oral and topical meds like finasteride and minoxidil are probably the best way to block DHT and regrow hair, certain shampoos can help. They can reduce DHT on your scalp, and generally improve the health of your hair. \n\nThis said, you should always consider DHT-blocking shampoos as an extra layer to your hair loss treatment. They can't replace medication altogether. \n\n**Here are a few that have been shown to work:**\n\n1. Happy Head Hair Thickening Shampoo\n\nThis shampoo is infused with a veritable cocktail of healthy and DHT-blocking ingredients, including Argan Oil, Biotin, Collagen, Keratin, and Saw Palmetto.\n\nThe latter ingredient (Saw palmetto) is particularly good for reducing DHT levels on the scalp.\n\nWhat I really liked about this one is that it has a very fresh scent, it reminded me of being outside during the sunrise in Alaska! It's also not too overpowering, which I prefer in a shampoo. I'd say it's suitable for both men and women who are looking to tackle early-stage hair thinning, so long as it's coupled with other treatments.\n\nHappy Head recommends pairing this shampoo with its hair-thickening conditioner to stabilize hair loss completely. \n\nThe Hair Thickening shampoo bottles are 8 fl oz / 240 ml. You can buy them for $36 as a one-off purchase or $30 per month as part of a subscription. There's an introductory offer to get it for $21 for the first month, which I used to test this out.\n\n2. Hims Thick Fix Thickening Shampoo\n\nI was cautious about trying this out after reading multiple comments like this:\n\n[https://www.reddit.com/r/tressless/comments/s9ojkd/comment/htqm056/](https://www.reddit.com/r/tressless/comments/s9ojkd/comment/htqm056/)\n\nLong story short, redditors were saying they'd had pretty lukewarm results with this shampoo. Still, its key ingredient is saw palmetto which we already know is good for reducing DHT on your scalp. There are also some thickening agents like natural guar gum and Polyquaternium-67 (a synthetic polymer derived from cellulose that can smooth cuticles). \n\nLike Happy Head's offering, the shampoo has a fresh scent. It's actually quite minty. The website says it's eucalyptus. \n\nBottles are 6.4 fl oz / 190 ml. You can buy them for $19 each as a one-off purchase. Due to its relative affordability, I'd say this is a good choice for both guys and gals who need a simple, low-cost supplement for their hair care routine. Just bear in mind the lackluster Reddit reviews.\n\n3. MDhair Restore Shampoo\n\nWhile digging in to this particular product I came across Reddit threads like this [https://www.reddit.com/r/tressless/comments/12o9aej/anyones\\_thoughts\\_on\\_mdhair\\_products/](https://www.reddit.com/r/tressless/comments/12o9aej/anyones_thoughts_on_mdhair_products/) that give mixed reports about this product.\n\nThe general trend seems to be it works well at first, then slopes off. I only used it for a couple of weeks, so have no complaints but you'll probably need to do your own research to check if this is the best long-term hair loss treatment.\n\nActive ingredients include our old friend saw palmetto extract, as well pumpkin seed oil which also has DHT-blocking properties. It also includes other components for maximizing hair volume like keratin, argan oil, and even tea tree oil. They all seem to be plant-based, making this a good option for vegans.\n\nOf all the shampoos I've tried, this probably has the longest list of ingredients, so I encourage you to read the bottle carefully before trying it out. Speaking of the bottle, when I opened it there wasn't much of a scent. \n\nThe product comes in quantities of 3.7 fl oz (110 ml) and costs $22 per unit. This makes it one of the more expensive DHT-blocking shampoos out there, but discounts are available if you buy in three or six units in one go.\n\nA word of warning: Remember, certain people (myself included!) are sensitive to ingredients commonly used in the above products, particularly saw palmetto and ketoconazole. If your scalp is itchy or red, stop using the shampoo immediately and contact your provider for a gentler formula.\n\nI'd love to hear from anyone who's tried these (or other) DHT-blocking shampoos for any length of time. Which one's worked (or didn't work) for you? Let me know!  ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "n58owk",
    "title": "help, are any of these ingredients bad for seb derm?",
    "url": "https://www.reddit.com/r/SebDerm/comments/n58owk/help_are_any_of_these_ingredients_bad_for_seb_derm/",
    "score": 3,
    "num_comments": 8,
    "created": "2021-05-05T05:54:12+00:00",
    "body": "new leave in conditioner im using \n- AQUA / WATER / EAU, DIMETHICONE, CETEARYL ALCOHOL, AMODIMETHICONE, PHENOXYETHANOL, POLYQUATERNIUM-37, DIMETHICONOL, PARFUM / FRAGRANCE, PROPYLENE GLYCOL DICAPRYLATE/DICAPRATE, TRIDECETH-5, STEARETH-20, CETYL HYDROXYETHYLCELLULOSE, GLYCERIN, CITRIC ACID, LIMONENE, PPG-1 TRIDECETH-6, TRIDECETH-10, SODIUM HYDROXIDE, CHLORHEXIDINE DIGLUCONATE, SORBITAN OLEATE, ACETIC ACID, LINALOOL, CITRONELLOL, CITRAL, EUGENOL\n\nmoisture treatment \n- AQUA / WATER / EAU, GLYCERIN, CETEARYL ALCOHOL, BEHENTRIMONIUM CHLORIDE, AMODIMETHICONE, CETYL ESTERS, ISOPROPYL ALCOHOL, SODIUM PCA, PHENOXYETHANOL, PARFUM / FRAGRANCE, TRIDECETH-6, CHLORHEXIDINE DIGLUCONATE, BENZYL ALCOHOL, LINALOOL, CETRIMONIUM CHLORIDE, HEXYL CINNAMAL, SODIUM HYALURONATE\n\nprotein treatment\n-AQUA / WATER / EAU, BEHENTRIMONIUM CHLORIDE, CETEARYL ALCOHOL, ARGININE, GLUTAMIC ACID, GLYCERIN, PEG-40/PPG-8 METHYLAMINOPROPYL/HYDROXYPROPYL DIMETHICONE, COPOLYMER, ISOPROPYL ALCOHOL, CITRIC ACID, DIPROPYLENE GLYCOL, PHENOXYETHANOL, HYDROXYETHYLCELLULOSE, PARFUM / FRAGRANCE, POLYQUATERNIUM-67, POLYSORBATE 20, HYDROLYZED VEGETABLE PROTEIN PG-PROPYL SILANETRIOL, CETYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, CHLORHEXIDINE DIGLUCONATE, QUATERNIUM-33, BENZYL ALCOHOL, LINALOOL, HEXYL CINNAMAL, POTASSIUM SORBATE\n\nI feel like itâ€™s most likely the leave in conditioner (1st list of ingredients) thatâ€™s probably making me flare up . but iâ€™d appreciate if someone could identify some red flag ingredients for me",
    "flair_text": "Product Question",
    "flair_template_id": "9010acb6-e88b-11ea-b1b9-0ef3bc6b5891",
    "comments": [
      {
        "author": "saaaaabinaaaaaass",
        "body": "a bunch of unsafe ingredients:(",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Wdraycott01",
        "body": "Just go no poo, worked wonders for me",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "real_herbalgerbil",
        "body": "Alcohol is bad.... dunno about the others",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FancyFollicles",
    "post_id": "4z9ala",
    "title": "Advice: At home bleaching after Olia hair dye (metallic salts)",
    "url": "https://www.reddit.com/r/FancyFollicles/comments/4z9ala/advice_at_home_bleaching_after_olia_hair_dye/",
    "score": 3,
    "num_comments": 3,
    "created": "2016-08-23T22:52:54+00:00",
    "body": "Hi Fancy Follicles just looking for some advice,\n\nIt's my first time at home bleaching my hair and have regularly been using Olia light blonde (last time was about 2 months ago, give or take). I have a darker Brown hair colour and about 1/2 inch of roots to colour. I have some Wella colour charm powder lightener and Wella cream developer volume 20. I plan to tone after but I'm wondering if I should be concerned, since I've been reading some articles about metallic salts in box dyes. I know metal salt dyes can't be combined with bleach (burning etc) but I'm not sure if Olia hair dye has these salts and I was wondering if one of you wonderful people with more knowledge then me could let me know. \n\nHere's the ingredient list: \n\nColorant:Â Paraffinum Liquidum/Mineral Oil/Huile Minerale, Aqua/Water/Eau, Ethanolamine, Steareth-20, Caprylyl/Capryl Glucoside, Polysorbate 21, Toluene-2,5-Diamine, Steareth-2, Resorcinol, Parfum/Fragrance, M-Aminophenol, 2,4-Diaminophenoxyethanol Hcl, Sodium Metabisulfite, N,N-Bis(2-Hydroxyethyl)-P-Phenylenediamine Sulfate, Ascorbic Acid, Edta, Polyquaternium-67, Hydroxybenzomorpholine, Helianthus Annuus Seed Oil/Sunflower Seed Oil, Limnanthes Alba Seed Oil/Meadowfoam Seed Oil, Passiflora Incarnata/Passiflora Incarnata Seed Oil, Camellia Oleifera Seed Oil, Thioglycerin\n\nTLDR: is there metallic salts in Olia hair colour and should I be concerned bleaching my hair at home after using Olia for a few yrs",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "LasciviousLlama",
        "body": "Metallic salts react badly with most professional colors and bleaches. Metallic salts are typically the culprit when you hear about someone getting a \"chemical haircut\" i.e. their hair breaks off. It can also cause your hair to smoke and melt. I would recommend performing a test strand before each new color. Take a small section of hair from the lower back of your head and apply the color/bleach and let it develop to see how the hair reacts. Does it smoke, get hot, not color well, break, or cause your hair to feel like wet noodles? If the answer to any of those is yes, obviously don't go through with doing your whole head. If the test strand goes well, you're good to go!",
        "score": 6,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Skincare_Addiction",
    "post_id": "19biekk",
    "title": "have anyone tried the new formula of etude soonjung 5.5 cleanser?",
    "url": "https://www.reddit.com/r/Skincare_Addiction/comments/19biekk/have_anyone_tried_the_new_formula_of_etude/",
    "score": 3,
    "num_comments": 2,
    "created": "2024-01-20T18:34:16+00:00",
    "body": "the ingredients: \n\nWATER / AQUA / EAU, SODIUM COCOYL ISETHIONATE, GLYCERIN, HYDROXYPROPYL STARCH PHOSPHATE, SODIUM METHYL COCOYL TAURATE, DECYL GLUCOSIDE, POTASSIUM COCOYL GLYCINATE, CETEARYL ALCOHOL, GLYCERYL STEARATE, SORBITAN OLIVATE, GLYCOL DISTEARATE, POTASSIUM COCOATE, CAPRYLYL GLYCOL, CITRIC ACID, POLYQUATERNIUM-67, GLYCERYL CAPRYLATE, DISODIUM EDTA, SODIUM ACETATE, SODIUM CHLORIDE, PANTHENOL, PENTYLENE GLYCOL, MADECASSOSIDE",
    "flair_text": "Product Question",
    "flair_template_id": "d9d5f234-4250-11ea-99e4-0ecdfe17c40f",
    "comments": [
      {
        "author": "NoTurnip6629",
        "body": "Did u try?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1ehjfo4",
    "title": "[product question] Can I use this vitamin c night serum in the morning?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1ehjfo4/product_question_can_i_use_this_vitamin_c_night/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-08-01T15:25:13+00:00",
    "body": "Ingredients: \nAqua / Water, Ascorbic Acid, Pentylene Glycol, Glycerin, Sodium Hydroxide, Hydroxyacetophenone, Salicylic Acid, Caprylyl Glycol, Caprylyl/ Capryl Glucoside, Polyquaternium-67, Adenosine, Trisodium Ethylenediamine Disuccinate, Sodium Hyaluronate, Linalool, Limonene, Geraniol, Parfum / Fragrance.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guide [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "19ar4om",
    "title": "[product question] have anyone tried the new formula of etude soonjung 5.5 cleanser?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/19ar4om/product_question_have_anyone_tried_the_new/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-01-19T19:16:37+00:00",
    "body": "the ingredients :\n\nWATER / AQUA / EAU, SODIUM COCOYL ISETHIONATE, GLYCERIN, HYDROXYPROPYL STARCH PHOSPHATE, SODIUM METHYL COCOYL TAURATE, DECYL GLUCOSIDE, POTASSIUM COCOYL GLYCINATE, CETEARYL ALCOHOL, GLYCERYL STEARATE, SORBITAN OLIVATE, GLYCOL DISTEARATE, POTASSIUM COCOATE, CAPRYLYL GLYCOL, CITRIC ACID, POLYQUATERNIUM-67, GLYCERYL CAPRYLATE, DISODIUM EDTA, SODIUM ACETATE, SODIUM CHLORIDE, PANTHENOL, PENTYLENE GLYCOL, MADECASSOSIDE",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "NoTurnip6629",
        "body": "Did u try",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "wx1fd9",
    "title": "Help with what ingredient is causing bumps on scalp & neck",
    "url": "https://www.reddit.com/r/curlyhair/comments/wx1fd9/help_with_what_ingredient_is_causing_bumps_on/",
    "score": 2,
    "num_comments": 6,
    "created": "2022-08-25T01:55:33+00:00",
    "body": "I recently purchased the Zotos All About Curls Line as a Deva knockoff and after the first couple of uses I developed 3-4 large pimple-like bumps on the nape of my neck and around my hairline by my ear.  I experienced these same bumps several years ago with the LUS line (I loved what it did to my hair, but couldn't deal with the bumps!).  These are both supposed to be very ingredient-friendly lines, so I'm trying to compare and figure out what I apparently reacting to.  I analyzed the ingredient lists from both brands' conditioners and found the following matching ingredients (see below).  I also ran the ingredients through CosDNA to see if anything dinged as a problem.\n\nNothing I'm doing is healing these bumps (other than time I guess).  I've tried tea tree, clay masks, anti-fungal shampoo, neosporin.  They don't pop like pimples.  \n\nI cut everything out the last week, and last night I added in the Zotos conditioner only to try to narrow down the issue and I have a couple new sore bumps on my scalp.\n\nClearly I have to avoid one (or several) of these ingredients, but I need help narrowing it down and seeing if anyone else has had experience with this?\n\n&#x200B;\n\nZotos Daily Conditioner:\n\nWATER/AQUA/EAU, CETEARYL ALCOHOL, ISOAMYL LAURATE, BEHENTRIMONIUM CHLORIDE, GLYCERIN, GLYCERYL STEARATE SE, COCOS NUCIFERA (COCONUT) OIL, HONEY/MEL/MIEL, BUTYROSPERMUM PARKII (SHEA) BUTTER EXTRACT, HYDROLYZED SOY PROTEIN, PRUNUS AMYGDALUS DULCIS (SWEET ALMOND) FRUIT EXTRACT, SCLEROCARYA BIRREA SEED OIL, GLYCINE SOJA (SOYBEAN) OIL, PHENOXYETHANOL, POLYQUATERNIUM-67, GLYCERYL LAURATE, SODIUM GLUCONATE, CITRIC ACID, LECITHIN, ISOPROPYL ALCOHOL, LIMONENE, COUMARIN, LINALOOL, ALPHA-ISOMETHYL IONONE, FRAGRANCE/PARFUM.\n\n&#x200B;\n\nLUS Conditioner:\n\n Aqua/Water/Eau, Cetyl Alcohol, Cetearyl Alcohol, Ceteareth-20, Glycerin, Cetrimonium Chloride, Polyquaternium-11, Butyrospermum Parkii (Shea) Butter, Moringa Oleifera Seed Oil, Polyquaternium-7, Polyquaternium-37, Citric Acid, Phenoxyethanol, Ethylhexylglycerin, Fragrance/Parfum. \n\n&#x200B;\n\nShared ingredients from both products:\n\nCETEARYL ALCOHOL, glycerin, BUTYROSPERMUM PARKII (SHEA) BUTTER EXTRACT, PHENOXYETHANOL, Citric Acid",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "manderly808",
        "body": "Photo of the bumps on my nape\n\nhttps://i.imgur.com/QOIm3O4.jpghttps://i.imgur.com/S3GcqD5.jpg",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "manderly808",
        "body": "https://i.imgur.com/VTevGjH.jpg",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lavender_and_teal",
        "body": "Itâ€™s unlikely that glycerin or cetearyl alcohol is causing this, at least in my eyes. I do notice that both products have fragrance which can irritate the skin and cause reactions, so fragrance sensitivity or allergy is a possibility. Phenoxyethanol is a preservative that can cause skin irritation or allergies in some people, but itâ€™s likely in other products you use as well. If you have skincare with it and donâ€™t have that issue, I would rule this out as a culprit. Itâ€™s very common and wouldnâ€™t be in a very high concentration based on the ingredient list. Same with citric acid, I donâ€™t think thatâ€™s it. Itâ€™s a ph adjustor in a very small concentration.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bisi30",
        "body": "If they are pimples and not allergic reaction, it could be the almond oil or coconut oil. Both of those cause breakouts for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thebouncingcupcake",
        "body": "Definitely one of the oils, coconut oil is a known comedogenic.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "overwhelmed_housecat",
        "body": "Behentrimonium chloride in eva NYC protein mask. Ruined my scalp felt like a chemical burn. Unfortunately I Google it and apparently its toxic at high concentrations could just be contact dermatitis but its regulated in Europe apparently not in US.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "16dtah1",
    "title": "Nanoplasty aftercare question!",
    "url": "https://www.reddit.com/r/Hair/comments/16dtah1/nanoplasty_aftercare_question/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-09-09T02:03:33+00:00",
    "body": "Help!!! I got a salon nanoplasty a few days ago and have 1L of redken â€œacidic bonding concentrateâ€ shampoo at home and I am trying to work out if this will be a bad option for my hair! \n\nMy natural hair prior to nanoplasty was colour treated, shoulder length curly/frizzy â€œhagrid-esqueâ€ hair, with hair like this the longer the nanoplasty lasts the better so any advice from people is appreciated\n\n the shampoo ingredients are below \n\nAQUA / WATER / EAU DECYL GLUCOSIDE SODIUM COCOYL ISETHIONATE COCAMIDOPROPYL BETAINE CITRIC ACID SODIUM HYDROXIDE PANTHENOL GLYCERIN DIMETHICONE PEG-150 DISTEARATE PPG-5-CETETH-20 SODIUM BENZOATE SODIUM CHLORIDE PEG-55 PROPYLENE GLYCOL OLEATE PROPYLENE GLYCOL CARBOMER PARFUM / FRAGRANCE COCO-CAPRYLATE/CAPRATE POLYQUATERNIUM-67 SALICYLIC ACID AMODIMETHICONE SODIUM PHYTATE GLYCOL DISTEARATE COCO-BETAINE ACRYLATES/BEHENETH-25 METHACRYLATE COPOLYMER LIMONENE TRIDECETH-6\n\nPlease let me know if this will b ok followed by a treatment or if I shud try something else(if so suggestions please!)\n\nTIA",
    "flair_text": "Help",
    "flair_template_id": "1fb23224-19ed-11e8-8598-0e09b1f8bce8",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  }
]