[
  {
    "subreddit": "HaircareScience",
    "post_id": "t5wzoi",
    "title": "You can mend split ends semi-permanently",
    "url": "https://www.reddit.com/r/HaircareScience/comments/t5wzoi/you_can_mend_split_ends_semipermanently/",
    "score": 272,
    "num_comments": 60,
    "created": "2022-03-03T17:36:28+00:00",
    "body": "Part 2 based on u/winwinnwinnie’s comment: https://www.reddit.com/r/Hair/comments/t82slz/mending_split_ends_part_2_with_castor_oilsebacic/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nYou can temporarily mend split ends together with the ingredients polyquaternium-28 and PVM/MA copolymer. Most products that claim to mend split ends don’t have these two ingredients. Also, both ingredients are required for the mending to work and withstand other stresses like combing. \n\n#Here’s the study done on these two ingredients showing the semi permanent mending effects: \n\nhttps://www.researchgate.net/publication/6111412_Semi-permanent_split_end_mending_with_a_polyelectrolyte_complex\n\n##Brief explanation:\n\nThe cationic, anti static ingredient **polyquaternium-28** is attracted to the anionic ingredient **PVM/MA copolymer**. The idea is that damage and split ends are anionic so the polyquaternium-28 is attracted to them and will bind them together until it is washed out. In the study, these two ingredients were shown to bind together split ends and also withstood the stress of combing.\n\n#Here are some products I FINALLY found that have these two ingredients:\n\n#[Kim Kimble Healed Ends Serum 4 oz ($20)](https://www.frendsbeauty.com/kim-kimble-healed-ends-serum-4oz.html)\n\nIngredients: \n\nWater (Aqua), **Polyquaternium-28**, PEG-40 Hydrogenated Castor Oil, Hydroxyethylcellulose, Arctium Majus Root (Burdock) Extract, Citrus Medica Limonum (Lemon) Peel Extract, Equisetum Arvense (Horsetail Extract, Malva Sylvestris (Mallow) Flower Extract, Citrus Limon (Lemon) Fruit Extract, Pyrus Malus (Apple) Fruit Extract, Saccharum Officinaru (Sugarcane) Extract, Camellia Sinensis Leaf Extract, Caprylyl Glycol, Lactic Acid, Ethylhexyglycerin, Betaine, Hexylene Glycol, **PVM/MA Copolymer**, Dimethicone PEG-8 Meadowfoamate, Hexapeptide-11, Phenoxyethanol, Sodium Hydroxide, Glycerin, Fragrance (Parfum)\n\nThis one has **polyquaternium-28** as the 2nd ingredient, then some oils, a bunch of extracts, then the **PVM/MA copolymer** as the 17th ingredient. Phenoxyethanol as the preservative is fine here since it is being used on the ends, not on the scalp.\n\n#[Color Proof SuperRich Split Ends Mender 3.4 oz ($11)](https://www.beautyplussalon.com/color-proof-superrich-split-ends-mender)\n\nIngredients:\n\nWater/Aqua/Eau, Glycerin, **Polyquaternium-28**, Phenoxyethanol, Xanthan Gum, Fragrance (Parfum), **PVM/MA Copolymer**, Sodium Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Isohexadecane, Sodium Hydroxide, Disodium EDTA, Hydroxypropyl Cyclodextrin, Polysorbate 80, Caprylyl Glycol, Linalool, Citric Acid, Limonene, Sorbitan Oleate, Iodopropynyl Butylcarbamate, Citronellol, Citral, Helianthus Annuus (Sunflower) Seed Oil, Ethylhexyl Methoxycinnamate, Pelargonium Graveolens Flower Oil, Sodium Polystyrene Sulfonate, Tocopheryl Acetate, Quaternium-95, Propanediol, Helianthus Annuus (Sunflower) Seed Extract, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Laminaria Digitata Extract, Hydrolyzed Adansonia Digitata Seed Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Salvia Officinalis (Sage) Leaf Extract, Achillea Millefolium Extract, Potassium Sorbate, Lentinus Edodes Extract, Tocopherol, Benzyl Alcohol, Sodium Benzoate, BHT, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate.\n\nThis ingredients list is interesting, **polyquaternium-28** as the 3rd ingredient is awesome, but the 4th, 5th, and 6th ingredients are two preservatives and a fragrance. That’s fine, as xanthan gum is also a thickener. Then the 7th ingredient is the **PVM/MA copolymer**. Then there’s a bunch of emollients and extracts and another preservative that is annoying to see in products. \n\n##This one contains Iodopropynyl butylcarbamate, a **formaldehyde releasing preservative**. This is fine, as the formaldehyde is how it preserves the product, but it is always good to be aware of these things, so you don’t let the bottle sit for a very long time, as this ingredient **releases formaldehyde slowly over time** to preserve the product. \n\n#[White Sands The Cure 24/7 Serum 3.38 oz ($20)](https://sleekshop.com/products/white-sands-the-cure-24-7-serum.html?sku=whs09-3-38-oz)\n\nIngredients:\n\nDeionized Water, **Polyaualerium-28**, **PVMMA Copolymer**, Xanthan Gum, Caprylic/Capric Acid, Triglyceride, Cyrribidium Grandilorioum Flower, Propylene Glycol, Diazolidinyl Urea, Iodopropynyl Butylcarbarmate, Fragrance.\n\nThis one has a much more simple ingredients list! **Polyquaternium-28** is the second ingredient and the **PVM/MA** copolymer is the third ingredient. Then there is xanthan gum to thicken and preserve. \n\n##However, again, at the end of this list we have **formaldehyde releasing preservatives**: **Diazolidinyl Urea and Iodopropynyl Butylcarbarmate.** Again, this is fine, but good to be aware of so you don’t let the bottle sit for a year, as these preservatives **slowly release formaldehyde over time** to preserve the product. \n\n#[OGX Coconut Curls Air Dry Cream 6 oz ($9)](https://www.ulta.com/p/locking-coconut-curls-air-dry-cream-pimprod2005306)\n\nIngredients:\n\nWater (Aqua), Tapioca Starch, C12-15 Alkyl Benzoate, Polyquaternium-37, Cocos Nucifera (Coconut) Oil, Butyrospermum Parkii (Shea) Butter, **Polyquaternium-28**, **PVM/VA Copolymer**, Propylene Glycol Dicaprylate/Dicaprate, PPG-1 Trideceth-6, Polymethylsilsesquioxane, Lecithin, Sodium Hydroxide, Phenoxyethanol, Caprylyl Glycol, Fragrance (Parfum)\n\nHere we have tapioca starch to reduce any heavy oily feel. Then some emollients and oils. Then **polyquaternium-28** as the 7th ingredient and the **PVM/MA copolymer** as the 8th ingredient. Then there’s some more emollients and then the preservative and a fragrance. Phenoxyethanol is a fine because this is for use on the end of the hair, not the scalp. \n\nSo there you have it. You can semi-permanently mend your split ends. It took a LONG time for me to find products that actually had the *combitnation* of BOTH of these ingredients. \n#So if anyone else finds more products that contain polyquaternium-28 and PVM/MA copolymer, please share here!\n\nAlso, for those that can’t tell, the links are imbedded in the title of the product. So, for example, you can click on the title Kim Kimble Healed Ends Serum at the top of the post and it will take you to the website. The links are imbedded in every title",
    "flair_text": "Research Highlight",
    "flair_template_id": "a19dce10-9249-11eb-8a61-0ee89185d3f7",
    "comments": [
      {
        "author": "thebouncingcupcake",
        "body": "**This is where my detective skills shine.** I did a search on Cosdna for products that contain both these ingredients, here's what's in the database:\n\n_____________________________________________________\n\n\nNeXXus ProMend Heat Protexx Heat Protection Styling Spray\n\nDRYBAR Hot Toddy Heat Protector Frizz Fighter\n\ntresemme split remedy split end sealing serum\n\nTresemme Split End Shampoo\n\nNexxus Promend Split End Binding Daily Conditioner\n\nSuave Professionals Split End Rescue Serum\n\nDrybar Hot Toddy Heat & UV Protectant\n\nNexxus ProMend Heat Protecting Mist\n\nOribe - Split End Seal Beautiful Color Treatment\n\nTRESemme Keratin Smooth 7 Day Smooth Conditioner\n\nNexxus Promend for Hair Prone to Split Ends Leave-In Creme\n\nTresemme Slit end remedy\n\nTresemme 7 day smooth heat activating treatment\n\nSISLEY THE CREAM 230",
        "score": 134,
        "is_top_level": true
      },
      {
        "author": "klymfs",
        "body": "Just gonna say I'm not a Chemist but I work in regulatory in R&D in a personal care facility and these two components are merely just thickener for the base of the product. It's possible they can have a satisfying effect on hair depending on the molecular level and can weigh down the split ends on hair but that's about it.",
        "score": 29,
        "is_top_level": true
      },
      {
        "author": "hematyt",
        "body": "This is so interesting, thank you! I'll look for it",
        "score": 26,
        "is_top_level": true
      },
      {
        "author": "cantreadamap",
        "body": "Thank you for this write up! Ideally using one of these products should help the already split end to not travel further up the hair shaft until it can be cut right? By sealing it up temporarily?",
        "score": 24,
        "is_top_level": true
      },
      {
        "author": "Evil-Marr",
        "body": "I wonder if other polyquaterniums are also effective? (Don't have time to look at the linked study rn so sorry if it answers that question)",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "jvanderh",
        "body": "Can we rely on these two ingredients forming an ionic bond when they're in a formulation with so many other things?",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "winwinnwinnie",
        "body": "Check out Crodabond aka **hydrogenated castor oil/sebacic acid copolymer**, the active in B3 (Brazilian Bond Builder); it’s also found in Eva NYCs split end mender (in smaller concentrations, after lots of database researching too)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "azssf",
        "body": "One of the interesting things when it comes to research is the gap between “worked in lab conditions” and “worked in a producible formulation sold to customers”. \n\nAlthough it seems I am raining on this parade, this is how science works— find what works in the lab, then go on to research if it works in a product formulation. This is also why so many exciting lab experiments do not come to the commercial market, and, similarly, why so many promising drug formulations do not make it to market.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "tiffanylan",
        "body": "I have used the living proof split ends repair. And I would say it definitely works. I have strawberry blonde long hair with a significant amount of balayage.   Out of the list it’s the only one I’ve tried but it does work. Not 100%, but I’ve definitely noticed reduction in split ends",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "RubyDiscus",
        "body": "Great post!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "RubyDiscus",
        "body": "Ogx Coconut Oil Air Dry Cream\n\nHas it in 8th ingredient",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "shewiththesax",
        "body": "Just curious, I use the Olaplaex bonding oil right now. How do you feel these ingredients compare to dimethicone? Have you tried any of your recommendations? I was about to get more of the bonding oil, but I would love to try something stronger if it’s out there.\n\nEdit: Also, thanks for this list! I will be using it for sure!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Viralfoxy",
        "body": "I'm amazed at this report and your in-depth knowledge. What is your background? I learned so much in a short time from this post, thank you!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thisbread_",
        "body": "The White Sands product actually seems to be deliberately imitating the formula used in the original study. It is the only one close enough to the original study that I'd consider dropping some dollars to try it lol.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Instance_Most",
        "body": "There is no such thing as semi-permanently.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 15,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "b0ycjk",
    "title": "System 4 Climbazole Scalp Tonic - One of the most interesting commercially availavle products for SD!",
    "url": "https://www.reddit.com/r/SebDerm/comments/b0ycjk/system_4_climbazole_scalp_tonic_one_of_the_most/",
    "score": 9,
    "num_comments": 2,
    "created": "2019-03-14T09:44:20+00:00",
    "body": "AFAIK there are not many research papers that tested climbazole on malassezia, but the ones available show really, really good results (similar like Ketoconazol, what is in Nizoral). The user reports in the internet (and I mean mainly rosaceagroup.org) report almost all better results then with Kataconazol. Only problem with Climbazole is that AFAIK you can not really buy OTC products in USA, because the FDA did not allow it's use (or made no rules I think -> not allowed to sell products with it), but there is no problem in importing the things.\n\n&#x200B;\n\nThe thing that makes System 4 Clibmazole Scalp Tonic so interesting for me is not just climbazole (other active is piroctone olamine) , but it is a leave on product (what is much much better then a rinse product like a shampoo) & for me doesn't make my scalp dry, like many shampoos do & the hair do not look oily after applying & is easy to apply. So you can wash your hair with a really mild shampoo (e.g. a baby shampoo that is Malassezia safe without heavy sulfates, I now ordered  Bioderma ABCDerm Shampoo, hope i will get it today). The only bad thing is it really doesn't smell very good. And that you do not know the concentrations of the actives, but climbazole & piroctone olamine is effective in really really small amounts when it is a leave on product, so probably there will be enough in it.\n\n&#x200B;\n\nI plan to use this Tonic every day till all the Malassezia is gone on my scalp, then just every-some-days.\n\n&#x200B;\n\nBy the way the whole line does look not so bad, with a lot of different products for different types of hair/scalp: [https://sim.fi/en-system4](https://sim.fi/en-system4)\n\n&#x200B;\n\nHonestly I don't know how you guys in America order this the best, I am from Austria and ordered from nicebeauty.com. In Europe it should not be such a big problem, it is a company from Finnland.\n\n&#x200B;\n\nEdit:  Aqua, Alcohol Denat., Polyquaternium-28, Cetrimonium Chloride, Hydroxyethylcellulose, Climbazole, Piroctone Olamine, Salicylic Acid, Rosmarinus Officinalis (Rosemary) Leaf Extract, Propylene Glycol, Melaleuca Alternifolia Leaf Oil, Menthol\n\nSo also Salicylic Acid for exfoliation. And Tea Tree Oil, but this is probably in too low concentration to be effective / just for smell.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "d0lern",
        "body": "https://www.sachajuan.com/en/scalp-treatment-125-ml-218/\nThis might be an alternative as well. Same active ingriedients.\nAQUA (WATER)\nALCOHOL DENAT.\nC12-13 ALKYL LACTATE\nACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER\nPIROCTONE OLAMINE\nCLIMBAZOLE\nZINGIBER OFFICINALE ROOT EXTRACT\nMENTHYL LACTATE\nBIOSACCHARIDE GUM-1\nSALICYLIC ACID\nMENTHOL\nTOCOPHERYL ACETATE\nROSMARINUS OFFICINALIS LEAF OIL\nSODIUM HYDROXIDE\nPHENOXYETHANOL\nBUTYLENE GLYCOL\nLACTIC ACID\nPOLYSORBATE 20\nSODIUM BENZOATE\nPOTASSIUM SORBATE\nSORBIC ACID\nLIMONENE",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "20i1u2",
    "title": "Organix compatibility with Ouidad Climate Control?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/20i1u2/organix_compatibility_with_ouidad_climate_control/",
    "score": 12,
    "num_comments": 2,
    "created": "2014-03-15T19:51:46+00:00",
    "body": "Hi all! First-timer question here. \n\nI used to use all Ouidad products, but I'm now transitioning away from shampoos full of sulfates! I'm currently using Organix Moroccan Argan Creme shampoo/conditioner for my fairly fine, curly hair. \n\nIs the cleanser in the Organix enough to remove dimethicone buildup? I'd love to use my old favorite gel (Ouidad's Climate Control)? Also, I'd love to try out Organix's Sea Mineral Moisture line; would that work too? I see that the Sea Mineral Moisture deep conditioner has dimethicone in it too. \n\nOGX Argan Creme shampoo ingredients\n\n    Water , Sodium C14-16 Olefin Sulfonate , Cocamidopropyl Betaine , PPG-2 Hydroxyethyl Coco/Isostearamide , Sodium Cocoyl Isethionate , Glycol Distearate , PEG-12 Dimethicone , Hydrogenated Argania Spinosa (Argan) Kernel Oil , PEG-23M , Polyquaternium-10 , Laureth-4 , Laureth-23 , PEG-120 Methyl Glucose Dioleate , Dimethicone , Fragrance , Diazolidinyl Urea , Iodopropynyl Butylcarbamate , Tetrasodium EDTA , Yellow 5CI 19140 , Yellow 6CI 15985        \n\nOuidad Climate Control gel ingredients\n\n    Water (Aqua), Tocopheryl Acetate (Vitamin E), Retinyl Palmitate (Vitamin A), Panthenol (Provitamin B5), Chamomilla Recutita (Matricaria) Flower Extract, Actinidia Chinensis (Kiwi) Fruit Extract, Lawsonia Inermis (Henna) Leaf Extract, Wheat Amino Acids, Hydrolyzed Wheat Protein/PVP Crosspolymer, Propylene Glycol, PEG-60 Almond Glycerides, Dimethicone Copolyol, Dimethicone, Polyquaternium-28, Glycerin, PPG-26-Buteth-25, PEG-40 Hydrogenated Castor Oil, PVP/DMAPA Acrylates Copolymer, Hydroxyethylcellulose, Fragrance (Parfum), Methylparaben, DMDM Hydantoin, Methylchloroisothiazolinone, Methylisothiazolinone\n\nOGX Sea Mineral Moisture shampoo ingredients\n\n     WATER (AQUA), Sodium C14-16 Olefin Sulfonate, Cocamidopropyl Hydroxysultaine, Sodium Cocoyl Isethionate, Deep Sea Minerals, Green Algae, Sea Kelp, Albumen, Panthenol, Dimethicone, Amodimethicone, Glycol Stearate, PEG-120 Methyl Glucose Dioleate, Guar Hydroxypropyltrimonium Chloride, Polyquaternium-6, Polyquaternium-10, Laureth-4, Laureth-23, Cocamidopropyl Betaine, Cetrimonium Chloride, Trideceth-12, Tetrasodium Edta, Sodium Chloride, Fragrance, Citric Acid, Diazolidinyl Urea, Iodopropynyl Butylcarbamate.\n\nThanks for your help! I'm having a hard time interpreting which surfactants are compatible with what. If the betaine in the shampoo can't clean dimethicone, why does the Sea Mineral deep conditioner have dimethicone in it??",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlygirl",
    "post_id": "mx1s8o",
    "title": "EVO Curl Line Ingredients List",
    "url": "https://www.reddit.com/r/curlygirl/comments/mx1s8o/evo_curl_line_ingredients_list/",
    "score": 7,
    "num_comments": 0,
    "created": "2021-04-23T18:27:44+00:00",
    "body": "I was so frustrated that I couldn’t find the ingredients list for the Evo line anywhere online, including the Evo website??? (in order to copy+paste into CurlsBot.com or Isitcg.com), so I just bit the bullet and wrote every ingredient out individually.\n\nHere they are in case anyone wants this for reference:\n\nHeads Will Roll Co-Wash\n\naqua, disodium cocoamphodiacetate, cetearyl alcohol, polyquaternium-37, sodium chloride, peg-12 dimethicone, parfum, behentrimonium chloride, phenoxyethanol, isopropyl alcohol, benzoic acid, argania spinosa kernel oil, persea gratissima oil, simmondsia chinensis seed oil, vp/dmapa acrylates copolymer, dehydroacetic acid, benzalkonium chloride, coumarin, linalool, limonene \n\nTotal Recoil Curl Definer\n\naqua, pvp, alcohol denat., butyrospermum parkii, cetearyl alcohol, vp/va copolymer, alcohol, theobroma cacao seed butter, ceteareth-25, peg-40 hydrogenated castor oil, phenoxyethanol, parfum, acrylates /c10-30 alkyl acrylate crosspolymer, peg-20m, ceteareth-20, benzoic acid, dehydroacetic acid, silica, coumarin, linalool, limonene\n\nSpringsclean Deep Clean Rinse\n\naqua, peg-12 dimethicone, xanthan gum, parfum, coco-glucoside, phenoxyethanol, cocamidopropyl betaine, polyquaternium-10, hydrolyzed quinoa, benzoic acid, persea gratissima oil, simmondsia chinesis seed oil, dehydoacetic acid, butylene glycol, ethylhexylglycerin, sodium acetate, sodium chloride, isopropyl alcohol, potassium sorbete, coumarin\n\nLiquid Rollers Curl Balm\n\naqua, cetyl alcohol, cetearyl alcohol, behentrimonium chloride, pvp, isopropyl myristate, stearamidopropyl dimethylamine, cyclomethicone, cyclopentasiloxane, peg-20 stearate, phenoxyethanol, methyl gluceth-20, parfum, isopropyl alcohol, phenyl trimethicone, dimethiconol, polyquaternium-28, citric acid, panthenol, benzoic acid, hydrolyzed quinoa, dehydroacetic acid, butylene glycol, ethylhexyl glycerin, potassium sorbate, amyl cinnamal, linalool, butylphenyl methylpropional, benzyl salicylate, citronellol, geraniol, limonene\n\nbaby got bounce curl treatment\n\naqua, isopropyl myristate, cetearyl alcohol, glycerin, behentrimonium chloride, argania spinosa kernel oil, behentrimonium methosulfate, amodimethicone, parfum, butyrospermum parkii,glyceryl stearate, theobroma cacao seed butter,  phenoxyethanol, isopropyl alcohol, cetrimonium chloride, simmondsia chinensis seed oil, theobroma grandiflorum seed butter, trideceth-15, trideceth-3, benzoic acid, dehydroacetic acid, vp/dmapa acrylates copolymer, hydrolyzed quinoa, alcohol, butylene glycol, acetic acid, ethylhexylglycerin, benzalkonium chloride, potassium sorbate, coumarin",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "jbbw3b",
    "title": "Sudden change in hair manageability, would really appreciate some help :(",
    "url": "https://www.reddit.com/r/HaircareScience/comments/jbbw3b/sudden_change_in_hair_manageability_would_really/",
    "score": 4,
    "num_comments": 8,
    "created": "2020-10-14T23:12:56+00:00",
    "body": "I’m almost in tears as I write this:( Over a month ago now my hair suddenly abbruptly became completely unmanageable after a single wash.\n\nThe hair feels dry and almost squeaky? The strands feel like they won’t run over eachother no matter how much product is on them the hair just knots up, and webs together even if I’ve managed brushed out the section is just does this all over again and feels like straw\n\nI’ve tried multiple different products and spent so much money.\nDoes anyone have any idea what could be happening or any advice?\n\nBack-story:\n\nI have fine long curly hair that was already kind of dry before this due to bleaching but easily manageable and styled and I absolutely loved it! I would’ve said it was high porosity, low density and 3a/3b\n\nJust over a month ago I don’t know what happened but I washed my hair one time with a really old bottle of “Tresemme Keratin 7 Day Smooth Shampoo” (ingredients below) As soon as I got out the shower my hair WAS HORRENDOUS. No matter how much conditioner I used I couldn’t get a brush through it, and the conditioner was almost foaming up?! I genuinely couldn’t brush my hair after 4 hours of trying. I immediately went to the hairdressers, she tried to wash out my hair, did Olaplex treatments on it, and deep conditioned it. After that she just about managed to brush it out. But that was a month ago and I haven’t been able to brush it properly since :(\n\nI’ve tried everything. Harsh shampoos, gentle co washes, deep conditioners, hot oil treatments, olaplex, silicones & sulphate free AND tried bringing them back in to my hair too. It just seems to reject everything I put on it and feel like unbrushable straw regardless\n\nThe ONLY thing that’s worked is the Shea Moisture Manuka Honey & Yoghurt Hydrate + Repair Protein Power Treatment on my hair for around an hour, keeping it warm. Only then can I brush my hair\n\nShampoo ingredient: Aqua, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Carbomer, Citric acid, Dimethiconol, Disodium EDTA, DMDM Hydantoin, Glycerin, Glycol Distearate, Guar Hydroxypropyltrimonium Chloride, Hydrolyzed Keratin, Lecithin, Magnesium chloride, Magnesium Nitrate, Methylchloroisothiazolinone, Methylisothiazolinone, Mica, Parfum, PEG-45M, Phenoxyethanol, Polyquaternium-28, PPG-12, PVM/MA Copolymer, Silica, Sodium benzoate, Sodium chloride, Sodium hydroxide, TEA-Dodecylbenzenesulfonate, TEA-Sulfate, Benzyl alcohol, Benzyl Salicylate, Citronellol, Geraniol, Hexyl Cinnamal, Limonene, Linalool, CI 77891",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "new-crystal",
        "body": "Maybe the water quality in your shower changed?",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1g258qw",
    "title": "Overspent on a curl cream, now having second thoughts... should I keep using it? ",
    "url": "https://www.reddit.com/r/curlyhair/comments/1g258qw/overspent_on_a_curl_cream_now_having_second/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-10-12T17:30:37+00:00",
    "body": "My hair type is a mix of 2b and 2c.   \n  \nI recently bought this curl cream:   \n[https://lushnlure.pk/products/curl-romance](https://lushnlure.pk/products/curl-romance)  \nI will list the ingredients at the end of the post. \n\nMy routine was usually oiling with coconut oil (the only oil that does something for my hair) and silicone free shampoo, 2-3x a week, and then some coconut oil afterwards as well, only a tiny amount. This worked great for me in terms of length retention, shine and feel. But my curls were not holding up, and especially the front of my hair was in this weird frizzy state always, not curly, not straight. So I bought a curl cream because I heard it works great for curl definition and retention. I used this once and I did see a difference, nothing too good in terms of shine and softness, but curl definition was great and held till the next wash day very well.   \nBut someone told me that this ingredient list is not good at all and I should avoid long term usage as it can damage my hair, especially the preservatives and mineral oil and silicones present in this. \n\nHow true is that? \n\n  \nThis is the ingredients list:\n\nAQUA, CETEARYL ALCOHOL, STEARTRIMONIUM CHEORIDE, PARAFFINUM LIQUIDUM, CYCLOPENTASILOXANE DIMETHICONE HYDROXYETHYLCELLULOSE, PVP, PARFUM, ARGAN OIL, POLYQUATERNIUM-28, DMDM HYDATO",
    "flair_text": "Help!",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Many-Put9009",
        "body": "Sounds like the product is working for you. Don't let the \"chemicals\" police get to you. \nMost people's hair does perfectly fine with \"forbidden products\" like sulfates silicones, alcohols...",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]