[
  {
    "subreddit": "SkincareAddiction",
    "post_id": "8l5gx5",
    "title": "[Research] Evaluating Your Routine: Hydroxy Acids",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/8l5gx5/research_evaluating_your_routine_hydroxy_acids/",
    "score": 672,
    "num_comments": 82,
    "created": "2018-05-21T23:56:14+00:00",
    "body": "*Edits: Removed Azelaic Acid since it is not a hydroxy acid and it created confusion*\n\nOriginally, this whole post was going to be about exfoliation, but I swear, there's just too much ground to try to cover in one post. As usual, my goals with these posts is not to necessarily make product recommendations for specific skin types, but to talk about the ingredients themselves. For this post however, I worked in products since hydroxy acid products are still a question mark to a lot of skin newbies. I say, \"You should try something with AHA!\" and I get asked, \"Wait, what is that? Is that a brand or is it on the bottle or...?\"As such, I've put products in each category (though mandelic is sparse...) and noted some as my personal recommendations based on the ingredients or my own anecdotal evidence of efficacy (for example, I use the 2% BHA Liquid and think it is VERY effective and has a pretty clean ingredient list).\n\nOne of these days I'll get around to doing a general, broad recommendations post, but today is not that day. \n\nAs usual, please feel free to correct me, update me, or make recommendations for your specific regions in the comments. The sunscreen post had a TON of discussion like this and I thought it was wonderful that these threads have not just been a place for me to braindump, but a place for us all to learn about specific things together. **So thank you.** \n\nOne more note: I wrote this on a night I was *really* struggling to write, so please feel free to call out weird clarity issues.\n\n---\n\nWhen I was younger, I spent almost every waking moment browsing skincare communities. Most posts in those communities boils down to routine help, selfies, or general questions, but sometimes, skincare routines in popular media come up. One such routine was displayed in the film American Psycho with Christian Bale. You can do a quick Google search and find numerous articles, blog posts, and videos about Patrick Bateman's infamous daily routine and people who've tried to follow it.\n\nIn the film, Patrick Bateman -- a man with deep, anti-social behaviors -- details his morning routine:\n\n>“I live in the American Gardens Building on W. 81st Street on the 11th floor. My name is Patrick Bateman. I’m 27 years old. I believe in taking care of myself and a balanced diet and rigorous exercise routine.\n\n>\"In the morning if my face is a little puffy I’ll put on an ice pack while doing stomach crunches. I can do 1000 now.\n\n>\"After I remove the ice pack I use a deep pore cleanser lotion. In the shower I use a water activated gel cleanser, then a honey almond body scrub, and on the face an exfoliating gel scrub. Then I apply an herb-mint facial mask which I leave on for 10 minutes while I prepare the rest of my routine. I always use an after shave lotion with little or no alcohol, because alcohol dries your face out and makes you look older. Then moisturizer, then an anti-aging eye balm followed by a final moisturizing protective lotion.”\n\nShowing the audience this routine reveals to us how much emphasis Bateman puts on his outwards appearance -- a central theme to the film.\n\nMost people care deeply about their appearance, whether they're following a Bateman-esc routine or trimming their brows. After all, glowing skin is typically a sign of health.\n\nBateman's routine puts particular emphasis on a youthful appearance, with multiple scrubs, peels, and moisturizers; and indeed it is exfoliation and skin-cell turnover that keeps your skin looking younger and healthier, but how do we get there from here? What should a good exfoliation routine look like? Where do you even start?\n\nIn this post, I'll be breaking down some of the things that can keep us looking younger: AHAs, BHAs, and LHAs.\n\n#**Introduction to Hydroxy Acids**\n\nYou may remember from my post on moisturizers that skin cells (keratinocytes) begin deep in the stratum basale -- the deepest layer of the epidermis -- and work their way upwards, flattening out, hardening, dying, and eventually flaking away.\n\nHowever, some skin cells are not quite as good at this as others. They will build up, stick together, or get \"stuck\" in the pores (hair and oil gland openings) of skin. Hydroxy acids are what is called an \"active\" skincare ingredient -- basically something that performs an action on the skin. In this case, rejuvenation and exfoliation. They are largely found in botanical sources, which is why they are frequently referred to as fruit acids, and are divided up based upon the hydroxyl groups on their molecular structures. Hydroxy acids posses the ability to separate skin cells from the stratum corneum, which can be hugely beneficial to skin diseases that are characterized by a build up of dead skin (or hyperkeratosis), such as acne. Many also have the ability to stimulate the growth of collagen in the deeper layers of the skin, resulting in the reduction of fine lines over time.[1][2][3][4][7]\n\nIf you want to think of it in a more simple way, hydroxy acids are solutions that break down the \"glue\" that holds skin cells together (not the skin cells themselves), but like with anything that performs an action on the skin, this can be very irritating. Whether or not it is irritating to you depends on your needs and the formulations as well as the concentrations of the exfoliants you pick.\n\n#**AHAs**\n\nThe term AHA is short for \"Alpha Hydroxy Acid.\" It is the most common of the chemical exfoliants you can find. They're usually associated with creating glowing, youthful skin due to their ability to exfoliate away the upper layers of the stratum corneum so effectively.\n\nThey work best around a pH of 3.5, which allows for better absorption. The higher the pH, the lower the amount of acid that is absorbed by the skin. To demonstrate this, one study compared the effects of glycolic and lactic acid on the skin when applied at different pH values. At a pH of 3, the total absorption of a 5% glycolic acid cream in 24 hours was 27%. When increasing the pH value to 7, that absorption tanked to a mere 3.5%. Similarly, 5% lactic acid had a total absorption of 30% over 24 hours at a pH of 3, which dropped to 10% when the pH was boosted to a value of 7. [5]\n\nThey are water-soluble, meaning that they work best directly on clean, dry skin. Some even have humectant properties, allowing them to draw moisture into the upper layers of the skin.\n\nAll AHAs create photo-sensitization -- or sensitivity to the sun -- due to their ability to exfoliate the stratum corneum.\n\nAHAs are also generally not recommended for rosacean or eczema-prone skin, as they can worsen the inflammation that is common in these conditions. Additionally, avoid using AHAs in combination with other forms of exfoliation (such as physical scrubbing) or prescription topicals given to you by your dermatologist, especially tretinoin/Retin-A.\n\nThere are multiple types of AHAs, and they come in various forms, differentiated by molecular size and source. The most common types of AHAs are glycolic, mandelic, and lactic.\n\n#**Glycolic**\n\nThe most common form of AHA is glycolic, and it's found in nearly every AHA product you can find these days. It has a small molecular structure, meaning it can penetrate the upper layers of the skin more easily and quickly, but it is also the most irritating due to these properties. It's usually found in products in concentrations of 8-10%. Some examples of popular products with glycolic acid:\n\n**Paula's Choice 8% AHA Gel - Recommended**\n\n>Water (Aqua), Glycolic Acid (alpha hydroxy acid/exfoliant), Sodium Hydroxide (pH adjuster), Chamomilla Recutita Matricaria Flower Extract (chamomile/skin-soothing), Aloe Barbadensis Leaf Juice (hydration), Camellia Oleifera Leaf Extract (green tea/antioxidant/skin-soothing), Sodium Hyaluronate (skin replenishing), Panthenol (hydration), Sodium PCA (skin replenishing), Propylene Glycol (hydration), Butylene Glycol (hydration), Hydroxyethylcellulose (texture-enhancing), Polyquaternium-10 (texture-enhancing), Phenoxyethanol (preservative), Sodium Benzoate (preservative).\n\n**Pixi Glow Tonic**\n\n>Aqua, Aloe Barbadensis Leaf Juice, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Glycolic Acid, Ammonium Glycolate, Glycerin, Butylene Glycol, Hexylene Glycol (and) Fructose (and) Glucose (and) Sucrose (and) Urea (and) Dextrin (and) Alanine (and) Glutamic Acid (and) Aspartic Acid (and) Hexyl Nicotinate, Panax Ginseng Root Extract, Phenoxyethanol, Sodium Benzoate, Biotin, Polysorbate 20.\n\n**Nip + Fab Glycolic Fix Daily Cleansing Pads**\n\n>Aqua (Water), Glycerin, Glycolic Acid, Polysorbate 20, Sodium Hydroxide, PEG-12 Dimethicone, Hamamelis Virginiana (Witch Hazel) Water, Phenoxyethanol, Benzyl Alcohol, Alcohol Denat. (SD Alcohol 40-B), Disodium EDTA, Globularia Alypum (Blue Daisy) Extract, Panthenol, Lactic Acid, Parfum, Limonene, Ethylhexylglycerin, Dehydroacetic Acid, Sodium Hyaluronate, Linalool, Geraniol, Citral.\n\n\n**CosRX AHA 7 Whitehead Power Liquid**\n\n>Pyrus Malus (Apple) Fruit Water, Butylene Glycol, Glycolic Acid, Niacinamide, Sodium Hydroxide, 1,2-Hexanediol, Panthenol, Sodium Hyaluronate, Xanthan Gum, Ethyl Hexanediol.\n\n#**Lactic Acid**\n\nLactic acid is the second most common of all AHAs, and can be frequently found hanging out in the ingredients with other AHAs or BHAs , though it is a fine exfoliator on its own. It has a larger molecule than glycolic, making it slower to act and less irritating -- ideal for more sensitive skin. It is usually derived from milk, and has the best humectant properties out of all of the acids. Some examples of popular products with lactic acid:\n\n**Sunday Riley Good Genes All-In-One Lactic Acid Treatment**\n\n>Opuntia Tuna Fruit (Prickly Pear) Extract, Agave Tequilana Leaf (Blue Agave) Extract, Cypripedium Pubescens (Lady's Slipper Orchid) Extract, Opuntia Vulgaris (Cactus) Extract, Aloe Barbadensis Leaf Extract & Saccharomyses Cerevisiae (Yeast) Extract, Lactic Acid, Caprylic/Capric Triglyceride, Butylene Glycol, Squalane, Cyclomethicone, Dimethicone, Ppg-12/Smdi Copolymer, Stearic Acid, Cetearyl Alcohol And Ceteareth20, Glyceryl Stearate And Peg-100 Stearate, Arnica Montana (Flower) Extract, Peg-75 Meadowfoam Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Cymbopogon Schoenanthus (Lemongrass) Oil, Triethanolamine, Xantham Gum, Phenoxyethanol, Steareth-20, Dmdm Hydantoin.\n\n**The Ordinary Lactic Acid 10% + HA**\n\n>Aqua (Water), Lactic Acid, Glycerin, Pentylene Glycol, Arginine, Potassium Citrate, Triethanolamine, Sodium Hyaluronate Crosspolymer, Tasmannia Lanceolata Fruit/Leaf Extract, Acacia Senegal Gum, Xanthan Gum, Trisodium Ethylenediamine Disuccinate, PPG-26-Buteth-26, Ethyl 2,2-Dimethylhydrocinnamal, PEG-40 Hydrogenated Castor Oil, Ethylhexylglycerin, 1,2-Hexanediol, Caprylyl Glycol.\n\n**AmLactin 12% Alpha-Hydroxy Therapy Daily Moisturizing Body Lotion - Recommended (for body)**\n\n>Water, Lactic Acid, Light Mineral Oil, Glyceryl Stearate, PEG 100 Stearate, Propylene Glycol, Glycerin, Magnesium Aluminum Silicate, Laureth 4, Polyoxyl 40 Stearate, Cetyl Alcohol, Methylparaben, Propylparaben, Methylcellulose.\n\n**Mandelic Acid**\n\nMandelic acid has only just begun to appear on the scene, though it has been around for awhile. It is one of the best choices for very sensitive skin, and great for acne-prone skin due to its anti-bacterial and anti-microbial nature. It is derived from almonds and has moderate humectant properties, floating somewhere between glycolic and lactic. An example of a popular product with mandelic acid:\n\n**Stratia Skin Soft Touch AHA with 10% Mandelic Acid - Recommended**\n\n>Water (Aqua), Mandelic Acid, Propylene Glycol, Polyacrylate Crosspolymer-6, Panthenol, Aloe Barbadensis Leaf Juice, Matricaria Recutita (Chamomile) Flower Extract, Glycerin, Sodium Hyaluronate, Allantoin, Sodium Hydroxide, Diazolidinyl Urea, Iodopropynyl Butylcarbamate.\n\nThere are also plenty of products that combine several alpha hydroxy acids together, such as:\n\n**Drunk Elephant TLC Framboos Glycolic Night Serum**\n\n>Water, Glycolic Acid, Butylene Glycol, Glycerin, Sodium Hydroxide, Salicylic Acid, Lactic Acid, Citric Acid, Vitis Vinifera (Grape) Juice Extract, Aloe Barbadensis Leaf Juice, Opuntia Ficus-Indica Extract, Aesculus Hippocastanum (Horse Chestnut) Seed Extract, Camellia Sinensis Leaf Extract, Rubus Idaeus (Raspberry) Fruit Extract, Saccharomyces Cerevisiae Extract, Buddleja Davidii Meristem Cell Culture, Sclerocarya Birrea Seed Oil, Sodium Hyaluronate Crosspolymer, Allantoin, Hydroxyethylcellulose, Galactoarabinan, Propanediol, Disodium EDTA, Xanthan Gum, Hexylene Glycol, Phenoxyethanol, Caprylyl Glycol, Ethylhexylglycerin, Sodium Nitrate, Potassium Sorbate, Pentylene Glycol, Sodium Benzoate.\n\n**Dr. Dennis Gross Skincare Alpha Beta Extra Strength Daily Peel**\n\n>Water (Aqua), Alcohol Denat., Glycolic Acid, Potassium Hydroxide, Hamamelis Virginiana (Witch Hazel) Leaf Extract, Salicylic Acid, Polysorbate 20, Lactic Acid, Mandelic Acid, Malic Acid, Citric Acid, Salix Alba (Willow) Bark Extract, Menthyl Lactate, Camellia Sinensis Leaf Extract, Achillea Millefolium Extract, Chamomilla Recutita (Matricaria) Flower Extract, Soy Isoflavones, Copper PCA, Zinc PCA, Disodium EDTA, Fragrance (Parfum), Sodium Benzoate.\n\n#**BHAs**\n\nBHA is short for \"Beta Hydroxy Acid.\" These acids are slightly more complex than AHAs due to their oil-solubility. They are able to penetrate not just the skin, like AHAs, but also the pores of the skin. This is what makes them an ideal choice for acne-prones, who tend to have lipid-rich sebaceous glands.\n\nBHAs work best around pH values of 3, and in concentrations of 1-2%. They're frequently found with AHAs, but can be found in formulations without the addition of other hydroxy acids.\n\nBHAs are not as photo-sensitizing as AHAs [6], but it is still frequently recommended that you wear a sunscreen when using any hydroxy acid.\n\nThere are two major types of BHAs: salicylic acid and lipohydroxy acid.\n\n#**Salicylic Acid**\n\nWhen discussing BHAs, the ingredient that is usually being discussed is salicylic acid, which is derived from salicin -- the same stuff in asprin. Due to this origin, salicylic acid should be avoided if you have an asprin allergy.\n\nSalicylic acid has no humectant properties, and can cause drying of the skin. Though if formulated correctly, this can largely be avoided which can make BHA a much more effective acne treatment for some than harsher, more drying topicals such as benzoyl peroxide.\n\nIt can also be soothing to some skin types, such as rosacean skin or acne skin, and is pretty well-tolerated overall.\n\nSome examples of popular products with salicylic acid:\n\n**Paula's Choice 2% BHA Liquid  - Recommended**\n\n>Water (Aqua), Methylpropanediol (hydration), Butylene Glycol (hydration), Salicylic Acid (beta hydroxy acid/exfoliant), Polysorbate 20 (stabilizer), Camellia Oleifera Leaf Extract (green tea/skin calming/antioxidant), Sodium Hydroxide (pH balancer), Tetrasodium EDTA (stabilizer).\n\n**Stridex Triple Action Pads, Alcohol Free (Red Box)**\n\n>Salicylic acid 2.0%, Ammonium lauryl sulfate, ammonium xylenesulfonate, citric acid, DMDM hydantoin, fragrance, menthol, PPG-5-Ceteth-20, purified water, simethicone, sodium borate, tetrasodium EDTA.\n\n#**Lipohydroxy Acid**\n\nLipohydroxy acid is a derivative of salicylic acid, with unique properties. It has a higher molecular weight and an added fatty chain, making it more lipophilic (oil loving) than its parent SA.\n\nFirst developed by L'Oreal in the 1980s, it penetrates the skin less easily due to it's lipophilic properties. This slower penetration means that it breaks down the glue of the skin cells slower, but it is still unclear whether or not this results in less irritation.\n\nLike other hydroxy acids, LHA thins the stratum corneum, but has dermal thickening properties. In one study, it was shown to be as effective as tretinoin, due to it's stimulation of structural skin proteins and lipids. [7]\n\nIt is excellent for acne skin due to it's lipophilic nature, and in one study, showed a decrease of 85% in follicular plugs over 14 days. [8]\n\nIt is only available in products made by L'Oreal, so it is difficult to get your hands on a wide variety. Some examples:\n\n**SkinCeuticals LHA Cleansing Gel**\n\n>aqua / water / eau, coco-betaine, propylene glycol, peg-120 methyl glucose dioleate, sorbitol, glycerin, glycolic acid, triethanolamine, sodium laureth sulfate, sodium chloride, disteareth-100 ipdi, phenoxyethanol, salicylic acid, capryloyl salicylic acid, menthol, methylparaben, disodium edta, steareth-100.\n\n**La Roche-Posay Effaclar Duo**\n\n>Water, Isostearyl Alcohol, Glycerin, Pentylene Glycol, Silica, Carbomer, Capryloyl Salicylic Acid, Potassium Hydroxide, Tocopheryl Acetate, Acrylates/c10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Epilobium Angustioflium Flower/leaf/stem Extract.\n\n**SkinCeuticals LHA Toner**\n\n>Water / Eau, Alcohol Denat., Glycolic Acid, Sodium Hydroxide, Capryloyl Salicylic Acid, Salicylic Acid.\n\n\n\n#**All Together Now**\n\n* **If you're sensitive, avoid AHA and BHA used together.** Multiple hydroxy acids in one product increase your likelihood of a reaction. It's better to start low and slow when introducing skin to a hydroxy acid.\n*  **Lower concentrations for beginners.** If you've never used a hydroxy acid, go for lower concentrations, such as 1% BHA (Paula's Choice makes a 1% variety of BHA) and 4-5% glycolic acid. If your skin is sensitive and generally reactive, look for larger molecules, like lactic or mandelic acid.\nIf you're oily-skinned, rosacean, or acne-prone, try BHA. I cannot understate enough how great BHA is. It is generally soothing and can break through oils on the skin, making it ideal for acne.\n* **Do not use physical exfoliation like scrubs, towels, or a Clarisonic when using a chemical exfoliant.** Your stratum corneum thins when using a chemical exfoliant, so you shouldn't need to be physically scrubbing your skin, which can just create irritation.\n* **Be careful when using BP/retinol/retinoids with AHAs/BHAs if you are very sensitive.** If you're very sensitive with conditions such as rosacea or eczema, be cautious when using other actives in addition to AHAs/BHAs. This can be too much for some skin.  \n* **Use hydroxy acids infrequently.** Unlike Patrick Bateman, most people do not need daily exfoliation. Use a hydroxy acid two to three times a week. Tweak this based on how your skin reacts.\n* **Back off if you're breaking out.** Skin irritation can occur with hydroxy acids, usually in the form of breakouts. If this occurs, discontinue use until your skin clears. Re-introduce the product slowly and use fewer days per week. If the reaction re-occurs, discontinue use entirely.\n* **Use a sunscreen during the day.** Except for salicylic acid, hydroxy acids thin the stratum corneum and photo-sensitize the skin. You must use a sunscreen during the day to prevent damage and sunburn.\n* **Use at night.** As I said above, hydroxy acids photo-sensitize you (except BHA). Use them at night for this reason.\n* **Use hydroxy acids as close to the skin as possible.** Applying any skin \"active\" right after you cleanse is ideal. This ensures it is as close to the skin as possible, and does not need to penetrate any additional products to work.\n\n---\n\n**Sources**\n\n* [Effects of alpha-hydroxy acids on photoaged skin: a pilot clinical, histologic, and ultrastructural study.](http://europepmc.org/abstract/MED/8642081)\n* [A review of skin ageing and its medical therapy](https://onlinelibrary.wiley.com/doi/abs/10.1046/j.1365-2133.1996.d01-1088.x?amp;userIsAuthenticated=false&deniedAccessCustomisedMessage=)\n* [Epidermal and dermal effects of topical lactic acid](https://www.sciencedirect.com/science/article/pii/S0190962296906027)\n* [Glycolic Acid Treatment Increases Type I Collagen mRNA and Hyaluronic Acid Content of Human Skin](https://onlinelibrary.wiley.com/doi/abs/10.1046/j.1524-4725.2001.00234.x?amp;userIsAuthenticated=false&deniedAccessCustomisedMessage=)\n* [Labmuffin - Why does pH matter for AHAs and BHAs](https://labmuffin.com/fact-check-friday-why-does-ph-matter-for-ahas-and-bhas/)\n* The effects of topically applied glycolic acid and salicylic acid on ultraviolet radiation-induced erythema, DNA damage and sunburn cell formation in human skin: https://www.jdsjournal.com/article/S0923-1811(09)00099-1/abstract\n* [The Use of Lipohydroxy Acid in Skin Care and Acne Treatment](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5300717/)\n* [Comedolysis by a lipohydroxyacid formulation in acne-prone subjects.](https://www.ncbi.nlm.nih.gov/pubmed/12609785)\n\n---\n\n* * *\nAll of My Posts\n=======\n\n* [Purging, Irritation, and Gram-Negative Folliculitis](https://www.reddit.com/r/SkincareAddiction/comments/90dq0d/misc_acne_prolonged_purging_irritation_and/)\n* [Dehydrated Skin: An Updated Guide](https://www.reddit.com/r/SkincareAddiction/comments/8wxwuv/misc_dehydrated_skin_an_updated_guide_to_healing/)\n* [A Guide to Your Dermatologist: When to go, picking a doctor, prepping for your first visit, and tackling shame and depression](https://www.reddit.com/r/SkincareAddiction/comments/8wfpvs/misc_a_guide_to_your_dermatologist_when_to_go_to/)\n* [Perioral Dermatitis](https://www.reddit.com/r/SkincareAddiction/comments/8teeln/misc_perioral_dermatitis_an_odd_mouth_rash/)\n* [Keratosis Pilaris: An Updated Guide](https://www.reddit.com/r/SkincareAddiction/comments/8smxjr/misc_keratosis_pilaris_kp_managing_the_condition/)\n* [Rosacea](https://www.reddit.com/r/SkincareAddiction/comments/8omjau/research_rosacea_the_curse_of_the_celts/)\n* [Rosacea: Recommended Products](https://www.reddit.com/r/SkincareAddiction/comments/8qdha9/misc_rosacea_recommended_products/)\n* [Evaluating Your Routine: Hydroxy Acids](https://www.reddit.com/r/SkincareAddiction/comments/8l5gx5/research_evaluating_your_routine_hydroxy_acids/)\n* [Evaluating Your Routine: Sunscreen](https://www.reddit.com/r/SkincareAddiction/comments/8kbgvs/research_evaluating_your_routine_sunscreens/)\n* [Evaluating Your Routine: Moisturizers](https://www.reddit.com/r/SkincareAddiction/comments/8k0mb0/research_evaluating_your_routine_moisturizers/)\n* [Evaluating Your Routine: Cleansers](https://www.reddit.com/r/SkincareAddiction/comments/8jqgmi/research_evaluating_your_routine_cleansers/)\n\n\n\n\n\n",
    "flair_text": "Research",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Darker-Days",
        "body": "**Great right up! I would like to point out a few things though**\n\n>##Azealic Acid\n>Azelaic acid stands on its own as an ingredient\n\n...\n\n>is not as irritating as AHAs or BHAs\n  \nI don’t object to Azealic Acid being grouped here. Its useful for many of the thing bha and aha are and has some similar mechanisms of actions in the skin.\n\nHowever, can this be edited to disclaim Azealic Acid is not actually chemically grouped as an hydroxy acid? Its actually a Dicarboxylic Acid.\n\nI also think it should be disclaimed that since AzA its not a “true” hydroxy acid — it *may* be exempt from some of the aforementioned “rules” of hydroxy acids. First is unless Im r/outoftheloop I don’t think there’s any proof yet that AzA causes photosensitivity and should only be used at night\n\nSecond is while yes, AHA & BHA do have a higher free acid value as pH decreases yes. AzA isn’t the same. Most brands have AzA their products in the pH range of 4.0-to-5.0 (usally the higher end) because it commonly cited to work best at a pH around 4.8-to-5.0. (*Allegedly,* Finacea is 4.8)\n \nEx:  One study showed that Azealic Acid works better and has a higher bioavailability in the skin at a pH of 4.9 than it does at a pH of 3.9 [source](https://www.tandfonline.com/doi/abs/10.3109/03639045.2011.635376?journalCode=iddi20)\n\n######Limitations of study: Murine Skin\n\nInfo from PubChem Review: Azealic Acid has also had pH comparison studies done, comparing its ability to reduce the activity of p.acnes a pH of 4.0, pH of 5.0 and pH of 6.0. Synopsis — at a pH of 5.0 it worked significantly better than it did at a pH of 4.0 and at a pH of 6.0. [Source](https://pubchem.ncbi.nlm.nih.gov/compound/azelaic_acid#section=Non-Human-Toxicity-Excerpts)\n\nAccording to [this](https://www.ncbi.nlm.nih.gov/m/pubmed/7829407/) it was peer reviewed.\n\n######Limitations of study: Invitro not Invivo\n\nAzA being in a different acid family and being formulated at a higher pH might be attrributed to be why its usually less irritating\n\n>Unfortunately, it is largely prescription-only in the US (going by the prescription name of Finacea), land can only be found in lower concentrations when purchased over the counter. \n\nI think this should be edited aswell. Unlike in Canada, low and high strength Azealic Acid is available in the USA with and w/o an RX in the USA in strengths from 4%-to-20%.\n\n.........\n\n***RX ONLY***\n\n..........\n\n**Azelex** Cream^20%\n\n**Finacea** Gel^15%\n\n**Curology** Custom^4%+\n\n\n........\n\n***OTC/Online/Non-Rx***\n\n........\n\n**PCA Skin** - Pigment Bar^(?%AzealicAcid+?%KojicAcid+?%Niacinamide)\n\n**Sesderma** - Azelac Lotion^(5%AzealicAcid+2%SalicylicAcid)\n\n**Gigi Bioplasma** - Azealic Cream for Oily Skin^(15%AzealicAcid)\n\n**Ecological Formulas** - Melazapam Cream^(20%AzealicAcid)\n\n...\n\n**Edit** \n\n######There are some others I neglected to mention. “PCA SKIN” also has another product with AzA called “ACNE GEL”. I didnt include his one in the above list with the mainly because unlike the “pigment bar” it seems like the main selling point of this product is not AzA, but actually the 2%SA in it. Also the Azealic acid percentage is undeclared along with the pH. The dermstore star ratings look good. There’s also “*DERMADOCTOR Photodynamic Therapy Age Spot Eraser & Skin Brightener*” you can get at Sephora an Dermstore. The AzA is probably in a decently high percentage because its high on the list (7th ingredient) unfortunately Idk the pH of it. Note: the star rating  for this on dermstore are pretty low. Jan Marini Bioglycolic Bioclear Lotion”\nalso contains AzA but I wouldnt waste my money on it. There’s 2% Salicylic acid and since AzA is lower on the list than SA its most definitely at too low of an amount to make a significant difference. Also the description’s wording makes if sound like its mainly meant to be used as a peeling lotion and since it has both Glycolic and Salicylic acid I bet the pH is made to be low — meaning the little AzA there is, isnt very bioavailabe",
        "score": 50,
        "is_top_level": true
      },
      {
        "author": "BerdLaw",
        "body": "good post TY! I will say that the part advising to use acids at night due to photosensitivity is a bit of a myth. It takes something like a week for skin to return to normal photosensitivity-wise after the use of 10% glycolic acid https://www.ncbi.nlm.nih.gov/pubmed/12713551. Unless the photosensitivity was actually caused by a reaction with the product on your skin + sun (like it would be with a phototoxic reaction with something like lime juice) the sensitivity and need for sunscreen isn't going to be significantly different by waiting overnight. Especially since most people using an aha in their routine are using it at least once a week and won't ever be back to baseline photosensitivty-wise so to say.\n\nAlso adding that if used for 2 days salicylic acid at close to neutral ph of 6.5 has been found to work as well as at 3.12 with less irritation, which is pretty cool for people with sensitive skin https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1468-2494.2009.00501_2.x\n\nAgain thanks for making this content!",
        "score": 25,
        "is_top_level": true
      },
      {
        "author": "MySkinsRedditAcct",
        "body": "I appreciate you taking the time to write this up and the thought and effort behind it. I will say though that there is one part you should seriously consider editing:\n\n\"Do not use hydroxy acids with retinoids/retinol/Retin-A/Accutane or Benzoyl Peroxide (BP) products. Speaking from personal experience, this is way too much irritation to most people's skin. It can create more breakouts, redness, and inflammation, which is what you're typically trying to fix with these topicals.\"\n\nThis is very incorrect. While you might have had a bad experience, using acids with retinol will NOT cause more breakouts as you erroneously suggested, and on the contrary many dermatologists recommend using benzoyl peroxide in conjunction with retinols to stave off purging and help acne heal faster. You can say be careful using acids, but speaking so definitively about something that is completely not true and unfounded (especially about it somehow causing more breakouts) is something that needs to be editing or removed.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "NeoBane",
        "body": "So if I use Benzoyl Peroxide as a spot treatment, would using a BHA/AHA during the same night routine not be recommended? If so, how do people use their spot treatments in their routines?",
        "score": 11,
        "is_top_level": true
      },
      {
        "author": "Meldanya44",
        "body": "I'm new to skincare & this post was so helpful & answered so many of my questions!",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Kokiri713",
        "body": "Hmmm you don’t talk about purging at all? I thought active ingredients (such as AHA and BHA) often cause purging, but in your post you said breakouts are caused by irritation?",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "cf1245",
        "body": "Wow thanks for taking the time to put all of this together. I have a question regarding\n\n\"Additionally, avoid using AHAs in combination with other forms of exfoliation (such as physical scrubbing) or prescription topicals given to you by your dermatologist, especially tretinoin/Retin-A.\"\n\nand\n\n\"Do not use hydroxy acids with retinoids/retinol/Retin-A/Accutane or Benzoyl Peroxide (BP) products. Speaking from personal experience, this is way too much irritation to most people's skin. It can create more breakouts, redness, and inflammation, which is what you're typically trying to fix with these topicals.\"\n\nI was first prescribed Retin-A at 18 years old. I used it on and off from age 18 to 21. I have been using it consistently (5-7 days per week) from age 21 to 25 (my current age). I now use 0.1% retin-a almost every night and a few months ago I started using TO 30% AHA + 2% BHA once a week. The AHA + BHA makes my skin really smooth and helps with SFs on my nose. It does not cause redness, dryness, or irritation for me. Could I be doing damage to my skin that I can't see? Or is it ok to use as long as I don't see or feel irritation?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Sonoris",
        "body": "This is a fantastic write up, but I don't know how to apply any of this to my product choices. 😅 I must be doing something wrong because neither of them seem to do anything for my skin texture.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "peniscapades",
        "body": "This is so great and cleared up many of my questions about the differences between BHA and AHA!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "rnnybf",
        "body": "I’ve always assumed this but just want to double check since you seem much more knowledgable than I am: don’t AHAs and retinoids (specifically adapalene in my case) have the same  exfoliating effect? I understand AHAs loosens skin cells and retinoids increase cell renewal, but don’t they end up having pretty much the same benefit? My logic has been that I don’t need to add an AHA to my routine, if I need more exfoliation I’ll just up my adapalene percentage, but please correct me if I’m wrong! I would love to know if AHA can give me anything a retinoid can’t.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "dnsf3",
        "body": "Can I use Stridex and tretinoin together in my routine? Stridex in the AM, and tret in the PM? Or even Stridex and tret together in the PM",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "jingledells",
        "body": "Thanks so much for putting this together - I learned a lot from it! One question - what would hyaluronic acid classify as then? Is it even a hydroxy acid? I've seen it as an ingredient in a alot of cleansers.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Toastb0i",
        "body": "Brilliant write up, well done. \n\nJust a quick question, I’m currently applying a retinoid in the evening, followed by a vitamin c serum. I’ve recently added 5% lactic acid to my routine, which I’ve been applying after a toner, and before the retinoid. According to your post, this is not a good idea. When would you/anyone else reading this recommend applying the acid??\n\nThanks!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Poison-Paradise",
        "body": "Would azelaic acid be beneficial to none acne prone skin? In the way that tretinoin has an anti aging properties?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "tinybac0n",
        "body": "I have been using TO Salicylic Acid 2% for about three months (currently at 3x a week), but I'm not sure it's really doing anything for me. Should I continue to 4x a week or try another acid, like lactic acid? I have very sensitive, acne-prone skin as well.  \n\nRoutine for reference...  \nAM:  \n* Rinse with water  \n* Hada Labo Gokujun Hyaluronic Lotion  \n* Laneige Water Bank Eye Gel  \n* Elta MD PM Therapy Moisturizer    \n* Coola Classic Face SPF30  \nPM:  \n* Farmacy Green Clean Cleansing Balm  \n* Murad Clarifying Cleanser  \n* 3x a week TO Salicylic Acid 2%  \n* Hada Labo Gokujun Hyaluronic Lotion  \n* Laneige Water Bank Eye Gel  \n* Elta MD PM Therapy Moisturizer",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "TheonecalledBillie",
        "body": "This is incredible! Thanks so much for your time and effort. Do you think it’s safe to use TO Glycolic Toner then the TO Retinoid 2% every night? Or should I alternate...I’ve just started (tonight) and my skin feels fine so far. Also wondering how long I should wait between using each product?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Chouchoutrain",
        "body": "I've always wondered how does alpha lipoic acid for into the aha/BHA classification?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "xhcd",
        "body": "Isn't it contradictory to say that salicylic acid exfoliate but does not thin the stratum corneum?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Zero_Fucks_",
        "body": "Thanks for the info. Does anyone know if the time you need to leave it on without adding anything else changes with the acid you use? Do you always need to leave acids a certain amount of time to work properly, or does it depend on the formula and you just need to wait until it's absorbed?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Queef-on-Command",
        "body": "I've heard of skin prepping prior to using acids, especially for masks. I'm assuming this is to prep the skin to an ideal pH, is this relavent for low percentages/daily of acids use? What would be some recommend products? Could you expand on this topics further, thanks for the write up :)\n\nAlso opinion on high percentage masks vs routine use of low percentages (example: 4x a week 2% BHA vs 1x a week 30%)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "j33li",
        "body": "Does Azealaic acid make anyone else’s skin tingle and itch like crazy? Even when I wait for it to dry it does this.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "xPawreen",
        "body": "Thanks for the write up!\n\nSince azelaic acid isn’t a hydroxy acid, does it not increase photosensitivity? And if it decrease keratin production, is it a suitable treatment for keratosis pilaris? I often see AHA and BHA and urea recommended for KP but not azelaic acid.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "tayyylooor",
        "body": "Is it true that AHAs are better for PIH where as BHAs are better for acne? I have closed comedones on my checks and black heads/clogged pores on my back. I was using TO glycolic acid, which I think helped with discoloration, but I’m wondering if I should switch to a BHA?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "goingtotryagain",
        "body": "Sooooooo I should ignore the directions that is given on the bottle with regards to TO Mandelic Acid 10% where it says that I should use it daily then?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Caralain",
        "body": "What BHA preparations do you recommend for dry, acneic skin? Trying to get rid of these CCs but I don't want to dry out.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BrigetteM",
        "body": "Thank you so much! Saved this post. Will be reading it every now and then. Very informative. I've been suffering from redness on my cheeks and nose, sometimes my jaw. Even though I haven't gone to the dermatologist, I don't think I have rosacea but just really dehydrated skin + sensitivity. I use Pixi toner day and night, it's given me a really nice glow but it might've been too much use. I'm also using HA (unrelated to this post) but I think due to my dehydrated skin, it's becoming even more dehydrated. I will try TO's Mandelic and maybe alternate it with Pixi day to day.  I have just read a blog entry about TO Mandelic vs Stratia Mandelic and found it very informative. Link below:\n\n[https://www.mydadthechemist.com/reviews/mandelic-acid-stratia-vs-the-ordinary/](https://www.mydadthechemist.com/reviews/mandelic-acid-stratia-vs-the-ordinary/)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Wormspike",
        "body": "I asked this a couple weeks ago and got little help, so maybe you can help. \n\nMy skin is pretty hearty. I've worked up to being able to handle using a BHA and AHA at the same time. Couple questions though: \n\n1) The PH is usually around 3. Most cleansers leave you around a 5 or so. Can you recommend any cleansers or toners to bring your skin's PH down to the appropriate level before applying HAs? \n\n2) Is there any issue with using two different HAs at the same time? Can I use some stridex pads and then throw some TO Glycolic Acid on top? Or do I want to wait 20 minutes in between each HA?\n\n3) If we are to wait in between HAs, then I wash my skin down to a good Ph to apply my first HA..but then 20 minutes later my Ph is going to be back to a 6. I wouldn't want to wash again, what do I do to repeatedly drag down my Ph??",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 27,
      "top_level": 27,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "257kgd",
    "title": "A list of available high street (drugstore) BHAs in the UK.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/257kgd/a_list_of_available_high_street_drugstore_bhas_in/",
    "score": 122,
    "num_comments": 50,
    "created": "2014-05-10T14:54:40+00:00",
    "body": "First of all, these are a list of products available in Boots that I've found, so they're non-exhaustive. Apart from some Neutrogena products and No7 Beautiful Skin Blemish Defence Serum, they contain \"alcohol denat.\", which is a dealbreaker for me as I try to avoid drying alcohols as much as I can. \n\nBHAs are few and very far in between, in addition to not being labelled as such and most probably without the percentage of salicylic acid contained or whether it's in the right pH to be effective. \n\nI haven't done a price comparison, and since I found them in Boots I've used the online site's price point. Prices are only as a guide, they may be cheaper/more expensive elsewhere. Ingredients are highlighted to point out the position of salicylic acid, as well as presence of drying alcohols and parfum for those irritated by them. \n\nAdditional suggestions, opinions and reviews are very welcome!\n\n* PRODUCT: Boots Skin Clear Deep Blackhead Cleansing Lotion\n\nPRICE: £2.99\n\nINGREDIENTS: Aqua (Water), **Alcohol denat.**, **Salicylic acid**, PPG-1-PEG-9 lauryl glycol ether, Butylene glycol, Potassium hydroxide, Ammonium glycyrrhizate, **Parfum (Fragrance)**, Dipropylene glycol\n\n\n\n* PRODUCT: Clearasil Daily Clear Deep Cleansing Pads\n\nPRICE: £4.29 for 65 exfoliating pads\n\nINGREDIENTS: Aqua, **Alcohol Denat., Salicylic Acid,** Isoceteth-20, Aloe Barbadensis Leaf Juice, Sodium Hydroxide, Triethanolamine, Allantoin, **Parfum**, **Menthol**, Benzyl Salicylate, Disodium EDTA, Limonene, Potassium Sorbate, Sodium Benzoate, Citric Acid\n\n\n\n* PRODUCT:Clearasil Ultra Rapid Action Pads\n\nPRICE: 5.39 for 65 pads\n\nINGREDIENTS:Aqua, **Alcohol Denat.**, Isoceteth-20, **Salicylic Acid**, Hydrogen Peroxide, **Parfum**, Sodium Hydroxide, Dextrin, Hydrolyzed Milk Protein, Disodium EDTA, Phenoxyethanol, Sodium Benzoate, Ethylparaben, Butylparaben, Propylparaben.\n\n\n\n* PRODUCT: Clearasil Daily Clear Superfruits Refreshing Pads\n\nPRICE: £4.07\n\nINGREDIENTS: Aqua, **Alcohol Denat.**, Isoceteth-20, Glycerin, **Salicylic Acid**, **Parfum**, Hydrogenated Starch Hydrolysate, Sodium Hydroxide, Propylene Glycol, Niacinamide, Citric Acid, Limonene, Citronellol, Butylphenyl Methylpropional, Hexyl Cinnamal, Rubus Idaeus Juice, Trideceth-9, Vaccinium Macrocarpon Fruit Juice, Geraniol, Bisabolol\n\n\n\n* PRODUCT:Garnier Pure Active line (various)\n\nPRICE: from £4.99 to £7.99\n\nINGREDIENTS: I can't find an ingredients list anywhere, which is frustrating but as a guide, I remember putting all the Garnier products down because they contain \"Alcohol Denat.\" The packaging lists 2% salicylic acid. No info on pH level. \n\n\n\n* PRODUCT: No7 Beautiful Skin Blemish Defence Serum\n\nPRICE: £16.00\n\nINGREDIENTS: Aqua (Water), Glycerin, **Salix Nigra (Willow) Bark Extract**, Phenoxyethanol, Xanthan Gum, Sodium Polyacrylate, Citric Acid, Butylene Glycol, Propylene Glycol, Methylparaben, Sodium Citrate, Aloe Barbadensis Leaf Extract, Lupinus Albus Seed Extract, Tetrasodium EDTA, Carbomer, Polysorbate 20, Butylparaben, Ethylparaben, Disodium EDTA, Propylparaben, Isobutylparaben, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7.\n\nNOTE: As far as I know, willowback extract works as a weaker form of salicylic acid, so I really can't comment on whether there's enough of it to be effective (or if it's in the right pH!), but hey, no alcohols as far as I can see! \n\n\n\n* PRODUCT: No7 Beautiful Skin Pore Minimising Serum\n\nPRICE: £16.00\n\nINGREDIENTS: Aqua(Water), **Alcohol denat.**, Cyclopentasiloxane, Glycerin, HDI/trimethylol hexyliactone cross polymer, C12-15 alkyl benzoate, Dimethicone crosspolymer, Octyldodecanol, Acrylamide/ammonium acrylate copolymer, **Alcohol, Salicylic acid**, Butylene glycol, Polyisobutene, Phenoxyethanol, PEG-30 dipolyhydroxtstearate, Octyldodecylxyloside, Hamamelis virginiana (Witch hazel) water, **Parfum (Fragrance)**, Lens esculenta fruit extract, Sodium PCA, Tocopheryl acetate, Retinyl palmitate, Sorbitan isostearate, Polysorbate 20, Ascorbyl glucoside, Silica, Tetrasodium EDTA, Magnesium PCA, Dipropylene glycol, Spiraea ulmaria extract, Zinc PCA, Potassium hydroxide, Ethylhexylglycerin, Manganese PCA, Potassium sorbate, Tocopherol.\n\n\n\n* PRODUCT: Neutrogena Visibly Clear Oil-Free Moisturiser\n\nPRICE: £4.99\n\nINGREDIENTS: Aqua, Propylene Glycol, Clycerin, C12-15 Alkyl Benzoate, Cetyl Alcohol, Stearyl Alcohol, **Salicylic Acid**, AloeBarbadensis, Chamomilla Recutita, Menthyl Lactate, Glyceryl Stearate, Palmitic Acid, Stearic Acid, Dimethicone, PEG-100 Stearate, Sodium Isostearoyl Lactylate, Propylene Glycol Isostearate, Cyclohexasiloxane, Cyclopentasiloxane, Carbomer, Acrylates / C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Sodium Hydroxide, Phenoxyethanol, Methylparaben, Ethylparaben, Probylparaben, Butylparaben, Isobutylparaben, **Parfum**.\n\n\n\n* PRODUCT: Neutrogena Visibly Clear Spot Stress Control 3-in-1 Daily Cleansing Lotion\n\nPRICE: £3.99\n\nINGREDIENTS: Aqua, **Alcohol Denat.**, Butylene Glycol, **Salicylic Acid**, PPG-5-Ceteth-20, Camellia Oleifera Leaf Extract, Cucumis Sativus Fruit Extract, C12-15 Alkyl Lactate, Cetyl Lactate, Glycerin, Potassium Lactate, **Isopropyl Alcohol**, Sodium Benzotriazolyl Butylphenol Sulfonate, Cocamidopropyl PG-Dimonium Chloride Phosphate, Sodium Citrate, Lactic Acid, Sodium Chloride, Disodium EDTA, Benzalkonium Chloride, Phenoxyethanol, **Parfum**, Cl 17200, Cl 19140, Cl 42090.\n\n\n\n* PRODUCT: Neutrogena VISIBLY CLEAR Blackhead Eliminating Cleansing Lotion\n\nPRICE: £3.99\n\nINGREDIENTS: Aqua, **Alcohol Denat.**, PPG-5-Ceteth-20, Glycerin, **Salicylic Acid**, Menthyl Lactate, **Parfum**\n\n\n\n* PRODUCT: Neutrogena VISIBLY CLEAR Pink Grapefruit Oil-Free Moisturiser\n\nPRICE: £4.99\n\nINGREDIENTS: Aqua, Glycerin, Propylene Glycol, Cetyl Alcohol, C12-15 Alkyl Benzoate, Stearyl Alcohol, Glyceryl Stearate, PEG-100 Stearate, **Salicylic Acid**, Aloe Barbadensis Leaf Extract, Chamomilla Recutita Extract, Menthyl Lactate, Cetyl Lactate, Cocamidopropyl PG-Dimonium Chloride Phosphate, C12-15 Alkyl Lactate, Dimethicone, Sodium Isostearoyl Lactylate, Propylene Glycol Isostearate, **Alcohol Denat.**, **Isopropyl Alcohol**, Myristyl Alcohol, Palmitic Acid, Stearic Acid, Carbomer, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Chloride, Disodium EDTA, Sodium Hydroxide, Lactic Acid, Benzalkonium Chloride, Methylparaben, Propylparaben, Ethylparaben, Phenoxyethanol, **Parfum**.\n\n\n\n* PRODUCT: Neutrogena Visibly Clear Spot Stress Control Hydrating Spot Treatment (note: currently using this as my BHA, tell me if you want a review. It's also one of the recommended products in r/skincareaddiction's sidebar).\n\nPRICE: £4.99\n\nINGREDIENTS: Aqua, Cyclopentasiloxane, PEG-8, Dimethicone, **Salicylic Acid**, Dimethicone Crosspolymer, Sodium Polyacrylate, Vinyl Dimethicone/ Methicone Silsesquioxane Crosspolymer, Panthenol, Cucumis Sativus Extract, Camellia Oleifera Extract, Sclerotium Gum, Butylene Glycol, C12-15 Alkyl Lactate, Cocamidopropyl PG-Dimonium Chloride Phosphate, Laureth-23, Trideceth-6, Cetyl Alcohol, Cetyl Lactate, Laureth-4, Glyceryl Stearate, PEG-75 Stearate, Sodium Chloride, PEG/PPG-18/18 Dimethicone, Ceteth-20, Steareth-20, Glycerin, Lactic Acid, Sodium Hydroxide, Disodium EDTA, Potassium Sorbate, Benzalkonium Chloride, Phenoxyethanol, **Parfum**\n\n\n\n~~* PRODUCT: Neutrogena Visibly Clear Rapid Clear Treatment~~\n((decided that this isn't really appropriate to list as a BHA since it's supposed to be applied directly on spots and not for all over the face, as well as only containing 15ml))\n\n**EDIT** more products!\n\n* PRODUCT: Soap & Glory The Fab Pore 2-in-1 Facial Pore Purifying Mask & Peel\n\nPRICE: £10.00\n\nINGREDIENTS: Corylus Avellana (Hazel) Seed Oil, Glycerin, Stearic Acid, Triethanolamine, Mannitol, Phenoxyethanol, Kaolin, Cellulose, Crataegus Monogina Flower Extract, Allyl Methacrylates Crosspolymer, **Salicylic Acid**, Butylene Glycol, Ci 19140 (Yellow 5), **Parfum (Fragrance)**, Pyridoxine Hcl, Tetrasodium Edta, Methylparaben, Fomes Officinalis (Mushroom) Extract, Propylene Glycol, Aqua (Water),Butylparaben, Ethylparaben, Peg-8, Ascorbyl Palmitate, Tocopheryl Acetate, Titanium Dioxide, Isobutylparaben, Propylparaben, Glyceryl Stearate, Laminaria Saccharina Extract, Hydroxypropyl Methylcellulose, Tocopherol, Sorbitol, Peg-40 Hydrogenated Castor Oil, Ascorbic Acid, Citric Acid, Ci 77289 (Chromium Hydroxide Green), Ci 17200 (Red 33).\n\n\n* PRODUCT: L'Oreal Triple Active Anti-Shine Mattifying Hydrating Moisturiser\n\nPRICE: £4.99\n\nINGREDIENTS: Aqua, Glycerin, Isohexadecane, Glyceryl Stearate, Isononyl, Isononanoate, Cetearyl Alcohol, Dimethicone, **Salicylic Acid**, Aluminium Starch Octenylsuccinate, Silica, Perlite, Nylon-66, Oleth-10, C13-14 Isoparaffin, PEG-100 Stearate, Stearyl Alcohol, Sodium Hydroxide, Capryloyl Salicylic Acid, Tetrasodium EDTA, Laureth-7, Xantham Gum, Polyacrylamide, Linalool, Geraniol, Alpha-Isomethyl Ionone, Limonene, Butylphenyl Methylpropional, **Parfum**",
    "flair_text": "Exfoliation",
    "flair_template_id": null,
    "comments": [
      {
        "author": "turquoise_politics",
        "body": "Thank you for this list! I'm new to skincareaddiction and I've found finding suitable products in the UK is super over-whelming. This is really helpful!",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "siassias",
        "body": "This puts together a lot of helpful information, thank you! \n\nHowever, I wanted to add that I just bought two packs of Stridex (90 pads) from iherb last week, and including postage it was £12. I think for the quality and quantity of product, it's definitely worth buying this over anything in Boots. \n\nI wouldn't bother buying e.g. face wash our moisturiser from the U.S., but I really this it's worth considering the Stridex.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "memequeen",
        "body": "Thank you!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "stufstuf",
        "body": "It wasn't till I started reading this subreddit that I realised that I probably should ease off the scrubbing and look into chemical exfoliation so I went back to an old bottle of *Neutrogena Visibly Clear Spot Stress Control 3-in-1 Daily Cleansing Lotion* that I had. While I could see the improvements, it would feel like my skin was burning. I'm not sure if it's due to the age of the bottle, or just the ingredients, but I discontinued use.\n\nThen I bought *Boots Skin Clear Deep Cleansing Lotion* which is exactly the same as the Blackhead version just with an extra word on the front. It feels just like[ L'Occitaine's Shea Butter Toner](http://cosdna.com/eng/cosmetic_8adf20777.html) that's alcohol free, but a month in and I don't really feel like it's doing anything.\n\nI used to use Neutrogena a lot and I really liked their grapefruit range, but the *Neutrogena VISIBLY CLEAR Pink Grapefruit Oil-Free Moisturiser* stopped being effective far too quickly. It goes on really light which I like, but after a while my skin either feels dry, or really oily. I felt it was super hit and miss.\n\nWith the Neutrogena Visibly Clear Spot Stress Control Hydrating Spot Treatment, is that just on acne, do you put it on under moisturiser or as a moisturiser?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "m0ssatron",
        "body": "Great list, thank you! I'm a lurker on this sub reddit ever since my skin started breaking out again (late 20s - my skin hasn't been this bad in a long time, hopefully just pre-wedding stress!), largely because I can't comment on/get hold of most of the products. \n\nI quite like the Boots Clear Skin range - their face scrub is something I've actually used until the dregs at the end. I accidentally bought their face wash instead of replacing my scrub, and haven't tried it as yet. Hoping it'll be as good as the scrub is - think it really helped my break outs. Will definitely try the lotion! \n\nI only tend to by No 7 stuff when they do their vouchers, or when it's in the sale, so might hold out until then!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Mircyreth",
        "body": "I know you've removed it, but I would recommend the visibly clear spot treatment. Couldn't find a bp anywhere (have these gone out of fashion or something?!) So got that as a cheap deal at Asda and it's reduced some really threatening lumps on my chin! Great stuff!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "_becatron",
        "body": "Great post. The boots lotion is still one of my HG products and my skin has improved so much from using it. Clearly I have no issues with the alcohol so it might not be for everyone. But I love the stuff, can't rave enough about it. Lasts ages too and so cheap.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 7,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "18nusra",
    "title": "CeraVe Brand Review: Hydrating Cream-to-Foam Cleanser, Acne Foaming Cream Cleanser (4% Benzyl Peroxide) Resurfacing Retinol Serum, PM Facial Moisturizing Lotion, Moisturizing Cream (White Tub)",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18nusra/cerave_brand_review_hydrating_creamtofoam/",
    "score": 58,
    "num_comments": 17,
    "created": "2023-12-21T19:16:27+00:00",
    "body": "**Review (Long Term Usage; 1+ years)** I have been using a few CeraVe products for more than an year. Putting down all the reviews at one place.\n\nhttps://preview.redd.it/21mqpuxa4p7c1.jpg?width=768&format=pjpg&auto=webp&s=6152cd7496bcfdc6354819d50cab1872dd769b28\n\n**About me**: 25 F; I have combination skin with an oily T zone in summers and dry cheeks and nose in winters. I don't like strong fragrance in products, and I stay away from DIYs\n\n**Skin concerns**: Cystic acne; scars, hyperpigmentation *and* *crying* from the cystic acne\n\nAccording to the brand, All CeraVe products are formulated to be fragrance-free.\n\n*Category 1: Cleansers*\n\n**CeraVe Hydrating Cream-to-Foam Cleanser**\n\nTexture: Just like its described. It’s a creamy lotion texture out of the bottle. When you add water to it, it foams up and washes off like any other foaming cleanser. No noticeable fragrance.\n\nApplication: I use it two ways. First, if I want to take off any light makeup I rub it all over my dry face and it melts makeup off, then I add water it it and cleanse. Second way, I use it as a regular cleanser taking a pump in palm adding water to it and rubbing it all over my face, washing it off with water\n\n**10/10. Excellent. No notes. HG**. Already on 6th bottle. **WRP Forever**.\n\nIngredients AQUA / WATER / EAU, GLYCERIN, SODIUM METHYL COCOYL TAURATE, COCO-BETAINE, SODIUM COCOYL ISETHIONATE, SODIUM CHLORIDE, PCA, PPG-5-CETETH-20, PEG-100 STEARATE, PEG-150 PENTAERYTHRITYL TETRASTEARATE, PEG-6 CAPRYLIC/CAPRIC GLYCERIDES, PEG-30 DIPOLYHYDROXYSTEARATE, CI 77891 / TITANIUM DIOXIDE, ASPARTIC ACID, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, SORBITAN ISOSTEARATE, CARBOMER, GLYCOL DISTEARATE, GLYCERYL STEARATE, GLYCERYL OLEATE, GLYCINE, TRIDECETH-6, CETEARYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, THREONINE, SODIUM HYDROXIDE, SALICYLIC ACID, SODIUM PCA, SODIUM LACTATE, ARGININE, SODIUM LAUROYL LACTYLATE, SERINE, SODIUM BENZOATE, VALINE, SODIUM HYALURONATE, PROLINE, ISOLEUCINE, CHOLESTEROL, PHENOXYETHANOL, ALANINE, PHENYLALANINE, COCONUT ACID, COCO-GLUCOSIDE, CHLORPHENESIN, DISODIUM EDTA, HYDROXYETHYL UREA, CITRIC ACID, HYDROXYETHYL ACRYLATE/SODIUM ACRYLOYLDIMETHYL TAURATE COPOLYMER, CAPRYLYL GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, HISTIDINE, ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER, POLYQUATERNIUM-53, POLYQUATERNIUM-39, POLYSORBATE 60, ETHYLHEXYLGLYCERIN, BENZOIC ACID\n\n**CeraVe** **Acne Foaming Cream Cleanser (4% Benzyl Peroxide)**\n\nTexture: Translucent lotion-y texture, It’s runnier than the Cream to foam cleanser. Foams up well on wet face.\n\nApplication: It’s a wash off BP product. I use it 2x a week. I apply on face, neck and underarms. I leave it on for 5min and wash it off with water. I think it works better this way. If I leave it on for too long it does dry out my skin.\n\nI use it as a body wash too. It helped me with active acne on my face and back. I find it Better than other BP bodywashes and facewashes I tried. It doesn’t strip my skin. I do use a thick moisturiser after this.\n\n**9/10**. I cut one point for the packaging; It leaked on a flight once. **WRP**\n\nIngredients BENZOYL PEROXIDE 4%\n\nINACTIVE INGREDIENTS: WATER, GLYCERIN, PROPYLENE GLYCOL, COCAMIDOPROPYL HYDROXYSULTAINE, SODIUM C14-16 OLEFIN SULFONATE, XANTHAN GUM, POTASSIUM HYDROXIDE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, NIACINAMIDE, GLYCOLIC ACID, SODIUM CHLORIDE, SODIUM CITRATE, SODIUM HYALURONATE, SODIUM LAUROYL LACTYLATE, SODIUM HYDROXIDE, CHOLESTEROL, PHENOXYETHANOL, PROPANEDIOL, CITRIC ACID, TETRASODIUM EDTA, DIETHYLHEXYL SODIUM SULFOSUCCINATE, PHYTOSPHINGOSINE, ETHYLHEXYLGLYCERIN, BENZOIC ACID\n\n*Category 2: Serum*\n\n**CeraVe Resurfacing Retinol Serum**\n\nTexture: Off-white runny lotion texture. Spreads easily. Not sticky, layers well under other products in my routine. No added fragrance.\n\nApplication: I started with using it twice a week and built up to every day. I use the sandwich method and layer between essence and a moisturizer. I don’t like it. It didn’t do anything for me. I noticed no difference in my skin except a slight smoothing effect. I find it to be a non-offensive beginner retinol.\n\n**5/10**. Excellent packaging. All Retinol products should come in a pump like this. **WNRP**\n\nIngredients: AQUA/WATER/EAU, PROPANEDIOL, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), CETEARYL ETHYLHEXANOATE, NIACINAMIDE, AMMONIUM POLYACRYLOYLDIMETHYL TAURATE, DIPOTASSIUM GLYCYRRHIZATE, HYDROGENATED LECITHIN, POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, CETEARYL ALCOHOL, BEHENTRIMONIUM METHOSULFATE, DIMETHICONOL, LECITHIN, SODIUM CITRATE, RETINOL, SODIUM HYALURONATE, SODIUM LAUROYL LACTYLATE, CHOLESTEROL, PHENOXYETHANOL, ALCOHOL, ISOPROPYL MYRISTATE, CAPRYLYL GLYCOL, CITRIC ACID, TRISODIUM ETHYLENEDIAMINE DISUCCINATE, PENTYLENE GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, POLYSORBATE 20, ETHYLHEXYLGLYCERIN\n\n*Category 3: Moisturizers*\n\n**CeraVe PM Facial Moisturising Lotion**\n\nTexture: Super light gel cream texture. Applies like a dream on my skin. No noticeable fragrance.\n\nApplication: I apply it after Hada Labo lotion. Used it throughout summer, great stand alone moisturizer. It was the only niacinamide product I was using at the time. I don’t like it for colder weather as my skin becomes drier. Excellent in hot weather at night. Helps oil control and the usual niacinamide things. It might feel heavy if you have super oily skin.\n\n**10/10.** No Nonsense night moisturizer in a pump bottle!!! **WRP**.\n\nIngredients : AQUA / WATER / EAU, GLYCERIN, CAPRYLIC/CAPRIC TRIGLYCERIDE, NIACINAMIDE, CETEARYL ALCOHOL, POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), CETEARETH-20, BEHENTRIMONIUM METHOSULFATE, SODIUM LAUROYL LACTYLATE, SODIUM HYALURONATE, CHOLESTEROL, PHENOXYETHANOL, DISODIUM EDTA, DIPOTASSIUM PHOSPHATE, CAPRYLYL GLYCOL, PHYTOSPHINGOSINE, XANTHAN GUM, POLYGLYCERYL-3 DIISOSTEARATE, ETHYLHEXYLGLYCERIN\n\n**CeraVe Moisturizing Cream (White Tub)**\n\nTexture: Thick and gooey. The only CeraVe product that has a strange plastic/fevicol smell. The brand says there is no added fragrance so maybe it's just me. \n\nApplication: Applies smooth. Feels super super heavy on my face. I could just feel it sitting heavy on my skin. It didn’t give me any CCs. I used the rest of the tub as a body moisturizer. Great as a body moisturizer.\n\n**4/10.** The tub packaging too is disappointing. **WNRP.**\n\nIngredients: AQUA / WATER / EAU, GLYCERIN, CETEARYL ALCOHOL, CAPRYLIC/CAPRIC TRIGLYCERIDE, CETYL ALCOHOL, CETEARETH-20, [PETROLATUM](https://www.cerave.com/skincare/petrolatum), POTASSIUM PHOSPHATE, CERAMIDE NP, CERAMIDE AP, CERAMIDE EOP, CARBOMER, [DIMETHICONE](https://www.cerave.com/ingredients-in-cerave/dimethicone), BEHENTRIMONIUM METHOSULFATE, SODIUM LAUROYL LACTYLATE, SODIUM HYALURONATE, CHOLESTEROL, PHENOXYETHANOL, DISODIUM EDTA, DIPOTASSIUM PHOSPHATE, TOCOPHEROL, PHYTOSPHINGOSINE, XANTHAN GUM, ETHYLHEXYLGLYCERIN\n\nSorry for any mistakes. Let me know if I've missed any points. I'm new to reviews and English is hard.\n\nIf you have any questions about the products, please do ask.",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "Poignant-musings",
        "body": "Amazing review. Thank u so much!",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "Rumi2019",
        "body": "Excellent write up 👍 👍 👍 \n\nHow much does the Hydrating cream to foam cleanser actually foam? Mild lather /mild foam Sulphate free shampoo kind or full on foamy?\n\nAlso strange that cerave in the tub smells like fevicol to you. I didn't smell that when I used it.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Sweet-Opportunity111",
        "body": "Where did you get these products from",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "skinndom",
        "body": "I’ve been wanting to try the acne foaming cleanser for while. Loved your review! Will get my hands on it !",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Intelligent_Side_729",
        "body": "Very well written review. \nI have a similar skin type as yours. Definitely going to try the night moisturiser in summers. Do you have a suggestion for a winter moisturizer as well? I get dry patches but am scared to try anything too thick because it might trigger my acne.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ilovecvocks",
        "body": "Do you use hydrating cream to foam cleanser daily? If so, how has it changed your skin? Does it help with hyperpigmentation and fading away acne marks and even skin texture and brightening? Can you provide us the link to the product, please?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "103waxh",
    "title": "Best surfactants for hard water?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/103waxh/best_surfactants_for_hard_water/",
    "score": 11,
    "num_comments": 11,
    "created": "2023-01-05T11:04:02+00:00",
    "body": " Ive tried sodium C14-16 olefin sulfate which is supposed to be clarifying, but my hair still has waxy buildup after washing in hard water. I've also tried shampoo with a chelating agent (EDTA), which didn't work either. \n\nThe only shampoo that leaves my hair feeling clean is loreal metal detox, but this is obviously too harsh for regular use. It also has numerous surfactants (ingredients below) so hard to tell which one was doing the trick. Should I try good old SLS? \n\nEdit: just wanted to add that I already have one of the shower head filters with the beads from amazon and it hardly does a thing, and I don't have the funds to install an expensive softening system. Looking for ingredient/ product recommendations only.\n\nUpdate: I just used a shampoo with SLS and it worked like a dream!\n\nLoreal metal detox ingredients: AQUA / WATER / EAU • SODIUM COCOYL ISETHIONATE • DISODIUM LAURETH SULFOSUCCINATE • GLYCOL DISTEARATE • SODIUM LAURYL SULFOACETATE • SODIUM LAUROYL SARCOSINATE • GLYCERIN • PARFUM / FRAGRANCE • PPG-5-CETETH-20 • DECYL GLUCOSIDE • COCAMIDOPROPYL BETAINE • COCO-BETAINE • DIVINYLDIMETHICONE/DIMETHICONE COPOLYMER • AMODIMETHICONE • CITRIC ACID • SODIUM HYDROXIDE • POLYQUATERNIUM-7 • POLYQUATERNIUM-10 • CARBOMER • SODIUM BENZOATE • SODIUM CHLORIDE • LIMONENE • PEG-55 PROPYLENE GLYCOL OLEATE • PROPYLENE GLYCOL • SALICYLIC ACID • BENZOIC ACID • POLYSORBATE 21 • HEXYL CINNAMAL • LINALOOL • TRIDECETH-6 • C12-13 PARETH-23 • C12-13 PARETH-3 • CITRAL • GERANIOL • GLYCINE • TOCOPHEROL • CETRIMONIUM CHLORIDE • PHENOXYETHANOL.",
    "flair_text": "Discussion",
    "flair_template_id": "ccd7cb78-90e4-11eb-bf25-0e05a18c66ab",
    "comments": [
      {
        "author": "Blaque-Cat",
        "body": "Get a clarifying hard water shampoo, like Malibu C Undo Goo, and a shower filter attachment.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Notsureindecisive",
        "body": "Just get a showerhead filter and your problem will be gone 🤗",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "IllidanLegato",
        "body": "Korean products",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "world2021",
        "body": "SLS",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "throwawaythrowyellow",
        "body": "Just going to add when hard water was too much for my hair (and products). I switched to filtered bottled water for my hair for awhile.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1h4vo12",
    "title": "I randomly tried some gel I had purchased for my son and it has been the best I have used on bringing out more curls in my hair....I immediately went to order another jar and couldn't find it. I contacted the company and was told it is discontinued :( Can anyone help me find something similar??? ",
    "url": "https://www.reddit.com/r/curlyhair/comments/1h4vo12/i_randomly_tried_some_gel_i_had_purchased_for_my/",
    "score": 10,
    "num_comments": 5,
    "created": "2024-12-02T14:04:05+00:00",
    "body": "# Function of Beauty Moisturizing Styling Gel for Curly / Coily Hair \n\n  \nI realize it may not be the best ingredients but it has literally been the best gel I have tried since starting my curly girl journey!! Please help! \n\n# Ingredients:\n\nWater (Aqua), Glycerin, Polyacrylate Crosspolymer-6, Ppg-5-Ceteth-20, Hydrolyzed Ceratonia Siliqua Seed Extract, Caesalpinia Spinosa Fruit Extract, Helianthus Annuus (Sunflower) Sprout Extract, Panthenol, Guar Hydroxypropyltrimonium Chloride, Zea Mays Starch, Acacia Senegal Gum, Pvp, Xanthan Gum, Maltodextrin/Vp Copolymer, Ethylhexylglycerin, Propylene Glycol, Benzoic Acid, Disodium Edta, Dehydroacetic Acid, Phenoxyethanol, Sodium Benzoate, Fragrance, Potassium Sorbate, Polyquaternium-7, T-Butyl Alcohol, Linalool, Limonene, Hexyl Cinnamal, Benzyl Salicylate, Amyl Cinnamal, Citral.",
    "flair_text": "Help!",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "yurily26",
        "body": "According to [skinskool](https://skinskoolbeauty.com/dupes/function-of-beauty/moisturizing-styling-gel-for-curlycoily-hair-25cf7381), the closest products by ingredients are “Rebounce Natural Texture & Curl Defining Crème by R+CO BLUE”, “Brilliant Gloss Multi-Tasker by FEKKAI”, and “Zipper Multi-Tasking Styling Lotion by R+CO”. The hyperlink has a ton more “dupes”, but I’m not gonna copy paste them all lol",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi there! I'm a bot, and I've been summoned to help.\n\n**If you have not seen our [WIKI](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/) yet:** Please check it out! It's nearly 100 pages full of curated information to help answer all of your curl-related questions. You can use the included Table of Contents (page 2), the side bar, or CTRL-F to search for keywords and help navigate the document.\n\n**Reminder:** [Curl type](https://docs.google.com/document/d/1Q6Dj9WAZxlfBhJSyS5on2rw3-if5cOV3oV-dQ3B0AHA/edit?tab=t.0#bookmark=kix.e9uk1qyai8oh) is NOT your hair type! Whether you are wavy, curly, or coily - you have texture and you belong here. More than that, your curl type doesn't dictate how you care for your hair. To help your curls thrive, we recommend instead using the wiki link above to learn about your porosity, texture, and density.\n\n**If this is a photo submission:** Please include your detailed routine for your post to remain active! This MUST include the *brands* of ALL products used, *order* of application and *technique* used to apply them, how you dried your hair, and anything else that you might find useful for people to know.\n\n**If you received this message in error:** Please disregard this comment! I probably just picked up on a keyword in your title.\n\nThank you. Wishing you many happy, wonderfully curly hair days!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/curlyhair) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTransplants",
    "post_id": "1hr7qr6",
    "title": "Hair Transplant and Seborrheic Dermatitis - When Can I Resume My Anti-Dandruff Shampoo?",
    "url": "https://www.reddit.com/r/HairTransplants/comments/1hr7qr6/hair_transplant_and_seborrheic_dermatitis_when/",
    "score": 7,
    "num_comments": 4,
    "created": "2025-01-01T17:35:02+00:00",
    "body": "\nHi everyone,\n\nI recently had a hair transplant and wanted to ask for advice regarding my scalp care routine. I’ve been managing seborrheic dermatitis on my scalp really well with a Vichy anti-dandruff shampoo, which I use 1–2 times per week. It contains the following ingredients:\n\n\tAQUA / WATER - SODIUM LAURETH SULFATE - COCO-BETAINE - GLYCERIN - DIMETHICONE - CETYL ALCOHOL - HYDROXYSTEARYL CETYL ETHER - CARBOMER - CI 19140 / YELLOW 5 - CITRIC ACID - 2-OLEAMIDO-1,3-OCTADECANEDIOL - PPG-5-CETETH-20 - PROPYLENE GLYCOL - SALICYLIC ACID - SELENIUM SULFIDE - SODIUM CHLORIDE - SODIUM HYDROXIDE - SODIUM HYPOCHLORITE - PARFUM / FRAGRANCE\n\nOn other days, I typically use Sebamed Plus Shampoo for sensitive skin, which has these ingredients:\n\n\tAqua (Water), Sodium Laureth Sulfate, Lauryl Glucoside, Sodium Lauroyl Sarcosinate, Sodium Chloride, Hydroxypropyl Oxidized Starch PG-Trimonium Chloride, Piroctone Olamine, Menthol, Parfum (Fragrance), Citric Acid, Phenoxyethanol, Sodium Benzoate, CI 42090 (Blue 1 Lake), CI 47005\n\nI know the transplanted area needs time to heal properly, so I’ve held off using these shampoos for now. However, seborrheic dermatitis tends to flare up if I don’t keep it under control, so I want to know:\n\t1.\tWhen can I safely resume using my Vichy anti-dandruff shampoo?\n\t2.\tShould I wait longer to use the Sebamed shampoo as well, or is it gentler and safe to use earlier?\n\t3.\tAre there any precautions or alternative recommendations for managing seborrheic dermatitis during this healing phase?\n\nI’m following my surgeon’s advice for post-transplant care, but I’d love to hear from others with similar experiences or knowledge. Thanks in advance for your help!",
    "flair_text": "General\n",
    "flair_template_id": "87d440ce-c946-11ec-9512-e2386cad1844",
    "comments": [
      {
        "author": "dulz93",
        "body": "Would love to get your experience few months down the line as I also have SD, and have been hesitant to get the HT as I'm not sure if itll be successful on me o",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Select_Quiet_8380",
        "body": "Hi mate, I was waiting on this exact question from my doctors PA and it got answered yesterday. They’ve informed me that once the skin has fully healed and isn’t inflamed then you can go about using normal medicated shampoos. Mine is for Psoriasis and has Salicylic acid in too.\n\nSo after about 2 months post procedure you’re probably alright to use it 👍🏼",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LsdMdma_lover",
        "body": "I do an apple cider vinegar and water mixture. Apply to my scalp before showering leave it on for 10 min then rinse. Has helped with my dandruff.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "4wgni0",
    "title": "[Sun Care] Is it okay using a body sunscreen for your face? (Piz Buin Allergy Lotion SPF 30)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/4wgni0/sun_care_is_it_okay_using_a_body_sunscreen_for/",
    "score": 7,
    "num_comments": 8,
    "created": "2016-08-06T16:53:19+00:00",
    "body": "I'm trying to find a good, affordable sunscreen in the UK. I've been looking at Piz Buin Allergy Lotion SPF30, and they also have one specifically for you face, Piz Buin Allergy Face Cream SPF30, which is more expensive and I'd rather not pay that much. Is it okay using the body one for your face too?\n\nHere are the ingredients for both:\n\nPiz Buin Allergy Lotion SPF30: \nAqua, Ehtylhexyl Salicylate, C12-15 Alkyl Benzoate, Octocrylene, Glycerin, Cyclohexasiloxane, Butylene Glycol, VP/Eicosene Copolymer, Butyl Methozydibenzoylmethane, Dimethicone, Cetearyl Alcohol, Methylene Bis-Benzotriazolyl Tetramethylbutylphenol, Chrysanthemum Parthenium Extract, Hydroxyphenyl Propamidobenzoic Acid, Pentylene Glycol, Cyclopentasiloxane, Acrylates/C12-22 Alkyl Methacrylate Copolymer, Caprylyl Glycol, Propylene Glycol, PPG-5-Ceteth-20, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Ceteth-10 Phosphate, Dicetyl Phosphate, Decyl Glucoside, Potassium Lactate, Xanthan Gum, Disodium EDTA, Sodium Hydroxide, BHT, Phenoxyethanol, Potassium Sorbate, Parfum\n\nPiz Buin Allergy Face Cream SPF30:\nAqua, C12-15 Alkyl Benzoate, Ethylhexyl Salicylate, Octocrylene, Glycerin, Butylene Glycol, Silica, Cyclohexasiloxane, Butyl Methoxydibenzoylmethane, Butyrospermum Parkii Butter, VP/Eicosene Copolymer, Methylene bis-benzotriazolyl tetramethylbutylphenol (nano), Styrene/Acrylates Copolymer, Cetyl Alcohol, Bis-Ethylhexyloxyphenol Methoxyphenyl Triazine, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Chrysanthemum Parthenium Flower Extract, Hydroxyphenyl Propamidobenzoic Acid, Pentylene Glycol, Propylene Glycol, Sodium Polyacrylate, Acrylates Copolymer, Caprylyl Glycol, Cyclopentasiloxane, Linseed Acid, Glyceryl Stearate, PEG-75 Stearate, PEG-8 Laurate, Potassium Cetyl Phosphate, Decyl Glucoside, Steareth-20, Sodium Dodecylbenzenesulfonate, Ceteth-20, Cetearyl Alcohol, Xanthan Gum, Disodium EDTA, Ascorbyl Palmitate, Phenoxyethanol, Potassium Sorbate, Parfum\n\nAlso, if anyone has any experience using any of the Piz Buin sunscreens, I would love to hear! I'm looking for one that doesn't look oily/greasy and doesn't clog pores. I'm not sure if this one meets those requirements, but judging from the ingredients it doesn't seem too bad compared to others I've seen. Thanks!\n",
    "flair_text": "Sun Care",
    "flair_template_id": null,
    "comments": [
      {
        "author": "eep1237",
        "body": "This was a while ago, but what did you think of the Piz Buin sunscreen if you tried it? I'm now in the same boat looking for an affordable sunscreen in the UK...",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "-salma",
        "body": "I'll answer my own question. Yes, it's perfectly fine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "missblonde",
        "body": "I use the Paula's Choice body butter on my face.I emailed the company to make sure and they said it was fine. It is very rich, but if you're skin is dry it's ideal.It's a lot better thn some irritiang \"face\" creams.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "qzb7zv",
    "title": "What is in Pureology Nanoworks Gold that my hair really loves?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/qzb7zv/what_is_in_pureology_nanoworks_gold_that_my_hair/",
    "score": 7,
    "num_comments": 9,
    "created": "2021-11-22T02:51:21+00:00",
    "body": "Hi everyone,\n\nI’m a bit of a haircare/hair science newbie, and I searched the sub and combed through the wiki to try to figure this out myself, but I’m still at a loss, probably because I just don’t quite understand which haircare ingredients do what. Anyway, all this to say that I’m sorry if this has been asked or covered before. I just couldn’t find it on my own. If there are any posts you think I should refer to, please link it below!\n\n\nI recently tried the Pureology Nanoworks Gold shampoo and conditioner set, and after rinsing out the conditioner, I could immediately tell that my hair felt softer. After drying, my hair was much smoother/less frizzy, had a lot of body, and was the shiniest I’ve ever seen it. My parents, who have never commented on my hair, even said that my hair looked really healthy when we were FaceTiming. Given that the price of the products makes me want to cry, I’m hoping to get some help in figuring out what exactly is in it that my hair really loves, and I want to see if I can find those ingredients in other shampoos/conditioners. \n\n\nA little bit about my hair:\n\n\nI have thin, low porosity (I think), fine, black hair. My ends are drier and I have a very oily scalp. The oily scalp is very odd to me because I am extremely dry everywhere else on my body, but my scalp has always been oily.\n\n\nI wash and condition my hair every night, wrap in an Aquis microfiber towel for a while, remove the towel, spray It’s A 10 leave-in lite, then dry my hair with a hairdryer. I’ve tried not washing my hair every day, but it just gets too oily by the second day and my hair gets stringy and looks limp. Sometimes I will use dry shampoo, but I find that it just feels like there’s a lot of gunk in my hair and I break out on my scalp. \n\n\nFor the past couple of years, I’ve used Matrix Biolage Ultra Hydrasource Shampoo and ultra Hydrasource conditioning balm. I’ve also used the Paul Mitchell tea tree shampoo/conditioner set on the days I have to wash dry shampoo out of my hair because I feel like the tea tree helps with the breakouts. For deep conditioning, I used the briogeo don’t despair repair conditioning mask, but honestly that just felt like an everyday conditioner to me, and I would mix that in with the tea tree conditioner because I didn’t feel like the Paul Mitchell one did anything for my hair. Currently I’m using the living proof restore hair mask in the same way. When I ran out of the matrix set, I switched over to the Bondi Boost hair growth shampoo and conditioner because when I finally was able to get a hair cut, my hairdresser told me that I had lost a lot of hair. Although I think it was due to stress and the fact that I couldn’t go get my hair done because COVID and I live in a different state than my home state for grad school, so my hair got really long and I don’t think it was very healthy (but it also looked really good after the Pureology set, and it looks even better now that I got a haircut and feel like my hair is a bit healthier than before). The Pureology was used here and there throughout my time with these aforementioned products, mainly because I was trying to make the product last longer, but each time I use it, I notice an immediate difference. \n\n\nPlease let me know if there’s any other info you need to know about my hair, and thanks in advance for reading this post and for any insight you might have for me!\n\n\nShampoo Infredients:\n\n\nAqua/Water/Eau, Disodium Laureth Sulfosuccinate, Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Sodium Lauryl Sulfoacetate, Glycol Distearate, Divinyldimethicone/Dimethicone Copolymer, Coco-Glucoside, Glycereth-26, Panthenol, Parfum/Fragrance, Sodium Chloride, Ppg-5-Ceteth-20, Methyl Gluceth-20, Polyquaternium-10, Amodimethicone, Peg-55 Propylene Glycol Oleate, Propylene Glycol, Trisodium Ethylenediamine Disuccinate, Carbomer, C11-15 Pareth-7, Benzoic Acid, Sodium Benzoate, Sclerocarya Birrea Seed Oil, Tocopherol, Butyrospermum Parkii Butter/Shea Butter, Ethylhexyl Methoxycinnamate, Butylene Glycol, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Laureth-9, Glycerin, C12-13 Pareth-23, Benzyl Alcohol, C12-13 Pareth-3, Trideceth-12, Helianthus Annuus Seed Extract/Sunflower Seed Extract, Magnesium Nitrate, Phenoxyethanol, Sodium Acetate, Salicylic Acid, Isopropyl Alcohol, Methylchloroisothiazolinone, Melanin, Potassium Sorbate, Sorbic Acid, Magnesium Chloride, Methylisothiazolinone, Pentylene Glycol, Bht, Ethylhexylglycerin, Citric Acid, Sodium Hydroxide.\n\n\nConditioner Ingredients\n\n\nAqua/Water/Eau, Cetearyl Alcohol, Behentrimonium Chloride, Amodimethicone, Parfum/Fragrance, Isopropyl Alcohol, Phenoxyethanol, Panthenol, Butyrospermum Parkii Butter/Shea Butter, Benzoic Acid, Trideceth-6, Sclerocarya Birrea Seed Oil, Tocopherol, Ethylhexyl Methoxycinnamate, Butylene Glycol, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Potassium Hydroxide, Caramel, Cetrimonium Chloride, Sodium Chloride, Helianthus Annuus Seed Extract/Sunflower Seed Extract, Benzyl Alcohol, Potassium Sorbate, CI 15985/Yellow 6, CI 14700/Red 4, BHT, Melanin, Pentylene Glycol, Citric Acid, Ethylhexylglycerin.",
    "flair_text": "Advice Request",
    "flair_template_id": "e608b216-58be-11e4-9d10-12313b0ea4d6",
    "comments": [
      {
        "author": "RubyDiscus",
        "body": "Likely from the amodimethicone and oils.\n\nI think its a bit too heavy for my hair tho. I tried a product with it higher up the list but it made it too weighted",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "grizzzl",
        "body": ">Conditioner Ingredients\n\n>Caramel\n\nIm gonna need a taste test of your hair lol",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "1hga33f",
    "title": "Is there any reason NOT to use kiehls hand salve as a face cream...?",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/1hga33f/is_there_any_reason_not_to_use_kiehls_hand_salve/",
    "score": 6,
    "num_comments": 7,
    "created": "2024-12-17T13:00:18+00:00",
    "body": "Hi all, this might be a weird post, but here we go: I ran out of normal face moisturiser the other evening, but my face was feeling super dry so I didn't want to leave it with nothing on. I figured I'd make do with what I had to hand (hah) and use what I have, so I applied a small amount of kiehl's ultimate strength hand salve to my face. It was a bit thick but eventually soaked in fine. \n\nThe next morning though, I was GLOWING. I've tried it a few more times since and it's gone just as well. I'm now actually wondering if I should just start using this as a nighttime face cream permanently...? \n\nAre there any ingredients in it that aren't good for face skin long term? Can anyone think of any other reason why I shouldn't use it (at least in winter when I often need extra moisturising)? Nothing jumps out at me on the ingredients, but I'm really not knowledgeable in that department at all. Alternatively, can anyone suggest something likely to be similar to the hand salve, but that's actually tailored to face skin? \n\nBy the way I'm not affliated with Kiehl's in any way or anything; just a disorganised gal with sometimes dry skin. Thank you for reading! \n\n\n\n\nFull ingredients list: \n\nAqua/Water, Glycerin, Caprylic/ Capric/Stearic Triglyceride, Butylene Glycol, Aluminum Starch Octenylsuccinate, Hydrogenated Stearyl Olive Esters, Butyrospermum Park II/Shea Butter, Cetearyl Alcohol, PEG-75 Stearate, Glyceryl Stearate, Cetyl Alcohol, BIS-Diglyceryl Polyacyladipate-2, Sesamum Indicum/Sesame Seed Oil, Squalane, Dimethicone, Ceteth-20, Phenoxyethanol, Persea Gratissima/Avocado Oil, Steareth-20, Ceteareth-20, Methylparaben, Sodium Dehydroacetate, Tocopheryl Acetate, PPG-5-Ceteth-20, Eucalyptus Globulus/Eucalyptus Globulus Leaf Oil, Allantoin, Disodium EDTA, Aloe Barbadensis/Aloe Barbadensis Leaf Juice",
    "flair_text": "Question",
    "flair_template_id": "939a0b98-06d8-11e4-89e1-12313b01142d",
    "comments": [
      {
        "author": "llama_del_reyy",
        "body": "If it works for you, go for it! A lot of people would find these ingredients heavy/clogging and could experience breakouts.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Ndanatsei",
        "body": "Hey OP, if it works for you, then keep on keeping on! People have a tendency to generalise skincare but if this work, then go ahead🥰",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Specialist_Office_62",
        "body": "Glad to see another Kiehl's hand salve fan that stuff is the best I've tried (for hands, it's too greasy for my face). Their Ultra Facial Advanced Repair Barrier Cream is nice and thick too, but not quite the same stuff. If it works for you, why not?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "RositaZetaJones",
        "body": "As long as it’s not clogging the skin and breaking you out then go ahead :)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, welcome to r/SkincareAddictionUK! If you are asking for help with skincare, please remember to list your routine in full, and all the products you've tried so that you can receive the best possible advice.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddictionUK) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "wonderingloz",
        "body": "Not sure if anyone is interested in an update, but I decided to roll with it and kept using the hand cream as a face cream for a while every evening, and while it (surprisingly) didn't clog up my pores to give me spots, it did seem to be changing the texture of my skin a bit. I hadn't changed anything else overall, so I'm fairly sure it was the hand cream, but I found my skin was getting less smooth. Not in a dry way, nor did I seem to be overly oily, I guess it made my pores look bigger in the T zone and my cheek skin a bit less smooth somehow? I don't know how else to describe it. Anyway, I've stopped using it as a daily for sure, but wouldn't hesitate to use it again as a one off. \n\n\nOne word of caution that I'd like to add is that (on the rare occasions I actually go full makeup) I use Estee Lauder double wear foundation, and these did NOT go well together. I put the moisturiser on first as I usually do (I don't tend to use a dedicated primer) let it sit for a second to soak in a bit, then applied the foundation. Unfortunately, it made the foundation just sit on my skin instead of blending/soaking in nicely and made my face look simultaneously greasy yet dry?? Again I'm not sure how else to describe it, and I have no idea what was going on chemically, but I had to wash it off and redo without moisturiser underneath. \n\n\nOverall: \n\n- As a one off: 8/10 (first couple times were fantastic, I hope that going back to my usual stuff and then using this as a one off now and then replicates this)\n\n- As a daily: 2/10 (seemed to worsen skin texture after ~1.5weeks, better than no moisturiser in my case but only as a last resort, no breakouts though so not the absolute worst) \n\n- For under EL doublewear foundation: 0/10 (don't bother)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "awtd5m",
    "title": "[Product Question]Does ceramide in shampoo help skin or just hair?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/awtd5m/product_questiondoes_ceramide_in_shampoo_help/",
    "score": 8,
    "num_comments": 4,
    "created": "2019-03-03T11:56:23+00:00",
    "body": "In search of shampoo for dry sensitive skin that doesnt cause breakouts...\n\n&#x200B;\n\nCame across this [shampoo](https://www.bedbathandbeyond.com/store/product/garnier-reg-fructis-reg-grow-strong-12-5-fl-oz-shampoo-with-apple-extract-and-ceramide/1020421571?skuId=20421571&&mrkgcl=609&mrkgadid=3301588880&enginename=google&mcid=PS_googlepla_nonbrand_beautywellness_local&product_id=20421571&adtype=pla&product_channel=local&adpos=1o1&creative=270343263248&device=c&matchtype=&network=g&gclid=EAIaIQobChMI8faz5_nk4AIVURx9Ch2B2gSgEAQYASABEgK1q_D_BwE&gclsrc=aw.ds). It claims that it has ceramide. Im wondering if this ceramide helps skin as well?\n\n&#x200B;\n\n========================\n\np.s. I searched the ingredient list but couldnt find ceramide. Anyone see it?\n\nIngredient:\n\nAqua/Water/Eau, Sodium Laureth Sulfate, Cocamidopropyl Betaine, Sodium Lauryl Sulfate, Glycol Distearate, Sodium Chloride, Amodimethicone, PPG-5-Ceteth-20, Parfum/Fragrance, Sodium Benzoate, Pyrus Malus Fruit Extract/Apple Fruit Extract, Salicylic Acid, Guar Hydroxypropyltrimonium Chloride, Trideceth-6, Carbomer, Linalool, Niacinamide, Pyridoxine HCl, Limonene, Hexyl Cinnamal, Citric Acid, Cetrimonium Chloride, Saccharum Officinarum Extract/Sugar Cane Extract/Extrait De Canne a Sucre, Citronellol, 2-Oleamido-1,3-Octadecanediol, Pyrus Malus Water/Apple Fruit Water, Fumaric Acid, Hydroxypropyltrimonium Lemon Protein, Phenoxyethanol, Citrus Limon Peel Extract/Lemon Peel Extract, Leuconostoc/Radish Root Ferment Filtrate, Camellia Sinensis Leaf Extract, Sodium Hydroxide.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "dubberpuck",
        "body": "Looks like it's 2-Oleamido-1,3-Octadecanediol, which is Ceramide 6 II.\n\nReference: [https://www.cir-safety.org/sites/default/files/cerami122014tent.pdf](https://www.cir-safety.org/sites/default/files/cerami122014tent.pdf)",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "QuinnReed",
        "body": "I’d try one without SLS. It’s one of the first ingredients that can dry and irritate.",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7dvkl9",
    "title": "[Acne] My sking has got me feeling depressed, gross, and unwanted.",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7dvkl9/acne_my_sking_has_got_me_feeling_depressed_gross/",
    "score": 7,
    "num_comments": 2,
    "created": "2017-11-18T20:37:54+00:00",
    "body": "Hello you all,\n\nI've been following this sub for years, I've definitely learnt a lot, but this time I'm just exhausted. I don't feel like leaving the house and I cringe every time I look at the mirror I cringe.\n\nI didn't have acne in my teens and I mean it. My skin was magazine-cover clear. At around 18 I started getting some pimples on my chin, but they were mostly isolated and would go away fairly quickly. This is around the time I started using a proper cleanser and moisturizer. Last year I got the worst breakout ever - I have acne all over my face, including my cheeks, which was terrifying because I'd never got a single pimple in my cheeks. I went to the derm and after trying a lot of topical meds (epiduo, clindoxyl, differin, etc) it mostly went down with doxycycline. My cheeks and forehead cleared up, but my chin didn't.\n\nAnd, jesus crist, I hate my chin so much now.\n\nIf you touch it, it feels like that chocolate nut ice pop meme, it's bumpy even where there's no acne, and some bumps are huge. Also, it's all red since the spots are so close together. It's painful and whenever I touch it, it feels oily and gross.\n\nIt makes me anxious, depressed and self conscious. I find myself trying to cover my chin whenever I talk to people, but mostly I just try to avoid interactions because of that. I hate going out during daytime because the sunlight makes it more noticeable. I installed the dimmest lighting possible in my bathroom so I feel less like shit.\n\nMy current routine is:\n\n- Aché's Nutrel Cleanser for Sensitive Skin (aqua, glycerin, butylene glycol, decyl glucoside, lauryl glucoside, acrylates copolymer, xantham gun, ppg-5-ceteth-20, peg-120, methyl glucose dioleate, triethanolamine, ppg-2 methyl ether, phenylpropanol, triethyl citrate, behenyl alcohol, sucrose stearate, disodium edta, isocetyl alcohol, sucrose tristearate, stearic acid, arginine, veratraldehyde, anisaldehyde, coumarin, tripeptide-3)\n\n- Granado Moisturizing Fluid for Sensitive Skin (aqua, cyclomethicone, isononyl isononanoate, glycerin ,cetearyl alcohol, dimethicone, caprylic/capric triglyceride, polysorbate 60, tocopheryl acetate, polyacrylamide, c13 – 14 isoparaffin, dimethicone crosspolymer, astrocaryum murumuru seed butter, phenoxyethanol, butylene glycol, palm alcohol, laureth 7, piptadenia colubrina peel extract, disodium edta, theobroma grandiflorum seed butter, lecithin, propanediol, bht, triethanolamine, cyclotetrasiloxane, phytosteryl canolate, methylisothiazolinone, caprylyl glycol, potassium sorbate, tocopherol)\n\n- Bioré Aqua Rich Watery Essence FPS 50 (2015)\n\nRight now I have at home Pond's Cleansing Oil, Cosrx Low PH Good Morning Gel Cleanser, Cosrx One Step Original Clear Pads and HOLIKA HOLIKA Smooth Egg Skin Peeling Gel, but to be honest I'm scared of trying them and just making it all worse.\n\nI should also mention that I've been examined for PCOS and they found nothing. I'm not on the pill, I don't wear scarves and I've tried multiple brands of tooth paste. I'm at loss.\n\n[Here](https://i.imgur.com/X7m5BIu.png) are some pics. The bottom one was taken under my bathroom lights, so you can see why I installed that... \n\n):",
    "flair_text": "Acne",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Lisavdl",
        "body": "I had the exact same! Overall clear skin but my chin: a warzone. None of my products helped.\n\nThe solution for me: eliminate dairy!! \n\nAcne on the chin is mostly hormonal and dairy is full of hormones (milk comes from a pregnant cow so that makes sense). The hormones in dairy cause a hormonal inbalance which lead to hormonal acne (chin).\n\nI really hope it will help for you (if you haven' already tried it)",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7bldnx",
    "title": "[Product Question] Different versions of La Roche Posay Lipikar Syndet?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7bldnx/product_question_different_versions_of_la_roche/",
    "score": 7,
    "num_comments": 12,
    "created": "2017-11-08T13:44:17+00:00",
    "body": "After hearing wonders about using Syndet as a face cleanser I set out to purchase it, however here in Europe I only find the [AP+ version](http://www.laroche-posay.com/products-treatments/Lipikar/Lipikar-Syndet-AP-p21564.aspx) which has the following ingredient list:  \n\n>AQUA / WATER, GLYCERIN, SODIUM LAURETH SULFATE, PEG-200 HYDROGENATED GLYCERYL PALMATE, COCO-BETAINE, POLYSORBATE 20, PEG-7 GLYCERYL COCOATE, NIACINAMIDE, ACRYLATES COPOLYMER, BUTYROSPERMUM PARKII BUTTER / SHEA BUTTER, CITRIC ACID, COCAMIDE MEA, DISODIUM EDTA\nMANNOSE, POLYQUATERNIUM-11, SODIUM BENZOATE, SODIUM CHLORIDE, SODIUM HYDROXIDE, STYRENE/ACRYLATES, COPOLYMER, VITREOSCILLA FERMENT  \n\nHowever the ['regular' version](http://www.laroche-posay.com.au/products-treatments/Lipikar/Lipikar-Syndet-p6931.aspx) I see everyone use has slightly different ingredients:  \n\n>AQUA / WATER, GLYCERIN, DISODIUM COCOAMPHODIACETATE, \n COCO-BETAINE, PEG-7 GLYCERYL COCOATE, SODIUM CHLORIDE, SODIUM LAURETH SULFATE, GLYCOL DISTEARATE, SODIUM GLYCOLATE, ACRYLATES COPOLYMER, CITRIC ACID, NIACINAMIDE, PEG-55 PROPYLENE GLYCOL OLEATE, PEG-75 SHEA BUTTER GLYCERIDES, POLYQUATERNIUM-7, PPG-5-CETETH-20, PROPYLENE GLYCOL, SODIUM BENZOATE, SODIUM HYDROXIDE  \n\nHas anyone tried both (if it's a case of reformulation) or is it just a different version because of FDA or something?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "cultrevolt",
        "body": "Why not just use one of their facial cleansers? The AP line is formulated for eczema. Their hydrating cleanser is a skincare staple for me; gentle, non-stripping, imparts nice looking skin.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Penguins_Polar_Bears",
        "body": "Just to add, I'm currently using the Lipikar Baum which is AMAZING (20% Shea Butter, 4% niacinamide and other goodies).",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "pethatcat",
        "body": "Oh, you solved the mystery for me! I was thinking to buy LRP cleanser, but it seemed to contain SLS as main ingridient, so I thought it would be too harsh for me. I seriously was wondering what was everyone was raving about, so you solved a mystery for me!\n\nThe second one is based on coconut oil-derived mild surfactant with some SLS, while the first one is SLS-based. So the first version should be much more harsh on the skin.\n\n\nYou know what the second ingridient list reminds me of? Do not judge, please. Bioderma Atoderm shower oil, which I currently use for my face :) it is quite gentle, while taking off any make up( Estee Lauder Doublewear foundation included). I do not use it on my eyes though:\n\nAqua (Water), Glycerin, Peg-7 Glyceryl Cocoate, Sodium Cocamphoacetate, Lauryl Glucoside, Coco-Glucoside, Glyceryl Oleate, Citric Acid, Peg-90 Glyceryl Isostearate, Fragrance (Parfum), Mannitol, Polysorbate 20, Xylitol, Laureth-2, Rhamnose, Niacinamide, Fructooligosaccharides, Tocopherol, Hydrogenated Palm Glycerides Citrate, Lectihin, Ascorbyl Palmitate.\n\n\nGiven my face is very sensitive, prone to drying out and breakouts, I was able to use up a 200 ml bottle of it with no adverse effects. But it does leave your face squeaky clean, so I'm waiting for Hada Labo order to reach me and see of that works even better.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "22vjt5",
    "title": "Mary Kay formula 1 suggestions?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/22vjt5/mary_kay_formula_1_suggestions/",
    "score": 7,
    "num_comments": 1,
    "created": "2014-04-12T20:23:19+00:00",
    "body": "Hey all :) I know not too many of you are into Mary Kay, but I've been in the middle of a routine that somehow works great for me and it involves the brand. \n\n* Cerave moisturizing cleanser\n\n* Mary Kay Hydrating Freshener (formula 1)\n\n* Mary Kay Enriched Moisturizer (formula 1)\n\nEvery week or so, or as needed, I use Stridex in the red box. Anything more often than that and I get too many new bumps... At night and on drier days I pat on dat Nivea Creme.\n\nI've been following this routine for maybe a month, and my skin looks great. Today I have a couple of bumps because I've been falling asleep places without washing my face.. but it's still the best it's ever looked! The kicker is, all the formula 1 stuff apparently has been discontinued! Aaaand I'm running out of product ;_; \n\nSo, SCA...do you have any suggestions for products that are similar to (or better than? :)) the Mary Kay formula 1 stuff? \n\n**EDIT:** Apparently, these are the ingredients for the **moisturizer**: Water, Mineral Oil, Dimethicone, Propylene Glycol Dioctanoate, Stearic Acid, Cetearyl Octanoate, Glycereth-26, Glyceryl Stearate, Sorbitol, Dioctyl Dilinoleate, PEG-100 Stearate, Soluble Animal Collagen, Triethanolamine, Panthenol, Methylparaben, Imidazolidinyl Urea, Carbomer 941, Disodium EDTA\n\nAs for the **freshener**: Water, Butylene Glycol, Diazolidinyl Urea, PPG-5-Ceteth-20, Methylparaben, Panthenol, Allantoin, Disodium EDTA, Propylene Glycol, Menthol, Superoxide Dismutase, Simethicone, Dimethicone Copolyol, Tocopheryl Acetate, Retinyl Palmitate, Aloe Barbadensis Extract, Arnica Montana Extract, Peppermint Extract, Blue 1, Red 4",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2565kc",
    "title": "Thoughts on Peter Thomas Roth \"Un-Wrinkle Peel Pads\"?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2565kc/thoughts_on_peter_thomas_roth_unwrinkle_peel_pads/",
    "score": 8,
    "num_comments": 17,
    "created": "2014-05-09T23:49:52+00:00",
    "body": "Hi all, \n\nThe side bar says: Do NOT use AHAs or BHAs layered with retinoids. There are pH issues that will render both to be not as efficient. Also, this can be very irritating.\n\nHowever, I noticed that the ingredients the peel pads ([peel pads](http://www.peterthomasroth.com/p-64-un-wrinkle-peel-pads.aspx)) include AHA, BHA, *and* retinol. \n\nI'm just wondering if anyone else has used this product. It has done wonders for my skin (in combination with a few other products), so I'm hoping I'm not secretly harming my skin by using it.\n\nRoutine--\nAM:\n\n* Neutrogena Healthy Skin Anti-Wrinkle/Anti-Blemish (cleanser) OR splash with water\n* Bioré UV Bright Face Milk 50+ PA++++\n\nPM\n\n* Neutrogena Cleanser above\n* Peter Thomas Roth Un-Wrinkle Pads (wash off after 3 minutes)\n* Cerave in the tube + Neutrogena Health Skin Anti-Wrinkle Cream (night)\n* Spot treatment of trentonin + clindamyacin\n\nOnce a week: PTH cucumber skin mask\n\nEDIT: The ingredients are (with my concerns in bold):\n\nWATER (AQUA), **GLYCOLIC ACID**, ETHOXYDIGLYCOL, SODIUM HYDROXIDE, **SODIUM LACTATE (LACTIC ACID)**, ROSA CENTIFOLIA FLOWER WATER, HAMAMELIS VIRGINIANA (WITCH HAZEL) WATER, PPG-5-CETETH-20, BUTYLENE GLYCOL, ARGININE, LINOLENIC ACID (VITAMIN F), GAMMA-AMINOBUTYRIC ACID, TOCOPHEROL (VITAMIN E), **RETINOL (VITAMIN A)**, CHOLECALCIFEROL (VITAMIN D), ALANINE, SODIUM ASCORBYL PHOSPHATE (VITAMIN C), ZINGIBER OFFICINALE (GINGER) ROOT EXTRACT, CITRUS MEDICA LIMONUM (LEMON) PEEL EXTRACT, CHAMOMILLA RECUTITA (MATRICARIA) FLOWER EXTRACT, SYMPHYTUM OFFICINALE LEAF EXTRACT, CAMELLIA SINENSIS LEAF EXTRACT, ALOE BARBADENSIS LEAF JUICE, **SALICYLIC ACID**, CAPRYLIC/ CAPRIC TRIGLYCERIDE, PROPYLENE GLYCOL, METHYLPARABEN, PROPYLPARABEN, DIAZOLIDINYL UREA.",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "awnjmq",
    "title": "Why does my hair like this cheap shampoo?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/awnjmq/why_does_my_hair_like_this_cheap_shampoo/",
    "score": 4,
    "num_comments": 11,
    "created": "2019-03-02T23:01:06+00:00",
    "body": "I have Type 1a hair, an oily scalp, and dry ends. For almost my entire life, I've suffered from an itchy scalp that got oily quickly and very thin, but very sleek and shiny hair. Naturally, it was recommended I try washing less and use SLS-free shampoos, so I did for several years with no real improvement.\n\nOn a whim last year, I tried Garnier Whole Blends Honey Treasures shampoo and conditioner, and while my hair isn't perfect, my scalp does NOT ITCH when I use this **AT ALL**. It still gets a little flaky, but the fact that it doesn't make me itchy at all is a goddamn miracle that I have never found before or since, so I continue to use it.\n\nThe thing is, I know it does cause buildup and probably isn't the 'best' shampoo for my hair- I'm wondering if anyone can help me figure out what exactly it is about this shampoo that my hair 'likes' that isn't in most other shampoos? A stretch, but I figured I would ask.\n\nThe ingredients are: AQUA / WATER / EAU, SODIUM LAURETH SULFATE, SODIUM LAURYL SULFATE, COCAMIDE MEA, GLYCOL DISTEARATE,SODIUM CHLORIDE, MEL / HONEY / MIEL,PPG-5-CETETH-20, ARGANIA SPINOSA KERNEL OIL, FUMARIC ACID, ROYAL JELLY, CARBOMERGLYCERIN, DIMETHICONE, ALOE BARBADENSIS / ALOE BARBADENSIS LEAF JUICE, SODIUM HYDROXIDE, ALCOHOL, PROPOLIS EXTRACTGUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, CITRIC ACID, SODIUM BENZOATE, SALICYLIC ACID, CI 19140 / YELLOW 5, CARAMELPARFUM / FRAGRANCE, COUMARIN, LIMONENE, BENZYL ALCOHOL, BENZYL SALICYLATE",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Moose_Cricket",
        "body": "I'm wondering why, if this is working for you, you think it's not the best shampoo for your hair? \n\nSLS free works for many people, but it's not a requirement for healthy hair.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "rvrdtr",
        "body": "You might be noticing a difference from the salicylic acid.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "mcdonaldlargefry",
        "body": "OKAY DUDE SAME.............. but the maple version! I’ve never felt my hair that soft and had it that smooth! I have a lot of breakage because of hard water in my old apartment so in turn there’s a ton of flyaways, but I had almost none of that when I used the maple duo!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "051928374",
        "body": "Maybe your scalp and hair like honey.   Try Shea Moisture Manuka Honey.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1zbm1z",
    "title": "Dr. Lin Acne Cleansing Pads (No Alcohol)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1zbm1z/dr_lin_acne_cleansing_pads_no_alcohol/",
    "score": 5,
    "num_comments": 9,
    "created": "2014-03-02T04:27:48+00:00",
    "body": "I was in CVS trying to find some hydrocolloid bandages, peeked over in the skincare aisle and noticed [these](http://i.imgur.com/Dyz1vS2.jpg) Dr. Lin Cleansing Pads. Looked into the ingredients list and was surprised to find no alcohol at all.\n\n* [Side 1](http://i.imgur.com/zaRphpi)\n* [Side 2 - Ingredients](http://i.imgur.com/UjLDjcC)\n\nHere's a  [CosDNA](http://www.cosdna.com/eng/cosmetic_69e3134700.html) of the ingredients.\n\nActive Ingredients:\n\nSA 2%\n\nInactive Ingredients:\nAloe Barbadensis Leaf Extract (Aloe Extract), Caprylyl Glycol, Citric Acid, Disodium EDTA, Fragrance, Hamamelis Virginiana (Witch Hazel) Extract, Lauryl Glucoside, Menthol, Phenoxyethanol, PPG-5-Ceteth-20, Simethicone, Sodium Borate, Sodium Citrate, Sodium Lauryl Glucose Carboxylate, Water\n\nI'm kind of hesitant to buy/try them because of some of the ingredients. Sodium Borate is Borax, isn't it? That does not seem like something you'd want to put on your face. CosDNA says it's a major irritant and a pH adjustor, making me thing the pH of these may be out of whack. And it seems like Fragrance is really high on the list.\n\nDoes anyone have any experience with these? What are your impressions?\n\nHow about impressions of the ingredients list?\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "BonnieinPA",
        "body": "Yup I bought them and returned them. They stung/irritated my skin. Surprising since the ingredients didn't seem too bad. Just my experience though",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LauraBellz",
        "body": "Your mileage may vary, but most of my family uses a beeswax cream that is made with a small amount of Borax. It's the only thing that works on my cousin's psoriasis, and heals bad patches of my eczema like nobody's business.\n\nHowever, if Stridex is working I see no real reason to switch.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7bxymo",
    "title": "[Product Question] Thoughts on Dermalogica Special Cleansing Gel and Active Moist?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7bxymo/product_question_thoughts_on_dermalogica_special/",
    "score": 6,
    "num_comments": 5,
    "created": "2017-11-10T01:32:38+00:00",
    "body": "My mom is a huge Dermalogica fan and swears up and down by their products. Upon moving out, she gifted me with what can only be called an industrial sized container of the Special Cleansing Gel and about 6 bottles of the Active Moist (she's...excessive, I know! Ack she really...really shouldn't have <3). So now it seems those are going to be my staple skincare products for a while.\n\n\nI was wondering what you all thought of these products and whether or not I should opt for something highly recommended by /SCA and /AB or stick with these items (my skin has zero reaction to them, neither great nor terrible. The cleansing gel foams nicely and from what I have gathered, has a neutral pH. The active moist is very light and leaves my skin slightly tacky once it dries -- I wouldn't say it's very \"plumping\")\n\nThank you for all your advice and information thus far!! <3 I'm excited to take my first plunge into true skin care :) \n\n\nEDIT: Oh! I should mention I have an oily/normal skin with hormonal acne, slightly enlarged pores in my oily areas, and PIE/PIH on my cheeks. I'm still in the beginning stages of figuring out what to do about all of this, haha. Any help would be greatly appreciated. \n\n\nAnd finally, I thought I would include an ingredient list for anyone who's interested:\n\nCleansing Gel: Water/Aqua/Eau, Sodium Laureth Sulfate, Disodium Lauroamphodiacetate, Sodium Trideceth Sulfate, Hexylene Glycol, Hydroxyethylcellulose, Lavandula Angustifolia (Lavender) Extract, Melissa Officinalis Leaf Extract, Quillaja Saponaria Bark Extract, Lavandula Angustifolia (Lavender) Oil, PPG-5-Ceteth-20, Citric Acid, Sodium Chloride, Phenoxyethanol, Methylparaben, Propylparaben.\n\nActive Moist:\nWater/Aqua/Eau, Caprylic/Capric Triglyceride, Methyl Gluceth-20, Pentylene Glycol, Butylene Glycol, Dimethicone, Lactamide MEA, Ethylhexyl Methoxycinnamate, PEG-100 Stearate, Cetearyl Alcohol Stearic Acid, Glyceryl Stearate, Lavandula Angustifolia (Lavender) Extract, Malva Sylvestris (Mallow) Flower/Leaf/Stem Extract, Hedera Helix (Ivy) Leaf/Stem Extract, Cucumis Sativus (Cucumber) Fruit Extract, Sambucus Nigra Flower Extract, Arnica Montana Flower Extract, Parietaria Officinalis Extract, Nasturtium Officinale Flower/Leaf Extract, Arctium Lappa Root Extract, Salvia Officinalis (Sage) Leaf Extract, Citrus Medica Limonum (Lemon) Fruit Extract, Saponaria Officinalis Leaf/Root Extract, Silk Amino Acids, Glycolipids, Sodium Hyaluronate, Leuconostoc/Radish Root Ferment Filtrate, Palmitoyl, Hydroxypropyltrimonium Amylopectin/Glycerin Crosspolymer, Lecithin, Vitis Vinifera (Grape) Seed Extract, Allantoin, Panthenol, Cetyl Alcohol, Polyquaternium-10, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Polysorbate 60, Aminomethyl Propanol, Disodium EDTA, Linalool, Lavandula Hybrida Oil.",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "OuttaMyFaaace",
        "body": "As far as the cleanser goes, it's nothing special.  Same with Active Moist.  The two products I think are Dermalogica's best, would be the Daily Microfoliant (DM) and their Pre-Cleanse (PC).  The DM has done more to smooth out my skin than any acid has EVER done.  As far as the PC goes, I really happen to enjoy the consistency and how long it lasts.  It's also very effective and runs over the face well.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "jolie0216",
        "body": "I have Active Moist and I like it just ok.  My skin type is OILY - just naturally very oily to the point where I've given up on anything having a real mattifying effect.   I just...never found an ideal place for Active Moist in my routine.   It's not moisturizing enough to be my PM moisturizer.   And I don't really need ANY moisturizer in the morning because my vit c serum (Sunday Riley CEO serum) and my sunscreen are plenty moisturizing on their own with me being so oily.   I will give it credit for not breaking me out, so at least it did no harm :)    It's just an ok moisturizer.   I got it at my spa this summer after my facialist recommended it to me - idk why I bought it, I really did NOT need another moisturizer.  I'm such an easy mark lol!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "6e7grl",
    "title": "[Routine Help] Please help me figure out what ingredients I should avoid based on what products made me break out!!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/6e7grl/routine_help_please_help_me_figure_out_what/",
    "score": 2,
    "num_comments": 7,
    "created": "2017-05-30T13:52:16+00:00",
    "body": "I have extremely sensitive skin- about 80% of products break me out. For reference, I have dry, rosacea skin that is also acne-prone and I have very large pores. \n\n\nI'm in the market for a new makeup primer to help with my pores, but I'd like to first figure out the common denominators of any ingredients I am particularly sensitive to, based on what has made me break out in the past. I've checked Acne Mantra and other sites and have a basic understanding, but I'm finding it difficult to see at least some sort of pattern or commonality in what kind of products break me out. Please help!!!\n\n\nPRODUCTS THAT HAVE BROKEN ME OUT:\n\n\n- **Exuviance Sheer Daily Protector SPF 50:** Active Ingredients: Titanium Dioxide 7.0%, Zinc Oxide 6.0%, Inactive Ingredients: Benzoate, Hydrogenated Polydecene, Butyloctyl Salicylate, Gluconolactone, Styrene/Acrylates Copolymer, Alumina, Ammonium Hydroxide, Lactobionic Acid, PEG-9 Polydimethylsiloxyethyl Dimethicone, Phenethyl Benzoate, Nylon-12, Tocopheryl (Vitamin E) Acetate, Epigallocatechin Gallate (EGCG), Polyhydroxystearic Acid, Ethylhexylglycerin, Isohexadecane, Tocopherol, Dimethicone/PEG-10/15 Crosspolymer, Dipropylene Glycol, Disteardimonium Hectorite, Magnesium Sulfate, Methicone, Propylene Carbonate, Sodium Citrate, Triethoxycaprylylsilane, Sodium Bisulfite, Phenoxyethanol, CI 77491 (Iron Oxide Red), CI 77492 (Iron Oxide Yellow), CI 77499 (Iron Oxide Black)\n\n\n- **Neutrogena Age Shield Face Sunblock Lotion SPF 110 with Helioplex:** Active Ingredients: Avobenzone (3%), Homosalate (15%), Octisalate (5%), Octocrylene (4%), Oxybenzone (5%). Other ingredients: Water, Styrene Acrylamide Copolymer, Silica, Beeswax, Cyclopentasiloxane, Ethylhexylglycerin, Glyceryl Stearate, PEG 100, PEG 100 Stearate, Acrylates/Dimethicone Copolymer, Acrylates/C10 30 Alkyl Acrylate Crosspolymer, Chlorphenesin, Triethanolamine, Disodium EDTA, Dipotassium, Dipotassium Glycyrrhizate, BHT, Methylisoptiazolinone, Diethylexyl 2, 6 Naphthalate, Fragrance\n\n\n- **Hourglass Mineral Veil Primer SPF 15:** Active: Zinc Oxide (4.2%), Titanium Dioxide (2.45%), Other: Cyclopentasiloxane, Isododecane, Polysilicone-11, Polymethylsilsesquioxane, Hexyl Laurate, PEG-10 Dimethicone, Polyglyceryl-4 Isosterate, Stearic Acid, Alumina\n\n\n- **Makeup Forever Step 1 Skin Equalizer Hydrating Primer:** Aqua (Water), Dimethicone, Isododecane, Oryza Sativa (Rice) Starch, Butylene Glycol, Polymethylsilsesquioxane, Glycerin, Dimethicone Crosspolymer, Phenoxyethanol, Laureth-4, Ethylhexylglycerin, Hydroxyethylcellulose, Carbomer, Caprylyl Glycol, Parfum (Fragrance), Cichorium Intybus (Chicory) Root Extract, Sodium Hydroxide, Avena Sativa (Oat) Kernel Extract, Sodium Hyaluronate, Benzyl Benzoate, Benzyl Salicylate\n\n\n- **Clinique Moisture Surge Face Mask:** Water / Aqua / Eau, Glycerin, Cetyl Alcohol, Dimethicone, Glyceryl Polymethacrylate, Butyrospermum Parkii (Shea Butter), Cetyl Ethylhexanoate, PEG-8, Glycereth-26, Sucrose, Sorbitan Stearate, PEG-100 Stearate, Trehalose, Mangifera Indica (Mango) Seed Butter, Hypnea Musciformis (Algae) Extract, Gellidiela Acerosa (Algae) Extract, Olea Europaea (Olive) Fruit Extract, Triticum Vulgare (Wheat Bran) Extract, Cladosiphon Okamuranus Extract, Astrocaryum Murumuru Seed Butter, Cetearyl Alcohol, Aloe Barbadensis Leaf Water, PEG-75, Caffeine, Pantethine, Sorbitol, Butylene Glycol, Oryzanol, Bisabolol, Panthenol, Phytosterols, Tocopheryl Acetate, Caprylyl Glycol, Sodium Hyaluronate, Hexylene Glycol, Carbomer, Potassium Hydroxide, Dextrin, Disodium EDTA, Phenoxyethanol, Red 4 (CI 14700), Yellow 5 (CI 19140)\n\n\n- **Dermalogica Skin Hydrating Booster:** Melissa Officinalis Leaf Extract, Sodium Hyaluronate, Hydrolyzed Glycosaminoglycans, Glycerin, Glyceryl Polymethacrylate, Panthenol, Lavandula Angustifolia (Lavender) Oil, Glycolipids, Hydrolyzed Algin, Chlorella Vulgaris Extract, Sea Water, PPG-5-Ceteth-20, Phenoxyethanol, Methylparaben\n\n\n- **MARIO BADESCU Facial Spray With Aloe, Herb and Rosewater:**Aqua (Water, Eau), Propylene Glycol, Aloe Barbadensis Leaf Juice, Rosa Canina Extract, Thymus Vulgaris (Thyme) Leaf Extract, Fucus Vesiculosus Extract, Gardenia Florida Fruit Extract, Caprylyl Glycol, Hexylene Glycol, Polysorbate 20, Parfum (Fragrance), Phenoxyethanol, Sodium Chloride, Citronellol, Geraniol, CI 17200 (Red 33), CI 42090 (Blue 1)\n\n\n- **IT Cosmetics Bye Bye Redness Correcting Creme:** Cyclopentasiloxane, Aqua/Water/Eau, Silica, PEG/PPG-18/18 Dimethicone, Dimethicone/Vinyl Dimethicone Crosspolymer, Isododecane, Propanediol, Dimethicone, Polysilicone-11, Lauryl PEG/PPG-18/18 Methicone, PEG-10 Dimethicone, Magnesium Aluminum Silicate, Sodium Chloride, Polyglyceryl-4 Isostearate, Butylene Glycol, Decyl Glucoside, Disteardimonium Hectorite, Cetyl PEG/PPG-10/1 Dimethicone, Methicone, Hexyl Laurate, Retinyl Palmitate, Ascorbyl Palmitate, Tocopheryl Acetate, Hydrolyzed Collagen, Hydrolyzed Silk, Acetyl Octapeptide-3, Dipeptide Diaminobutyroyl Benzylamide Diacetate, Acetyl Hexapeptide-8, Camellia Sinensis Leaf Extract, Caprylic/Capric Triglyceride, Aloe Barbadensis Leaf Extract, Olea Europaea (Olive) Leaf Extract, Punica Granatum Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Carthamus Tinctorius (Safflower) Seed Oil, Vitis Vinifera (Grape) Seed Extract, Chamomilla Recutita (Matricaria) Flower Extract, Prunus Domestica Seed Oil, Persea Gratissima (Avocado) Oil, Perfluorodecalin, Niacinamide, Glycerin, Carbomer, Polysorbate 20, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Ethylhexyl Palmitate, Silica Dimethyl Silylate, Hyaluronic Acid, Cholesteryl Nonanoate, Cholesteryl Oleyl Carbonate, Cholesteryl Chloride, Colloidal Oatmeal, Magnolia Acuminata Bark Extract, Chrysanthemum Parthenium (Feverfew) Extract, Citrus Grandis (Grapefruit) Peel Oil, Lithospermum Officinale Extract, Agaricus Bisporus (Mushroom) Extract, Glycine Soja (Soybean) Seed Extract, Curcuma Longa (Turmeric) Root Extract, Phenoxyethanol, Ethylhexylglycerin. May Contain: Titanium Dioxide (CI 77891), Iron Oxides (CI 77492, CI 77491, CI 77499).\n\n\nProducts that actually work for me include the Tatcha One Step Camilla Cleansing Oil, Neutrogena Hydro Boost Gel-Cream, BareMinerals Complexion Rescue Tinted Hydrating Gel Cream, and Dr. Jart+ Water Fuse Beauty Balm SPF 25 PA++.\n\n\nThank you in advance for any sort of commonality you can see...I know sometimes there just isn't a pattern to it, but I thought I'd ask you guys just in case.",
    "flair_text": "Routine Help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "screambledeggs",
        "body": "I recommend looking them up at [cosdna](http://www.cosdna.com). It's easier looking at ingredient similarities and differences.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "justkate2",
        "body": "I am by no means an expert, but I noticed that a majority of the skincare and primers included some kind of -cone. (Silicone, Dimethicone, and the like) I don't have particularly sensitive skin, but anything with any kind of silicone makes me break out and messes with my skin texture. I eventually figured out that the inclusion of -cones in my hair conditioner was the cause of my annoying spread of upper face acne. Even when I started switching up my hair care routine, my skin would end up breaking out with a few different new products. Guess how many had silicones? Lol.",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "3buzt7",
    "title": "What is weighing my hair down?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/3buzt7/what_is_weighing_my_hair_down/",
    "score": 5,
    "num_comments": 5,
    "created": "2015-07-02T11:04:47+00:00",
    "body": "I started using L'Oreal EverStrong shampoo and conditioner about a month ago, and it's not working for me. My hair feels weighed down, and even after shampooing I feel like there's residue left over. This is the third purchase in a row that has turned out like this. I'm not new to gentle cleansers, either. When I straighten my hair, I can't run my fingers through it without getting tangled up. I'd love to know what's causing this so that I can avoid those ingredients in the future. What might be causing these issues?  \n\n**My hair:**  \nMy hair is coarse, thick, and wavy, a bit longer than my chin, and overall healthy. My routine is to shampoo & condition my hair once every three to five days. I don't rinse in between. I use [Kenra Curl Defining Creme](http://www.ulta.com/ulta/browse/productDetail.jsp?productId=xlsImpprod6370205) and [Davines Melu Serum](http://us.davines.com/melu-serum/d/1049) to style. (This has been the same for about a year and a half now.)  \n\n**[L'Oreal EverStrong Anti-Breakage Shampoo](http://www.ulta.com/ulta/browse/productDetail.jsp?productId=xlsImpprod6330217)**\n> Aqua/Water/Eau, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Disodium Laureth Sulfosuccinate, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Glycol Distearate, Glycereth-26, Decyl Glucoside, Hydrogenated Coconut Acid, Parfum/ Fragrance, Divinyldimethicone/Dimethicone Copolymer, Ppg-5-ceteth-20, Polyquaternium-7, Peg-55 Propylene Glycol Oleate, Propylene Glycol, Amodimethicone, Polyquaternium-10, Sodium Isethionate, Carbomer, C11-15 Pareth-7, Benzoic Acid, Laureth-9, Glycerin, Benzyl Salicylate, Hexyl Cinnamal, Benzyl Alcohol, Tocopherol, Linalool, Trideceth-12, Limonene, C12-13 Pareth-23, Sodium Benzoate, C12-13 Pareth-3, 2-oleamido-1,3 Octadecanediol, Cetyl Alcohol, Juniperus Communis Fruit Oil,Behentrimonium Methosulfate, Quaternium-33, Methylchloroisothiazolinone, Rosmarinus Officinalis Leaf Oil/Rosemary Leaf Oil, Methylisothiazolinone, Sodium Hydroxide, Citric Acid  \n  \n**[L'Oreal EverStrong Anti-Breakage Conditioner](http://www.ulta.com/ulta/browse/productDetail.jsp?productId=xlsImpprod11601017)**  \n> Behentrimonium Chloride, Cetyl Esters, Isopropyl Palmitate, Quaternium-80, Polysorbate 20, Parfum/Fragrance, Phenoxyethanol, Isopropyl Alcohol, Polyquaternium-37, Paraffinum Liquidum/ Mineral Oil/Huile Minerale, Mentha Piperita (Peppermint) Leaf Extract, Cetyl Alcohol, Tocopherol, Chlorhexidine Dihydrochloride, Limonene, Behentrimonium Methosulfate, Ppg-1 Trideceth-6, Linalool, Rosmarinus Officinalis Oil/ Rosemary Leaf Oil, Quaternium-33, Butylphenyl Methylpropional, Citronellol, 2-oleamido- 1,3-octadecanediol. F.I.L. # D162525/1  \n  \nThank you for any help or pointers you can give me!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "thebexperson",
        "body": "I would say it's probably the ingredients in the shampoo that are causing buildup, specifically the amodimethicone and the divinyldimethicone/dimethicone copolymer. Generally things that contain silicone substances can buildup easily in hair, and will usually require a stronger surfectant to remove.\n\nThe amodimethicone would be water soluble if it had both trideceth-12 AND centrimonium chloride, but it seems to be missing the chloride part of the equation so I would say that is a likely culprit. \n\nAlso the divinyldimethicone/dimethicone copolymer is water insoluble, which needs a stronger surfectant to remove.",
        "score": 5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1v2et3",
    "title": "Anyone tried either of these AHA products?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1v2et3/anyone_tried_either_of_these_aha_products/",
    "score": 6,
    "num_comments": 8,
    "created": "2014-01-13T00:00:44+00:00",
    "body": "I am wondering if anyone can give me any further info or opinions on two different products. I am looking for something containing AHA to help even my skin tone and keep winter flakes away. If you have used any of the following or know anything about their effectiveness please let me know! It seems based on my reading on this subreddit that pH is a big thing when it comes to these types of skin care products being effective but I am unsure where to find info on the pH of these. Thanks in advance for your help!\n\n1. First Aid Beauty Facial Radiance Pads\n\nIngredients: Water/Eau, Aloe Barbadensis Leaf Juice, Glycerin, Cucumis Sativus (Cucumber) Fruit Water, Lactic Acid, Glycolic Acid, Sodium Hydroxide, Leuconostoc/Radish Root Ferment Filtrate, Camellia Sinensis (White Tea) Leaf Extract, Chrysanthemum Parthenium (Feverfew) Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Citrus Medica Limonum (Lemon) Peel Extract, Citrus Nobilis (Mandarin Orange) Fruit Extract, Hyaluronic Acid, Phyllanthus Emblica (Indian Gooseberry) Fruit Extract, Polysorbate 20.\n\n2. Peter Thomas Roth Un-Wrinkle Peel Pads\n\nIngredients: Water, Glycolic Acid, Ethoxydiglycol, Sodium Hydroxide, Sodium Lactate (Lactic Acid), Rosa Centifolia Flower Water, Hamamelis Virginiana (Witch Hazel) Water, Ppg-5-Ceteth-20, Butylene Glycol, Arginine, Linolenic Acid (Vitamin F), Gamma-Aminobutyric Acid, Tocopherol (Vitamin E), Retinol (Vitamin A), Cholecalciferol (Vitamin D), Alanine, Sodium Ascorbyl Phosphate (Vitamin C), Zingiber Officinale (Ginger) Root Extract, Citrus Medica Limonum (Lemon) Peel Extract, Chamomilla Recutita (Matricaria) Flower Extract, Symphytum Officinale Leaf Extract, Camellia SinensisLeaf Extract, Aloe Barbadensis Leaf Juice, Salicylic Acid, Caprylic/Capric,Triglyceride, Propylene Glycol, Methylparaben, Propylparaben, Diazolidinyl Urea.\n\nIf you have any other ideas for similar products I should consider, I am open to other things too. I have already tried the Nip + Fab Glycolic Fix pads which were good, but I am looking for something that will do a little more for me. They were nice though because they are readily available in Canada (I prefer to not have to order online), and inexpensive. The above two products are much pricier but I am okay with spending a little money if it will work.\n\nPS I am sorry if this has been posted before but I searched both products in this subreddit and my search didn't return much info! \n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "8brkwy",
    "title": "I started using the ingredient checker on some of my products, and I noticed that some of my \"sulfate-free\" shampoos include Sodium Lauryl Sulfoacetate (SLSA). I know that it's milder than SLS, but isn't it still a sulfate? How are companies getting away with the sulfate-free label?",
    "url": "https://www.reddit.com/r/curlyhair/comments/8brkwy/i_started_using_the_ingredient_checker_on_some_of/",
    "score": 4,
    "num_comments": 6,
    "created": "2018-04-12T16:39:20+00:00",
    "body": "**First example:** [Kerastase Bain Chromatique Sulfate-Free Shampoo](https://www.kerastase-usa.com/bain-chromatique-sulfate-free/E2271600.html)\n\n**Ingredients:** \n\n> Sodium Cocoyl Isethionate, Disodium Laureth Sulfosuccinate, Sodium Lauryl Sulfoacetate, Sodium Lauroyl Sarcosinate, Glycol Distearate, Cocamidopropyl Betaine, Glycereth-26, Sodium Citrate, Decyl Glucoside, Hydrogenated Coconut Acid, Coco-Betaine, Ppg-5-Ceteth-20, Sodium Benzoate,  Divinyldimethicone/ Dimethicone Copolymer, Sodium Chloride, Polyquaternium-7, Amodimethicone,  Polyquaternium-10, Sodium Isethionate, Peg-55 Propylene Glycol Oleate, Propylene Glycol, Carbomer, Salicylic Acid, C11-15 Pareth-7, Benzoic Acid, Oryza Sativa Bran Oil, Rice Bran Oil, Ethylhexyl Methoxycinnamate, Laureth-9, Glycerin, Limonene, Glycine Soja Oil, Soybean Oil, Tocopherol, Linalool, Trideceth-12, Hexyl Cinnamal, Benzyl Alcohol, Citronellol, C12-13 Pareth-23, C12-13 Pareth-3, Butylene Glycol, Geraniol, Zinc Gluconate, Phenoxyethanol, Sodium Acetate, Isopropyl Alcohol, Sorbic Acid, Bht, Litchi Chinensis Pericarp Extract, Citrus Junos Fruit Extract, Sodium Hydroxide, citricacid, parfum\n\n**Second example:** [Pureology Hydrate Sheer Shampoo Sulfate-Free](https://www.pureology.com/hydrate-sheer-fine-dry-hair-shampoo/PPDPURHydrateSheerSham.html)\n\n**Ingredients:**\n\n> Aqua / Water / Eau, Sodium Cocoyl Isethionate, Disodium Laureth Sulfosuccinate, Cocamidopropyl Betaine, Sodium Lauryl Sulfoacetate, Sodium Lauroyl Sarcosinate, Glycol Distearate, Glycereth-26, Decyl Glucoside, Sodium, Isethionate, Coconut Acid, Parfum / Fragrance, Sodium Chloride, Ppg-5-Ceteth-20, Polyquaternium-7, Peg-55 Propylene Glycol Oleate, Propylene Glycol, Carbomer, Polyquaternium-10, Linalool, Benzoic Acid, Glycerin, Butylene Glycol, Limonene, Geraniol, Hydroxypropyltrimonium Hydrolyzed Wheat Protein, Helianthus Annuus Seed, Extract / Sunflower Seed Extract, Magnesium Nitrate, Sodium Benzoate, Benzophenone-4, Benzyl Alcohol, Glycine Soja Oil / Soybean Oil, Tocopherol, Sodium Acetate, Eucalyptus Globulus Leaf Extract, Ethylchloroisothiazolinone, Phenoxyethanol, Isopropyl Alcohol, Magnesium Chloride, Methylisothiazolinone, Melanin, Pentylene Glycol, Ethylhexylglycerin, Sodium Hydroxide, Citric Acid",
    "flair_text": "discussion",
    "flair_template_id": "8a0f6380-21dd-11e6-9e78-0ead3f7791ed",
    "comments": [
      {
        "author": "lilnubz",
        "body": "I had the same question before I started the CG method when I was using some of L'oreal's \"sulfate free\" products. I'm not really sure either but my guess would be they get to claim it's sulfate free on the technicality that it is a sulfoacetate, not a sulfate, even though they are very similar chemicals. Don't really see how else you could explain that.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "JBinYYC",
        "body": "My understanding - and this goes for the sulfosuccinate as well - is that these are technically not sulfates.  Therefore, they can call it \"sulfate free\".  However they are almost as harsh and damaging to the hair as sulfates.  \n\nPlus the other ingredients - the  Kerastase has silicones, and the Pureology has isopropyl alcohol (very drying).  \n\nSo any way you look at it, these are not CG friendly products.",
        "score": 4,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "2tfnuy",
    "title": "Product review: L'oreal Oleo Therapy Oil Infused Shampoo(sulfate-free)",
    "url": "https://www.reddit.com/r/curlyhair/comments/2tfnuy/product_review_loreal_oleo_therapy_oil_infused/",
    "score": 4,
    "num_comments": 1,
    "created": "2015-01-23T19:40:05+00:00",
    "body": "\n**Basic Info** \n\nL'oreal Oleo Therapy Oil Infused Shampoo is 8.5 fl oz for $6.99 on Ulta's website.  \"Introducing OleoTherapy, our first replenishing system for dull, dry or damaged hair. Formulated with a 6 flower oil blend, our system provides intense nutrition and shine. Hair is restored to smooth and silky.\"\n\n\n**Ingredients** (as listed on product):\n\nAqua/Water/Eau, Sodium Lauroyl Methyl Isethionate, Sodium Cocoamphopropionate, Cocamide Mipa, Sodium Lauroyl Sarcosinate, PEG-40 Hydrogenated Castor Oil, Propylene Glycol, PEG-120 Methyl Glucose Trioleate, Decyl Glucoside, PEG-150 Distearate, PPG-5-Ceteth-20, Parfum/Fragrance, Phenoxyethanol, PEG-55 Propylene Glycol Oleate, Trisodium Ethylendiamine Disuccinate, Sodium Benzoate, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Caprylic/Capric Triglyceride, Hexyl Cinnamal, Methyl Cocoate, Hydroxycitronellal, Sodium Cocoate, Argania Spinosa Oil/Argania Spinosa Kernel Oil, Cocos Nucifera Oil/Coconut Oil, Isoeugenol, Sodium Hydroxide, Chamomilla Recutita Extract/Matricaria Flower Extract, Methylchloroisothiazolinone, Cl 19140/Yellow 5, Methylisothiazolinone, Cl 15510/Orange 4, Gardenia Tahitensis Flower Extract, Rosa Canina Flower Extract, Nelumbium Speciosum Extract/Nelumbium Speciosum Flower Extract, Linum Usitatissimum Flower Extract, Citric Acid.\n\n\n**Price**\n\n$6.99\n\n**Where to Buy**\n\nAlmost Anywhere in the US! I've found it at Ulta, Walgreens, Walmart, Kmart, etc.\n\n\n**How to Use**\n\nJust a normal shampoo- lather and rinse.\n\n**Pros**\n\nIt smells good, it's available in many stores(not hard to find), rinsed out- didn't leave buildup, \n\n**Cons**\n\nDried the everyloving sh*t out of my hair. The first few uses seemed okay, but then my hair just panicked. I haven't used it for two weeks and am still trying to get my hair to recover. :(\n\n**Overall**\n\nJust like all of the other L'oreal shampoos(even the sulfate-free ones) I don't recommend this product.  It took a while before my hair really showed the damage it was doing, but it is seriously parched now. I'm doing deep conditioning treatments, pre-pooing with oils, etc.   I wanted to try it because it's cheaper than my SheaMoisture and more readily available, but it is not worth it.  I did try the conditioner also but wasn't wowed- it felt a bit waxy to me.\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "earthforms",
        "body": "I tried the conditioner from this line. It was sooo waxy (pretty sure one of the first ingredients was actually wax...), and my hair has looked terrible ever since it entered my shower.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "11yrzuq",
    "title": "[Sun Care]How do self-tanning lotions/mousses/drops have different undertones?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/11yrzuq/sun_carehow_do_selftanning_lotionsmoussesdrops/",
    "score": 4,
    "num_comments": 3,
    "created": "2023-03-22T18:30:31+00:00",
    "body": "Some self-tanners advertise having a \"violet\" base. Where does this come from?? I've been obsessing over this but I still don't understand. This is what I know so far:\n\n1. Most self-tanners have DHA, which reacts with the skin keratin or whatever to produce a golden color.\n2. Some self-tanners have erythrulose, which also reacts with the skin to produce a redder color. Supposedly this can change the fake tan color from Yellow-gold to a more bronze. Although it seems like yellow+red = orange (but this is in addition to whatever skin pigment you already have.\n3. WHAT I\"M CONFUSED ABOUT: How do different formulations have different undertones? what ingredients cause these? (i.e. MineTan's \"violet\" or \"ashy\" undertones)\n\n* Is it an ingredient that reacts with the skin, similar to DHA or erythrulose? Which one?\n* Are these brands just advertising that their wash-off guide colors have purple or other undertone?\n   * Often these tanners have dyes listed in the ingredients (e.g. , ci 14700 (red 4), ci 19140 (yellow 5), ci 42090 (blue 1) ), which I understand to be **water soluble**, so they would just wash off with the guide colors, right? So the dyes couldn't provide the long-lasting \"violet\" base. That seems misleading.\n   * are they somehow binding these dyes to the skin so they're not water soluble?\n   * Has anyone used these and noticed their tan get yellower (the undertone fading) in a few days?\n\n&#x200B;\n\n* St. Tropez Self Tan Classic Bronzing Mousse has these ingredients:\n   * aqua (water/eau), dihydroxyacetone, ppg-5-ceteth-20, propylene glycol, glycerin, ethoxydiglycol, coco-glucoside, caramel, phenoxyethanol, parfum (fragrance), sodium metabisulfite, hydrolyzed jojoba esters, hydroxyethylcellulose, tocopherol, linalool, hexyl cinnamal, benzyl salicylate, caprylyl glycol, decylene glycol, citronellol, limonene, geraniol, hydroxycitronellal, alpha-isomethyl ionone, anise alcohol, coumarin, sodium hydroxide, ci 14700 (red 4), ci 19140 (yellow 5), ci 42090 (blue 1).\n* Minetan Violet base foam:\n   * Water (Aqua, Eau), Propylene Glycol, Dihydroxyacetone, PEG-6  Caprylic/Capric Glycerides, Caramel, Dihydroxypropyl PEG-5  Linoleammonium Chloride, PEG-7 Glyceryl Cocoate, Phenoxyethanol,  Caprylyl Glycol, Potassium Sorbate, Hexylene Glycol, Argania Spinosa  (Argan) Kernel Oil, Macadamia Integrifolia (Macadamia) Seed Oil, Cocos  Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Rosa  Canina (Rosehip) Fruit Oil, Vitis Vinifera (Grape) Seed Oil, Persea  Gratissima (Avocado) Oil, Cucumis Sativus (Cucumber) Fruit Extract,  Ascorbic Acid, Tocopheryl Acetate, Blue 1 (CI 42090), Red 40 (CI 16035),  Yellow 6 (CI 15985), Green 5 (CI 61570), Yellow 5 (CI 19140), Red 33  (CI 17200)\n* Minetan Olive base foam (I'll save you time -- the ingredients are The Same as the Violet base until the dyes at the end after Tocopheryl Acetate):\n   * Water (Aqua, Eau), Propylene Glycol, Dihydroxyacetone, PEG-6  Caprylic/Capric Glycerides, Caramel, Dihydroxypropyl PEG-5  Linoleammonium Chloride, PEG-7 Glyceryl Cocoate, Phenoxyethanol,  Caprylyl Glycol, Potassium Sorbate, Hexylene Glycol, Argania Spinosa  (Argan) Kernel Oil, Macadamia Integrifolia (Macadamia) Seed Oil, Cocos  Nucifera (Coconut) Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Rosa  Canina (Rosehip) Fruit Oil, Vitis Vinifera (Grape) Seed Oil, Persea  Gratissima (Avocado) Oil, Cucumis Sativus (Cucumber) Fruit Extract,  Ascorbic Acid, Tocopheryl Acetate, Yellow 5 (CI 19140), Green 5 (CI  61570), Red 40 (CI 16035), Red 33 (CI 17200), Blue 1 (CI 42090), Yellow 6  (CI 15985)\n\nCurious if you can clarify/correct any of the above.",
    "flair_text": "Sun Care",
    "flair_template_id": "ce606fe8-d013-11e3-9fb7-12313b04d1c1",
    "comments": [
      {
        "author": "santigirl",
        "body": "Did you ever find anything out about this? It’s super interesting. I just used the MineTan Olive and I swear it makes me less orange that other tanners, but idk if that’s just me wanting to like the results.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "2x0nzd",
    "title": "How do Kiehl's Amino Acid shampoo/conditioner rank?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/2x0nzd/how_do_kiehls_amino_acid_shampooconditioner_rank/",
    "score": 3,
    "num_comments": 0,
    "created": "2015-02-24T18:57:33+00:00",
    "body": "Looking at a gym with Kiehl's products, and I'm wondering how good their shampoo is and if that should be a selling point haha. Also, would I be able to co-wash with their conditioner?\n\nShampoo Ingredients: Aqua / Water / Eau, Sodium Methyl Cocoyl Taurate, Sodium Coco-Sulfate, Sodium Chloride, Coco-Betaine, Parfum / Fragrance, Ppg-5-Ceteth-20, Sodium Lauroyl Glutamate, Lactic Acid, Propylene Glycol, Peg-55 Propylene Glycol Oleate, Salicylic Acid, Benzoic Acid, Guar Hydroxypropyltrimonium Chloride, Coconut Alcohol, Cocos Nucifera Oil / Coconut Oil, Coumarin, Hydrolyzed Wheat Protein, Wheat Amino Acids, Hydrolyzed Wheat Starch.\n\nConditioner ingredients [here](http://1.bp.blogspot.com/_uxzMSWNg2N8/SqXWM7S2agI/AAAAAAAABVw/JVYYiOe1bQc/s400/sample_kiehls+aa+conditoner+ingredients.JPG)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1l0q8yh",
    "title": "Is the Garnier Pure Active Hydrating Deep Cleanser enough to remove water-resistant SPF? [Product Question]",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1l0q8yh/is_the_garnier_pure_active_hydrating_deep/",
    "score": 3,
    "num_comments": 4,
    "created": "2025-06-01T14:27:26+00:00",
    "body": "I've seen a few reviews say it should be enough (without an oil cleanser, alone). Would really appreciate if anyone who's used it could confirm or deny. More specifically, has anyone successfully removed any of the La Roche Posay UVMUNE sunscreens with it?\n\nFor context, INCI: Aqua/​Water, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-Betaine, Sodium Cocoyl Isethionate, Sodium Chloride, Niacinamide, Glyceryl Stearate, PEG-100 Stearate, PPG-5-Ceteth-20, PEG-55 Propylene Glycol Oleate, Sodium Citrate, Sodium Hyaluronate, Sodium Hydroxide, 2-Oleamido-1,3-Octadecanediol, Kaolin, Coconut Acid, Propylene Glycol, Caprylyl Glycol, Citric Acid, Polyquaternium-53, Acrylates/​C10-30 Alkyl Acrylate Crosspolymer, Sodium Benzoate, Salicylic Acid, Phenoxyethanol, Chlorphenesin\n\nI know it's not hugely expensive, but demoting cleansers to hand soap never feels good. ",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guides [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and if it is, we might remove your post).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ReaLitTea",
        "body": "When I used Uvmune I didn’t need to double cleanse so this cleanser should be ok as long as you feel clean after and there’s no leftover residue",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "9ezsa3",
    "title": "Can someone check these ingredients?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/9ezsa3/can_someone_check_these_ingredients/",
    "score": 3,
    "num_comments": 6,
    "created": "2018-09-11T17:52:31+00:00",
    "body": "I was buying up stock of my favorite shampoo which got discontinued. The more recent formulation worked great for my hair but I got a bottle of the older formulation. Can someone check out these ingredients and tell me if there's anything I should worry about? The big one that pops out to me is the **Amodimethicone**.\n\n\n\n\n>>> Aqua/Water, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Disodium Laureth Sulfosuccinate, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Glycol Distearate, Glycereth-26, Decyl Glucoside, Parfum/Fragrance, PPG-5-Ceteth-20, Amodimethicone, Polyquaternium-7, Methylparaben, Propylene Glycol, PEG-55 Propylene Glycol Oleate, Carbomer, Polyquaternium-10, C11-15 Pareth-7, Glycerin, Trideceth-12, Laureth-9, Limonene, Linalool, Benzyl Salicylate, Benzyl Alcohol, Eugenol, Coumarin, Hydroxypropyltrimonium Hydrolyzed Wheat Protein, Wheat Amino Acids, Methylchloroisothiazolinone, Hydrolyzed Soy Protein, CI 17200/Red 33, Methylisothiazolinone, Hydrolyzed Oats, Hydrolyzed Oat Protein, Tocopheryl Acetate, Ascorbic Acid, Benzophenone-4, Cananga Odorata Oil/Cananga Odorata Flower Oil, Fusanus Spicatus Wood Oil, Lavandula Angustifolia Extract/Lavender Extract, Helianthus Annuus Seed Oil/Sunflower Seed Oil, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Helianthus Annuus Seed Extract/Sunflower Seed Extract, CI 15985/Yellow 6, Camellia Sinensis Extract/Camellia Sinensis Leaf Extract, Melanin, Sodium Hydroxide, Citric Acid",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "succulentivy",
        "body": "Amodimethicone is the only ingredient you have listed in your post but it's just a silicone. Any ingredient that ends in -cone is a silicon, which is used to coat the hair to reduce frizz and tangles. These are found in like 90% of conditioners.\n\n Silicones can create buildup that make the hair heavy and dull but sulfate and other clarifying shampoos take care of that.\n\nPersonally I dont use any silicones in my hair care routine because I'm sensitive to sulfates. \n\nQuick google search gave me this awesome article going into detail of silicones in hair products. https://www.naturallycurly.com/curlreading/curl-products/curlchemist-amodimethicone-and-other-amine-functionalized-silicones",
        "score": 0,
        "is_top_level": true
      },
      {
        "author": "jenbjoyce",
        "body": "Sodium laryl sulfate is a toxin used to create lather in soaps and shampoos. Here’s more about why it’s bad for you: https://follain.com/clean-beauty-101/soap-sls-sodium-lauryl-sulfate/",
        "score": -1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "21e0s5",
    "title": "Confused about purpose of product",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/21e0s5/confused_about_purpose_of_product/",
    "score": 3,
    "num_comments": 2,
    "created": "2014-03-26T04:25:48+00:00",
    "body": "So I have this bottle of toner sitting at home and I can't quite figure out what it does and what skin type this product best works on. My skin is the oily, dry, acne prone combo. (yay.)\nHere's a link for it:\nhttp://www.esteelauder.com/product/684/25954/Product-Catalog/Skincare/By-Category/Cleansers-Toners/Perfectly-Clean/Multi-Action-Toning-LotionRefiner/index.tmpl\n\nand the ingredients list if that helps:\nwater, alcohol denat, glycerin, butylene glycol, hypnea musciformis (algae) extract, gellidielas acerosa (algae) extract, witch hazel, Lady's Thistle extract, bamboo extract, pea extract, gentian root extract, algae extract, rice bran extract, yeast extract, sucrose, trehalose, lactobionic acid, peg-40 hydrogenated castor oil, sorbitol, caffene, dipotassium glycyrrhizate, biosaccharide gum-1, ppg-26-buteth-26, sodium hyaluronate, zinc pca, pentylene glycol, ppg-5-ceteth-20, sodium hydroxide, glucosamine hcl, fragrance, phytic acid, potassium sorbate, disodium edta, phenoxyethanol\n\nThanks a lot!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ISwearImAGirl",
        "body": "It really doesn't do anything except dry out your skin",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "freethink17",
        "body": "The alcohol and castor oil suggest a drying effect.. rice bran can help with PIH.. but I wouldn't use it",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "354tnn",
    "title": "Tresemme Flawless Curls Mousse and l'Oreal Curling Spritz?",
    "url": "https://www.reddit.com/r/curlyhair/comments/354tnn/tresemme_flawless_curls_mousse_and_loreal_curling/",
    "score": 3,
    "num_comments": 2,
    "created": "2015-05-07T02:49:58+00:00",
    "body": "So I'm new and trying to find a good mousse and/or gel to use in my routine.  After looking around the house turns out I had bought some products a few years ago that I never tried.  They don't seem to have silicones but wondering if you guys have given them a try or if they are worth keeping around.  I've listed the products and ingredients below.\n\nTresemme Flawless Curls mousse:\nWater (Aqua, Eau), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polysorbate 20, Polyquaternium-4, Pvp, Ppg-12ppg-50 Lanolin, Olealkonium Chloride, Polyquaternium-7, Ppg-9 Diethlymonium Chloride, Sodium Benzoate, Cyclopentasiloxane, Propylene Glycol, Sorbitol, Glycerin, Cyclohexasiloxane, Cocamidopropyl Betaine, Gelatin/Keratin Amino Acids/Lysine Hydroxy- Propyltrimonium Chloride, Fragrance (Parfum), Hexyl Cinnamal, Benzyl Benzoate, Limonene, Butylphenyl Methylpropional, Linalool, Citronellol, Geraniol, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Alpha-Isomethyl Ionone. Water (Aqua), Isobutane, Hydrofluorocarbon 152a, Vp/Va Copolymer, Polyquaternium-11, Propane, Polyquaternium-4, Pvp, Polyquaternium-7, Cyclopentasiloxane, Cyclohexasiloxane, Polysorbate 20, Olealkonium Chloride, Cocamidopropyl Betaine, Peg-12-Peg-50 Lanolin, Ppg-9 Diethylmonium Chloride, Glycerin, Gelatin/Keratin Amino Acids/Lysine Hydroxypropyltrimonium Chloride, Propylene Glycol, Sorbitol, Sodium Benzoate, Fragrance (Parfum).\n\nL'oreal Studio Silk & Gloss Curling Spritz: \naqua, glycerin, propylene glycol, sodium polystyrene sulfonate, PPG-5-ceteth-20, PPG-5-ceteth-10 phosphate, phenoxyethanol,caprylyl glycol, triethanolamine, hexyl cinnamal, linalool, limonene, butylphenyl, methylpropional, citronellol, amyl cinnamal, hydrolyzed silk, parfum",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "ImaCheeseMonkey",
        "body": "Silicones in the mousse are: Cyclopentasiloxane, Cyclohexasiloxane, Cyclopentasiloxane, Cyclohexasiloxane \n\nin the Curling Spritz I don't see any 'cones,  but there is a lot of glycerin which could lead to frizz in humid areas.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MuddledMeggie",
        "body": "Tresemme Flawless Curls Mousse is the only thing I have ever found at the drug store that keeps my curls how I like them. It keeps them well controlled and minimizes frizz. It can leave the hair a bit crunchy depending on how much you use, but I would definitely recommend it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "iludd2",
    "title": "LA ROCHE-POSAY CICAPLAST LAVANT B5 GEL - is it OK to use as cleanser everyday?",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/iludd2/la_rocheposay_cicaplast_lavant_b5_gel_is_it_ok_to/",
    "score": 3,
    "num_comments": 4,
    "created": "2020-09-03T14:25:05+00:00",
    "body": "This cleanser is formulated with zinc, copper and manganese. I was wondering if it is safe for everyday use. I read somewhere it's not recommended to use products with copper peptides everyday, only for broken or injured skin. But this is a wash off product, so maybe it wouldn't be so bad.  \n\nAny thoughts? Has anyone tried it? Here are the ingredients:\n\nAqua (Water), Sodium Laureth Sulfate, Panthenol, Peg-200 Hydrogenated Glyceryl Palmate, Glycerin, Coco-Betaine, Sodium Chloride, Polysorbate 20, Peg-7 Glyceryl Cocoate, Citric Acid, Cocamide Mea, Copper Gluconate, Manganese Gluconate, Peg-55 Propylene Glycol Oleate, Peg-60 Hydrogenated Castor Oil, Polyquaternium-11, Ppg-5-Ceteth-20, Propylene Glycol, Prunus Amygdalus Dulcis Oil/Sweet Almond Oil, Sodium Benzoate, Sodium Hydroxide, Zinc Gluconate.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chattykitten97",
        "body": "I am currentlu using it as a face wash. I really like it! It foams gently and cleanses/rinses very well. It leaves my skin comfortable. However if you have dry skin I think you should look for something a bit more nourishing as this is not the most hydrating cleanser.\nIt does sting my eyes a bit.\nThis is a good choice for normal to oily &acne prone skin in my opinion (+it is super affordable and has a convenient pump! )\n\nHope this helps you out!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "ina_raw",
        "body": "Believe me, I have the equivalent of this one range in the Avène brand (which is Cicalfate) and I use the cream which has copper and zinc and it's made for hurt skin, surgical procedure recovery... i just use it in industrial amounts when I have any skin wound or irritation\n\nSo yeah I Guess you can use it on your skin as it's meant to be anti bacterial and it doesn't have any pharmaceutically active ingredient",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "witic",
        "body": "Have you tried using this on the scalp?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "36o8tr",
    "title": "Need help with routine (while working around a soy/vitamin e/almond oil allergy)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/36o8tr/need_help_with_routine_while_working_around_a/",
    "score": 2,
    "num_comments": 8,
    "created": "2015-05-20T20:50:14+00:00",
    "body": "So, I've been actively trying to clear my skin for the past 9 months, and I recently got really, really close. However, after reading through the sidebar a hundred times and searching all of the previous posts, I'm concerned that my routine is damaging to my skin.\n\n*Please note that 6-7ish months ago I had a very severe allergic reaction on my face (NOT fun) and I believe, after much trial and error, that it was caused by my skin hating anything soy derived. A lot of the HG items on skincareaddiciton I've tried had to be ruled out because of it.*\n\n**Routine from Feb-May**\n1. Remove make-up and massage skin with 100% Mineral Oil (the kind you get at Bed, Bath, and Beyond that's labeled \"Snow River\" Oil)\n\n2. Wash with a dime-sized amount of Alaffia Authentic African Black Soap (Unscented). *Ingredients: Ocimum canum (African Mint) Aqueous Extract, Saponified Butyrospermum parkii (Shea) Butter and Elaeis guineensis (Palm Kernel) Oil, Lauryl Glucoside*\n\n3. Pat face dry or air dry\n\n4. Swipe on Noxzema Triple Clean Anti-Blemish Pads. *Ingredients: Alcohol denat, water(aqua EAU), PEG-4, PPG-11, stearyl ether, fragrance (parfum), eugenol, linalool, limonene, geraniol, benzyl benaoate, disodium EDTA, cinnamal, citral*\n\nNo moisturizer. No sunscreen. I would love to use them (I've got several in my bathroom) but they all break me out terribly because of the soy content. I'm trying to get the cleaning routine down (nice and slow - yay) before I can finish out my beauty regimen.\n\n10 days ago, I ran out of my Noxzema pads and decided to give the Stridex Red Box a try. I thought that hey, I've already been using a 2% salicylic acid, another should work just fine. Besides, the Noxzema burns my skin a little when I use it (though that goes away quickly). Here are the inactive ingredients for Stridex: Ammonium lauryl sulfate, ammonium xylenesulfonate, citric acid, DMDM hydantoin, fragrance, menthol, PPG-5-ceteth-20, purified water, simethicone, sodium borate, tetrasodium EDTA\n\nNow go figure, I'm breaking out. I don't think it's purging because I rarely break out on my forehead, and now I have 3 new pimples in my hairline.\n\nFor reference, here is my photo journey since February: http://imgur.com/a/rGMfa\n\n**NEED HELP**\n\n1. Is the (probably terribly high) pH of the black soap doing irreparable damage? Or is the BHA afterwards helping with the pH of my skin?\n\n2. If the answer to #1 is \"Yes, get rid of that soap crap\", then what do I do for a cleanser? OCM doesn't work well for me without a cleanser afterwards (tried other oils, and I must stick to Mineral Oil). I've considered trying washing with oatmeal or honey...both of which I used during my allergy attack.\n\n3. Noxzema vs Stridex? The first burns when I use it, but my face stays clear. The second is gentle, but causes me to break out. Or do I ditch both for something else? (Keep in mind that pesky soy issue)\n\n========\n\nFor reference, I can't (usually) use products with the following ingredients because they are/usually are derived from soy: glycerin, glycols, xanthan gum, tocopherol acetate/vitamin e, lecithin, argan oil, and (duh) anything with the word \"soy\" in it",
    "flair_text": "Routine Help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Firefox7275",
        "body": "- Yes alkaline stuff is horrible for the acidic skin barrier. Are you using an emulsifier (polysorbate) in your oil and a (clean) cloth such as muslin? If so you should be squeaky clean without actually being squeaky (tight)\n\n- What BHA? I see drying alcohol and a pile of fragrance ingredients?\n\nThe problem you may encounter is between the alkaline soap and the massive amount of alcohol in the pads is that your acid mantle/ beneficial flora, and probably some of the horny layer are likely to be badly damaged. Basically the entire skin barrier may well be decimated. You may well have a rebound breakout as the bad guys repopulate faster than the good guys. :/\n\nNo idea what you can use without glycerin, other than DIY. Never heard anyone say they avoid that with a soy allergy. You can purchase water soluble salicylic acid from Skin Essential Actives, presumably other ingredients suppliers.\n\nIt will be a cold day in hell before I advocate a product with ALS and fragrance. I didn't know Stridex had ALS so that is two TILs for me today.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mopers",
        "body": "I'm also allergic to soy, and I've discovered I'm unable to use other things as well, including mineral oil and Vaseline, at least one preservative, and possibly shea butter. I've started trying to make my own moisturizer based on https://www.reddit.com/r/DIYBeauty/comments/1v3y85/im_tired_of_not_being_able_to_find_moisturizers/ and http://sheabutterguide.com/shea-butter-recipes/ . That's how I further confirmed that shea butter doesn't work for me, but it was super easy to make and I'm planning on looking for another butter to try.\n\nI have not found a cleanser I can use after OCM, so I wipe off with cotton wipes from CVS then rinse with water. I have found that I can break out from an oil that doesn't work for me as well as from not moisturizing enough (which is why I'm trying to figure out a homemade moisturizer). I have given up for the moment on looking for a cleanser for after OCM and, I think I have a new exfoliant on order, but until I get a new moisturizer working for me, I can't start a new exfoliant.\n\nI don't have much advice for you beyond the obvious, probably going back to the Noxzema if you liked the clear skin despite the burning. However, I recommend finding a moisturizer, though I understand it may be difficult. Thanks for the info on glycerin and glycols. I knew they were made from vegetables, but I had assumed they were usually corn and coconut.\n\nWhat do you use for shampoo and conditioner? I figured out recently that I was allergic to either my shampoo (Clean Kids Naturally orange) or lotion (Everyday Shea vanilla), and the shampoo has lecithin :(",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ashdar",
        "body": "I did a quick google search and found this company called Luminance Skincare. They say their formulas are completely soy free. It may be worth checking out!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1kidh1j",
    "title": "[Routine help] Is my skincare routine too acid?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1kidh1j/routine_help_is_my_skincare_routine_too_acid/",
    "score": 2,
    "num_comments": 7,
    "created": "2025-05-09T08:26:46+00:00",
    "body": "Hellooo! ☺️ Skincare newbie here!\n\nSoo hmm I bought The Ordinary aloe 2% + nag 2% and The Ordinary Niacinamide 10% + Zinc 1%. I haven't used them yet 'cause I'm waiting to get a good cleanser. I think a foundt a good one, but I'm afraid that it's too acid givent that the two The Ordinary products already contain acids.\n\nHere are the ingredients of the cleanser :\nAqua / Water, Glycerin, Sodium Methyl Cocoyl Taurate, Coco-betaine, Sodium Cocoyl Isethionate, Sodium Chloride, Niacinamide, Glyceryl Stearate, Peg-100 Stearate, Ppg-5-ceteth-20, Peg-55 Propylene Glycol Oleate, Sodium Citrate, Sodium Hyaluronate, Sodium Hydroxide, 2-oleamido-1, 3-octadecanediol, Kaolin, Coconut Acid, Propylene Glycol, Caprylyl Glycol, Citric Acid, Polyquaternium-53, Acrylates/c10-30 Alkyl Acrylate Crosspolymer, Sodium Benzoate, Salicylic Acid, Phenoxyethanol, Chlorphensin\n\nThe mix of these three products aren't too acid? 🤔",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "dubberpuck",
        "body": "They shouldn't be direct acid products, so it's fine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guides [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and if it is, we might remove your post).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "6iat0e",
    "title": "is Redken Color Extend magnetics shampoo really sulfate free?",
    "url": "https://www.reddit.com/r/curlyhair/comments/6iat0e/is_redken_color_extend_magnetics_shampoo_really/",
    "score": 2,
    "num_comments": 7,
    "created": "2017-06-20T01:10:57+00:00",
    "body": "     I've bee using Redken Color Extend magnetics shampoo for a few months now and I like it a lot. I got it from a hair salon I went to when it was recommended to keep my color from fading since it is \"sulfate free\" (said the salon and front of the bottle). \n     Now i haven't been doing the CG method but i've decided to try and my past routine was this shampoo, tresemee curls conditioner (had silicones) and bumble and bumble curl cream (had silicones) but now I am trying to use this shampoo with shea moisture curl and shine conditioner and kinky curly knot today curling custard. \n     After doing some research I realized the ingredients do seems to contain sulfates according to this sub. The Ingredients are -\n\nAqua/Water/Eau, Coco-Betaine, Disodium Laureth Sulfosuccinate, Sodium Cocoyl Isethionate, Sodium Lauryl Sulfoacetate, Sodium Lauroyl Sarcosinate, Glycol Distearate, Sodium Chloride, Decyl Glucoside, Polyquaternium-10, Parfum/Fragrance, Amodimethicone, Ppg-5-Ceteth-20, Hydrogenated Coconut Acid, Propylene Glycol, Peg-55 Propylene Glycol Oleate, Carbomer, Acrylates/Beheneth-25 Methacrylate Copolymer, Disodium Edta, Sodium Isethionate, Benzoic Acid, Sodium Cocoyl Amino Acids, Tocopherol, Trideceth-6, Benzyl Salicylate, Potassium Dimethicone Peg-7 Panthenyl Phosphate, Limonene, Linalool, Magnesium Nitrate, Sodium Sarcosinate, Benzyl Alcohol, Hydroxycitronellal, Sodium Acetate, Alpha-Isomethyl Ionone, Arginine, Serine, Hydrolyzed Soy Protein, Cetrimonium Chlorideglutamic Acid, Benzophenone-4, Sodium Benzoate, Butylene Glycol, Isopropyl Alcohol, Hydrolyzed Vegetable Protein Pg-Propyl Silanetriol, Methylchloroisothiazolinone, Magnesium Chloride, Methylisothiazolinone, Glycerin, Phenoxyethanol, Tetrasodium Edta, Bambusa Vulgaris Sap Extract, Camellia Sinensis Leaf Extract, Potassium Sorbate, Sorbic Acid, Sodium Hydroxide, Citric Acid (D184886/1).\n\nThe third and few after it ingredients are not CG friendly right? Are they also not safe for color treated hair? Thank you for any help! ",
    "flair_text": "help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "BrutallyHonestAlways",
        "body": "You are correct, technically it is sulfate free in the sense of SLS, ALS, SLES? But its got pure salt pretty high up, and 4+ surfactants. So it can be drying, but if you like it, and it works for you, keep at it.\n\nPersonally, I wouldn't because it also has silicones, which I don't mind in my conditioners and stylers, but I mind them in my shampoos.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "nlwmul",
    "title": "[product question] I can’t seem to find a substitute for the Neutrogena Acne Stress Control Triple Action Toner (BHA), please help",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/nlwmul/product_question_i_cant_seem_to_find_a_substitute/",
    "score": 2,
    "num_comments": 3,
    "created": "2021-05-27T01:29:32+00:00",
    "body": "I’ve been on this sub for years through other accounts and I could never find something that works for me BHA-wise as much as this “toner” that is basically an astringent.\n\nI am not opposed to alcohol denat (since I saw Dr Dray’s opinion on it and basically now I understand that it helps the product’s formula and sometimes for the product to penetrate better). I even have alcohol in my sunscreen and it’s just not an issue for me.\n\n**I am leaning towards “if it works then use it”, but I am just trying to understand why**.\n\nThese are the products I have tried so far and didn’t work well for me: \n\n- Stridex in the red box \n- Stridex green box \n- Stridex face and body \n- Paula’s choice 2% perfecting BHA \n- COSRX AHA BHA toner \n- COSRX blackhead power liquid \n\nStridex felt more drying than Neutrogena (somehow) and frankly just irritated my skin, paula’s choice perfecting BHA is one of my worst purchases (terrible texture and dried out my skin), COSRX didn’t even tickle my skin and I’m sure it broke me out (beyond purge).\n\nFor years now I’ve been hoping that neutrogena would release a fragrance free, alcohol free version of this toner (the alcohol content is strong) but I guess it’s not gonna happen. \n\nBut what is it about this toner that my skin loves so much? What ingredient could it possibly have that all of those other products fail? \n\nMy skin is combo and on tret so it’s more on the drying side, my skin does NOT feel irritated or dried out from this product. It looks smooth and healthy specially now that I reintroduced with a gentle and hydrating routine. \n\nLooking for some insight on this.\n\nThis is the ingredients list: \n\nWater, Alcohol Denat., Butylene Glycol, Ppg-5-Ceteth-20, C12-15 Alkyl Lactate, Fragrance, Sodium Citrate, Cocamidopropyl Pg-Dimonium Chloride Phosphate, Peg/Ppg-20/6 Dimethicone, Sodium Hydroxide, Benzalkonium Chloride, Cetyl Lactate, Sodium Benzotriazolyl Butylphenol Sulfonate, Disodium Edta, Propylene Glycol, Cucumis Sativus (Cucumber) Fruit Extract, Camellia Oleifera Leaf Extract, Blue 1, Green 5, Yellow 5 \n\nAnd plus 2% salicylic acid.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Lurking_Scientist",
        "body": "Why do you need a substitute? If it’s working for you just keep using it",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "finehair",
    "post_id": "1i43aw8",
    "title": "Any low/no fragrance alternatives for TIGI's Queen For a Day Thickening Spray? ",
    "url": "https://www.reddit.com/r/finehair/comments/1i43aw8/any_lowno_fragrance_alternatives_for_tigis_queen/",
    "score": 2,
    "num_comments": 0,
    "created": "2025-01-18T08:37:57+00:00",
    "body": "Works great but the fragrance is a bit much. Never really seen people suggest 'dupes', only rave about it. Is there really nothing that performs similarly?\n\nIngredients for context: \n\n>Water (Aqua/eau), Dimethyl Ether, Pvp, Vp/va Copolymer, Phenoxyethanol, Peg-45 Palm Kernel Glycerides, Ppg-5-ceteth-20, Caprylyl Glycol, Carbomer, Triethanolamine, Fragrance (Parfum), Polysorbate 20, Polyquaternium-7, Tetrasodium Edta, Benzophenone-4, Isopropyl Alcohol, Laurtrimonium Chloride, Sodium Benzoate, Amyl Cinnamal, Benzyl Alcohol, Benzyl Cinnamate, Citral, Geraniol, Hexyl Cinnamal, Limonene, Linalool",
    "flair_text": "Product Help",
    "flair_template_id": "bb8d5d74-589c-11ee-b690-1221113bcd5f",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "BestBeautyDupes",
    "post_id": "1ilmtlj",
    "title": "Dupe request - Murad Pore Extractor Pomegranate Mask",
    "url": "https://www.reddit.com/r/BestBeautyDupes/comments/1ilmtlj/dupe_request_murad_pore_extractor_pomegranate_mask/",
    "score": 1,
    "num_comments": 1,
    "created": "2025-02-09T19:25:52+00:00",
    "body": "I have had this Murad Pore Extractor Pomegranate mask for years. I have been saving it for when my skin gets really bad, but there is barely any left. It is the best product to remove the sebaceous filament on my chin and makes my skin feel incredible. Sadly, it has been discontinued.\n\nAny ideas for a dupe? (Thanks in advance!)\n\n  \nI have found this list of ingredients: \n\n[Water (Aqua)](https://incidecoder.com/ingredients/water), [Alcohol Denat](https://incidecoder.com/ingredients/alcohol-denat), [Glycolic Acid](https://incidecoder.com/ingredients/glycolic-acid), [Butylene Glycol](https://incidecoder.com/ingredients/butylene-glycol), [Glycerin](https://incidecoder.com/ingredients/glycerin), [Methyl Gluceth-10](https://incidecoder.com/ingredients/methyl-gluceth-10), [Aloe Barbadensis Leaf Juice](https://incidecoder.com/ingredients/aloe-barbadensis-leaf-juice), [Salicylic Acid](https://incidecoder.com/ingredients/salicylic-acid),[Punica Granatum Extract](https://incidecoder.com/ingredients/punica-granatum-extract), [Rice Amino Acids](https://incidecoder.com/ingredients/rice-amino-acids), [Zinc Aspartate](https://incidecoder.com/ingredients/zinc-aspartate), [Chitosan Ascorbate](https://incidecoder.com/ingredients/chitosan-ascorbate), [Sodium Hyaluronate](https://incidecoder.com/ingredients/sodium-hyaluronate), [Lecithin](https://incidecoder.com/ingredients/lecithin), [Tocopherol](https://incidecoder.com/ingredients/tocopherol), [Magnesium Ascorbyl Phosphate](https://incidecoder.com/ingredients/magnesium-ascorbyl-phosphate), [Dipotassium Glycyrrhizate](https://incidecoder.com/ingredients/dipotassium-glycyrrhizate), [Palmitoyl Hydroxypropyltrimonium Amylopectin/​Glycerin Crosspolymer](https://incidecoder.com/ingredients/palmitoyl-hydroxypropyltrimonium-amylopectin-glycerin-crosspolymer), [Vitis Vinifera (Grape) Seed Extract](https://incidecoder.com/ingredients/vitis-vinifera-seed-extract), [Oenothera Biennis (Evening Primrose) Oil](https://incidecoder.com/ingredients/oenothera-biennis-oil), [Ascorbyl Palmitate](https://incidecoder.com/ingredients/ascorbyl-palmitate), [Zinc Acetate](https://incidecoder.com/ingredients/zinc-acetate), [Linoleic Acid](https://incidecoder.com/ingredients/linoleic-acid), [Retinyl Palmitate](https://incidecoder.com/ingredients/retinyl-palmitate), [Sodium PCA](https://incidecoder.com/ingredients/sodium-pca), [Hydroxyethylcellulose](https://incidecoder.com/ingredients/hydroxyethylcellulose), [PPG-5-Ceteth-20](https://incidecoder.com/ingredients/ppg-5-ceteth-20), [Tetrasodium EDTA](https://incidecoder.com/ingredients/tetrasodium-edta),[Sodium Hydroxide](https://incidecoder.com/ingredients/sodium-hydroxide), [Phenoxyethanol](https://incidecoder.com/ingredients/phenoxyethanol), [Benzyl Salicylate](https://incidecoder.com/ingredients/benzyl-salicylate), [Linalool](https://incidecoder.com/ingredients/linalool),[Hexyl Cinnamal](https://incidecoder.com/ingredients/hexyl-cinnamal), [Limonene](https://incidecoder.com/ingredients/limonene), [Fragrance (Parfum)](https://incidecoder.com/ingredients/parfum)\n\nSource: [https://incidecoder.com/products/dr-murad-pore-extractor-pomegranate-mask-50gr](https://incidecoder.com/products/dr-murad-pore-extractor-pomegranate-mask-50gr)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Want more beauty dupe alerts in your inbox every week? You can [subscribe here to receive our weekly newsletter](https://beautyalerts.beehiiv.com/). I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestBeautyDupes) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "16dtah1",
    "title": "Nanoplasty aftercare question!",
    "url": "https://www.reddit.com/r/Hair/comments/16dtah1/nanoplasty_aftercare_question/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-09-09T02:03:33+00:00",
    "body": "Help!!! I got a salon nanoplasty a few days ago and have 1L of redken “acidic bonding concentrate” shampoo at home and I am trying to work out if this will be a bad option for my hair! \n\nMy natural hair prior to nanoplasty was colour treated, shoulder length curly/frizzy “hagrid-esque” hair, with hair like this the longer the nanoplasty lasts the better so any advice from people is appreciated\n\n the shampoo ingredients are below \n\nAQUA / WATER / EAU DECYL GLUCOSIDE SODIUM COCOYL ISETHIONATE COCAMIDOPROPYL BETAINE CITRIC ACID SODIUM HYDROXIDE PANTHENOL GLYCERIN DIMETHICONE PEG-150 DISTEARATE PPG-5-CETETH-20 SODIUM BENZOATE SODIUM CHLORIDE PEG-55 PROPYLENE GLYCOL OLEATE PROPYLENE GLYCOL CARBOMER PARFUM / FRAGRANCE COCO-CAPRYLATE/CAPRATE POLYQUATERNIUM-67 SALICYLIC ACID AMODIMETHICONE SODIUM PHYTATE GLYCOL DISTEARATE COCO-BETAINE ACRYLATES/BEHENETH-25 METHACRYLATE COPOLYMER LIMONENE TRIDECETH-6\n\nPlease let me know if this will b ok followed by a treatment or if I shud try something else(if so suggestions please!)\n\nTIA",
    "flair_text": "Help",
    "flair_template_id": "1fb23224-19ed-11e8-8598-0e09b1f8bce8",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "413web",
    "title": "[Product Question] Is it ''safe'' to use Stridex and Effaclar Duo+ together? [Ingredients list inside]",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/413web/product_question_is_it_safe_to_use_stridex_and/",
    "score": 1,
    "num_comments": 5,
    "created": "2016-01-15T16:51:31+00:00",
    "body": "EFFACLAR: \n\nAQUA / WATER,\nGLYCERIN,\nDIMETHICONE,\nISOCETYL STEARATE,\nNIACINAMIDE,\nISOPROPYL LAUROYL SARCOSINATE,\nSILICA,\nAMMONIUM POLYACRYLDIMETHYLTAURAMIDE / AMMONIUM POLYACRYLOYLDIMETHYL TAURATE,\nMETHYL METHACRYLATE CROSSPOLYMER,\nPOTASSIUM CETYL PHOSPHATE,\nZINC PCA,\nGLYCERYL STEARATE SE,\n\n\nSTRIDEX: \n\n\nMaximum Pads\n\nActive Ingredient:                                         \nSalicylic acid 2.0% (w/w)                               \n\nInactive Ingredients:\nAmmonium lauryl sulfate, ammonium xylenesulfonate, citric acid, DMDM hydantoin, fragrance, menthol, PPG-5-Ceteth-20, purified water, simethicone, sodium borate, tetrasodium EDTA.\n\n\nAre these products okay to use in the same routine?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "bebemona",
        "body": "definately, however both can be very drying, which can lead to more acne. I'd go with PC BHA instead of Stridex & also use Effaclar Duo as spot treatment only, if you want to use it all over the face then try for a lower percentage of BP :)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "1dolr8i",
    "title": "Certain shampoo making me shed more? ",
    "url": "https://www.reddit.com/r/Haircare/comments/1dolr8i/certain_shampoo_making_me_shed_more/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-06-26T00:47:36+00:00",
    "body": "For context, my two favorite hair care lines are gisou and Garnier honey treasures. Completely different ends of the price spectrum, but I find them to both work incredibly well on my wavy, fine hair. I've been using the gisou shampoo and conditioner for over a year now, and it makes my hair so healthy. I have an issue however-I've noticed that whenever I use it, I shed WAY more than usual. Recently I switched back to Garnier just to try it, and I immediately stopped shedding like that when washing. Why might this be? I'd assume it has something to do with the Garnier having sulfates and therefore effectively cleansing my scalp, but I honestly don't know. Here's the ingredients for both:\nGisou: \nAqua (Water/Eau), Sodium Lauroyl Methyl Isethionate, Cocamidopropyl Betaine, Glyceryl Laurate, PEG-40 Hydrogenated Castor Oil,Glycerin, Parfum (Fragrance), Mel (Honey/Miel)*,Hydrolyzed Pea Protein, Hydrolyzed Vegetable Protein, Argania Spinosa Kernel Oil, Arginine,Creatine, Hydrolyzed Adansonia Digitata Seed Extract, Helianthus Annuus Hybrid (Sunflower Seed) Oil, Sodium Lauroyl Sarcosinate, Decyl Glucoside, Citric Acid, Sodium Benzoate, Cetearyl Alcohol, Sodium Chloride, Guar\nHydroxypropyltrimonium Chloride,Polyquaternium-10, Xanthan Gum,Hydroxypropyltrimonium Inulin, Caramel,Tocopheryl Acetate, Potassium Sorbate, Benzyl Alcohol, Panthenol, CI 14700 (Red 4), CI 19140(Yellow 5), Coumarin**, Hexyl Cinnamal**,Limonene**, Linalool*\n\nGarnier: AQUA / WATER/EAU,\nSODIUM LAURETH SULFATE,\nSODIUM LAURYL SULFATE, COCAMIDE MEA,GLYCOL DISTEARATE, SODIUM CHLORIDE,PARFUM /FRAGRANCE, DIMETHICONE,citriC acid, sodium BENzOATe,PPG-5-CETETH-20, SODIUM HYDROXIDE,coco-Betaine, GLYCERIN, CARBOMeR,SALICYLIC ACID,\nGUAR HYDROXYPROPYLTRIMONIUM CHLORIDE\n,MEL / HONEY / MIEL,BENZYL ALCOHOL,COUMARIN, LIMONENE,\nBENZYL SALICYLATE, ARGANIA SPINOSA KERNEL OIL, CERA ALBA/BEESWAX/CIRE DABEILLE,CARAMEL, FUMARIC ACID, MEL EXTRACT/HONEY EXTRACT, CI 19140/YELLOW 5, POTASSIUM SORBATE",
    "flair_text": "Help needed",
    "flair_template_id": "fb6ae90e-af6c-11ed-b65a-9ae950aefbfe",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "skin",
    "post_id": "1g2prik",
    "title": "Allergic reaction on eyelids (red and swollen) ",
    "url": "https://www.reddit.com/r/skin/comments/1g2prik/allergic_reaction_on_eyelids_red_and_swollen/",
    "score": 1,
    "num_comments": 1,
    "created": "2024-10-13T13:34:22+00:00",
    "body": "On Thursday I started using Dermalogica special cleansing gel, it felt gentler than my normal cleanser and I didn’t have any bad reaction on my face. I’ve been waking up with little whiteheads every day for months and the 2 days I used the dermalogica cleanser I didn’t wake up with any new ones.\n\nOn Friday night I used Bioderma atoderm eye cream around my eyes and woke up Saturday morning and noticed darkness on the outer corner of my eye but I thought nothing of it. I had been using this product earlier this year for a few months and had no reaction to it but I hadn’t used it since then. So I used the dermalogica cleanser and eye cream again yesterday and after washing my face and applying the eye cream straight after I noticed my whole eye area was red and wrinkly. I immediately washed the cream off and last night I used my normal cleanser instead, avoiding my eye area but today I’ve woken up with both eyes swollen, red and itchy. \n\nI’m just wondering if anyone knows what one of these products could have caused this. I know it could be anything but I’ve heard of eyelid dermatitis caused by acrylates so I was thinking maybe it could be the Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer in the eye cream but I’m not sure. \n\nHere are the ingredients\nDermalogica cleansing gel \nWater/Aqua/Eau, Disodium Laureth Sulfosuccinate, Sodium Lauroyl Sarcosinate, Quillaja Saponaria Bark Extract, Lavandula Angustifolia (Lavender) Oil, Melissa Officinalis Leaf Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Nardus (Citronella) Oil, Glycerin, Cocamidopropyl Betaine, Coco-Betaine, Hydroxyethylcellulose, Sodium Cocoyl Isethionate, Capryloyl Glycine, Sodium Lauryl Sulfoacetate, Methylpropanediol, Ethylhexylglycerin, Caprylhydroxamic Acid, PPG-5-Ceteth-20, Sodium Hydroxide, Disodium EDTA.\n\nBioderma eye cream \nAqua/Water/Eau, Glycerin, Paraffinum Liquidum/Mineral Oil/Huile Minerale, Helianthus Annuus (Sunflower) Seed Oil, Dipropylene Glycol, Brassica Campestris (Rapeseed) Seed Oil, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sucrose Stearate, 1,2-Hexanediol, Glycyrrhetinic Acid, Sodium Citrate, Polysorbate 60, Sorbitan Isostearate, Mannitol, Sodium Lauroyl Lactylate, Xylitol, Citric Acid, Pentylene Glycol, Rhamnose, Tocopherol, Phytosphingosine, Ceramide Np, Sodium Hyaluronate, Ethylhexylglycerin, Ceramide Ap, Cholesterol, Carbomer, Xanthan Gum, Fructooligosaccharides. Caprylic/Capric Triglyceride, Laminaria Ochroleuca Extract, Ceramide Eop. [Bi 478].",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Don't ask for or hand out medical diagnoses. We're not doctors, so we can't diagnose or treat your skin condition. If you're concerned about something, please see a qualified medical professionals rather than trust the comments made by random strangers on the internet. For a medical professional answer try r/AskDocs for a bug bite, try r/bugbites\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/skin) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Ulta",
    "post_id": "1i0tj1n",
    "title": "(HELP) Redken Cleansing Cream. 2 Percent Sold In-Store vs 4 Percent Sold Online. Any difference? Ingredients Listed",
    "url": "https://www.reddit.com/r/Ulta/comments/1i0tj1n/help_redken_cleansing_cream_2_percent_sold/",
    "score": 1,
    "num_comments": 6,
    "created": "2025-01-14T00:40:52+00:00",
    "body": "I went in the store expecting the 4% Ulta shows online. I didn't realize until I got home that mine shows the old 2%. I haven't used either, but I thought they got rid of these in the beginning of last year?\nThey say they increased the \"cleansing complex\" and the ingredients look a little different.\n\nCan anyone who's used both or is knowledgeable about ingredients give a little insight? Like which is more stripping? I would even appreciate people who've only used one to give reviews. Just state which one you used.\n\n2% Ingredients: AQUA / WATER/EAU, SODIUM LAURETH SULFATE, SODIUM LAURYL SULFATE, COCO-GLUCOSIDE, COCAMIDOPROPYL BETANE, SODIUM CHLORIDE, CETYL ALCOHOL, GLYCOL DISTEARATE, CITRIC ACID, PARFUM / FRAGRANCE, PPG-5-CETETH-20, SODIUM BENZOATE, SODIUM HYDROXIDE, LIMONENE, TRISODIUM ETHYLENEDIAMINE DISUCCINATE, SALICYLIC ACID, COCO-BETAINE, SACCHARUM OFFICINARUM EXTRACT / SUGARCANE EXTRACT / EXTRAIT DE CANNE A SUCRE,  HYDROXYPROPYLTRIMONIUM HYDROLYZED WHEAT PROTEIN, HEXYL CINNAMAL, LINALOOL, PHENOXYETHANOL, CITRUS LIMON FRUIT EXTRACT / LEMON FRUIT EXTRACT, PYRUS MALUS FRUIT EXTRACT / APPLE FRUIT EXTRACT, CAMELLIA SINENSIS LEAF EXTRACT\n\n4% Ingredients Courtesy of Ulta: Aqua/Water/Eau, Sodium Laureth Sulfate, Lauryl Glucoside, Cetyl Alcohol, Sodium Chloride, Glycol Distearate, Citric Acid, Ppg-5-Ceteth-20, Parfum/Fragrance, Sodium Benzoate, Sodium Hydroxide, Cocamidopropyl Betaine, Limonene, Disodium EDTA, Salicylic Acid, Coco-Betaine, Saccharum Officinarum Extract/Sugarcane Extract/Extrait De Canne A Sucre, Hydroxypropyltrimonium Hydrolyzed Wheat Protein, Hexyl Cinnamal, Linalool, Phenoxyethanol, Citrus Limon Peel Extract/Lemon Peel Extract, Pyrus Malus Fruit Extract/Apple Fruit Extract, Camellia Sinensis Leaf Extract",
    "flair_text": "Discussion",
    "flair_template_id": "b7f4003e-ec64-11ea-9e3d-0eccd226b929",
    "comments": [
      {
        "author": "xtinappm",
        "body": "I never paid attention to this but I just got a new jumbo (shipped) and it's 2% while my current one in my shower is 4% that was also shipped to me last year. Now I'm curious if there is any difference or not.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "k66c6l",
    "title": "I got a bad reaction to Cetraben 2in1 Daily Cleansing Cream...boo",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/k66c6l/i_got_a_bad_reaction_to_cetraben_2in1_daily/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-12-03T21:12:03+00:00",
    "body": "I finished another bottle of my favourite cleanser (La Roche Posay Caring Wash) and decided to try a cleanser by Cetraben because it was cheaper and could be purchased locally (as opposed to the LRP which I had to ship from France).\n\nI did my usual routine until I washed my face with this product. My face became flushed and reddened. It's about an hour later and it's still hot. Needless to say this cleanser is not for me and I will go back to my LRP.\n\nDoes anyone have any idea what could have caused the reaction? I don't have rosacea or anything (afaik) and my skin isn't super sensitive. I wondered if it might be too harsh of a cleanser, but it's supposed to be for dry skin and can be used all over the body. \n\nI also hate the smell of this. It smells of liquid paraffin, but insanely strong.\n\nI was going to use it up as a hand wash but since I have dyshidrosis I don't want to take the risk. I'll probably give it to my mum. \n\nHere are the ingredients:\nAqua, Petrolatum, Cetearyl Alcohol, Paraffinum Liquidum, Disodium Cocoamphodiacetate, Polysorbate 60, PPG-5-Ceteth-20, Sodium Chloride, p-Chloro-m-Cresol, Citric Acid",
    "flair_text": "Discussion",
    "flair_template_id": "84244f70-06d8-11e4-9cc7-12313b0add52",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "hi247k",
    "title": "[Routine Help] I've arrived home to a new collection of acne treatments, which ones do I use?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/hi247k/routine_help_ive_arrived_home_to_a_new_collection/",
    "score": 1,
    "num_comments": 9,
    "created": "2020-06-29T15:39:02+00:00",
    "body": "**Please check my previous posts and tell me if it looks fungal, I'm getting mixed answers and don't want to waste more money**\n\nCurrent routine:\n• AM\n• Splash with water \n\n• PM\n\n• Quinoderm Anti Bacterial Face wash (contains salicylic acid\n\n• Nizoral 10 min mask (idk if I even have fungal acne)\n\n• Simple light hydrating moisturizer\n\nNew products:\n\n• Clean and clear blackhead leave on cleanser (Aqua, Alcohol denat., PPG-5-Ceteth-20, Glycerin, Salicylic Acid, Panthenol, Menthyl Lactate, Potassium Lactate, Sodium citrate, Parfum)\n\n• Acnecide 5% Benzoyl peroxide gel\n\nIm afraid if I use both the Acnecide and clean and clear it will irritate my skin and I'm not too comfortable about benzoyl peroxide's side effects.\n\nI'm thinking about using the clean and clear instead as I also need to improve a few blackheads and texture. \n\nAny advice on what I should do with these new products? \n\nThanks! :)",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "decemberrainfall",
        "body": "Why does everyone think they have fungal acne? It has to be diagnosed by a derm.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/hhszv5/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "newaxcounr",
        "body": "is there a specific reason you’re just using water in the mornings?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Potatoesofdefiance",
        "body": "This isn’t something someone can tell you from a photo. It’s one of the easiest things to figure out on your own, though. Get a black light and check what color your clogged pores glow under it. Acne bacteria glows orange while malassezia (fungus) glows bluish white. Derms use a black light device called a woods lamp, but for seeing clogged pores at home a black light flashlight does just fine. \n\nI use the flashlight to see if new products have started clogging me up *without* having to wait until I actually start getting visible breakouts. You’ll also be able to see with the black light just how well benzoyl peroxide works to eliminate acne bacteria because the orange glow is practically gone within 12 hours wherever you apply it. \n\n**Please do not check your acne under a black light though if you’re prone to skin picking**, you‘ll be tempted to squeeze out every last clogged pore. Have someone else check for you in that case, or better yet just go see a derm.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Pomade",
    "post_id": "xycbul",
    "title": "water based with petrolatum",
    "url": "https://www.reddit.com/r/Pomade/comments/xycbul/water_based_with_petrolatum/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-10-07T22:36:16+00:00",
    "body": "Hi guys, im looking for a water based product that offers light to medium hold, I tried Syoss invisible paste as someone here recommended it and I liked it, it washes out with water although it has petrolatum right after water in the formula, looking for a more premium option, thanks.\n\nIngredients:\n\nAqua (Water, Eau) · Petrolatum · Cera Alba (Beeswax, Cire d’Abeille) · C12-15 Alkyl Benzoate · Stearic Acid · Palmitic Acid · Cetyl Alcohol · Steareth-21 · Steareth-2 · PVP · Paraffinum Liquidum (Mineral Oil, Huile Minérale) · Parfum (Fragrance) · PPG-5-Ceteth-20 · Oleth-20 · Phenoxyethanol · Cetearyl Alcohol · Caprylyl Glycol · Dicetyl Phosphate · Ceteth-10 Phosphate · Acrylates/C10-30 Alkyl Acrylate Crosspolymer · Linalool · C12-15 Alcohols · Aminomethyl Propanol · Limonene · Geraniol · Citronellol · Tropolone · Ethylhexylglycerin · Citral · Benzyl Alcohol",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskDocs",
    "post_id": "1g2ptrn",
    "title": "Swollen and red eyelids ",
    "url": "https://www.reddit.com/r/AskDocs/comments/1g2ptrn/swollen_and_red_eyelids/",
    "score": 1,
    "num_comments": 5,
    "created": "2024-10-13T13:37:40+00:00",
    "body": "On Thursday I started using Dermalogica special cleansing gel, it felt gentler than my normal cleanser and I didn’t have any bad reaction on my face. I’ve been waking up with little whiteheads every day for months and the 2 days I used the dermalogica cleanser I didn’t wake up with any new ones.\n\nOn Friday night I used Bioderma atoderm eye cream around my eyes and woke up Saturday morning and noticed darkness on the outer corner of my eye but I thought nothing of it. I had been using this product earlier this year for a few months and had no reaction to it but I hadn’t used it since then. So I used the dermalogica cleanser and eye cream again yesterday and after washing my face and applying the eye cream straight after I noticed my whole eye area was red and wrinkly. I immediately washed the cream off and last night I used my normal cleanser instead, avoiding my eye area but today I’ve woken up with both eyes swollen, red and itchy. \n\nI’m just wondering if anyone knows what one of these products could have caused this. I know it could be anything but I’ve heard of eyelid dermatitis caused by acrylates so I was thinking maybe it could be the Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer in the eye cream but I’m not sure. \n\nHere are the ingredients\nDermalogica cleansing gel \nWater/Aqua/Eau, Disodium Laureth Sulfosuccinate, Sodium Lauroyl Sarcosinate, Quillaja Saponaria Bark Extract, Lavandula Angustifolia (Lavender) Oil, Melissa Officinalis Leaf Extract, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Cymbopogon Nardus (Citronella) Oil, Glycerin, Cocamidopropyl Betaine, Coco-Betaine, Hydroxyethylcellulose, Sodium Cocoyl Isethionate, Capryloyl Glycine, Sodium Lauryl Sulfoacetate, Methylpropanediol, Ethylhexylglycerin, Caprylhydroxamic Acid, PPG-5-Ceteth-20, Sodium Hydroxide, Disodium EDTA.\n\nBioderma eye cream \nAqua/Water/Eau, Glycerin, Paraffinum Liquidum/Mineral Oil/Huile Minerale, Helianthus Annuus (Sunflower) Seed Oil, Dipropylene Glycol, Brassica Campestris (Rapeseed) Seed Oil, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Sucrose Stearate, 1,2-Hexanediol, Glycyrrhetinic Acid, Sodium Citrate, Polysorbate 60, Sorbitan Isostearate, Mannitol, Sodium Lauroyl Lactylate, Xylitol, Citric Acid, Pentylene Glycol, Rhamnose, Tocopherol, Phytosphingosine, Ceramide Np, Sodium Hyaluronate, Ethylhexylglycerin, Ceramide Ap, Cholesterol, Carbomer, Xanthan Gum, Fructooligosaccharides. Caprylic/Capric Triglyceride, Laminaria Ochroleuca Extract, Ceramide Eop. [Bi 478].\n\n24F, 5’2, 54kg",
    "flair_text": "Physician Responded",
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for your submission. **Please note that a response does not constitute a doctor-patient relationship.** This subreddit is for informal second opinions and casual information. The mod team does their best to remove bad information, but we do not catch all of it. Always visit a doctor in real life if you have any concerns about your health. Never use this subreddit as your first and final source of information regarding your question. By posting, you are agreeing to our [Terms of Use](https://www.reddit.com/r/AskDocs/wiki/terms_of_use) and understand that all information is taken at your own risk.\n**Reply here if you are an unverified user wishing to give advice. Top level comments by laypeople are automatically removed.** \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskDocs) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Itchdoc",
        "body": "Each of the products you mention has over 10 known potential allergens and known irritants.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "gnly0t",
    "title": "[ROUTINE HELP] Please help me understand where these skin products go in my AM/PM routine. Thank you in advance!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/gnly0t/routine_help_please_help_me_understand_where/",
    "score": 0,
    "num_comments": 3,
    "created": "2020-05-20T23:49:52+00:00",
    "body": "Hi! I have been a basic bitch since I found this sub a few years ago, and started using a 4-step skincare routine. But, lately, I am trying to take it up a level. I have T-zone, dehydrated skin that has some melasma on the sideburn area and my neck (I used to wax but I think these areas got more sensitive to sun, hence the melasma only being in the areas I waxed - I have since switched to threading. But the damage has been done).\n\nI really like these products individually, but I know there has to be a certain order and time (AM/PM) for them to truly work and be active.\n\nCan you help me create my AM/PM skin routine?\n\nI double cleanse with vitamin E oil, followed by La Roche Posey Toleriane Gentle Face Cleanser.\n\n**Trader Joes Nourish Antioxidant Facial Serum**\n\n***Ingredients:*** *Water, Aloe Vera Leaf Juice, Ethylhexyl (Octyl) Palmitate, Glycerin, Glyceryl Stearate, Polysorbate-60, Cetearyl Alcohol, Phenoxyethanol, Cetearyl Glucoside, Sodium PCA, Ethylhexyglycerin, Butyrospermum Parkii (Shea Butter) Fruit, Tocopheryl Acetate, Xanthan Gum (Thickener), Tocopherol (Antioxidant), Sorbic Acid, Soluble Collagen, Panthenol (Pro-Vitamin B5), Ascorbyl Palmitate (Vitamin C Palmitate), Pomegranate Extract, Ginkgo Biloba Extract, Coffea Arobica (Coffee) Seed, Chamomile Flower/Leaf Extract, Green Tea Leaf Extract, Sodium Hyaluronate, Sorbitan Stearate, Phytonadione (Vitamin K1), Menadione (Vitamin K3), Hydrolyzed Silk, DMAE (Dimethylaminoethanol), Copper PCA, Retinol (Vitamin A), Retinyl Palmitate (Vitamin A Palmitate), Ubiquinone (Coenzyme Q10),Thioctic Acid (Alpha-lipoic acid), Cholecalciferol (Vitamin D3), Polysorbate-20, C12-15 Alkyl Benzoate, Phospholipids.*\n\n**Trader Joes Watermelon Facial Mist**\n\n***INGREDIENTS:*** *WATER, CITRULLUS LANATUS (WATERMELON) SEED OIL, ORYZA SATIVA (RICE) BRAN OIL, SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL, SORBITAN OLEATE, CITRULLUS LANATUS (WATERMELON) FRUIT WATER, PHENOXYETHANOL, PHOSPHOLIPIDS, SODIUM BENZOATE, FRAGRANCE, GLYCINE SOJA (SOYBEAN) OIL, DISODIUM EDTA, ETHYLHEXYLGLYCERIN, GLYCOLIPIDS, TAMARINDUS INDICA SEED POLYSACCHARIDE, ECLIPTA PROSTRATA EXTRACT, GLYCINE SOJA (SOYBEAN) STEROLS, BISABOLOL, PROPANEDIOL, MELIA AZADIRACHTA LEAF EXTRACT, MORINGA OLEIFERA SEED OIL, RAPHANUS SATIVUS (RADISH) ROOT EXTRACT, MALTODEXTRIN, SODIUM HYALURONATE, HIBISCUS SABDARIFFA FLOWER EXTRACT, CUCURBITA PEPO (PUMPKIN) SEED OIL.*\n\n**Advanced Clinicals Vitamin C Advanced Brightening Cream**\n\nIngredients; Water (Aqua) Cetearyl Alcohol Mineral Oil Glyceryl Stearate SE Aloe Barbadensis Leaf Juice Cocos Nucifera (Coconut) Oil Isopropyl Myristate Glycerin Butylene Glycol Ceteareth-20 Caprylic/Capric Triglyceride Aminopropyl Ascorbyl Phosphate Tetrahexyldecyl Ascorbate Tocopheryl Acetate Camellia Sinensis Leaf Extract Disodium EDTA Ascorbic Acid Ferulic Acid Fragrance Acrylates/C10-30 Alkyl Acrylate Crosspolymer Sodium Polyacrylate Ethylhexyl Stearate Trideceth-6 Phenoxyethanol Caprylyl Glycol Ethylhexylglycerin Hexylene Glycol Sodium Hydroxide\n\n**Stridex in the Red Box**\n\n**Active Ingredient:** Salicylic acid 2.0%\n\n**Inactive Ingredients**: \\*Ammonium lauryl sulfate, ammonium xylenesulfonate, citric acid, DMDM hydantoin, \\*fragrance, \\*menthol, PPG-5-Ceteth-20, purified water, simethicone, sodium borate, tetrasodium EDTA.\n\n**CeraVe Moisturinzing Cream**\n\n**Ingredients:** Aqua / Water / Eau, Glycerin, Cetearyl Alcohol, Caprylic/Capric Triglyceride, Cetyl Alcohol, Ceteareth-20, [**Petrolatum**](https://www.cerave.com/ingredients-in-cerave/petrolatum), Potassium Phosphate, Ceramide Np, Ceramide Ap, Ceramide Eop, Carbomer, Dimethicone, Behentrimonium Methosulfate, Sodium Lauroyl Lactylate, Sodium Hyaluronate, Cholesterol, Phenoxyethanol, Disodium Edta, Dipotassium Phosphate, Tocopherol, Phytosphingosine, Xanthan Gum, Ethylhexylglycerin\n\nTHANK YOU SO MUCH IN ADVANCE! :)",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "inscopia",
        "body": "I would do the following:\n\nAM-\n\nSingle cleanse,\nMist,\nVit C,\nMoisturise,\nSPF\n\nPM-\n\nDouble cleanse,\nMost,\nStridex,\nSerum",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "seraphin420",
        "body": "Thank you! I knew I had to keep the vitamin c away from the stridex, but can I wear vitamin c outside in the sun if I use spf? Thank you so much for your help!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/gn4cln/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EquinoxGyms",
    "post_id": "1ae5999",
    "title": "Equinox's Kiehl's Products Found to Contain Harmful Chemicals",
    "url": "https://www.reddit.com/r/EquinoxGyms/comments/1ae5999/equinoxs_kiehls_products_found_to_contain_harmful/",
    "score": 0,
    "num_comments": 38,
    "created": "2024-01-29T20:26:40+00:00",
    "body": "Hey Equinox members,\n\nI've got some concerning news about the Kiehl's products we've been using at Equinox. After doing some research, I've discovered that many of these products contain chemicals that are neurotoxic, carcinogenic, and reprotoxic.\n\nThe most alarming is the Bath and Shower wash. It's loaded with Benzyl salicylate, an endocrine disrupter; Disodium Laureth Sulfosuccinate, which is carcinogenic; PPG-5-Ceteth-20, PEG-150 Pentaerythrityl Testrastearate, and PEG-6 Caprylic/Capric glycerides, all linked to neurotoxic and carcinogenic effects; and Salicylic acid, known to be reprotoxic.\n\nKiehl's Ultra Facial Cleanser contains Phenoxyethanol, which is associated with fertility issues, along with PEG-200 Hydrogenated glyceryl palmate, PEG-7 Glycerl cocoate, and Laureth-2 – all flagged as neurotoxic and carcinogenic.\n\nSimilar concerns have been raised about the Body Lotion, which also contains Phenoxyethanol and PEGs, and the Amino Acid Shampoo, containing PPG-5-Ceteth-20, PEG-55 Propylene Glycol Oleate, and Phenoxyethanol.\n\nI thought it was crucial to share this with you all, as these are products we might be using regularly without knowing their potential harm. It's important to be informed about what we're putting on our bodies. Stay safe and healthy!\n\n*Note: while it's important to acknowledge that most of these chemicals are present in low levels and pose low risks, as members of one of the country’s most premium gyms, shouldn't we advocate for the highest standards? Organic and natural ingredients minimize any health risks. Why take any risk when better, safer alternatives could be the norm?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "carbsandcaffeine",
        "body": "To preface, I don't love Khiel's products either and I am not a dermatologist, but I am a skincare junkie and a lot of the ingredients you're mentioning are quite common in the skincare world in moderated amounts!\n\nFor example, [Phenoxyethanol](https://www.youtube.com/watch?v=MkPZTKWYeE8&ab_channel=DrDray) is often used as a preservative. There's been a huge push to \"clean beauty\" in the past few years, but a lot of it is just marketing. \"Clean beauty\" products expire a lot quicker and they harbor bacteria.\n\n[Salicylic Acid](https://health.ec.europa.eu/system/files/2021-08/sccs_o_223_0.pdf) is a holy grail for a lot of people who struggle with acne, oily skin, and uneven skin tone. If you have ever used any anti-acne product in your life, chances are it had salicylic acid.\n\nThe worst thing that sticks out to me on here is [Benzyl Salicylate](https://pubchem.ncbi.nlm.nih.gov/compound/Benzyl-salicylate#section=Antidote-and-Emergency-Treatment) and that's mostly just because it's a fragrance and all fragrances are classified as irritants. Some people tolerate them just fine, but going fragrance-free is the first thing many people with sensitive do when narrowing down their issues.\n\nI know you listed a lot more, but I just wanted to give my 2 cents on some ingredients I was familiar with just because they're common in the skincare world. Again, if you prefer to stay away from chemicals, that is more than fine. But I also wanted to throw my comment out there for those that are now worried they're slowly dying from showering at Equinox haha",
        "score": 88,
        "is_top_level": true
      },
      {
        "author": "SurgicalNeckHumerus",
        "body": "Might want to show your work. Most of these are probably harmful at only chronically high doses, not topically as there’s no systemic absorption. \n\nYour post reads like you’re more of a conspiracy theorist and less of an expert on any of these topics",
        "score": 63,
        "is_top_level": true
      },
      {
        "author": "st4rsh1ne",
        "body": "Anything that makes my face that moisturized can poison me as much as it wants",
        "score": 25,
        "is_top_level": true
      },
      {
        "author": "waffles4us",
        "body": "Toxic and carcinogenic in what amounts? \n\nAnd are those amounts present in the products?\n\nHow much exposure is needed?\n\nIs this in RCT human trials or mega dosed rat studies?",
        "score": 20,
        "is_top_level": true
      },
      {
        "author": "Niedzwiedz55",
        "body": "I’m a board certified dermatologist who goes to Equinox. I don’t have an issue with these chemicals. The issue I have is that they use too much fragrance/botanicals.",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "2022peace",
        "body": "These legacy brands tend to have outdated formulas",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Ecstatic-Land7797",
        "body": "Sounds like someone just found the EWG site...\n\nBtw a site that's actually helpful for looking up ingredients is:\n\n[https://www.paulaschoice.com/ingredient-dictionary](https://www.paulaschoice.com/ingredient-dictionary)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "PTDG310",
        "body": "Yeah I also drive a car in a major city, hang out with friends that smoke occasionally cigarettes and drink alcohol a few times a month. Your point is…?",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Feisty-Piccolo8610",
        "body": "I’ve used it for the last 5 years. I’m doing fine",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "watershed8",
        "body": "..... really wasn't ready for follow up questions...",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "joshually",
        "body": "U mean their \"Kirkland khiel's\" products? I swear they're watered down versions of the actual product you would find at a kiehl store",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "jdemart",
        "body": "I think that it’s time Equinox moved on from Kiehl’s. They’re no longer the high end hot brand they were when the partnership first happened, so both from a luxury and quality standpoint, it feels a little lagging behind to still have this partnership.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "BusyBurdee",
        "body": "When are they switching to Aesop??",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "scone70",
        "body": "Did you know that we, and everything around us, contain chemicals?  Settle down before you give yourself a brain aneurysm.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Glitter_Tulip",
        "body": "Kiehl’s products are tested in animals so that’s a big not for me. L’Oreal is their parent company. They need to switch to Aesop.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "hannah1432",
        "body": "One other thing to flag is that the shampoo contains wheat! I have Celiac and had a very bad reaction to it, so just to be aware if gluten is an issue for anyone",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Napervillian",
        "body": "This “research” reads like it was done on Facebook while pooping on the toilet.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "williamboweryswift",
        "body": "i can guarantee the amount of chemicals in these products are not going to cause neurotoxicity to anyone using them. don’t drink the face wash and you’ll be fine.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 18,
      "top_level": 18,
      "nested_replies": 0
    }
  }
]