[
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "i8a8uf",
    "title": "Earth Rhythm: Review & Experience",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/i8a8uf/earth_rhythm_review_experience/",
    "score": 128,
    "num_comments": 59,
    "created": "2020-08-12T08:47:26+00:00",
    "body": "&#x200B;\n\n[A picture of products minus the shampoo bar](https://preview.redd.it/wijwag21bjg51.jpg?width=720&format=pjpg&auto=webp&s=b8e5e8e14a08df16c73ddf38baca7ca026911f2d)\n\n*This post has been long due. I had to test the products adequately before making my mind about them. Other than the products in the picture, I purchased the Milk Protein Shampoo Bar as well. Overall I am very angry at myself for trying these products out.*\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **0.5% FERULIC ACID, 15% VITAMIN C, 1% VITAMIN E MULTIVITAMIN AGE DEFENSE SERUM**\n\n***^(Ingredients as on Website:)*** ^(Distilled Water, L-Ascorbic Acid Vitamin C, Alpha Tocopherol Vitamin E, Sodium Acrylates Copolymer, Lecithin, Caprylic/Capric Triglyceride, D Panthenol, Ferulic Acid, Sodium Hyaluronate)\n\n***My experience:***  This is the product I was the most excited about. Vitamin C is a powerhouse of an antioxidant and has many proven skin benefits. L-Ascorbic Acid is the most potent and studied form of Vitamin C, notorious for being highly unstable. I have used a bunch of Vitamin C serums but it can be really hard to find a well-formulated one, especially in India. I so wanted this to work out. Unfortunately, this serum broke my blemish-free skin-so-good spell (or Copper Peptide - will explain later). My skin was perfect right before the ER haul. After trying these products my skin started to break out left right and center. So after being frustrated with my new breakouts, I decided to check the PH of this serum. To my surprise, the PH came out to be PH 6-7. Vitamin C's work best between PH 2-3.5. I contacted the brand to know what they claim for the PH to be. They informed me the PH for the product is \"PH 2.5-3.2\" on their Instagram handle. I took it up further and after a lot of back and forth. [This](https://imgur.com/a/ihKkY6T) is the reply I received from the brand owner.  The preservatives & PH stabilizers that reacted were not mentioned in the ingredients list. I asked her later why they were not mentioned? I was told that the PH stabilizers and preservatives were less than 0.5% and anything less than 0.5% was not required to be mentioned. I, personally cannot understand that L-AA (15% and highly acidic PH 1-2) could turn a PH of 6-7 with just 0.01% of Ph stabilizers (As per what she claimed).\n\n***Texture:*** Thick goopy. I could sort of see/feel the ascorbic acid particles in the serum. It was clear when it arrived but has turned slightly yellow now.\n\n***Status:*** ***WNR.*** All in all, the product was unstable and breaking me out (maybe). I will not be repurchasing unless I find out the changed and fixed the formula.\n\n&#x200B;\n\n[Took a picture of the vitamin C serum. It turned slightly yellow now. It was clear when it arrived.](https://preview.redd.it/a5ikili8bjg51.jpg?width=720&format=pjpg&auto=webp&s=bd81bcb46e515122c37d2f0c79d1440712e1a2f0)\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **COPPER TRIPEPTIDE + PHYTO CERAMIDE SERUM**\n\n***^(Ingredients as on Website:)*** ^(Distilled Water, Polyacrylate Crosspolymer-6, Phospholipids (and Sphingolipids, Copper tripeptide-1, Tocopherol, Benzyl Alcohol & Glycerin & Sorbic Acid.))\n\n***My experience:*** I wanted to include copper-peptides in my routine after Gothamista raved about them. I haven't been able to get my hands on the TO/Niod ones. Let's copy-paste everything about my excitement and the sadness in what really happened with Vitamin C, here, as well. Basically, PH came out to be PH 2-3. The brand claimed it to be around PH 6-7. The owner admitted something went wrong. I discontinued usage. I received this product 2-3 days earlier to the Vitamin C serum. I broke out 2 days after introducing the Vitamin C & the Bakuchiol. I thought it was vitamin C that broke me out but in afterthought, it could be this serum as well. Maybe my skin barrier was ducked because of these, maybe it was an ingredient. Who knows? Interestingly this product mentions the preservatives. Not sure if it is because they are in a % above 0.05% or the brand just decided to put these in the ingredients list on the website.\n\n***Texture:*** Watery liquid, blue in color. Did not sting after application, slightly irritated my eyelids.\n\n***Status:*** ***WNR.*** All in all, the product was unstable and breaking me out (maybe). I will not be repurchasing unless I find out the changed and fixed the formula.\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **SKIN SMOOTHENING SERUM - BAKUCHIOL EXTRACT**\n\n***^(Ingredients as on Website:)*** ^(Vitus vinifera \\[Grape seed oil\\], Psoralea corylifolia \\[Bakuchiol Extract7%\\], Vitamin E \\[Tocopheryl Acetate\\], Tanacetum annum \\[Tansy Essential Oil\\])\n\n***My experience:*** I had read a lot about Bakuchiol and wanted to give it a try. Bakuchiol can have anti-acne and anti-aging benefits very comparable to tretinoin as per primary studies. However, Bakuchiol is not the same as Babchi oil. A lot of brands claim to be using Babchi oil and that can actually have some side effects. This [article](https://bakuchiol.net/2019/10/14/babchi-oil-versus-bakuchiol/) explains the difference well. Thus I had contacted ER before purchasing to ensure they were using Bakuchiol and not Babchi extract. They claimed they were indeed using Bakuchiol. On the first experience, it had the typical essential oil smell. The fragrance is toooooo much and it lingers. As per the ingredients list on site, it seems like it could be the Tansy oil, which I have no clue a to why it was added. Essential oils provide no benefit other than fragrance. Since I was breaking out I thought it must be this oil at first. So I just used it once and did not use it again till I found out it could be the products mentioned above. After that, I have tried two attempts to use this product. I tried to use it at night as a face oil. The smell lingers and it can be a good thing or a bad thing(depending on your preference). It is definitely not good for the skin. I didn't experience any breakouts but it did not give me any benefits in the short period I tried to use it. The smell was just too much for me. Thus, I tried to use it as a massage oil, pre-cleansing. It worked well initially. However, I started to notice my face getting red and sensitive after a few days so I stopped. I haven't use the oil ever since. I may give it another attempt but the fragrance is a huge turn-off.\n\n***Texture:*** Lightweight, nonsticky, oily.\n\n***Another issue:*** The ingredients list [on the ](https://imgur.com/a/cQdPBJY)[pack](https://imgur.com/a/cQdPBJY) was different than the one online. I mentioned this issue to the owner as well. She did not respond to this issue. Not sure if this was just another error or if this is the correct one actually.\n\n***Status:*** ***WNR.*** Please remove the essential oil from this product.\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **MILK PROTEIN SHAMPOO BAR**\n\n***^(Ingredients as on Website:)*** ^(Cocos Nucifera \\[Coconut Oil\\], Hydrolysed Milk Protein, Behentrimonium Methosulfate, and Cetyl Alcohol, Guar Hydroxypropyltrimonium Chloride, Sodium PEG-7 Olive Oil Carboxylate, Sodium Cocoyl Isethionate, Tocopheryl Acetate \\[Vitamin E\\], Benzyl Alcohol & Salicylic Acid & Glycerin & Sorbic Acid.)\n\n***My Hair type:*** Low porosity 1c-2a, scalp prone to dermatitis, was experiencing heavy hormonal hair fall during that period.\n\n***My experience:*** I purchased this after hearing a lot of hype around their shampoo bars. This did not increase my hair fall and when it arrived it looked really small but I think a little goes a long way with this one. I think it felt it was really gentle but not suitable for my hair type. It made my hair frizzier and slick at the same time although my scalp and hair both felt clean.\n\n***Status:*** May try another bar better suited for my hair type.\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **MOIST REPAIR HAIR CONDITIONER**\n\n***^(Ingredients as on Website:)*** ^(Distilled water, Glycerine and Water and Hibiscus Sabdariffa Flower Extract, Organic Glycerine, Quaternium-91, and Cetrimonium Methosulfate and Cetearyl Alcohol, Behentrimonium Methosulfate and Cetyl Alcohol, Cocamidopropyl Betaine, Hydrolyzed Soy Protein, Water & Vaccinium Myrtillus Fruit/Leaf Extract & Saccharum Officinarum \\[Sugar Cane\\] Extract & Citrus Aurantium Dulcis \\[Orange\\] Fruit Extract & Citrus Limon \\[Lemon\\] Fruit Extract & Acer Saccharum \\[Sugar Maple\\] Extract, dl-Alpha Tocopheryl Acetate, Benzyl Alcohol, and Salicylic Acid and Glycerin and Sorbic Acid.)\n\n***My Hair type:*** Low porosity 1c-2a, scalp prone to dermatitis, was experiencing heavy hormonal hairfall during that period.\n\n***My experience:*** On the website, they claim that this can be used on the roots as well. I tried that a few times.  It felt like it left a film on my hair and my hair looked greasy like that, thus I just started applying this on my ends. It does help detangle hair in the shower and it makes hair softer. However once dry, my hair becomes frizzier and tangled after wash. Again, I feel it may not be suited for my hair type. I think people which thick hair might like this.\n\n***Status: WNR***\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **DEEP CONDITIONER HAIR BUTTER WITH HIBISCUS, SHIKKAKAI & ARNICA EXTRACT**\n\n***^(Ingredients as on Website:)*** ^(Butyrospermum Parkii \\[Shea Butter\\], Theobroma Cacao \\[Cocoa Seed Butter\\], Astrocaryum Murumuru Seed Butter, Ricinus communist \\[Castor\\] Seed Oil, Cocos Nucifera \\[Coconut\\] Oil, Aloe vera Juice, Arnica Montana \\[Arnica flower\\]extract, Water, Glycerin, Persea Gratissima \\[Avocado\\] Fruit Extract, Acacia Concinna Fruit Extract, Tamarindus Indica Fruit Extract, Hibiscus Rosa-Senensis Extract, Rosmarinus Officinalis \\[Rosemary\\] leaf extract, Tocopheryl Acetate \\[Vitamin E\\], Olea Europaea \\[Olive\\] Leaf Extract, Water \\[aqua\\].Behentrimonium Methosulfate and Cetyl Alcohol, Benzyl Alcohol and Salicylic Acid and Glycerin and Sorbic Acid.)\n\n***My experience:*** The website claims that this can be used as a leave-in cream as well but I just used it as a hair mask and washed after 1-2 hrs. It left my hair extremely nourished and soft but really greasy. Even after washing it with a sulfate shampoo by hair were pretty much weighed down. I think this would be good for those with thick hair. I liked it for extra nourishment. I will use this up. I didn't notice my hair falling excessively while using this. The quantity is really little though and I am not sure how many uses you can get if you have very thick voluminous hair.\n\n***Status: WNR***\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n* **ORGANIC LIP** **~~SCRUB~~** **STICK**\n\n***^(Ingredients as on Website:)*** ^(Caprylic/Capric Triglyceride, Organic Cocos nucifera (Coconut Oil, Ricinus communis (Castor Seed Oil, Beeswax \\[Cera Alba\\], Hydrogenated Olive Oil and Olea Europaea \\[Olive\\] Fruit Oil, Butyrospermum Parkii \\[Shea Butter\\] and Organic Brown Sugar)\n\n***My experience:*** This product was a complete dud. Maybe I received a lip balm instead of a scrub. Maybe the sugar particles melted. Maybe my product did not have any sugar particles. I rubbed half the product to ensure that they were not buried deep inside. This was just a hard thick balm, not moisturizing at all. It has no scrub particles. This was a major disappointment. I had to contact ER for several days to get this fixed. I have no clue what went wrong with this product.\n\n***Status: WNR***\n\n&#x200B;\n\n\\------------------------------------------------------------------------------------------------------------------------------------------------\n\n&#x200B;\n\n***OVERALL BRAND REVIEW:***\n\nI appreciate how candid the owner was in admitting what could have gone wrong. Her responses seemed genuine. After much discussion about the unstable formulation, I had to wait a long while before the refund was processed for the defective items. I left reminder emails for the refund which was just very embarrassing. The owner, however, provided me a complete refund for all my purchases which is kind & generous.\n\n***I hate that they did not announce the issues in their batches on their Instagram/website. A batch can have anywhere around 500-20,000 units(approx). If the whole batch was bad, I feel those customers deserve a refund/new product.***\n\nI think the brand is still in the learning stage. I think their hair products may be nice. I can see them working out for some people. The skin care products were a major no-no.  I had a lot of expectations from the brand as they position themselves to be aware and first movers in the Indian skincare industry. I was gravely disappointed to know that the formulas are not well researched and; even though the brand is big on disclosure, they are not purposely going out of their way to list the complete ingredients list. No dyes, colors, preservatives, and ph stabilizers below 0.5% will be mentioned. Their sunscreen has no PA/PPD ratings.\n\nTheir packaging for both the lip scrub and the glass dropper bottle sucks. The bamboo exterior in the packaging is lined with a plastic interior. It makes the caps and sticks bulkier and thus hard to open and close. The brand heavily advertises and markets itself to be a clean/green brand. The bamboo cap packaging just looks like a gimmick though. It serves no real purpose. I appreciate the glass containers and the aluminum pump bottles although. They feel lux. Also, all products are packaged with a lot of newspaper stuffing, which I prefer over bubble wraps. Points for that.\n\nBy their brand marketing, they are trying to cater to both scientific and natural skincare consumers. The owner in a later email claimed that they aren't running the brand for-profit and are very motivated to reinvent the skincare industry. I can see that they are motivated but I cannot see how the brand is not focused on profits. Their products aren't cheap and they have invested heavily in marketing and influencer codes. I can see ER becoming the next JC. I am just sad that my experience was not nice. I hope the brand does try to take feedback and focuses more on quality and formulation. I think the brand has a lot of potential. They have a good marketing team and are developing products that are needed in the Indian market today. All their products look very interesting. I wish they ace their formulations as well.\n\n&#x200B;\n\nUpdate: **The brand owner contacted me that they have been getting a lot of hate since my post. I want to shout it out that it's ok to voice your criticism but any kind of bullying is NOT ok. Everyone is welcome to make purchase decisions based on what they seem fit but all our personal thoughts do not need to be aired.** **We are all human.** **Please don't send any hate to the owner. This does not mean I want to stop you from sharing your views/experiences. Just be careful of your words.**\n\n**She also let me know the steps and changes they have made following the event.** [Here](https://imgur.com/X5vr0sn) **is a screenshot of our conversation.**\n\n&#x200B;",
    "flair_text": "Review",
    "flair_template_id": "17caf4a0-2ab5-11e8-b6f9-0e331c7ef9ca",
    "comments": [
      {
        "author": "axel9991",
        "body": "This is why I can’t bring myself to trust Indian indie brands. It seems like most of them aren’t even hiring proper chemists and cosmetic formulators but rather reading up on what’s popular abroad and DIYing in their kitchen because they believe the Indian consumer isn’t educated enough to check PH. so thanks for doing that. Also if one batches PH went wrong I hope they weren’t being cheap and informed the other people who purchased from that batch and refunded them. Or else they’re literally endangering those customers skin",
        "score": 38,
        "is_top_level": true
      },
      {
        "author": "shilpamv",
        "body": "Today I am going to write about my harrowing experience with the brand EARTH RHYTHM.\nI ordered their ultra defence sun fluid\nPhytofuse moisturser and copper tripeptide serum.\nYes I fell for 20 % discount on their launch offer and ordered products worth rs 2527.\nA biggggg mistake.\n\nSo just a week after opening the sunscreen bottle , my sunscreen which was supposed to be thick lotion like...started coming out as a runny fluid.\n\nThe phytofuse moisturser...it came clogged at the neck of the bottle and was like that from beginning.\n\nI didn't open the copper tripeptide serum as I had my fare share of apprehensions because the other two products failed.\n\nSo I sent a DM to them on insta...\nGot a response plz wait for two days...\nThen started the emails on their official email id.\nMr Sivakumar from their staff agreed to fault in their sunscreen formulation.(screenshot attached) and told me that they would send me another piece from a fresh batch.i denied as I wasn't sure if the new product would be any better . And the bottle of sunscreen was swapped with a bottle of deep ceramide moisturser .\n\nThey even went on saying that they haven't got any single negative review about copper tripeptide and phyto fuse moisturser and i hence I should continue using those two.\nI agreed...as I trusted them...( Another mistake)\n\nAll this communication started on July 28th.2020\n\nFew days back this post on reddit went viral where the owner admitted to the fact that their copper tripeptide serum was unstable . And they will recall the product. The person who wrote that post got refunded in full...\n\nSo now alarmed ...I again sent them emails...but never got any response.\nFinally I sent them DM s on instagram...\n\nWhere after much contemplation they agreed to refund me only for the copper tripeptide serum and not other two products. \n\nBut they still refused to refund me for sunscreen and phyto fuse moisturser stating some internal policies.\n\nI even asked them to arrange for a pick up of all their products from my place and refund me in full...but the owner cut me short amd asked me bluntly if they could go ahead with the refund of only copper tripeptide serum or not. I agreed for the partial refund fearing even that might get stuck.\n\nI am sad,angry , frustrated and feeling a little agitatedand cheated ..\n\n\nDone with the brand EARTH RHYTHM for ever....\nAnd yes I lost 1100 bucks of my hard earned money in the pursuit..\n\nI might be labelled as a hater or someone trying to bring down the brand.trust me I never wanted to do this on a public platform .\nI sent them dms and emails...but the double standards of that brand left me with no choice..they sold me faulty products very well knowing their own shortcomings and then deny me full refund to which I m entitled for as a customer.",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "rifat_yasin",
        "body": "If it weren't for this sub, I wouldn't have known about the issues with their pH. Sadly, not everyone is following this sub and are spending a huge amount on their actives. :/",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "vidushirastogi1708",
        "body": "I think they hit a sweet spot with their shampoo bars etc. After that, on a roll totally. Obviously positive marks for commitment to green packaging etc. Sometimes I wonder if indian customers are bringing this upon themselves. There's a huge distrust of \"chemicals\" and too much focus on \"clean beauty\" at the cost of science and logic😐",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "randomnameiam",
        "body": "Oh and the cherry on top is that they won't let you post any negative comments on their website. I asked them about this multiple times on instagram. They deleted my comments on their posts and ignored my DMs.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "AparajitaG",
        "body": "So other than the cleansing balm, is there anything worth purchasing from Earth Rhythm?? So disappointed!",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "Lizari",
        "body": "I started following them from the beginning initially it was really sweet and nice but all of a sudden I don’t know how it started launching tonnes of different products , with a new website, as if some body was in a hurry and wanted to copy as much stuff as possible from other brands. Bha, AHa, Bakuchiol, snail mucin, etc, at such low prices, 😳 and so many bloggers even recommending and collaborating promoting the products. I mean everything seemed so fishy, and thank you for this post for speaking up.                           \nAs a broke student even I would want to buy the stuff that resembles Products of the higher end brands and sold so cheap, with bloggers providing juicy discounts; and basically buy something that does absolutely nothing.             It’s better to save up and buy one better formulated product with transparent ingredients and reviews, even if it costs more and then compare the effects and finally push Indian brands like earth rhythm to improve and provide quality rather than quantity.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "glossysiren",
        "body": "Thank you for the detailed review! I was really interested in the bakuchiol serum and the vitamin c serum but looks like I dodged a bullet. \n\nI heard many rave reviews of the lip balms and bought the honey one but it was extremely waxy. Also every flavour of their lip balm has the same ingredient list on the website which is a bit sketchy imo. \n\nHopefully they'll take this feedback and reformulate their products to work better.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "aaaakchooo",
        "body": "Thanks for the very detailed review, OP! I had my eyes on Acnes toner and your review convinced me to buy it. I'd been thinking of trying out ER's skincare and thanks to this, I'll be staying away for a while.\n\nReally appreciate your efforts! You're a true influencer 😉",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "notsosmooth13",
        "body": "Thank you for your detailed review! May I ask how long it took for the brand to respond and how did you reach out to them?\n\nThey haven’t been responding to any of my questions on Insta or via the contact form.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Micdrop74",
        "body": "Thank you for the detailed review. My personal experience with Pure bubbles soapery has not been great either. Looking at the others experiences with indie skincare brands has just put me off them now.\nGlad they refunded your money though.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Alarming-Leopard-514",
        "body": "😥😥😥 I literally just placed an order which them on their recent flash sale. I ordered 1 phytogel and 1 mandelic acid as I can’t get the ordinary one. I don’t know if i should get it cancelled ???? It’s still not shipped yet, I don’t want my skin to breakout more 😖 I think u received their lip balm which was a huge fail for me, I don’t know why they are selling such shit products if they can’t formulate it right. What good does having an ecocert certificate do if products do this to ur skin 😶😶 seems u can’t trust anyone these days. I hope suganda launches mandelic acid soon",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Mehranzad",
        "body": "Appreciate that you took so much time and effort in writing such an eloquent and detailed review, but also sad at the same time the products didn't workout as intended to be, I was really high on Earth Rhythm and was actually looking through this sub and you completed my quest, however not taking my chances now to give them a try.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "UnevenHanded",
        "body": "Thanks so much for the review and the effort you took to test the pH and stuff!. That part is what gets me... I mean, vitamin C is acidic to begin with.. And they over buffered it... Or...??? I don't even. And including/ not including ingredients as and when they see fit? ... Nope.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Any_Decision",
        "body": "Wow you just saved me a good amount of money! Was just about to place an order. Appreciate this a lot! Thank you! ❤️",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "loveandlightxoxo",
        "body": "Omg i was just about to order earth rhythmi vitamin c serum ! Thank goodness. Have you tried neemli, sugandha and pure by Priyanka products? They all have vitamin c serums. But now I’m apprehensive about these homegrown brands. I better go back to my kiehls vitamin c serum. Expensive but worth it. Don’t wanna put my skin at risk trying all these cheap affordable brands.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "debangana_sarkar",
        "body": "I just received the Earth rhythm Matcha green tea cleansing balm today. \nI had researched a lot on non comedogenic cleansing balms and thought this would be a good option. The ingredient list in their website looked promising. \n\nHowever, when I checked the ingredient list in the product I received, it was completely different. It has cetearyl alchohol and ceteareth 20 as the 3rd ingredient and no salicylic acid. \n\nI sent them a DM on insta and even mailed them. But no reply! \n\nIf anyone else have faced this please speak.. I wish I had found this post before. \nBut I had ordered it on Amazon and they claim that it is a genuine soapworks product. Everything is similar except the ingredient list.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "24pri",
        "body": "I recently placed an order for their cleansing balm, hair serum, shampoo bar I am sceptical know😢",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ladyphoenix0007",
        "body": "Can anyone suggest a good serum for oily and acne prone skin? I had just bought ER clear skin serum and have been breaking out. I thought this to be purging of skin. Only after reading this post I have realized my mistake in buying from them.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "yamraj212",
        "body": "Hey, are there any alternatives for the 0.5% FERULIC ACID, 15% VITAMIN C, 1% VITAMIN E MULTIVITAMIN AGE DEFENSE SERUM  that you were able to find?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Academic-kavishnu",
        "body": "Hi I bought ER phyto gel and clear skin aha bha exfoliating cleanser. Do these react badly. Are these breaking out ur skin. I think it's not serving me well. Do I need to stop. Requesting ur guidance.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Strange_Squirrel_63",
        "body": "Horrible experience here too. \n\nOrdered their coconut milk body lotion with spf 50. \n\nCoconut milk. It smells like mosquito repellent. 🤢🤮\n\nReached out to them and they said it is because of cardomomum oil (whatever that is) and I wonder why it even is in a product that is marketed as coconut milk lotion. Product development, execution, quality all -100.\n\nTheir policy is not to exchange so I'll have to smear this on the walls of my room to keep mosquitoes away now. \n\nDo not buy!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "crabsouper",
        "body": "FRAUD ALERT - BEWARE! They are liars and very rude customer service, that is you manage to get a response even. Also, first they offer discounts when you are adding items in the cart but they increase the price suddenly when you are about to make the payment. Absolute fraudsters.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "sk_desertrose",
        "body": "Thank you OP ❤️",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "navigating40s",
        "body": "Their products have improved with time. I have extremely dry skin on face and body, their butter soaps and photo ceramide lotion are god send. I absolutely love thephyto gel with horsetail extract for an overnight mask once a week. I stay clear from their actives.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 25,
      "top_level": 25,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "e9o26s",
    "title": "Olaplex 4 and 5, do they really repair damaged hair or is it all a siliconed lie?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/e9o26s/olaplex_4_and_5_do_they_really_repair_damaged/",
    "score": 105,
    "num_comments": 74,
    "created": "2019-12-12T14:13:06+00:00",
    "body": "Hi everyone! \nI'm considering buying olaplex n4 and n5 after seeing so many beautiful pictures of the results online. \nHowever, as I was on Sephora's website I decided to check the ingredients and saw that there are lots of silicones in these products. \nSo now I'm wondering if my hair is just going to appear healthy while slowly dying inside a silicon prison or what? \n\nHere are the ingredients listed for the conditionner by the way :\n\nBis-Aminopropyl Diglycol Dimaleate: Repairs damaged hair and protects from damage. Water, Cetearyl Alcohol, PPG-3 Benzyl Ether Myristate, Caprylic/Capric Triglyceride, Cetyl Alcohol,Octyldodecyl Ricinoleate, Quaternium-91, Cetrimonium Chloride, Divinyldimethicone/Dimethicone Copolymer, Behentrimonium Chloride, Glycerin, Cetyl Esters, Isododecane, Bis-Aminopropyl Diglycol Dimaleate, Fragrance, Panthenol, Phospholipids, Dimethicone PEG-7 Isostearate, Pseudozyma Epicola/Argania Spinosa Kernel Oil Ferment Filtrate, Pseudozyma Epicola/Camellia Sinensis Seed Oil Ferment Extract Filtrate, Tocopheryl Linoleate/Oleate, Quaternium-95, Propanediol, Punica Granatum Extract, Morinda Citrifolia Fruit Extract, PEG-8, Euterpe Oleracea Fruit Extract, Camellia Sinensis Seed Oil, Crambe Abyssinica Seed Oil, Hydroxypropyl Cyclodextrin, Persea Gratissima (Avocado) Oil, Vitis Vinifera (Grape) Seed Oil, Disodium EDTA, Polysilicone-15, C11-15 Pareth-7, Hydroxypropyl Guar, Glycine Soja (Soybean) Oil, PEG-45M, PEG-7 Amodimethicone, Amodimethicone, C12-13 Pareth-23, C12-13 Pareth-3, Laureth-9, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, PEG-4, Phenoxyethanol, Hexyl Cinnamal.\n\nAny thoughts? Thanks in advance!\n\nEdit: I'm overwhelmed with the number of replies I got, thank you so much for your advices :) I ordered olaplex 3 and 4 and can't wait to see how my hair likes them !",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "arushofblood",
        "body": "Olaplex *does* work.. sort of. \n\nI’m on mobile so I can’t link it, but the molecule that repairs your bonds is patented by Olaplex and you can look it up. It will cite the research behind it. However, what you’ll discover in the patent that olaplex doesn’t advertise is that the effect is temporary, which suggests that the bonds formed are not as strong as your natural hair bonds, and you must reapply olaplex at least every 6 weeks.",
        "score": 64,
        "is_top_level": true
      },
      {
        "author": "agrajag255",
        "body": "Lab muffin did some in depth research on olaplex. [lab muffin olaplex](https://labmuffin.com/how-does-olaplex-hair-treatment-work/)\n\nEdit: I’m a hairstylist and I love using it on others and it definitely saved my own hair after a bad hair melting situation.",
        "score": 47,
        "is_top_level": true
      },
      {
        "author": "kissxokissxokill",
        "body": "Hairstylist/Olaplex advocate here!\n\nOlaplex does have silicones, however, they are water soluble. So when you rinse, they flush out of the hair. All silicones are not created equal! The silicones within Olaplex are of the highest grade, and do not \"coat\" the hair in anyway- whatever bond repair is achieved by use is not a \"silicone lie\". Olaplex was created by organic chemists to help relink disulfide bonds. \n\nThe bonds that Olaplex creates are permanent- however, all disulfide bonds are broken by thermal, chemical, mechanical, and *some* environmental damage. This is why it is suggested that you use Olaplex regularly!",
        "score": 46,
        "is_top_level": true
      },
      {
        "author": "littlefuss",
        "body": "All of your hair outside of your scalp is technically “dead”. So once it’s damaged, you can’t really fix it to make it incredibly healthy again, all you can do is make it appear and feel healthy. My hair is absolutely fried, like to the point of being gummy, and Olaplex has definitely made it feel a lot better.",
        "score": 38,
        "is_top_level": true
      },
      {
        "author": "skincare_obssessed",
        "body": "I think no. 3 is their best at home product. It definitely saved my hair so if I was going to use any of their products it would be that.",
        "score": 35,
        "is_top_level": true
      },
      {
        "author": "Stepane7399",
        "body": "I’ve wondered this at least once. Of course, silicone is just fine and does a great job of smoothing hair, but it’s hard to wonder if that’s not exactly what’s behind the love people have for his formula.",
        "score": 19,
        "is_top_level": true
      },
      {
        "author": "hairgenius10",
        "body": "I’m a hairstylist...here’s the simple explanation:\n\n1. There are many different types of silicone, and all of them are not bad for your hair.\n\n2. When you use a full product line/hair care system consistently you will get far better results than if you neglect to use part of that system. The products are meant to compliment each other.\n\n3. Using a different shampoo and conditioner could counteract the results of the olaplex treatment. Let’s say there’s an ingredient in a shampoo that doesn’t “mix” well with the bonding treatment, but you wouldn’t know until after you use it a few times(and the change could be mistaken for thinking the olaplex treatment is wearing off it wasn’t worth it, etc. when the shampoo is the actual culprit).\n\n4. If you get an olaplex treatment, but do not use the shampoo and conditioner...it’ll be okay, but it will be much better if you do use it.\n\n5. Olaplex was originally rolled out as just a pH bonder for in-salon services. They didn’t not introduce 4 & 5 until a few years later. So there’s that.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "LethalWolf",
        "body": "I just finished my Olaplex 4 & 5 bottles and I was not impressed, didn't repurchase. Their shampoo, #4, was better than their conditioner, #5. The conditioner didn't hydrate my hair at all.\n\nI just bought the Alterna Caviar Mouisture Shampoo & Conditoner and omg they're the best shampoo & conditioners I've ever used in my entire life!! Especially the conditioner! They're really expensive though, like $52 each bottle, but I got them during a Nordstrom Black Friday sale for about 50% off.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "dontwannabewrite",
        "body": "I have used olaplex for almost a year and haven't noticed any change at all. I don't get the hype around it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "sissyrobin89",
        "body": "The shampoo and conditioner are the best I’ve ever used, and I’ve tried a lot, from drugstore to kerastase. The treatment is amazing too",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lollylozzle",
        "body": "Olaplex will help but not fix the problem, it’s more to prevent further damage. Best option is to get a haircut",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "lessonsinnj",
        "body": "#3 doesn’t have any silicones, but I looked at some of their other products, and I’m a little put off my the silicones. I know some people say they’re not that bad, but any time I use them I can feel them in my hair.",
        "score": -2,
        "is_top_level": true
      },
      {
        "author": "palmssalonn",
        "body": "Olaplex works great on damaged hairs. If you have dry hairs who should go for this treatment. Book an appointment for such treatment at [http://palms-salon.com/](http://palms-salon.com/) or place a call at (646) 599-3342 for for bookings.",
        "score": -4,
        "is_top_level": true
      },
      {
        "author": "madwomanwithacamera",
        "body": "There's 5 silicones I can identify off hand, so yes it's a silicone lie & so is any product claiming to repair damaged hair. Hair is dead, like fingernails & once it's damaged the only way to get rid of it is to cut it off",
        "score": -11,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 14,
      "top_level": 14,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlygirl",
    "post_id": "xxlwkm",
    "title": "Something in Ouidad Curl Recovery Melt-Down Extreme Repair Mask burning my face",
    "url": "https://www.reddit.com/r/curlygirl/comments/xxlwkm/something_in_ouidad_curl_recovery_meltdown/",
    "score": 17,
    "num_comments": 12,
    "created": "2022-10-07T01:21:59+00:00",
    "body": "I recently bought the Ouidad Curl Recovery Melt-Down Extreme Repair Mask, and it seems to be making my scalp and face burn a bit when I use it, and my face is quite red when I get out of the shower. Just saw a similar review on Dermstore ([https://www.dermstore.com/ouidad-curl-recovery-melt-down-extreme-repair-mask-177ml/11749844.html](https://www.dermstore.com/ouidad-curl-recovery-melt-down-extreme-repair-mask-177ml/11749844.html)) and I'd love help figuring out what ingredient(s) is/are doing it. Has anyone else had a similar experience? I know the answer might be \"idk but why tf are you still using it?\" and I'm okay with that haha, but it was expensive and I'd love to at least get a little knowledge out of it if it doesn't work out.\n\nAlso it looks like Ouidad has discontinued it, as it's not on their website...\n\nIngredient list:\n\nWater  (Aqua), Cetearyl Alcohol, C12-15 Alkyl Benzoate, Stearamidopropyl  Dimethylamine, Propanediol, Glycerin, Bis-Hydroxy/Methoxy  Amodimethicone, Behentrimonium Chloride, Cetrimonium Chloride,  Behentrimonium Methosulfate, Methyl Hydroxycellulose, Cetyl Esters,  Cetyl Alcohol, Trichilia Emetica Seed Butter, Citrullus Lanatus  (Watermelon) Seed Oil, Hydrogenated Castor Oil/Sebacic Acid Copolymer,  Passiflora Edulis (Passion Fruit) Seed Oil, Euterpe Oleracea (Acai) Pulp  Oil, Raphanus Sativus (Radish) Seed Oil, Tocopheryl Acetate, Oriza  Sativa (Rice Bran) Oil, Disodium EDTA, Panthenol, Limnanthes Alba  (Meadowfoam) Seed Oil, Quaternium-91, Simmondsia Chinensis (Jojoba) Seed  Oil, Cetrimonium Methosulfate, Persea Gratissima (Avocado) Oil,  Ethylhexylglycerin, C10-40 Isoalkylamidopropylethyldimonium Ethosulfate,  Cocos Nucifera (Coconut) Oil, Dipropylene Glycol, Lactic Acid, Guar  Hydroxypropyltrimonium Chloride, Butyene Glycol, Vanillyl Butyl Ether,  Phenoxyethanol, Fragrance.\n\nNote, also realized this isn't totally CG, as it has Bis-Hydroxy/Methoxy Amodimethicone.\n\nTIA!",
    "flair_text": "Product help",
    "flair_template_id": "376ffad4-d107-11eb-96b0-0eedca2fc703",
    "comments": [
      {
        "author": "cfrankieee",
        "body": "Did my own homework, wondering if these two might be giving me issues?\n\nbehentrimonium chloride:  [https://rootsandcurls.com/ingredient/behentrimonium-chloride](https://rootsandcurls.com/ingredient/behentrimonium-chloride)\n\nethylhexylglycerin:  [https://rootsandcurls.com/ingredient/ethylhexylglycerin](https://rootsandcurls.com/ingredient/ethylhexylglycerin)\n\nI generally think most products are just fine, but I've been trying to get a handle on my rosacea recently so it's got me paying more attention.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Animekaratepup",
        "body": "I don't know how to help you with this, but you might be able to tell the company it's giving you a reaction and get something out of it.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "parti_naturalist",
        "body": "I’m so glad I found this post! I just got done frantically rinsing this out of my hair after my skin started to feel like it was close to a bonfire. I don’t have color treated hair or sensitive skin so I’m shook! I emailed Ouidad and will reply back here if they have a response. \n\nDid you reach out to them?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Fast-Information-185",
        "body": "I’ve used Ouidad products for 20 years and have even used this mask before. I picked some up at TJ Maxx for $8. Low and behold, I had the burning effect too. I ignored it at first, wondering if it was caused my using Ouidad’s deep treatment (also now discontinued). However, I don’t think I lasted 10 minutes before I had to rinse it out. I immediately grabbed my reading glasses to see if I bought some sort of relaxer rather than a hair mask. \n\nAt least one comment that came up in a Google search claims this is supposed to be normal. WTH! Just why did someone think this was a good idea? \n\nI would bet my bank account whatever formulation hanged that clearly occurred happened after the company was sold. SMH",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "78oqmj",
    "title": "What makes a split end sealer a sealer?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/78oqmj/what_makes_a_split_end_sealer_a_sealer/",
    "score": 11,
    "num_comments": 9,
    "created": "2017-10-25T16:17:18+00:00",
    "body": "I am so happy to have stumbled upon this community! I had several inches cut off my hair and the stylist recommended [Redken Extreme Lengths Sealer](http://www.ulta.com/extreme-length-sealer?productId=xlsImpprod11951117). \n\nI couldn't afford it so decided to hold off, and I wondered what sets sealers apart from other products aimed toward avoiding/minimizing the appearance of split ends. \n\n**Ingredients:** Water, Amodimethicone, Cetearyl Alcohol, Trideceth-5, Polyquaternium-37, Phenoxyethanol, Propylene Glycol Dicaprylate / Dicaprate, Steareth-20, Parfum / Fragrance, Glycerin, Phenyl, Trimethicone, Cetyl Hydroxyethylcellulose, Trideceth-10, Cetyl Alcohol, PPG-1 Trideceth-6, Prunus Amygdalus Dulcis Oil / Sweet Almond Oil, Biotin, Polyquaternium-67, Arginine, Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate,Benzyl Benzoate, 2-Oleamido-1, 3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid Behentrimonium Methosulfate, Chlorhexidine Digluconate, Quaternium-33, Sodium Nitrate Benzyl Benzoate, 2-Oleamido-1,3-Octadecanediol, Hydrolyzed Soy Protein, Limonene, Benzyl Alcohol, Linalool, Silica, Sodium Acetate, Polysorbate 60, Hydrolyzed Vegetable Protein PG-Propyl, Silanetriol, Sodium Hydroxide, Citric Acid.\n\nI am also curious if [Not Your Mother's Way to Grow Leave In Conditioner](http://www.ulta.com/way-grow-leave-in-conditioner?productId=xlsImpprod6340354&sku=2270344&cmpid=PS_Non!google!Product_Listing_Ads&cagpspn=pla&CATCI=pla-195671275470&CAAGID=17996762790&CAWELAID=330000200000108699&catargetid=330000200000773138&cadevice=m&gclid=CjwKCAjw7MDPBRAFEiwAppdF9KAqiW1sDct8rIom3o5Yhh4loq8lEcyl_1sOPdgtIszBtET81iKRORoCZMcQAvD_BwE) has any ingredients with sealing properties. They state they have a top secret \"procapify\" formula but they don't delve into, what that means.\n\n**Ingredients:** Water, Butylene Glycol, Cetearyl Alcohol, Cetyl Triethylmonium Dimethicone PEG-8 Succinate, Fragrance, Quaternium-91, Propylene Glycol, Diazolidinyl Urea, Myristyl Myristate, Hydrolyzed Keratin, PPG-26-Buteth-26, Behentrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Iodopropynyl Butylcarbamate, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Citric Acid.\n\nThanks for any clarity you guys can bring to this! ",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "graythunderclouds",
        "body": "The only product on the market right now that will specifically mend split ends is b3 from Brazilian blowout. However, this is an in salon additive to a dye or flossing treatment. The simplest way to explain it is that the b3 works like doubled sided tape inside each hair strand and helps the strands reform as one strand. This treatment is only designed to last 6ish weeks, and is not a permanent long term fix.\nAlmost all products sold as a split end “repair” treatment will not actually repair the split ends. They’re most likely smoothing the hair shaft to give the appearance of less split ends, and it washes out when you wash your hair. The emollients concentration in these products is heavy, so they can be very challenging to people with oily hair, because you are essentially adding more oil to the hair.  These products will not help repair the split ends, they more likely mask the problem. \n\nThe only way to get rid of split ends once they are actually splitting is to get a haircut.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "graythunderclouds",
        "body": "The hydrolyzed keratin in  the not your mother’s product should essentially act as a very mild sealant, but they won’t actually repair anything",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Peanutswithcream",
        "body": "Remember seeing somewhere that the best thing for split ends is cutting them off...",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "4cezaq",
    "title": "Help! Hair doesnt feel the same anymore? Don't know whats wrong!",
    "url": "https://www.reddit.com/r/HaircareScience/comments/4cezaq/help_hair_doesnt_feel_the_same_anymore_dont_know/",
    "score": 10,
    "num_comments": 5,
    "created": "2016-03-29T11:13:57+00:00",
    "body": "So, 4 months ago i started taking care of my hair by going sulfate/silicone free and buying a water softener for my shower. I Shampoo/Condition my hair 2-3 times a week and dried with a T-shirt. Everything was going great until a week ago where I noticed my hair didn't feel the same anymore. I don't know how to describe it, but it almost feels rough and in need of conditioner? and my ends feel drier that normal. I am not sure whats happening my first thought was damage since I've been growing it out for almost a year without a trim or a cut. Now i'm starting to think that there is some sort of build up? What do you guys think? I have thick wavy/curly hair. Also, how do you know if your hair is moisturized? I always thought soft silky elastic hair = moisturized which is why I am writing this post because it no longer feels soft and silky, it feels rough.\n\nHeres the Shampoo  https://www.makeupalley.com/product/showreview.asp/ItemId=133656/Kirkland-Moisture-Shampoo/Unlisted-Brand/Hair \n\nIngredients: water sodium cocoyl isethionate cocamidopropyl hydroxysultaine methyl isethionate disodium cocoyl glutamate sodium lauryl sulfoacetate decyl glecoside ammonium cocoyl isethionate divinyldimethicond/dimethicone copolymer disodium laureth sulfosuccinate helianthus annus (sunflower) seed oil lycium barbarum fruit extract aloe barbadensis leaf extract camellia sinesis leaf extract cucumis sativus (cucumber) fruit extract persea gratissima (avocado) fruit extract punica granatum extract melanin vitis vinifera (grape) seed extract glycol disterate glycerin fragrance quaternium-91 sodium cocoyl glutamate peg-120 methyl glucose dioleate amodimethicone panthenol polyquaternium-10 ppg-3 benzyl ether myristate chlorphenesin methyl gluceth-20 guar hydroxypropyltrimonium chloride c11-15 pareth-7 laureth-9 phospholipids hydrolyzed vegetable protein pg-propyl silanetriol c12-13 pareth-23 c12-13 pareth-3 trisodium ethylenediamine disuccinate trideceth-12 superoxide dismutase sodium ascorbyl phosphate tocopheryl acetate methylchloroisothiazolinone methylisothiazolinone\n\nConditioner: http://www.makeupalley.com/product/showreview.asp/ItemId=133657/KIRKLAND-MOISTURE-CONDITIONER/Unlisted-Brand/Hair\n\nIngredients: water cyclopentasiloxane cetearyl alcohol stearyl alcohol cetrimonium chloride behentrimonium methosulfate helianthus annus (sunflower) seed oil lycium barbarum fruit extract aloe barbadensis leaf extract camellia sinesis leaf extract cucumis sativus (cucumber) fruit extract persea gratissima (avocado) fruit extract punica granatum extract melanin vitis vinifera (grape) seed extract helianthus annus (sunflower) seed extract glycereth-26 dimethiconol divinyldimethicone/dimethicone copolymer fragrance gluconolactone cetrimonium bromide panthenol ppg-3 benzyl ether myristate jojoba esters quaternium-91 amodimethicone hydroxyethylcelloulose cetrimonium methosulfate sodium benzoate c11-15 pareth-7 peg-45m laureth-9 aminomethly propanol glycerin butyrospermum parkii ( shea butter) c12-13 pareth-23 c12-13 pareth-3 cinnamidopropyltrimonium chloride (sunscreens) trideceth-12 citric acid ethylhexyl methoxycinnamate sodium ascorbyl phosphate butylene glycol hydrolyed soy protein tocopheryl acetate (vitamin e) hydrolyzed vegatable protein pg-propyl silanetriol\n\nedit: Some more info, My hair is just above shoulder length, when i get in the shower i use a wide tooth comb to get rid of knots then i soak my hair with warm water then lather the shampoo all over scalp and from root to end then rinse then i take a huge blob of Conditioner and use it the same way and leave it in for 1-2 minutes then rinse with cold water.\n\nThanks for the help! ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Barefooted23",
        "body": "Maybe I'm missing something, but don't both of those have dimethicone?  It'll block your hair's ability to get moisture, which could be why it's drying out.\n\nEdit: after looking at the pictures you linked, the bottles claim to be free of a lot of things but I don't see silicone on the list.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "spoolingthreads",
        "body": "Both of those ingredient lists contain dimethicone which is a silicone. The shampoo also contains polyquaternium-10 -- some people's hair is sensitive to polyquat build up. I'm guessing you've got some build up. The fine folks at r/curlyhair may be helpful to you. If you follow the \"curly girl method,\" you'd need to use a sulfate shampoo to get the silicone build up out one last time, then switch over to a true silicone/sulfate free routine. If you have wavy/curly hair, you may want to start deep conditioning as well since curly hair tends to be dry.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mistrait",
        "body": "Check you water softener and see if it is working properly, Im not familiar with that shampoo, Is it professional?  If not maybe you are drying it out or putting a buildup on your hair.  To remove a mild build up use some baking soda in a cleansing shampoo massage through hair and let it set about 5 minutes, Rinse. shampoo again with a moisturizing shampoo and then condition.  I would use professional shampoo. Good Luck!!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "4cf0cy",
    "title": "Help! Hair doesn't feel the same anymore? Don't know whats wrong!",
    "url": "https://www.reddit.com/r/curlyhair/comments/4cf0cy/help_hair_doesnt_feel_the_same_anymore_dont_know/",
    "score": 8,
    "num_comments": 5,
    "created": "2016-03-29T11:24:40+00:00",
    "body": "So, 4 months ago i started taking care of my hair by going sulfate/silicone free and buying a water softener for my shower. I Shampoo/Condition my hair 2-3 times a week and dried with a T-shirt. Everything was going great until a week ago where I noticed my hair didn't feel the same anymore. I don't know how to describe it, but it almost feels rough and in need of conditioner? and my ends feel drier that normal. I am not sure whats happening my first thought was damage since I've been growing it out for almost a year without a trim or a cut. Now i'm starting to think that there is some sort of build up? What do you guys think? I have thick wavy/curly hair. Also, how do you know if your hair is moisturized? I always thought soft silky elastic hair = moisturized which is why I am writing this post because it no longer feels soft and silky, it feels rough.\n\nHeres the Shampoo https://www.makeupalley.com/product/showreview.asp/ItemId=133656/Kirkland-Moisture-Shampoo/Unlisted-Brand/Hair\n\nIngredients: water sodium cocoyl isethionate cocamidopropyl hydroxysultaine methyl isethionate disodium cocoyl glutamate sodium lauryl sulfoacetate decyl glecoside ammonium cocoyl isethionate divinyldimethicond/dimethicone copolymer disodium laureth sulfosuccinate helianthus annus (sunflower) seed oil lycium barbarum fruit extract aloe barbadensis leaf extract camellia sinesis leaf extract cucumis sativus (cucumber) fruit extract persea gratissima (avocado) fruit extract punica granatum extract melanin vitis vinifera (grape) seed extract glycol disterate glycerin fragrance quaternium-91 sodium cocoyl glutamate peg-120 methyl glucose dioleate amodimethicone panthenol polyquaternium-10 ppg-3 benzyl ether myristate chlorphenesin methyl gluceth-20 guar hydroxypropyltrimonium chloride c11-15 pareth-7 laureth-9 phospholipids hydrolyzed vegetable protein pg-propyl silanetriol c12-13 pareth-23 c12-13 pareth-3 trisodium ethylenediamine disuccinate trideceth-12 superoxide dismutase sodium ascorbyl phosphate tocopheryl acetate methylchloroisothiazolinone methylisothiazolinone\n\nAnd the Conditioner: http://www.makeupalley.com/product/showreview.asp/ItemId=133657/KIRKLAND-MOISTURE-CONDITIONER/Unlisted-Brand/Hair\n\nIngredients: water cyclopentasiloxane cetearyl alcohol stearyl alcohol cetrimonium chloride behentrimonium methosulfate helianthus annus (sunflower) seed oil lycium barbarum fruit extract aloe barbadensis leaf extract camellia sinesis leaf extract cucumis sativus (cucumber) fruit extract persea gratissima (avocado) fruit extract punica granatum extract melanin vitis vinifera (grape) seed extract helianthus annus (sunflower) seed extract glycereth-26 dimethiconol divinyldimethicone/dimethicone copolymer fragrance gluconolactone cetrimonium bromide panthenol ppg-3 benzyl ether myristate jojoba esters quaternium-91 amodimethicone hydroxyethylcelloulose cetrimonium methosulfate sodium benzoate c11-15 pareth-7 peg-45m laureth-9 aminomethly propanol glycerin butyrospermum parkii ( shea butter) c12-13 pareth-23 c12-13 pareth-3 cinnamidopropyltrimonium chloride (sunscreens) trideceth-12 citric acid ethylhexyl methoxycinnamate sodium ascorbyl phosphate butylene glycol hydrolyed soy protein tocopheryl acetate (vitamin e) hydrolyzed vegatable protein pg-propyl silanetriol\n\nedit: Some more info, My hair is just above shoulder length, when i get in the shower i use a wide tooth comb to get rid of knots then i soak my hair with warm water then lather the shampoo all over scalp and from root to end then rinse then i take a huge blob of Conditioner and use it the same way and leave it in for 1-2 minutes then rinse with cold water.\n\nThanks for the help!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "SmellsLikeDogBuns",
        "body": "It could be build up. I see silicones in both the shampoo and conditioner and some people avoid polyquats because they can build up, too.\n\nIf you continue to use shampoo, I would recommend putting it near your roots only and using the pads of your fingers to scrub your scalp. Rinsing your hair will have the shampoo run down your strands to clean them. You can also consider combing once your hair is saturated with conditioner and not rinsing all of it out.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "bluethreads",
        "body": "I would definitely clarify with a  sulfate shampoo if I were you- I am using sulfate, silicone, and polyquat free products- but my hair still gets a ton of build up that doesn't go away with my sulfate free shampoo.  The build up makes my hair look terrible. I have to use the sulfate shampoo every one - two weeks. You have to see what works for your hair.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Smills09",
        "body": "Sulphate and silicone free doesn't always work for everyone. I had beautiful hair for some of it but then had to give it up because of the damage over long term use. \nIt's amazing when it works but it still will depend on your hair type.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NewBeauty",
    "post_id": "lmqxa5",
    "title": "Revolution Haircare has Launched with Tons of new products",
    "url": "https://www.reddit.com/r/NewBeauty/comments/lmqxa5/revolution_haircare_has_launched_with_tons_of_new/",
    "score": 6,
    "num_comments": 2,
    "created": "2021-02-18T16:40:52+00:00",
    "body": "REVOLUTION HAIRCARE PLEX 3 BOND RESTORE TREATMENT - they have about 20+ new hair products live on  [https://www.beautybay.com/l/revolutionhaircare/](https://www.beautybay.com/l/revolutionhaircare/)\n\nLooks like some of the products feature similar ingredients to Olaplex (Quaternium-91)  , except much more affordable.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IUVENI",
    "post_id": "1abts9y",
    "title": "Natural ingredients?",
    "url": "https://www.reddit.com/r/IUVENI/comments/1abts9y/natural_ingredients/",
    "score": 3,
    "num_comments": 0,
    "created": "2024-01-26T21:42:14+00:00",
    "body": " \n\n1. Water: Solvent and base.\n2. Helianthus Annuus (Sunflower) Seed Oil: Conditions hair, provides nutrients and antioxidants.\n3. Cetearyl Alcohol: Emollient, thickener, carrying agent.\n4. Behentrimonium Methosulfate: Gentle conditioning agent, detangles, softens hair.\n5. Cetyl Alcohol: Thickens product, provides creamy texture.\n6. C10-40 Isoalkylamidopropylethyldimonium Ethosulfate: Conditioning properties.\n7. Phenoxyethanol: Preservative.\n8. Fragrance: Adds scent. (flavorchem created our fragrance)\n9. Glycerin: Humectant, draws moisture into hair.\n10. Acetic Acid: Helps with scalp pH balance.\n11. Hydrolyzed Keratin: Repairs and strengthens hair.\n12. Hydrolyzed Collagen: Improves hair texture and elasticity.\n13. Tetrasodium Glutamate Diacetate: Chelating agent.\n14. Ethylhexylglycerin: Skin conditioning agent, preservative.\n15. Quaternium-91: Conditioning agent, improves manageability.\n16. Cetrimonium Methosulfate: Conditioning agent, prevents static and build-up.\n17. Sodium Hydroxide: pH adjuster. (This may be used by the company we use to create our product to adjust the required ph for IUVENI Quencher. Such a little amount, may not even be in every bottle but we list it because there is a small chance they had to use it to adjust the pH.)\n\nIt is safe enough to eat if you wanted but I don't recommend it. It doesn't taste very good.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "21cecc",
    "title": "REVIEW - Leonor Greyl Shampoo and Orchid Mask",
    "url": "https://www.reddit.com/r/curlyhair/comments/21cecc/review_leonor_greyl_shampoo_and_orchid_mask/",
    "score": 3,
    "num_comments": 1,
    "created": "2014-03-25T18:50:59+00:00",
    "body": "Hi, /r/curlyhair!  Long time lurker, first time poster!  I got these two products as a Christmas gift and used them for a few months before I decided to buckle down and write a review.  Here goes, please feel free to ask any questions!  \n\n**Basic Info** \n\nLeonor Greyl is a luxury natural hair care line.  I personally am a sucker for high-end products so I had to try these.  The shampoo/conditioners I usually use are the Cristalliste line from Kerastase (the pink bottles).  My hair is naturally 3B but I flat iron 1-2 times a week at most and rock it curly otherwise.  \n\nLeonor Greyl has a whole line of different products but the two I will be reviewing are the **Shampooing Reviviscence – Deep Repairing Shampoo for Damaged Hair and the Masque Orchidee — Conditioning Mask for Thick, Dry Hair**\n \n**Shampoo info:** Deep repairing shampoo for dehydrated, colored, damaged and brittle hair. This luxurious shampoo reconditions and restructures the most damaged hair, thus regaining strength and vitality, manageability, shine and softness.\n\n**Mask info:** Silk proteins, vegetal ceramids and oils work together to smooth, detangle, protect and restructure hair fiber. Leaves hair soft and manageable.\n\n\n**Ingredients** (as listed on product):\n\n**Shampoo:** Aqua, Ammonium Lauryl Sulfate, PEG-40 Glyceryl Cocoate, Sodium Coceth sulphate, Decyl Glucoside, Cocamidopropyl dimethylaminohydroxypropyl hydrolysed collagen, Hydrolysed Quinoa, Limonium latifolium, Fucus Vesiculosus Extract, Hydrolysed Silk, Bambusa vulgaris Extract, Myristamine Oxide, Polyquaternium-47, Cetyl Alcohol, Behentrimonium Methosulfate, Quaternium-33, Quaternium-91, Cetrimonium Methosulfate, Cetearyl Alcohol, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, PEG-15 Cocopolyamine, Lauryl Dimethyl Amine Oxide, Parfum (Fragrance), Amaranthus Caudatus Seed Extract, Cereus Grandiflorus (Cactus) Flower Extract, Propylene Glycol, Hydrogenated Vegetable Glycerides, Lactic Acid, Guar, droxypropyltrimonium Chloride, Daucus Carota Extract, Methylchloroisothiazolinone, Methylisothiazolinone, Limonene, Linalool, Geraniol, Butylphenyl Methylpropional\n\n**Mask:** Aqua, Methylheptyl Isostearate, Adipic Acid/Diethylene Glycol/Glycerin Crosspolymer, Hydrogenated Vegetable Glycerides, Cetyl Alcohol, Cocamide MEA, Buxus Chinesis Seed Oil, PEG-15 Cocopolyamine, Orchis Maculata Flower Extract, Cocamidopropyl PG-Dimonium Chloride, Hydrolyzed Sericin, Parfum (Fragrance), Ceteareth-33, Jojoba Wax PEG-120 Esters, Butyrospermum Parkii, Lauryl Dimethyl Amine Oxide,\nElaeis Guineensis (Palm) Oil, Hydrolysed Silk, Guar Hydroxypropyltrimonium Chloride, Triticum Vulgare,\nTrietanolamine, Methylchloroisothiazolinone, Methylisothiazolinone, Benzyl Alcohol\n\n**Price**\n\nSuggested retail for the shampoo is $67 (!) and the mask is $62.  Both are 200 mL (6.8 oz).  I've seen it online on Amazon for cheaper though.  Good thing this was a gift!  \n\n**Where to Buy**\n\nStore retailers are available on Leonor Greyl's website but there are several online retailers that sell this, such as Amazon, Doobop, etc.  \n\n**How to Use**\n\nFor the shampoo, you are supposed to lather and leave it in your hair for 5-minutes before rinsing out.  The mask can be used like a regular conditioner or you can leave it in your hair for 5-minutes if you want to do light conditioning, or 20-minutes for a deep treatment.\n\n**Pros**\n\nAfter the first month or so of using it once a week I noticed a bit of a difference.  My hair felt soft after I washed with these products and it didn't feel stripped.  The shampoo lathers pretty well and the mask spreads really nicely on my hair.  It's like butter.  Curls looked more well-defined.  \n\n**Cons**\n\nThe price.  The smell.  Oh dear lord, the shampoo smells like old ladies.  Consistency of the shampoo is really weird, too.  Maybe I got a bad bottle but it was like some solid stuff mixed in with liquid stuff.  I have to shake the bottle when I get it out and [this](http://i.imgur.com/mEnHADU.jpg) was what it looks like.  The bottle also opens from the bottom so as soon as I opened it the first few times the flood gates opened and all this watery shampoo poured out that I didn't need.  The mask doesn't smell as strongly as the shampoo does but it's pretty pricey, too.\n\n**Overall**\n\nIn my opinion these products were not worth the money.  Considering the price, the amount of product I got, and its performance, I'd rather spend my money on something else.  Without a doubt, these products would be good as a step up from using something like, say, from the drugstore.  The products I was using already were pretty high-end to begin with so it was like a lateral (or dare I say a step down) shift for me.  \n\nIf you're looking to step up from drugstore stuff then check out Ouidad.  If you're using mid-range stuff and are in the market for something HE then go with Kerastase.  \n\nThat being said, don't be discouraged just because of my review!  They have a sampler set on their website you can try if you feel so inclined.  \n\nI really wanted to like these products but I just can't.  Very disappointing but I'm glad I was able to try them.  ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "karmaleenash",
        "body": "Thank you for such a thorough review! I tend to collect high end products and am a bit of a product slut, but then tend to go back to my Deva curl and ouidad products, but I love reading reviews of products.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "y7rk96",
    "title": "Kirkland Signature Moisture Shampoo and Conditioner",
    "url": "https://www.reddit.com/r/curlyhair/comments/y7rk96/kirkland_signature_moisture_shampoo_and/",
    "score": 3,
    "num_comments": 4,
    "created": "2022-10-19T03:28:16+00:00",
    "body": "Hello everyone, onthe Costco Website, it states that the shampoo and conditioner are sulfate free and color safe. Does anyone have any experience using these on curly hair?? Or if not, can anyone tell me if these would be good for curly hair?? These would be such an affordable option since curly hair products can get pricey 😓\n\nIngredient list for shampoo: \nIngredients: Water/Aqua/Eau, Sodium Cocoyl Isethionate, Cocamidopropyl Hydroxysultaine, Potassium Cocoyl Glycinate, Disodium Cocoyl Glutamate, Sodium Lauroyl Methyl Isethionate, Sodium Lauroyl Sarcosinate, Decyl Glucoside, Potassium Cocoate, Glycereth-26, Glycol Distearate, Cocamidopropylamine Oxide, Phenoxyethanol, Fragrance (Parfum), Sodium Cocoyl Glutamate, PEG-120 Methyl Glucose Dioleate, Methyl Gluceth-20, Quaternium-91, Amodimethicone, Acrylates Copolymer, Citric Acid, Dicaprylyl Ether, Polyquaternium-10, Guar Hydroxypropyltrimonium Chloride, Chlorphenesin, Trisodium Ethylenediamine Disuccinate, PPG-3 Benzyl Ether Myristate, Glyceryl Oleate, C11-15 Pareth-7, Polyquaternium-39, Laureth-9, Phospholipids, Glycerin, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Polyquaternium-55, Sodium Benzoate, Panthenol, Trideceth-12, Glycine Soja (Soybean) Oil, Acetic Acid, Tetrasodium EDTA, Benzoic Acid, Sodium Hydroxide, Disodium Edta, Potassium Sorbate, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Caprylyl Glycol, Tocopheryl Acetate, Helianthus Annuus (Sunflower) Seed Oil, Alcohol, Tocopherol, Argania Spinosa Kernel Oil, Ascorbic Acid, Persea Gratissima (Avocado) Oil, Copaifera Officinalis (Balsam Copaiba) Resin, Passiflora Edulis Seed Oil, Isomalt, Euterpe Oleracea Fruit Oil, Aloe Barbadensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Quaternium-95, Propanediol, Camellia Sinensis Leaf Extract, Persea Gratissima (Avocado) Fruit Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract, Vitis Vinifera (Grape) Seed Extract, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate.\n\nIngredients for Conditioner: \nIngredients: Water/Aqua/Eau, Cetearyl Alcohol, Stearamidopropyl Dimethylamine, Glycerin, Propanediol, Behentrimonium Methosulfate, Cetrimonium Chloride, Dimethicone, Isododecane, Isohexadecane, Citric Acid, Fragrance (Parfum), Hydroxyethylcellulose, Phenoxyethanol, Caprylyl Glycol, Glyceryl Stearate, PPG-3 Benzyl Ether Myristate, Guar Hydroxypropyltrimonium Chloride, Amodimethicone, Polyquaternium-73, Sodium Benzoate, Quaternium-87, Isopentyldiol, Disodium EDTA, Butyrospermum Parkii (Shea) Butter, Sodium Stearoyl Glutamate, Jojoba Esters, C11-15 Pareth-7, Laureth-9, Trideceth-12, Hydrolyzed Vegetable Protein PG-Propyl Silanetriol, Acetic Acid, Glycereth-26, Sodium Hydroxide, Etidronic Acid, Potassium Sorbate, Helianthus Annuus (Sunflower) Seed Oil, Pentaerythrityl Tetra-di-t-butyl Hydroxyhydrocinnamate, Phospholipids, Argania Spinosa Kernel Oil, Persea Gratissima (Avocado) Oil, Ascorbic Acid, Tocopheryl Acetate, Copaifera Officinalis (Balsam Copaiba) Resin, Isomalt, Quaternium-95, Tocopherol, Panthenol, Passiflora Edulis Seed Oil, Glycine Soja (Soybean) Oil, Euterpe Oleracea Fruit Oil, Hydrolyzed Pea Protein PG-Propyl Silanetriol, Aloe Barbadensis Leaf Extract, Camellia Sinensis Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Lycium Barbarum Fruit Extract, Persea Gratissima (Avocado) Fruit Extract, Punica Granatum Extract, Malus Domestica Fruit Cell Culture Extract, Alcohol, Vitis Vinifera (Grape) Seed Extract, Xanthan Gum, Lecithin, Vitis Vinifera (Grape) Fruit Cell Extract.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "PlumPearls",
        "body": "Not suitable. Both contain silicones.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "It's what I've been using for years. Works for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Nixx_Mazda",
        "body": "They are rebranded major label. This says it's Pureology Hydrate.\n\n[https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/](https://thecostpro.com/pureology-hydrate-disguised-as-costco-signature-shampoo/)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_olaplexno3",
    "post_id": "ggxktb",
    "title": "Best Products for Healthy Hair",
    "url": "https://www.reddit.com/r/u_olaplexno3/comments/ggxktb/best_products_for_healthy_hair/",
    "score": 3,
    "num_comments": 0,
    "created": "2020-05-10T08:15:12+00:00",
    "body": " \n\n# [Olaplex No 3](https://springalways.co/collections/olaplex/products/olaplex-no-3-hair-perfector?gclid=CjwKCAjwqdn1BRBREiwAEbZcR2tZhAPe6C8DUrxfL-vnNh72dz0r362puE3BzZcLIUGRrkUY2uNrtRoCqpUQAvD_BwE) Hair Perfector\n\n[**Olaplex No 3 Hair Perfector**](https://springalways.co/products/olaplex-no-3-hair-perfector?_pos=4&_sid=d22e85e93&_ss=r) is an at-home treatment that contains the similar active ingredients found in all other professional Olaplex products. It is not any kind of conditioner.\n\nIt will surely restore your hair's healthy appearance as well as the texture by repairing damage and protecting your hair structure. **Olaplex No 3** will improve your hair's overall look and increases smoothness. The recorded PH Balance is 3.5-5.\n\n## Features:\n\n**OLAPLEX**’s 3-step ritual is a system that permanently rebuilds your hair's damaged disulphide bonds, which are compromised as a result of colouring, heat styling (from a hairdryer) and everyday wear & tear. It is a once-a-week at-home treatment.\n\n* **Olaplex No 3 Hair Perfector** is designed for at-home usage.\n* Helps to maintain hair integrity, softness & shine too.\n* Provides real, structural repair that surely works.\n* You can use it on the dry hair as well, hence it will just take a little more product to fully saturate the hair. So, the choice is up to the personal preferences of yours.\n* Notice your hair being softer, shinier, and easier to manage with less frizz for weeks.\n* Simple in usage.\n* It is DEA free.\n* Also, it is Aldehydes free.\n* It is formaldehyde-free.\n* Maintain the strong, healthy-looking hair between salon visits and much more.\n\n## Key benefits:\n\n* Addresses the damaged as well as the compromised hair.\n* Strengthens as well as protects the hair structure.\n* Restores healthy appearance as well as the hair texture etc.\n* The **Olaplex No 3** **Hair Perfector** will maintain the strength, structure, integrity, softness and shine of your hair leading up to the client's next service at the salon.\n\n### How to Apply Olaplex No 3?\n\nThere are some steps:\n\n1. Apply a generous amount to the towel-dried hair & comb through.\n2. Leave on for a minimum amount of 10 minutes. Keep in mind, the longer it's on, the more effective it is, especially for hair on which it is applied.\n3. Rinse, shampoo and the condition.\n4. Style as you normally do.\n\nAlso, you can leave it for at least 10 minutes. Most recommended leaving on is for at least 10 minutes. Though, the longer you leave on, the better it can work. However, in general, we recommend using the **Olaplex** **No** **3** weekly to continue the strengthening of bonds and also to repair any damage that is encountered from day-to-day. In case, if you are having more severe damage, then you can use the **Olaplex** **No 3** from 2 to 3 times a week.\n\n### Which hair type is it good for?\n\nSuitable as well as beneficial to all hair types like:\n\n* Straight hair.\n* Wavy hair.\n* Curly hair.\n* Coiled hair.\n* Tightly Coiled hair.\n\n## Ingredients Used\n\n* Water.\n* Propylene Glycol.\n* Cetearyl Alcohol.\n* Bis-Aminopropyl Diglycol Dimaleate.\n* Glycerin.\n* Behentrimonium Methosulfate.\n* Cetyl Alcohol.\n* Phenoxyethanol.\n* Hydroxyethyl Ethylcellulose.\n* Stearamidopropyl Dimethylamine.\n* Quaternium-91.\n* Sodium Benzoate.\n* Cetrimonium Methosulfate.\n* Cetrimonium Chloride.\n* Fragrance.\n* Polyquaternium-37.\n* Tetrasodium EDTA.\n* Butylphenyl Methylpropional.\n* Etidronic Acid.\n* Ascorbic Acid.\n* Phytantriol.\n* Tocopheryl Acetate.\n* Aloe Barbadensis Leaf Juice.\n* Panthenol.\n* Simmondsia Chinensis Seed Oil.\n* Citric Acid.\n* Potassium Sorbate.\n\n### Comes with:\n\n**1 Bottle** \\- Containing 3.3 fl oz quantity.\n\n**Note**: In case of any query, contact our helpline at any time.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "l11c2p",
    "title": "John Frieda Straight Fixation® Styling Crème",
    "url": "https://www.reddit.com/r/HaircareScience/comments/l11c2p/john_frieda_straight_fixation_styling_crème/",
    "score": 2,
    "num_comments": 4,
    "created": "2021-01-20T04:08:14+00:00",
    "body": "I have been using this product for years as a pre-styler. I have very fine, mid-length blond hair. It adds weight to my hair, gives it volume, texture and doesnt clump up. My concern is with the ingredients:\n\n[https://www.johnfrieda.com/en-ca/products/frizz-ease/hair-straightening-cream/](https://www.johnfrieda.com/en-ca/products/frizz-ease/hair-straightening-cream/)\n\n Aqua, Cetearyl Alcohol, Dimethicone, Alcohol, Stearyl Alcohol, Peg-100 Stearate, Glyceryl Stearate, Ceteareth-20, Polysilicone-9, Propylene Glycol Dicaprylate/dicaprate, Diazolidinyl Urea, Propylene Glycol, Polyquaternium-10, Aminopropyl Dimethicone, Dimethiconol, Behentrimonium Chloride, Parfum, Disodim  \nEdta, Cetrimonium Chloride, Dipropylene Glycol, Quaternium-91, Cetrimonium Methosulfate, Polyquaternium-55, Lactic Acid, Sodium Hydroxide, Malic Acid, Iodopropynyl Butylcarbamate, Hydrolyzed Milk Protein, Benzyl Alcohol, Sodium Laneth-40 Maleate/styrene Sulfonate Copolymer, Prunus Amygdalus Dulcis, Cocos Nucifera, Cetearyl Glucoside, Gardenia Tahitensis \n\n&#x200B;\n\nDoes anyone have any recommendations as an alternative?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "nat633",
        "body": "There is nothing out of the ordinary with that ingredients list. Is is totally fine for use on hair.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "cp8iun",
    "title": "Ingredient Check - The Longhairs Epically Ideal Shampoo & Conditioner",
    "url": "https://www.reddit.com/r/curlyhair/comments/cp8iun/ingredient_check_the_longhairs_epically_ideal/",
    "score": 2,
    "num_comments": 4,
    "created": "2019-08-12T06:26:44+00:00",
    "body": "[Epically Ideal Shampoo & Conditioner](https://thelonghairs.us/products/epically-ideal-shampoo-conditioner?variant=27846110707735)\n\n[See also in /r/haircarescience](https://www.reddit.com/r/HaircareScience/comments/cp8fid/ingredient_check_the_longhairs_epically_ideal/)\n\nI know, I know - gendered marketing premium and all that. But I love their hair ties enough that I kind of want to give these a go. I've got something like 2C hair if that's relevant.\n\n### Shampoo\n* Water (Aqua)\n* Sodium Cocoyl Isethionate\n* Cocamidopropyl Betaine\n* Disodium Laureth Sulfosuccinate\n* Sodium Lauroyl Sarcosinate\n* Glycol Distearate\n* Cocamide MEA\n* Quaternium-91\n* Amodimethicone\n* Dimethicone Crosspolymer\n* Dimethicone\n* Cetrimonium Chloride\n* Divinyldimethicone/Dimethicone Copolymer\n* Glycerin\n* Cyclopentasiloxane\n* Dimethiconol\n* Argania Spinosa (Argan) Kernel Oil\n* Euterpe Oleracea (Acai) Fruit Oil\n* Linum Usitatissimum\n* (Flaxseed/Linseed) Oil\n* Wheat Amino Acids\n* Hydrolyzed Wheat Protein\n* Hydrolyzed Soy Protein\n* Guar Hydroxypropyltrimonium Chloride\n* Fragrance (Parfum)\n* Polyquaternium-10\n* PPG-3 Benzyl Ether Myristate\n* Cinnamidopropyltrimonium Chloride\n* Tocopherol\n* Acrylates Crosspolymer-4\n* Trideceth-12\n* Sodium Benzoate\n* Potassium Sorbate\n* C12 – 13 Pareth-23\n* C12-13 Pareth-3\n* Citric Acid\n\n\n### Conditioner\n* Water (Aqua)\n* Stearyl Alcohol\n* Glycerin\n* Behentrimonium Chloride\n* Dimethicone\n* Centrimonium Chloride\n* Divinyldimethicone/Dimethicone Copolymer\n* Quatemium-91\n* Olea Europea (Olive) Fruit Oil\n* Cetearyl Alcohol\n* Amodimethicone\n* Silicone Quaternium-16\n* Argania Spinosa (Argan) Kernel Oil\n* Euterpe Oleracea (Acai) Fruit Oil\n* Linum Usitatissimum\n* (Flaxseed/Linseed) Oil\n* Cyclopentasiloxane\n* Dimethiconol\n* Wheat Amino Acids\n* Hydrolyzed Wheat Protein\n* Hydrolyzed Soy Protein\n* Panthenol\n* Guar Hydroxypropyltrimonium Chloride\n* Polyquaternium-37\n* Fragrance (Parfum)\n* Dimethicone Crosspolymer\n* Polyquaternium-10\n* PPG-3 Benzyl Ether Myristate\n* Ceteareth-20\n* Cinnamidopropyltrimonium Chloride\n* Tocopherol\n* Propylene Glycol Dicaprylate/Dicaprate\n* Trideceth-12\n* Sodium Benzoate\n* Potassium Sorbate\n* C12-13 Pareth-23\n* C12-13 Pareth-3\n* PPG-1 Trideceth-6\n* Undeceth-11\n* Butylocatanol\n* Undeceth-5\n* Citric Acid",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "natthatt",
        "body": "Neither one is cg approved. next time you can use curlsbot or isitcg to check.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "blckrainbow",
        "body": "No ... silicones",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Wavyhair",
    "post_id": "o4ql1a",
    "title": "Is this cg friendly?",
    "url": "https://www.reddit.com/r/Wavyhair/comments/o4ql1a/is_this_cg_friendly/",
    "score": 2,
    "num_comments": 3,
    "created": "2021-06-21T08:34:42+00:00",
    "body": "I have a curl cream and wanted to know if the ingredients are safe?\n\nIngredients:\nAqua, Cetostearyl alcohol, Shea butter ethyl Ester, Polyquaternium-69, Quaternium-91 (and) Cetrimonium Methosulfate (and) Cetearyl Alcohol, Aqua (and) Polyquaternium-10 (and) PG-Hydroxyethylcellulose Cocodimonium Chloride, Cetrimonium chloride, Shea butter, Ceteareth 25, Glycerin, Perfume, PPG-3 Caprylyl Ether, Jojoba oil, Argan Oil, Aqua (and) Linum Usitatissimum (Flax) Seed Extract (and) Salvia Hispanica( Chia) Seed Extract, Panthenyl Hydroxypropyl Steardimonium Chloride, Cocodimonium Hydroxypropyl Hydrolyzed Wheat Protein, DS EDTA, Guar hydroxypropyl trimonium chloride, Butylated hydroxy toluene, DMDM hydantoin",
    "flair_text": "products",
    "flair_template_id": "b2da9474-c1fc-11ea-9deb-0e24d27658c1",
    "comments": [
      {
        "author": "WeAreStarless",
        "body": "you can put this ingredient list through [curlsbot](https://www.curlsbot.com/) and/or [isitcg](http://www.isitcg.com/) and it'll tell you!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "rutujah",
        "body": "Is this ingredients list of Curl Up cream?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "fcjnyy",
    "title": "Help! Is it CG approved??",
    "url": "https://www.reddit.com/r/curlyhair/comments/fcjnyy/help_is_it_cg_approved/",
    "score": 2,
    "num_comments": 5,
    "created": "2020-03-02T21:48:54+00:00",
    "body": "I found a bunch of Not your Mother's products on sale at Bed Bath and Beyond today (score!). I got the Not your mother's way to grow leave in conditioner and I'm questioning if it's curly girl friendly. I checked isitcg.com but I want to make sure. I just started the CG method a couple weeks ago, and I don't want to mess up! Here's the ingredients. Thanks for any help!\n\nWater/Aqua, Butylene Glycol, Cetearyl Alcohol, Cetyl Triethylmonium Dimethicone PEG-8 Succinate, Fragrance/Parfum, Quaternium-91, Propylene Glycol Diazolidinyl Urea, Myristyl Myristate, Hydrolyzed Keratin, PPG 26-Buteth-26, Behentrimonium Chloride, PEG-40 Hydrogenated Castor Oil, Iodopropynyl Butylcarbamate, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Citric Acid",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "PauseAndThinkAboutIt",
        "body": "It's CG approved, but barely.  It does contain ingredients that can build up and cause problems.  That particular Dimethicone is just barely water soluble, and you may have to clarify every now and then, but it should be fine.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Jessachelle",
        "body": "I read somewhere that water soluble silicones are preceded by PPG, PEG, etc. But I dont know where I saw/read it so you might want to look into those.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "95t4zn",
    "title": "ArtNaturals leave in conditioner ingredients?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/95t4zn/artnaturals_leave_in_conditioner_ingredients/",
    "score": 1,
    "num_comments": 0,
    "created": "2018-08-09T03:58:53+00:00",
    "body": "I was wondering if anything harmful is in there newer formulation of there leave in conditioner. \n\nIt seems Cyclomethicone (Cyclopentasiloxane) is the only silicone product and is a group 1 silicone\n\nhttps://artnaturals.com/artnaturals-argan-leave-in-conditioner-repairs-split-ends-and-rehydrates-dryness-12-fl-oz-354-ml-14-00.html\n\n*Water, Quaternium-91, Behentrimonium Chloride, Myristyl Myristate, Cetearyl Alcohol, Butylene Glycol, Cetrimonium Chloride, Aloe Barbadensis (Aloe Vera) Leaf Juice, Phenoxyethanol, Caprylyl Glycol, Hydrolyzed Oat Protein, Cyclopentasiloxane, Quaternium-80, Panthenol (Vitamin B5), Helianthus Annuus (Sunflower) Seed Oil, Camellia Sinensis (Green Tea) Extract, Mucor Miehei Extract, Ganoderma Lucidum (Mushroom) Extract, Lentinus Edodes (Shiitake Mushroom) Extract, Mentha Piperita (Peppermint) Oil, Salvia Officinalis (Sage) Oil, Rosmarinus Officinalis (Rosemary) Leaf Oil, Simmondsia Chinensis (Jojoba) Seed Oil, Argania Spinosa (Argan) Kernel Oil, Tocopheryl Acetate (Vitamin E), Sorbic Acid, Fragrance (Perfume).*",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "fnx2l7",
    "title": "Ethanolamine irritation in conditioner?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/fnx2l7/ethanolamine_irritation_in_conditioner/",
    "score": 1,
    "num_comments": 6,
    "created": "2020-03-24T02:18:52+00:00",
    "body": "I recently started using a new shampoo and conditioner and in the past couple of times I've used it I have gotten this really itchy and sore feeling around the back of my ears. I'm pretty educated when it comes to ingredients in cosmetics, and when trying to figure out what could be causing it I noticed ethanolamine, which I hadn't seen in a lot of products. After looking it up I found out that it can cause irritation and can be more harsh than ammonia when used in hair color. I know a lot of ingredients in low concentrations are totally safe, like sodium hydroxide used to stabilize the ph so I'm not sure if this is a similar thing?\n\nAnyway here are the ingredients please let me know if theres anything else in here that could possibly be sensitizing. This is the first time I've ever had a skin reaction from a hair product so I'm freakin out lol.  \n\nAqua/Water/Eau, Cetearyl Alcohol, Propylene Glycol, Maleic Acid, Ethanolamine, Behentrimonium Methosulfate, Parfum/Fragrance, Stearamidopropyl Dimethylamine, Glycerin, Phenoxyethanol, Hydroxyethylcellulose, Ricinus Communis Seed Oil/Castor Seed Oil, Quaternium-91, Polyquaternium-37, Benzoic Acid, Paraffinum Liquidum/Mineral Oil/Huile Minerale, Cetrimonium Chloride, Cetrimonium Methosulfate, Ppg-1 Trideceth-6, Benzyl Benzoate, Biotin, Limonene, Benzyl Alcohol, Acrylates Copolymer, Linalool, 2-Oleamido-1,3-Octadecanediol, Sorbitan Oleate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jrbrown36",
        "body": "I’m not sure why they list ethanolamine so high in the list. It is a base used to raise the pH. Many of the conditioners require an acidic pH to function. The malic acid will do that since it’s higher up the list. This means the irritation potential referenced in hair color wouldn’t really apply in this case. \n\nIn general, if irritation develops when using a product, stop using it to see if it is the cause versus something else.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "jrbrown36",
        "body": "That was a great idea! Thank you for the update.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "fecswf",
    "title": "Do the silicones in Olaplex No 4 Bond Maintenance Shampoo wash off with water?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/fecswf/do_the_silicones_in_olaplex_no_4_bond_maintenance/",
    "score": 1,
    "num_comments": 3,
    "created": "2020-03-06T12:30:32+00:00",
    "body": "Water, Cetearyl Alcohol, PPG-3 Benzyl Ether Myristate, Caprylic/Capric Triglyceride, Cetyl Alcohol,Octyldodecyl Ricinoleate, Quaternium-91, Cetrimonium Chloride, Divinyldimethicone/Dimethicone Copolymer, Behentrimonium Chloride, Glycerin, Cetyl Esters, Isododecane, Bis-Aminopropyl Diglycol Dimaleate, Fragrance, Panthenol, Phospholipids, Dimethicone PEG-7 Isostearate, Pseudozyma Epicola/Argania Spinosa Kernel Oil Ferment Filtrate, Pseudozyma Epicola/Camellia Sinensis Seed Oil Ferment Extract Filtrate, Tocopheryl Linoleate/Oleate, Quaternium-95, Propanediol, Punica Granatum Extract, Morinda Citrifolia Fruit Extract, PEG-8, Euterpe Oleracea Fruit Extract, Camellia Sinensis Seed Oil, Crambe Abyssinica Seed Oil, Hydroxypropyl Cyclodextrin, Persea Gratissima (Avocado) Oil, Vitis Vinifera (Grape) Seed Oil, Disodium EDTA, Polysilicone-15, C11-15 Pareth-7, Hydroxypropyl Guar, Glycine Soja (Soybean) Oil, PEG-45M, PEG-7 Amodimethicone, Amodimethicone, C12-13 Pareth-23, C12-13 Pareth-3, Laureth-9, Pentaerythrityl Tetra-Di-T-Butyl Hydroxyhydrocinnamate, PEG-4, Phenoxyethanol, Hexyl Cinnamal",
    "flair_text": "Product Question",
    "flair_template_id": "f0237a66-58bd-11e4-a1a9-12313b0e8234",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "xzgaex",
    "title": "How to manage frizz and dryness in a humid climate?",
    "url": "https://www.reddit.com/r/NoPoo/comments/xzgaex/how_to_manage_frizz_and_dryness_in_a_humid_climate/",
    "score": 1,
    "num_comments": 2,
    "created": "2022-10-09T08:22:19+00:00",
    "body": "My hair type is 2b. I've been on the no poo method for a while. I've seen improvement in my hair but my it still gets dry and frizzy. Humidity is a factor but I've been wondering about some other things as well. For example currently I am working from home so I am indoors for most of the day. Another thing was the water I was using with my hair. I suspected maybe the water I'm getting in the shower was hard water and not soft water. I started using packaged bottles to wash my hair and while it felt like it retained more moisture it also used to get frizzy more easily than my shower's water.\n\nThis is my routine for my hair - When I am not washing it I only rinse my hair while massaging the scalp. Then I just kinda brush it with my hands since I don't use an actual brush.  \nWhen I am washing it I apply some coconut oil massaging it into the scalp. I wait 30 mins and when I wash it I have an argan oil, Jamaican black castor oil and Shea butter. I use the squish to condish method and I mostly condition the ends of my hair more than my scalp.\n\n  \nThis is the full ingredients list :-\n\nOrganic Butyrospermum Parkii (Shea) Butter, Argania Spinosa (Argan) Kernel Oil, Ricinus Communis (Castor) Seed Oil, Guar Hydroxypropyl Trimonium Chloride, Quaternium-91 (and) Cetrimonium Methosulfate (and) Cetearyl Alcohol, Dipalmitoylethyl Dimonium Chloride, Tocopheryl Acetate, Grapefruit Essential Oil.",
    "flair_text": "Troubleshooting (HELP!)",
    "flair_template_id": "427aea9e-bea4-11eb-abf5-0ed12a1a3c6b",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Welcome! If you're new, get started here: [Natural Haircare Quick Start Guide] (https://www.reddit.com/r/NoPoo/wiki/index/quickstart) \n\nPlease answer the following questions to help us help you. \n\nDo you have hard water? If you don't know what it is, there's an [article in the wiki] (https://www.reddit.com/r/NoPoo/wiki/index/hardwater) that discusses it. \n\nWhat is the porosity of your hair? If you don't know, there's a quiz linked in the sidebar. \n\nHow long have you been doing nopoo? \n\nNo-poo can mean many different things. Describe in detail how you wash your hair. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoPoo) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "shonaich",
        "body": "Hard water makes natural haircare more difficult. It turns oils into 'wax' and can leave mineral deposits on the hair itself which cause it to dry out and resist moisture.\n\nHere is an article with lots of information about hard water and wax and how to deal with it. \n\n[Hard Water, Wax and Natural Haircare] (https://www.reddit.com/r/NoPoo/wiki/index/hardwater)\n\nYou may need to do some chelating treatments to remove mineral buildup. I do a maintenance one one about once a month with a tiny pinch of ascorbic acid in about 3 cups of water. It works through my sebum and I leave it on for about an hour with my hair held close to my scalp for some warmth.\n\nIf you need a stronger treatment, I'd recommend Curl Partner by Malibu C, which will strip sebum and needs a deep conditioning treatment afterwards, as it is very drying.\n\nYou might also need to just add more real moisture into your routine. Oil and water (moisture) are two completely different things. Oils don't moisturize, they seal, condition and protect. Moisture moisturizes. Here's some natural haircare moisture for you.\n\nMoisture:\n\nDilute aloe juice or coconut water by half, apply til dripping (I use a sprayer or condiment squeeze bottle), gently massage into scalp for a few minutes, scrunch into your hair if you have enough hair to do so, then wrap in a towel for at least an hour before rinsing it out. Do this as often as you like.\n\nA honey rinse can also be good for some types of hair. 1 teaspoon honey in 1 cup water, apply in shower, gently massage and scrunch in, let sit for 5-10 mins and then rinse out.\n\nMuch more info and ideas here:\n\n[Tell me about...moisturizing](https://www.reddit.com/r/NoPoo/comments/mtp0wc/tell_me_aboutmoisturizing/)\n\nAnd a deep condition of yiu need it after the strong chelating treatment\n\nDeep condition:\n\nChoose a heavy oil like olive or avacado. Coconut can be good, but can also be bad if your hair is protein sensitive. Adding 1 part castor oil to 3 parts other oil can be pretty amazing as its a humectant and will help moisturize your hair for weeks. I also add 1 drop each of rosemary and lavender essential oils for my scalp. Mix several tablespoons of oil. My midback sorta thin hair takes 2-3. Throw a heavy towel in the dryer to warm it up. To clean, damp hair, apply oil all over in a nice heavy coat. Massage some into your scalp too. Wrap your hair close to your head in plastic, I use a shopping bag. Then wrap your head in the warm towel and let it sit for at least an hour. Change towels to a newly warmed one if it starts to cool too much. Wash out the oil using warm water and lots of preening, or pulse (pea, bean, lentil) flour, or egg (remove the skin of the yolk to help the smell) or a nice low poo co-wash that won't shock your scalp.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "7vzmqh",
    "title": "Product advice",
    "url": "https://www.reddit.com/r/NoPoo/comments/7vzmqh/product_advice/",
    "score": 1,
    "num_comments": 5,
    "created": "2018-02-07T21:34:17+00:00",
    "body": "I've been using [One n Only Argan Shampoo](http://www.sallybeauty.com/one-n-only-argan-oil-moisture-repair-shampoo/SBS-539402,default,pd.html) \n\n> Water (Aqua, Eau), Disodium Laureth Sulfosuccinate, Sodium Cocoyl Isethionate, PEG-150 Distearate, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Argania Spinosa Kernel Oil, Fragrance (Parfum), Sodium Cocoyl Sarcosinate, PPG-2 Hydroxyethyl Cocamide, Panthenol, Panthenyl Hydroxypropyl Steardimonium Chloride, Polyquaternium-10, Hydrolyzed Keratin, Sodium Chloride, Glycol Distearate, Steareth-4, Tetrasodium EDTA, Methylchloroisothiazolinone, Methylisothiazolinone, Red 33 (CI 17200), Yellow 5 (CI 19140)\n\nAnd [One N Only Argan Conditioner](http://www.sallybeauty.com/one-n-only-argan-oil-moisture-repair-conditioner/ONEONL19,default,pd.html)\n\n>Water (Aqua, Eau), Cetearyl Alcohol, Glycerin, Isohexadecane, Isododecane, Stearamidopropyl Dimethylamine, Fragrance (Parfum), Dicetyldimonium Chloride, Panthenol, Argania Spinosa Kernel Oil, Hydrolyzed Keratin, Cyclopentasiloxane, Dimethicone, Quaternium-91, Cetrimonium Methosulfate, Benzophenone-4, Propylene Glycol, Citric Acid, Diazolidinyl Urea, Iodopropynyl Butlylcarbamate, Red 33 (CI 17200), Yellow 5 (CI 19140).\n\nOccasionally when my scalp gets dry in winter or sweaty and dirty in summer.\n\nLately, due to the extremely dry weather we've been having this winter, I've been washing a lot more.  My hair isn't as it was when I washed less.  This got me wondering if this is a no poo or even low poo product.\n\nThis was first given to me by a friend because \"your hair smells... This is no poo\".  I've never really checked into it beyond the \"paraben free\" and \"sulphate free\" on the label itself.  I just kept using it.\n\nI don't even see the One N Only brand listed in the product recommendations.\n\nAre these products No Poo?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AnaBelem",
        "body": "I can't comment about the products themselves, but, I found this sentence contradictory:\n \"Lately, due to the extremely dry weather we've been having this  winter, I've been washing a lot more.\"\n\nIf you wash more, you will make your hair even drier, as you will strip your scalp and hair from the oils they need.\n\nWhen the weather is dry, I spread my washes more and [scritch/preen/BBB](https://www.youtube.com/watch?v=4gKjl_D3knM) twice a day.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "cp8fid",
    "title": "Ingredient Check - The Longhairs Epically Ideal Shampoo & Conditioner",
    "url": "https://www.reddit.com/r/HaircareScience/comments/cp8fid/ingredient_check_the_longhairs_epically_ideal/",
    "score": 1,
    "num_comments": 1,
    "created": "2019-08-12T06:16:37+00:00",
    "body": "[Epically Ideal Shampoo & Conditioner](https://thelonghairs.us/products/epically-ideal-shampoo-conditioner?variant=27846110707735)\n\n[See also in /r/curlyhair](https://www.reddit.com/r/curlyhair/comments/cp8iun/ingredient_check_the_longhairs_epically_ideal/)\n\nI know, I know - gendered marketing premium and all that. But I love their hair ties enough that I kind of want to give these a go. I've got something like 2C hair if that's relevant.\n\n### Shampoo\n* Water (Aqua)\n* Sodium Cocoyl Isethionate\n* Cocamidopropyl Betaine\n* Disodium Laureth Sulfosuccinate\n* Sodium Lauroyl Sarcosinate\n* Glycol Distearate\n* Cocamide MEA\n* Quaternium-91\n* Amodimethicone\n* Dimethicone Crosspolymer\n* Dimethicone\n* Cetrimonium Chloride\n* Divinyldimethicone/Dimethicone Copolymer\n* Glycerin\n* Cyclopentasiloxane\n* Dimethiconol\n* Argania Spinosa (Argan) Kernel Oil\n* Euterpe Oleracea (Acai) Fruit Oil\n* Linum Usitatissimum\n* (Flaxseed/Linseed) Oil\n* Wheat Amino Acids\n* Hydrolyzed Wheat Protein\n* Hydrolyzed Soy Protein\n* Guar Hydroxypropyltrimonium Chloride\n* Fragrance (Parfum)\n* Polyquaternium-10\n* PPG-3 Benzyl Ether Myristate\n* Cinnamidopropyltrimonium Chloride\n* Tocopherol\n* Acrylates Crosspolymer-4\n* Trideceth-12\n* Sodium Benzoate\n* Potassium Sorbate\n* C12 – 13 Pareth-23\n* C12-13 Pareth-3\n* Citric Acid\n\n\n### Conditioner\n* Water (Aqua)\n* Stearyl Alcohol\n* Glycerin\n* Behentrimonium Chloride\n* Dimethicone\n* Centrimonium Chloride\n* Divinyldimethicone/Dimethicone Copolymer\n* Quatemium-91\n* Olea Europea (Olive) Fruit Oil\n* Cetearyl Alcohol\n* Amodimethicone\n* Silicone Quaternium-16\n* Argania Spinosa (Argan) Kernel Oil\n* Euterpe Oleracea (Acai) Fruit Oil\n* Linum Usitatissimum\n* (Flaxseed/Linseed) Oil\n* Cyclopentasiloxane\n* Dimethiconol\n* Wheat Amino Acids\n* Hydrolyzed Wheat Protein\n* Hydrolyzed Soy Protein\n* Panthenol\n* Guar Hydroxypropyltrimonium Chloride\n* Polyquaternium-37\n* Fragrance (Parfum)\n* Dimethicone Crosspolymer\n* Polyquaternium-10\n* PPG-3 Benzyl Ether Myristate\n* Ceteareth-20\n* Cinnamidopropyltrimonium Chloride\n* Tocopherol\n* Propylene Glycol Dicaprylate/Dicaprate\n* Trideceth-12\n* Sodium Benzoate\n* Potassium Sorbate\n* C12-13 Pareth-23\n* C12-13 Pareth-3\n* PPG-1 Trideceth-6\n* Undeceth-11\n* Butylocatanol\n* Undeceth-5\n* Citric Acid",
    "flair_text": "Product Question",
    "flair_template_id": "f0237a66-58bd-11e4-a1a9-12313b0e8234",
    "comments": [
      {
        "author": "ftr-mmrs",
        "body": "Both are loaded with silicones. If you follow the CG Method these are not compatible.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hair",
    "post_id": "zto6h0",
    "title": "Stylist used heavily silicone oil on my hair. Having a panic attack.",
    "url": "https://www.reddit.com/r/Hair/comments/zto6h0/stylist_used_heavily_silicone_oil_on_my_hair/",
    "score": 0,
    "num_comments": 2,
    "created": "2022-12-23T17:50:12+00:00",
    "body": "I have been trying to avoid silicones for a while. I went to a salon the other day for product recommendations for my dry, bleached hair. Stylist put Kevin Murphy Young Again hair oil in my hair. I asked if it had silicones and she said no. Well it is loaded with them!! Will one time using it cause build up? Do I have to use clarifying shampoo? I just got my hair highlighted. Panicking!! \n\nHere are the ingredients:\n\nCyclopentasiloxane, Dimethicone, Dimethiconol, Bis-Cetearyl Amodimethicone, Helichrysum Stoechas Flower Extract*, Pyrus Malus (Apple) Fruit Extract, Saccharum Officinarum (Sugarcane) Extract, Camellia Sinensis Leaf Extract, Carthamus Tinctorius (Safflower) Seed Oil, Citrus Limon (Lemon) Peel Oil, Citrus Limon (Lemon) Fruit Extract, Vitis Vinifera (Grape) Seed Extract, Ginkgo Biloba Leaf Extract, Glycerin, Hydrolyzed Soy Protein, Water (Aqua) (Eau), Hexylene Glycol, Butylene Glycol, Cyclohexasiloxane, Betaine, Vanillyl Butyl Ether, Behentrimonium Chloride, Quaternium-91, Myristyl Myristate, Hexapeptide-11, Cetearyl Alcohol, Ethylhexyl Methoxycinnamate, BHT, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate, Fragrance (Parfum), Linalool, Limonene, Geraniol, Violet 2 (CI 60725)",
    "flair_text": "Help",
    "flair_template_id": "1fb23224-19ed-11e8-8598-0e09b1f8bce8",
    "comments": [
      {
        "author": "BvbblegvmBitch",
        "body": "Those are water soluble silicones.  You're fine. \n\nWhen people tell you to avoid silicones, they mean the ones that aren't easily washed away and cause build up.  Dimethicone, dimethiconal, and amodimethicone being present does not change the \"silicone free\" rating because they do not stay in your hair.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]