[
  {
    "subreddit": "AsianBeauty",
    "post_id": "e8s28z",
    "title": "Propolis Serum/Ampoule Ingredient Comparisons",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/e8s28z/propolis_serumampoule_ingredient_comparisons/",
    "score": 107,
    "num_comments": 49,
    "created": "2019-12-10T15:31:52+00:00",
    "body": "I decided to try a Propolis product and wanted to compare the ingredients.  I wanted to try to avoid essential oils, specifically citrus oils.  Thought I'd share this here in case anyone else wanted to see the info compiled.  For me, I decided to start with trying Cosrx because of the simplicity of ingredients.\n\n**By Wishtrend Polyphenols in Propolis 15% Ampoule** \n\n* Houttuynia Cordata Extract, Propolis Extract, Glycerin, Propanediol, Isopentyldiol, 1,2-Hexanediol, Water, Sodium Hyaluronate, Ocimum Sanctum Leaf Extract, Corallina Officinalis Extract, Portulaca Oleracea Extract, Punica Granatum Fruit Extract, Hamamelis Virginiana (Witch Hazel) Extract, Melia Azadirachta Flower Extract, Panthenol, Perilla Frutescens Extract, Curcuma Longa (Turmeric) Root Extract, Lactobacillus Ferment, Melia Azadirachta Leaf Extract, Butylene Glycol, Ammonium Acryloyldimethyltaurate/VP Copolymer, Betaine, Xanthan Gum, Ethylhexylglycerin, Disodium EDTA, Zinc PCA, Pantolactone\n\n**Cosrx Propolis Light Ampoule**\n\n* Propolis Extract, Butylene Glycol, Glycerin, Betaine, 1,2-Hexanediol, Cassia Obtusifolia Seed Extract, Sodium Hyaluronate, Hydroxyethylcellulose, Carbomer, Panthenol, Arginine\n\n**CNP Laboratory Propolis Energy Ampule**\n\n* Water, Propolis Extract, Beta-Glucan, Glycerin, Glycerin, Butylene Glycol, Sophora Angustifolia Root Extract, 1,2-Hexanediol, Imperata Cylindrica Root Extract, Madecassoside, Polysorbate 20, Carbomer, Hydroxyethylcellulose, Arginine, Honey Extract, Allantoin, PEG-8, Sigesbeckia Orientalis Extract, Rabdosia Rubescens Extract, Palmitoyl Tripeptide-38, Hydroxypropyl Cyclodextrin, Sodium Hyaluronate, Disodium EDTA, Pelargonium Graveolens Flower Oil, Punica Granatum Fruit Extract, Ficus Carica (Fig) Fruit Extract, Codonopsis Lanceolata Root Extract, Melissa Officinalis Leaf Extract\n\n**Dr.Ceuracle Royal Vita Propolis 33 Ampoule**\n\n* Water, Butylene Glycol, Panthenol, Rosa Centifolia Flower Water, Portulaca Oleracea Extract, Niacinamide, Propylene Glycol, 1,2-Hexanediol, Hippophae Rhamnoides Fruit Extract, 3-O-Ethyl Ascorbic Acid, Propolis Extract, Carbomer, Arginine, Phenoxyethanol, Hydroxyethylcellulose, Dipotassium Glycyrrhizate, Adenosine, Sodium Hyaluronate, Centella Asiatica Extract, Hamamelis Virginiana (Witch Hazel) Extract, Royal Jelly Extract, Spirodela Polyrhiza Extract\n\n**Elensilia CPP French Propolis 82% Resistem Ampoule**\n\n* Propolis Extract(82%), Water(Aqua), Glycerin, Butylene Glycol, Glycereth-26, Niacinamide, Glycosaminoglycans, Globularia Cordifolia Callus Culture Extract, Allantoin, PEG-40 Hydrogenated Castor Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tromethamine, Caprylyl Glycol, Sodium Polyacrylate, Hydroxyethylcellulose, Adenosine, Caprylhydroxamic Acid, Caramel, Disodium EDTA, Glyceryl Acrylate/Acrylic Acid Copolymer, Propylene Glycol, Fragaria Chiloensis (Strawberry) Fruit Extract, Juniperus Communis Fruit Extract, Rubus Fruticosus (Blackberry) Fruit Extract, Rubus Idaeus (Raspberry) Fruit Extract, Vaccinium Angustifolium (Blueberry) Fruit Extract, Vaccinium Macrocarpon (Cranberry) Fruit Extract, Vaccinium Myrtillus Fruit Extract, Vaccinium Vitis-Idaea Fruit Extract, Glycine, Serine, Glutamic Acid, Aspartic Acid, Leucine, Alanine, Lysine, Arginine, Tyrosine, Phenylalanine, Proline, Threonine, Valine, Isoleucine, Histidine, Cysteine, Methionine, Chlorphenesin, Gold\n\n**IUNIK Propolis Vitamin Synergy Serum**\n\n* Propolis Extract, Hippophae Rhmnoides Fruit Extract, Water, Butylene Glycol, Glycerin, Methylprpanediol, Niancinamide, Dipropylene Glycol, 1,2-Hexaanediol, Rosa Damascena Flower Water, Sodium Hyaluronate, Betaine, Glycosyl Trehalose, Honey Extract, Beta-Glucan, Hydrogenated Starch Hydrolysate, Allantoin, Carbomer, Arginine, Hydroxyethylcellulose, Adenosine, Dipotassium Glycyrrhizate, Pentylene Glycol, Citrus Auranitum Bergamia (Bergamot) Fruit Oil, Centella Asiatica Extract, Portulaca Oleracea Extract, Hamamelis Virginiana (Witch Hazel) Extract, Punica Granatum Fruit Extract, Ficus Carica (Fig) Fruit Extract, Mours Alba Fruit Extract, Ginkgo Biloba Nut Extract, Caprylyl Glycol\n\n**Tosowoong Propolis Natural Pure Essence Brightening Treatment**\n\n* Propolis Extract (75%), Butylene Glycol, Glycerin, Niacinamide, Glycereth-26, Water, rh-Oligopeptide-1, Galactomyces Ferment Filtrate, Bifida Ferment Lysate, Centella Asiatica Extract, Betaine, Allantoin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Arginine, Adenosine, Honey Extract, Royal Jelly Extract, Olive Leaf Extract, Sodium Hyaluronate, Blackberry Fruit Extract, Euterpe Oleracea Fruit Extract, Raspberry Fruit Extract, Strawberry Fruit Extract, Vaccinium Myrtillus Fruit Extract, Cranberry Fruit Extract, Aronia Melanocarpa Fruit Extract, Juniperus Communis Fruit Extract, Sapindus Mukurossi Fruit Extract, Blueberry Fruit Extract, Phenoxyethanol, Ethylhexylglycerin, Disodium EDT\n\n**Tosowoong Propolis Sparkle Ampoule**\n\n* Propolis Extract(80%), Water, Butylene Glycol, Glycerin, Glycereth-26, Honey Extract, Artemisia Vulgaris Extract, Sophora Angustifolia Root Extract, Coptis Chinensis Root Extract, Hydrogenated Lecithin, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, PVM/MA Copolymer, Glyceryl Acrylate/Acrylic Acid Copolymer, Citrus Limon (Lemon) Peel Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Aurantifolia (Lime) Oil, Pinus Sylvestris Leaf Oil, Eucalyptus Globulus Leaf Oil, PEG-60 Hydrogenated Castor Oil, PEG-2M, Sucrose Distearate, Polyglutamic Acid, Xanthan Gum, Dimethicone, Betaine, Tromethamine, Disodium EDTA, Phenoxyethanol, Chlorphenesin, 1,2-Hexanediol, Caprylyl Glycol, Ethylhexylglycerin\n\n**Scinic Propolis Ampoule**\n\n* [Propolis Extract](https://incidecoder.com/ingredients/propolis-extract), [Niacinamide](https://incidecoder.com/ingredients/niacinamide), [Royal Jelly Extract](https://incidecoder.com/ingredients/royal-jelly-extract), [Chrysanthellum Indicum Extract](https://incidecoder.com/ingredients/chrysanthellum-indicum-extract), [Anthemis Nobilis Flower Extract](https://incidecoder.com/ingredients/anthemis-nobilis-flower-extract), [Adansonia Digitata Seed Extract](https://incidecoder.com/ingredients/adansonia-digitata-seed-extract), [Aloe Barbadensis Leaf Extract](https://incidecoder.com/ingredients/aloe-barbadensis-leaf-extract), [Dipotassium Glycyrrhizate](https://incidecoder.com/ingredients/dipotassium-glycyrrhizate), [Polysorbate 80](https://incidecoder.com/ingredients/polysorbate-80), [Punica Granatum Fruit Extract](https://incidecoder.com/ingredients/punica-granatum-fruit-extract), [Ficus Carica Fruit Extract](https://incidecoder.com/ingredients/ficus-carica-fruit-extract), [Morus Alba Fruit Extract](https://incidecoder.com/ingredients/morus-alba-fruit-extract), [Ginkgo Biloba Nut Extract](https://incidecoder.com/ingredients/ginkgo-biloba-nut-extract), [Hordeum Vulgare Seed Extract](https://incidecoder.com/ingredients/hordeum-vulgare-seed-extract), [Cucumis Sativus Seed Extract](https://incidecoder.com/ingredients/cucumis-sativus-seed-extract), [Nelumbo Nucifera Seed Extract](https://incidecoder.com/ingredients/nelumbo-nucifera-seed-extract), [Punica Granatum Seed Extract](https://incidecoder.com/ingredients/punica-granatum-seed-extract), [Lactobacillus/​Soybean Ferment Extract](https://incidecoder.com/ingredients/lactobacillus-soybean-ferment-extract), [Salix Alba Bark Extract](https://incidecoder.com/ingredients/salix-alba-bark-extract), [Cinnamomum Cassia Bark Extract](https://incidecoder.com/ingredients/cinnamomum-cassia-bark-extract), [Origanum Vulgare Leaf Extract](https://incidecoder.com/ingredients/origanum-vulgare-leaf-extract), [Chamaecyparis Obtusa Leaf Extract](https://incidecoder.com/ingredients/chamaecyparis-obtusa-leaf-extract), [Scutellaria Baicalensis Root Extract](https://incidecoder.com/ingredients/scutellaria-baicalensis-root-extract), [Portulaca Oleracea Extract](https://incidecoder.com/ingredients/portulaca-oleracea-extract), [Carbomer](https://incidecoder.com/ingredients/carbomer), [Borago Officinalis Seed Oil](https://incidecoder.com/ingredients/borago-officinalis-seed-oil), [Prunus Amygdalus Dulcis Oil](https://incidecoder.com/ingredients/prunus-amygdalus-dulcis-oil), [Macadamia Integrifolia Seed Oil](https://incidecoder.com/ingredients/macadamia-integrifolia-seed-oil), [Helianthus Annuus Oil](https://incidecoder.com/ingredients/helianthus-annuus-seed-oil), [Brassica Campestris Seed Oil](https://incidecoder.com/ingredients/brassica-campestris-seed-oil), [Dimethicone](https://incidecoder.com/ingredients/dimethicone), [Cyclopentasiloxane](https://incidecoder.com/ingredients/cyclopentasiloxane), [Trideceth-6](https://incidecoder.com/ingredients/trideceth-6), [Peg/​Ppg-18/​18 Dimethicone](https://incidecoder.com/ingredients/peg-ppg-18-18-dimethicone), [Adenosine](https://incidecoder.com/ingredients/adenosine), [Curcuma Longa Root Extract](https://incidecoder.com/ingredients/curcuma-longa-root-extract), [Triethanolamine](https://incidecoder.com/ingredients/triethanolamine), [Disodium Edta](https://incidecoder.com/ingredients/disodium-edta), [1,2-Hexanediol](https://incidecoder.com/ingredients/1-2-hexanediol), [Caprylyl Glycol](https://incidecoder.com/ingredients/caprylyl-glycol)\n\n**SKIN FOOD Royal Honey Propolis Enrich Essence** \n\n* Propolis Extract, Honey Extract, Royal Jelly Extract, Butylene Glycol, Dipropylene Glycol, Portulaca Oleracea Extract, Glycerin, Beta-Glucan, Lactobacillus Ferment, Saccharomyces Ferment, Sodium Hyaluronate, Hydroxyethylcellulose, Disodium Edta, Carbomer, Arginine",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "TaekyoTT",
        "body": "Iunik one feels really nice and I love the thick texture. I feel as if I don’t have enough product even though I put it all over my face dramatically",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "tanninaz",
        "body": "The Toosowoong Sparkle Ampoule did nothing for me",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "offbeat_genre",
        "body": "Has anyone tried the SKIN FOOD propolis honey essence? Would be curious about your thoughts.",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "eternal-sun",
        "body": "The CNP did wonders for me- it makes my skin glowy and dewy. Had to stop using due to the price, so would love to find an affordable version!",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "ocean_800",
        "body": "I really like the tosowoong pure essense one, very light on the skin but very hydrating. Unfortunately had to stop using once I moved from a humid environment (bc of Sodium Hyaluronate) but loved the acne prevention, subtle glow and hydration.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "TrevTrev4Ev",
        "body": "The Scinic ampoule is amazing. I bought 2 on eBay recently for $10 each.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "wrkej",
        "body": "IUNIK Propolis Vitamin Synergy Serum  \n\nThis product have Vitamin C   ? Its say With the unique, optimal ratio of Propolis 70% and Vitamin C (Hippophae Rhamnoides Fruit Extract) 12%\n\n  is safe to use every day on sensitive skin\n\n\nIts say",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "teenyrabbitt",
        "body": "the cosrx one looks great! some great ingredients and not a ton of them, anyone have any thoughts on it?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "lgh07",
        "body": "Wow, thank you for doing this! It seems like CosRx is discontinuing the honey ceramide cream, my HG! And none of their new propolis products have honey in them. Looks like I’ll be adding the SkinFood serum to my CeraVe!!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "let_go_be_bold",
        "body": "I LOVE the iUnik! It’s so hydrating and really make a difference for me. Have tried their other serums and this one is just the best",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ava111sk",
        "body": "Anybody looking for Dr. Ceuracle propolis ampoule US Costco website has them 45 ml for 36.99 USD. It's 1 oz and 0.51 oz size together. You don't have to be a Costco member to purchase it. They also have Cremolab cleansing balm on clearance for 16.97 USD and Commleaf essence for 19.97 USD and gel cream for 14.97 USD. And the Urang rose ceramide cream for 26.99 USD I think which I'm planning to get if I get Christmas money. All great prices and no membership needed for these. Some other stuff you do need to be member to purchase. There is ton more Asian skincare to see. Goodal, DHC, Blythe tundra chaga pressed serum full size and crystal serum one travel size for 16.99 USD and Skin&Lab giant 3.3 oz barrierderm cream for 12.99 USD. And Pureheals centella serum and green tea mask on sale for 19 USD. The serum is awesome. Sorry I got too off topic... And still didn't mention half of the AB stuff.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Runtyettin",
        "body": "I've only tried the Elensilia one, whilst the ingredients look great it has niacinamide and lots of goodies I felt it didn't do anything at all for me, maybe slightly hydrating. Plus the problem with that is all the gold flakes, which I'd rather avoid.\nAny thoughts on the wishtrend propolis ampoule?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "melonduu",
        "body": "I finished a botrle of cosrx and iunik. Cosrx did not make my fa prone easily irritated red skin react which is nice, but it provided just a tiny amount of hydration and not much glow. The iunik is so much more moisturizing but i think the bergamot oil/one of the many many plant extracts in it irritated my skin bc nor i have to deal with a redder bumpier inner cheek area.\n\nI'm planning to try the skinfood one next, if it doesnt go well i might just go back to the cosrx.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "labellavita1985",
        "body": "I don't see any Propolis on the ingredients list for Dr. Ceuracle.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "OnTheWingsOfReality",
        "body": "I used to love the Skinfood one when it was available easily and I didn't have Malassezia Folliculitis.\nI'd to stop using the CosRX one because it irritated my FA prone skin. \nI'm looking into the Wishtrend or the iUNIK ones right now.. leaning more towards the iUNIK one because it's more affordable.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 15,
      "top_level": 15,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "46u8wk",
    "title": "Are Innisfree \"White tone up eye serums\" safe to use?",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/46u8wk/are_innisfree_white_tone_up_eye_serums_safe_to_use/",
    "score": 0,
    "num_comments": 8,
    "created": "2016-02-21T06:54:22+00:00",
    "body": "This feels like a silly question now that I've actually been using it for a month, but I am currently reading an article criticizing skin whiteners so I suddenly became paranoid. I haven't had any short term effects from the serum, and I'm not sure how well it works either. It does smell nice and works well as a moisturizer. \n\nHere are the list of ingredients: \n> WATER, BUTYLENE GLYCOL, DIMETHICONE, SQUALANE, CETYL ETHYLHEXANOATE, NIACINAMIDE, LIMNANTHES ALBA (MEADOWFOAM) SEED OIL, POLYGLYCERYL-3 METHYLGLUCOSE DISTEARATE, GLYCERYL STEARATE, LYCIUM CHINENSE FRUIT EXTRACT, RUBUS IDAEUS (RASPBERRY) FRUIT EXTRACT, VACCINIUM ANGUSTIFOLIUM (BLUEBERRY) FRUIT EXTRACT, FRAGARIA CHILOENSIS (STRAWBERRY) FRUIT EXTRACT, RUBUS CHAMAEMORUS SEED EXTRACT, CAMELLIA JAPONICA LEAF EXTRACT, ORCHID EXTRACT, OPUNTIA OCCINELLIFERA FRUIT EXTRACT, CITRUS UNSHIU PEEL EXTRACT, CAMELLIA SINENSIS LEAF EXTRACT, THEOBROMA CACAO (COCOA) EXTRACT, GINKGO BILOBA LEAF EXTRACT, VACCINIUM MACROCARPON (CRANBERRY) FRUIT EXTRACT, SAPINDUS MUKUROSSI FRUIT EXTRACT, COFFEA ARABICA (COFFEE) SEED EXTRACT, GLYCYRRHIZA GLABRA (LICORICE) ROOT EXTRACT, BROUSSONETIA KAZINOKI ROOT EXTRACT, MICA, PEG-100 STEARATE, TITANIUM DIOXIDE, POLYACRYLATE-13, CETEARYL ALCOHOL, POLYISOBUTENE, CYCLOPENTASILOXANE, XANTHAN GUM, POLYSILICONE-11, PROPANEDIOL, DISODIUM EDTA, POLYSORBATE 20, DEXTRIN, PHENOXYETHANOL, ETHYLHEXYLGLYCERIN, FRAGRANCE \n\nAre there any dangerous ingredients to look out for in particular? Thanks for your help! I really appreciate any input! I'll try to make a write up of what I learn from this!",
    "flair_text": "Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "LavenderExtract",
        "body": "It's important to remember that in general most skincare products labeled \"whitening\" are in fact -brightening-, as in they have niacinamide, or arbutin, or other ingredients that fade redness and spots to make your skin brighter.  What you're talking about is skin bleaching products.",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "angrythesaurus",
        "body": "Korean usage of English words is often not the exact same as how we commonly use them. For example, a handphone means cellphone, and a TV announcer means a TV anchor. Whitening in skincare is a synonym for brightening or skin tone evening, and it's meant to correct your skintone if there are any acne scars, dark spots, or unevenness. The only ingredient to look out for is high amounts of arbutin (like in the top 5 or so ingredients), because as far as I know that is the only ingredient that will discourage skin from making pigment (or something rather, correct me if I'm wrong). Otherwise, the common ingredients would be vitamin C, niacinamide, green tea extract, licorice, etc would all help resurfacing new skin to replace older, more damaged skin.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "phenomakos",
        "body": "I haven't seen anything bad mentioned about it in my research for this product as of yet. It's actually on my to-buy list.\n\nYou mentioned that it moisturizes well — can I ask what your skin type is and how quickly it absorbs/if it wears well under makeup? Have you been applying it to your entire eye area or just around it? The only thing that's stopped me from buying it so far is that I've been waiting to find it reasonably priced somewhere that doesn't require me to make a huge haul to justify shipping costs, so I'm very curious. \n\nEdit: It could be that the articles are criticizing actual whitening ingredients (like skin bleaching?), as opposed to brightening ingredients, which are generally what the word whitening actually means in most AB?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "FirionII",
        "body": "From my cursory googling so far, the biggest thing to watch out for is mercury in skin whiteners. The FDA has written up some advice on how to watch out for skin whiteners that contain mercury:\nhttp://www.fda.gov/ForConsumers/ConsumerUpdates/ucm294849.htm\n\nThey also linked to this list of whiteners found to contain mercury: http://www.health.state.mn.us/topics/skin/\n\nWikipedia lists some commonly used skin whitening chemicals. I guess it's helpful to always crosscheck to make sure your products don't contain these things? https://en.wikipedia.org/wiki/Skin_whitening\n\nWedMD mentions: \n> Make sure an over-the-counter skin lightener with hydroquinone has no more than 2% of that chemical.\n> If a label lists hydroquinone but doesn't say how much it contains, don't assume it's safe to use. Some foreign products contain more hydroquinone than is allowed in the U.S. and some labels may not be accurate.\nhttp://www.webmd.com/beauty/face/skin-lightening-products?page=2\n\nAnother chemical to look out for are corticosteroids (says the article I'm reading, can't link because it's a journal in my school's library, haha)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "aeht6i",
    "title": "Seborrheamedis? Chinese plant. Study in a medical journal",
    "url": "https://www.reddit.com/r/SebDerm/comments/aeht6i/seborrheamedis_chinese_plant_study_in_a_medical/",
    "score": 2,
    "num_comments": 1,
    "created": "2019-01-10T10:24:15+00:00",
    "body": "Never heard about it but I've found a study about it:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5404776/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5404776/)\n\n&#x200B;\n\n>**Participants:** Thirty-two subjects with seborrheic dermatitis were enrolled in the study. **Measurements:**  Subjects were instructed to use the study medication twice a day,  morning and evening, for a consecutive period of 42 days. In addition to  the baseline visit (Day 0), subjects visited the clinic for two  follow-up visits at Days 14 and 28 and for a final visit at Day 42. At  each visit, all parameters were evaluated. **Results:** A  reduction in all parameters evaluated was seen at almost all timepoints,  improving more from one timepoint to the next during the study period.  In addition, the patients expressed a high degree of satisfaction with  the treatment. No adverse events were reported during this study. **Conclusion:**  The study showed that after six weeks of treatment, the face cream  provided improvement in Investigator Static Global Assessment, pruritus,  desquamation, induration, and erythema.\n\nHas anybody already tried their product?\n\nIngredients: [https://www.kamedis-eu.com/products/sebo-dandruff-shampoo](https://www.kamedis-eu.com/products/sebo-dandruff-shampoo)\n\n>Ammonium Laureth Sulfate, Water(Aqua), Ammonium Lauryl Sulfate,  Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Zinc Pyrithione,  **Sapindus Mukurossi Fruit Extract**, Salicylic Acid, **Indigofera Tinctoria  Extract**, Sodium Chloride, Polyquaternium-10, Sodium Benzoate,  Triethanolamine, Fragrance (Perfume).\n\nSo there's Zinc pyrithione and salicylic acid but in addition some herbal extracts like the Sapindus and the Indigofera.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1aw8li0",
    "title": "[Product Request] Looking for alternatives for my fiancé",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1aw8li0/product_request_looking_for_alternatives_for_my/",
    "score": 2,
    "num_comments": 0,
    "created": "2024-02-21T10:08:49+00:00",
    "body": "Hi everyone!\r  \n\r  \nI'm looking for budget-friendly alternatives to my girlfriend's current skincare products.\r  \n\r  \nWhile she's been doing skincare for many years now, we're still newbies and learning a lot from this sub.\r  \n\r  \nHer current products come from a local shop/clinic (don't know how to say it in english). She went there due to acne issues after failing with a dermatologist and a clinic. I don't know if I can post links to the products, but I'll share the translated description and ingredients (thanks ChatGPT lol)\r  \n\r  \n\"Daily Sweet Soap\"\r  \n\r  \nGentle, soothing cleansing milk-soap for all skin types. 150 ml. Daily ultra-gentle cleansing milk-soap for effective removal of impurities like pollution, excess oil, cosmetics, and makeup without harming the protective surface layer. Ideal for acne-prone skin.\r  \n\r  \nAqua \\[Water\\], Urea, Propanediol, Snail secretion filtrate, Sorbitol, Propylene glycol, Dipotassium glycyrrhizate, Potassium azeloyl diglycinate, Propanediol caprylate, Saccharomyces/Sugarcane juice extract ferment extract, Arctium lappa root extract, Melaleuca alternifolia (Teatree) leaf oil, Saccharide isomerate, Styrax benzoin gum, Sapindus mukurossi fruit extract, Benzalkonium chloride, Parfum \\[Fragrance\\], CI 75810 \\[Chlorophyllin-copper complex\\], Hexyl cinnamal, Linalool, Hydroxycitronellal, Geraniol.\r  \n\r  \n2) \"Multi Action Serum\"\r  \n\r  \nAcne, rosacea, and inflammation serum. Balances skin microbiota and sebum, improves dark spots, and smoothens the skin. 100 ml. It prevents acne, rosacea, and folliculitis with anti-free radical action, controls sebum secretion, balances skin microbiota, and counters hyperkeratosis. Improves dark spots, evens out facial color, tightens and smoothens the skin. Lifting effect.\r  \n\r  \nAqua \\[Water\\], Coco-betaine, Lauroyl/Myristoyl methyl glucamide, Glycerin, Hydroxyethylcellulose, Propanediol, Sodium hyaluronate, 1,2-Hexanediol, Glyceryl stearate, Caprylic/capric triglyceride, Methylpropanediol, Ceteareth-20, Dipotassium glycyrrhizate, Cetearyl alcohol, Sorbitol, Hydrogenated ethylhexyl olivate, Hydrogenated olive oil unsaponifiables, Lauryl glucoside, Polyglyceryl-2 dipolyhydroxystearate, Sodium polyacrylate, Hydrolyzed collagen, Caprylhydroxamic acid, CI 75810 \\[Chlorophyllin-copper complex\\], Parfum \\[Fragrance\\], Sodium dehydroacetate.\r  \n\r  \n3) \"Vitamin C\"\r  \n\r  \nI don't think a translation is needed haha\r  \n\r  \n4) \"Cleansing Oil\"\r  \n\r  \nRemoves even the most resistant makeup. 150 ml.\r  \n\r  \nIdeal for purifying facial skin and gently removing all traces of makeup. Also suitable for delicate areas like eyes and lips. High percentage of plant oils removes impurities without harming the skin. Innovative glycerol ester creates a nourishing microemulsion for easy rinsing. Fully plant-based for nourishment and protection. Removes waterproof makeup, leaving clean, soft, and hydrated skin. Non-irritating and eye-friendly.\r  \n\r  \nCaprylic/capric triglyceride, PEG-20 glyceryl triisostearate, Prunus amygdalus dulcis oil, Ethylhexyl stearate, Argania spinosa kernel oil, Isoamyl cocoate, Parfum, Oenothera biennis oil\r  \n\r  \nHer routine:\r  \n\r  \nMorning:\r  \n\r  \nCleanser Oil\r  \n\r  \nSerum\r  \n\r  \nVitamin\r  \n\r  \nEvening:\r  \n\r  \nOil\r  \n\r  \nSerum\r  \n\r  \nVitamin\r  \n\r  \nRegarding Vitamin C I found the Melano CC on this sub. Greenlight?\r  \n\r  \nThank you in advance to everyone!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "141aaqu",
    "title": "A new local product",
    "url": "https://www.reddit.com/r/SebDerm/comments/141aaqu/a_new_local_product/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-06-05T10:40:01+00:00",
    "body": "There's a new product in my country, local manufacturing.\nI checked the ingredients over sezia.co and it came up with one \"bad\" ingredient (Polysorbate 20).\nBut it says that it has multiple anti fungals that maybe overcomes this particular ingredient.\nI know Piroctone Olamine is good anti fungal, but it's in the end of the list, so I guess there's not a lot of it in this product.\nDo you guys recognize any other anti fungals in here that I maybe didn't find?\n\nThis is the list:\nWater, Ammonium Laureth Sulfate,Cocamidopropyl Betaine, Acrylates Copolymer,Ammonium Lauryl Sulfate, Sodium LauroylSarcosinate, Sapindus Mukurossi Fruit Extract,Polysorbate 20, Styrene/Acrylamide Copolymer,Triethanolamine, Polyquaternium-10, SodiumChloride, Salicylic Acid, Piroctone Olamine, SodiumBenzoate, Climbazole, Fragrance, Citric Acid,Indigofera Tinctoria Extract.",
    "flair_text": "Product Question",
    "flair_template_id": "9010acb6-e88b-11ea-b1b9-0ef3bc6b5891",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2vpk0j",
    "title": "Just bought a glycolic overnight peel, can I use it in conjunction with anything else?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2vpk0j/just_bought_a_glycolic_overnight_peel_can_i_use/",
    "score": 1,
    "num_comments": 1,
    "created": "2015-02-13T00:03:22+00:00",
    "body": "Ingredients of the peel are at the bottom of the post.\n\nAt night, I normally use it as an opportunity to apply a night cream/serum (like The Body Shop's Tea Tree Blemish Fade Night Lotion, Lush Full of Grace Serum or Superdrug Vitamin E Serum), as well as spot treatment cream (currently using Neutrogena Rapid Clear with salicylic acid). Should I not use these things the night that I use the glycolic overnight peel? I won't be too bothered if I can't use the spot treatment because I know AHAs help acne, but it will be a shame if I can't use a night cream or serum because I love the opportunity for that deep moisturising.\n\n\nAqua, Propylene Glycol, Alcohol Denat., Glycerin, Vaccinium Myrtillus Fruit Extract, Xanthan Gum, Saccharum Officinarum Extract, Citrus Aurantium Dulcis Fruit Extract, Citrus Limon Fruit Extract, Acer Saccharum Extract, Sapindus Mukurossi Fruit Extract, Caesalpinia Spinosa Gum, Palmaria Palmata Extract, Glycolic Acid, Parfum, Actinidia Chinensis Fruit Extract, Nelumbium Speciosum Flower Extract, Morus Nigra Leaf Extract, Disodium EDTA, Potassium Sorbate, Sodium Benzoate, Phenoxyethanol, Ethylhexylglycerin, Citronellol, Coumarin, Eugenol, Geraniol, Linalool, Sodium Hydroxide.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "khas0414",
        "body": "Looks like it has alcohol and some potentially irritating extracts.  Heck, just look at how far down the list glycolic acid is and look at all the ingredients before it...  I think there a lot of better options for AHAs out there, but if you like this one and your skin tolerates it, I guess it could work.\n\nI think you should be able to use the moisturizers without problem, but the spot treatment could be too much to handle.  Once again, your skin decides what it likes and doesn't like, but I would just be more careful.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "eprgxy",
    "title": "Dog Ate Lip Mask",
    "url": "https://www.reddit.com/r/AskVet/comments/eprgxy/dog_ate_lip_mask/",
    "score": 0,
    "num_comments": 1,
    "created": "2020-01-16T23:15:45+00:00",
    "body": "Hi!! My dog ate less than 0.02 g of the Laneige Lip Mask this afternoon and I’m trying to figure out if the ingredients are toxic for her?? My vet is closed and my next course of action will probably be calling poison control but I’m trying to find out before i have to do so!! \n\nHere is the ingredients list: \n\nDiisostearyl Malate, Hydrogenated Polyisobutene, Phytosteryl/Isostearyl/Cetyl/Stearyl/Behenyl Dimer Dilinoleate, Hydrogenated C6-14 Olefin Polymers, Polybutene, Microcrystalline Wax, Shea Butter, Synthetic Wax, Candelilla Wax, Sucrose Tetrastearate Triacetate, Hydrogenated Butylene/Ethylene/Styrene Copolymer, Ethylene/Propylene/Styrene Copolymer, Mica, Astrocaryum murumuru Seed Butter, Titanium Dioxide, Dimethicone, Aromatics, Polyglyceryl-2 Diisostearate, Dehydroacetic Acid, Methicone, Carnauba Wax, Polyglyceryl-2 Triisostearate, CI 15985, CI 15850, Polyhydroxystearic Acid, Water, Potassium Alginate, Propanediol, Glycerin, Alcohol, Lycium Fruit Extract, Cranberry Fruit Extract, Strawberry Fruit Extract, Raspberry Fruit Extract, Sapindus mukurossi Fruit Extract, Blueberry Fruit Extract,  Rubus chamaemorus Seed Extract, Coffee Extract, Chenopodium quinoa Seed Extract, Magnesium Sulfate, Calcium Chloride, Sodium Hyaluronate, Beta-Glucan, Manganese Sulfate, Zinc Sulfate, Ascorbyl Glucoside",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. \n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]