[
  {
    "subreddit": "AsianBeauty",
    "post_id": "7u2j65",
    "title": "[Review] Tosowoong Apricot Seed Cleansing Oil",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/7u2j65/review_tosowoong_apricot_seed_cleansing_oil/",
    "score": 38,
    "num_comments": 8,
    "created": "2018-01-30T17:12:58+00:00",
    "body": "Hey all! I'm back with review #2 in my series of lesser-discussed product reviews. I hope the one for the [Benton TT Mist] (https://www.reddit.com/r/AsianBeauty/comments/7trt3u/review_benton_honest_tt_mist/) was useful, as I'm new to writing reviews. If you were/weren't a fan, feel free to leave a comment letting me know what you thought! On to today's review!\n\n**Tosowoong Natural Pure Apricot Seed Cleansing Oil**\n\nI need to confess right off the bat that Sulwhasoo Gentle Cleansing Oil is my forever and always HG first cleanser, and I will never find a product I like more. That being said, at $30 for a 6oz (170ml) bottle on Amazon, it's not a product my bank account will allow me to put on my face every day. And that's where Tosowoong comes in...it's a good, basic cleansing oil that helps me stretch my precious Sulwhasoo a bit further. I know the Propolis Sparkle Ampoule is the Tosowoong product that gets all the buzz around here, but the cleanser is seriously under-hyped, in my humble opinion. \n\n**Packaging:** The cleanser comes in a 120ml clear plastic bottle with an orangey label and a brown pump top. It's certainly simple, but the little apricot drawing on the front is cute, and more importantly, the packaging is practical. The clear bottle means that you can see when you're running out, and the pump top came with a detachable/re-attachable plastic piece that keeps the pump from being pushed down when the product's not in use. It held up great in my checked back through two flights recently, so that's a plus. The one downside is that the plastic top does feel a bit flimsy...it hasn't broken on me yet, but I'm always a bit worried that it might when I'm traveling. \n\n**Ingredients:** This was a bit tricky, as the ingredients aren't listed in English on the packaging. But thanks to [this] (https://www.reddit.com/r/AsianBeauty/comments/3c7vij/has_anyone_tried_the_tosowoong_apricot_seed/) post from u/riceprincesspt back in 2015, I was able to find the full ingredients list. As far as I know, it has not been reformulated since then, and the ingredients list remains the same. Oil cleansers are always a bit tricky, as oils seem to be a bit polarizing in terms of which ones break different people out. Unsurprisingly, apricot seed oil is the first ingredient listed, present in a concentration of 40%. While I haven't heard of many people irritated by apricot seed oil, some of the other ingredients may keep some folks away. CosDNA lists Isopropyl Myristate (a derivative of coconut oil) as a 5 on their acne trigger scale, while olive oil and jojoba oil both score a 2. \nThe product also contains mineral oil and fragrance, which some people are sensitive to. \n\nHere is the full ingredients list:\n\nApricot Seed oil (40%), Mineral Oil, PEG-20, Glyceryl Triiso, Stearate, Jojoba Seed Oil (5%), Isopropyl Myristate, PEG-8 Isostearate, Cetyl Ethylhexanoate, Macadamia Seed Oil, Olive Oil, Argan Spinosa Kernel Oil, Tocopheryl Acetate, Sodium Hyaluronate, Papaya Fruit Extract, Saponaria Officinalis Leaf/Root Extract, Lemon Extract, Apple Extract, Fragrance\n\n**Price:** I got mine for $14 on Jolse, which works out to about 12 cents per ml\n\n**Use and Performance:** I've used the Tosowoong Natural Pure Apricot Seed Cleansing Oil for  more than two months now. Like any other oil cleanser, this one should be applied to a dry face. Simply apply the oil cleanser, rub it in for a bit of an oil massage if you'd like, then apply water to emulsify and rinse. It has a relatively strong smell compared to other cleansers I've tried. I know logically that it smells like apricot pits, but to me, it smells like pumpkin. Not in a pumpkin spice way, but in a carving pumpkins for Halloween while its seeds are roasting in the oven way. \n\nI've found that 3 pumps is the magic number for me with this cleanser. It's a fairly thin consistency, which is both good and bad...it gives it plenty of slip for a nice oil massage, but also means that I tend to lose more product than I'd like. I've consistently been able to get grits while massaging with this product. And this cleanser emulsifies like a dream. All it takes is a bit of water and hardly any effort to turn it into a white foamy consistency that washes off cleanly. I'm seriously impressed by its emulsifying power and the fact that it doesn't leave any residue or dryness. I still like to follow up with a water-based cleanser, but not because of anything this cleansing oil leaves behind.\n\n Using an oil cleanser in general has been really great for my acne. That being said, I don't think that the Tosowoong apricot seed cleanser is as effective as my Sulwhasoo cleanser in unclogging my pores and thus preventing acne. It's a *very* subtle difference, but if I use this one too often, it starts to add up, and my breakouts get a little worse. I don't think it's a case of the cleanser itself breaking me out, because as I said, it washes off cleanly, and as far as I know none of its ingredients break me out. However, I just don't think it cleanses as deeply and effectively as my other oil cleanser by just a very slight margin. As I don't use it every day, it's not a big detractor for me, but I may consider trying something different in the future. \n\n**Final Thoughts:** This cleansing oil gets major points for its emulsifying and rinsing off abilities. There's no film, and no weird sensation left over. I think that this cleanser would work really well as an introduction to oil cleansing due to the ease of use and the fact that it's pretty effective without being expensive. However, the oils it uses can be acne triggers for many, which kind of limits the number of people who can use it. Also, if you're acne prone and find that oil cleansing helps with your acne, this might not have enough oomph for you. However, if your skin isn't particularly sensitive and you're looking for a no-frills cleansing oil with a modest price tag, this might be a good option for you.\n\n**My Rating: 4/5**\n\nAs always, feel free to leave feedback or questions! ",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "spiritswithout",
        "body": "I nearly bought this but needed an emulsion also and ended up getting both from Muji. I do like thinner oils but the main thing I don't like about my current is the strong smell. Thanks for sharing this review I think I will check this one off my list.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "YT-Rei",
        "body": "nice review! sounds like you found a good oil; too bad I can't try it, my skin will not tolerate mineral oil :(",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "emmalibras",
        "body": "If you don't mind this nooby question, what are grits?",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7bxymo",
    "title": "[Product Question] Thoughts on Dermalogica Special Cleansing Gel and Active Moist?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7bxymo/product_question_thoughts_on_dermalogica_special/",
    "score": 4,
    "num_comments": 5,
    "created": "2017-11-10T01:32:38+00:00",
    "body": "My mom is a huge Dermalogica fan and swears up and down by their products. Upon moving out, she gifted me with what can only be called an industrial sized container of the Special Cleansing Gel and about 6 bottles of the Active Moist (she's...excessive, I know! Ack she really...really shouldn't have <3). So now it seems those are going to be my staple skincare products for a while.\n\n\nI was wondering what you all thought of these products and whether or not I should opt for something highly recommended by /SCA and /AB or stick with these items (my skin has zero reaction to them, neither great nor terrible. The cleansing gel foams nicely and from what I have gathered, has a neutral pH. The active moist is very light and leaves my skin slightly tacky once it dries -- I wouldn't say it's very \"plumping\")\n\nThank you for all your advice and information thus far!! <3 I'm excited to take my first plunge into true skin care :) \n\n\nEDIT: Oh! I should mention I have an oily/normal skin with hormonal acne, slightly enlarged pores in my oily areas, and PIE/PIH on my cheeks. I'm still in the beginning stages of figuring out what to do about all of this, haha. Any help would be greatly appreciated. \n\n\nAnd finally, I thought I would include an ingredient list for anyone who's interested:\n\nCleansing Gel: Water/Aqua/Eau, Sodium Laureth Sulfate, Disodium Lauroamphodiacetate, Sodium Trideceth Sulfate, Hexylene Glycol, Hydroxyethylcellulose, Lavandula Angustifolia (Lavender) Extract, Melissa Officinalis Leaf Extract, Quillaja Saponaria Bark Extract, Lavandula Angustifolia (Lavender) Oil, PPG-5-Ceteth-20, Citric Acid, Sodium Chloride, Phenoxyethanol, Methylparaben, Propylparaben.\n\nActive Moist:\nWater/Aqua/Eau, Caprylic/Capric Triglyceride, Methyl Gluceth-20, Pentylene Glycol, Butylene Glycol, Dimethicone, Lactamide MEA, Ethylhexyl Methoxycinnamate, PEG-100 Stearate, Cetearyl Alcohol Stearic Acid, Glyceryl Stearate, Lavandula Angustifolia (Lavender) Extract, Malva Sylvestris (Mallow) Flower/Leaf/Stem Extract, Hedera Helix (Ivy) Leaf/Stem Extract, Cucumis Sativus (Cucumber) Fruit Extract, Sambucus Nigra Flower Extract, Arnica Montana Flower Extract, Parietaria Officinalis Extract, Nasturtium Officinale Flower/Leaf Extract, Arctium Lappa Root Extract, Salvia Officinalis (Sage) Leaf Extract, Citrus Medica Limonum (Lemon) Fruit Extract, Saponaria Officinalis Leaf/Root Extract, Silk Amino Acids, Glycolipids, Sodium Hyaluronate, Leuconostoc/Radish Root Ferment Filtrate, Palmitoyl, Hydroxypropyltrimonium Amylopectin/Glycerin Crosspolymer, Lecithin, Vitis Vinifera (Grape) Seed Extract, Allantoin, Panthenol, Cetyl Alcohol, Polyquaternium-10, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Polysorbate 60, Aminomethyl Propanol, Disodium EDTA, Linalool, Lavandula Hybrida Oil.",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "OuttaMyFaaace",
        "body": "As far as the cleanser goes, it's nothing special.  Same with Active Moist.  The two products I think are Dermalogica's best, would be the Daily Microfoliant (DM) and their Pre-Cleanse (PC).  The DM has done more to smooth out my skin than any acid has EVER done.  As far as the PC goes, I really happen to enjoy the consistency and how long it lasts.  It's also very effective and runs over the face well.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "jolie0216",
        "body": "I have Active Moist and I like it just ok.  My skin type is OILY - just naturally very oily to the point where I've given up on anything having a real mattifying effect.   I just...never found an ideal place for Active Moist in my routine.   It's not moisturizing enough to be my PM moisturizer.   And I don't really need ANY moisturizer in the morning because my vit c serum (Sunday Riley CEO serum) and my sunscreen are plenty moisturizing on their own with me being so oily.   I will give it credit for not breaking me out, so at least it did no harm :)    It's just an ok moisturizer.   I got it at my spa this summer after my facialist recommended it to me - idk why I bought it, I really did NOT need another moisturizer.  I'm such an easy mark lol!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "9h4ql2",
    "title": "New to CGM - Products in Romania",
    "url": "https://www.reddit.com/r/curlyhair/comments/9h4ql2/new_to_cgm_products_in_romania/",
    "score": 2,
    "num_comments": 1,
    "created": "2018-09-19T12:32:44+00:00",
    "body": "Hi!\n\nSo I am just starting the CGM, and as products that are in the Very Very short list are not available here, I made some research and found 2 products that might be ok.\n\nSo, first, the conditioner: **Apivita Shine & Revitalizing Conditioner.**\n\nIngredients: water, cetyl alcohol, hydragenated castor oil isostearate, glucerin, brassicamidopropyl dimethylamine, cetyl esters, mel, olea europaea fruit oil, citrus aurantium dulcis peel oil, citrus limon peel oil, citrus paradisi peel pol, alpha-glucan oligosaccharide, capryloyl glycerin/sebacic acid copolymer, diheptyl succinate, niacimade, aqua, aspartic acid, tocopheryl acetate, panthenol. hydroxyethylcellylose, actic acid, sodium gluconate, dehydroacetic acid, gossypium herbaceum flower extract, rosmarinus officinalis leaf extract, biotin, lavandula angustifolia flower extract, sideritis syraca extract, arginine, parfum, benzyl alcohol, limolene, linalool, citronellol, hexyl cinnamal\n\nAnd, as I workout and go swimming, I wanted to get also a Shampoo: **Apivita Sensitive Scalp Shampoo** (Sulfate and Silicone free)\n\nIngredients: \n\n water, sodium cocoamphoacetate, pg-60 almond glycerides, cocamidopropyl betaine, sodium cocoyl isethionate, sodium lauroyl sarcosinate, sodium methyl cocoyl taurate, peg-4 rapeseedamide, peg-200 hydrogenated glyceryl palmate, mel extract, glycerin, gossypium herbaceum flower extract, panthenol, alpha-glucan oligosaccharide, lavandula angustifolia oil, chamomilla recutita flower extract, rosmarinus officinalis leaf extract, sodium phytate, opuntia ficus-indica stem extract, butylene arginine, saponaria officinalis leaf/root extract, polyquaternium-47, chamomila recutita flower oil, benzoic acid, dehydroacetic acid, citric acid, phenoxyethanol, alcohol, parfum, hexyl cinnamal, limonene \n\n&#x200B;\n\nWhat do you think of these products?\n\nAlso, it's not clear to me: do you have to get a shampoo that has sulfates but no silicone for one final wash? and then use another one to remove build up, that has no sulfate and no silicone?\n\nOr you can just use the second one from the beginning?\n\n&#x200B;",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  }
]