[
  {
    "subreddit": "tressless",
    "post_id": "117aepk",
    "title": "I just went to a dermatologist and there were many red flags about him.",
    "url": "https://www.reddit.com/r/tressless/comments/117aepk/i_just_went_to_a_dermatologist_and_there_were/",
    "score": 13,
    "num_comments": 25,
    "created": "2023-02-20T15:42:47+00:00",
    "body": "I go in and he asks me\n\nD- You want me to check your face?\n\nMe- No, I'm here for a hair check, I think my hairline is receding and I'm losing hair. (I pull my hair back to show my hairline).\n\nD- It's nothing.\n\nMe- But my hairline is uneven.\n\nD- It's nothing\n\nMe- Look at the sides, the hair are thinning.\n\nD- Sit over there I'll check it out.\n\nHe grabs his camera and comes to me, I pull my hair back to show my hairline, he photographs it, then we go back to the desk. He shows me on his mac the pictures, and on those pictures my hairline looked fine, he then said \"See here and here, your hairline is receding\". He then said he'll give me a recipe for something/tell me what to take, he gave me a paper prescribing a hair lotion called \"Lotion revolotion evdermia\". He told me to rub it at the edges/sides of my hairline for three months and then he told me to go back to him. Dude was smiling the whole while and when he was given 30 bucks (a 20 and a 10) he was all happy and smiley and said \"oh, you've given me change\".\n\nI checked the lotion on the company's website and I don't think it's for hair regrowth. The ingredients are these:  **Aqua (Water), Alcohol Denat, Glycerin, Azelaic Acid, Betaine, Butylene Glycol, Glycosaminoglycans, Panthenol, Niacinamide, Hydrolyzed Hyaluronic Acid, Serenoa Serrulata Fruit Extract, Allantoin, Parfum (Fragrance), Potassium Sorbate, Carbomer, Sorbic Acid, Polysorbate 20, Biotin, Methionine, Tryptophan, Cysteine, Potassium Hydroxide, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7.**\n\nAnd the lotions actions are these: \n\n* **Toning and hydration of the hair and the hair follicle**\n* **Protection against split ends and hair breakage**\n* **Deep hydration and shine**\n* **Anti-aging**\n* **Non-oily texture**\n\nOverall it was weird.",
    "flair_text": "Treatment",
    "flair_template_id": "fe3884ac-25d5-11e6-a82b-0ecb21004af1",
    "comments": [
      {
        "author": "Philly514",
        "body": "Damn OP really went to see Dr Nick",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "TimmyNouche",
        "body": "You paid the doctor directly? In cash?!?!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "hallo-ballo",
        "body": "This doctor doesn't think you have hairloss.\n\nHe just wanted you to get out politely",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "IcyCheetah3568",
        "body": "Azelaic Acid and Serenoa Serrulata (Saw palmetto) are DHT blockers. It also contains other stuff which is supposed to be good for hair and skin. Based on ingredients alone it could work. It is not finasteride but an alternative and some other ingredients. Can't say anything about the concentrations of ingredients and clinical trials of course unlike finasteride or minoxidil",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "FunOptimal7980",
        "body": "Derms are also used for skincare so it's pretty normal to ask if you want to check the face. They mostly prescribe shit for acne, rosacea, etc.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ch8mpi0n",
        "body": "Why does this sound like an episode of the Sompsons. The doctor I mean haha.\n\nThe stuff you paid is an expensive sheet because it costs that much just to make it and obtain a profit. I wouldn't say it won't work but it's not gonna keep ya hair and there are plenty of options. The good thing is. You know it's receding and it's time to treat it the proper way. As you have paid for the stuff, just use it and in the mean time seek better help.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Xtremeelement",
        "body": "why not try a online consultation? i got my finasteride prescription through lemonaidhealth, had to submit like 8 photos of my hair from different angles and then had a chat with a NP and got a prescription, easy, fast",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Forsaken_Enthusiasm6",
        "body": "maybe upload a picture so we can see",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Zdog54",
        "body": "I remember I went to my doctor years ago and asked for a script of Finasteride for hair loss and he told me he couldn't help me with that and that I'd have to see a dermatologist. Immediately knew I was gonna be jumping through hoops because I had to do that before for simple stuff so I didn't even bother. This time around I just bought my Finasteride and oral minoxidil online, no doctor or prescription required and was completely painless",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Similar-Affect2048",
        "body": "When I was 19 or 20, I went to a derm in regards to hair loss. Because I had thick hair at the time, they didn’t think I had anything to worry about, though I clearly had a receding hairline. They also made it a point to mention that they could improve my acne scars if I was interested. That was about 10 years ago and I’ve had several hair transplants since then.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AK-11",
        "body": "Got my fin prescription through Roman and it took like 20 minutes to sign up for everything and a 2 minute phone call. Get my prescription through Costco for like $9 for a 90 day supply.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Southern_Source_2580",
        "body": "OP realizes appealing to authority means Jack shit sometimes",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 12,
      "top_level": 12,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "MakeupAddiction",
    "post_id": "4hukhe",
    "title": "Patchy skin with BareMinerals foundation and primer - help!",
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/4hukhe/patchy_skin_with_bareminerals_foundation_and/",
    "score": 10,
    "num_comments": 15,
    "created": "2016-05-04T13:56:04+00:00",
    "body": "Hi! I absolutely love this sub and I'm a long-time lurker, but this is my first actual post here. I did try searching for this issue but couldn't seem to turn up the result I needed, so I'm sorry if this has already been asked and answered or if I do anything wrong!\n\nBasically, I've been searching for a perfect match in foundation for years, and I think I've finally found it in Bare Minerals Original SPF Foundation. I love the colour match, the feel, the way it doesn't seem to break me out, everything. Except... I've been finding that I end up with really patchy skin, exactly like the picture in this post: https://www.reddit.com/r/MakeupAddiction/comments/3zys04/help_why_is_my_makeup_patchy_is_it_the_products_i/ \n\nFrom reading the comments in that post, it seems that the issue tends to stem from using a water based primer against a silicone based foundation and vice versa. But I can't figure out if that's what I'm doing. I'm using Bare Minerals Blemish Remedy Mattifying Prep Gel as a primer (which feels nice and seems to be helping any spots) which I think is water-based, but I'm just not sure of the foundation. So I'm hoping someone here can help! If it is the case, I'd rather drop the primer than the foundation so if anyone has any primer recommendations I'd love to hear them :)\n\n**Ingredients of BareMinerals Original Foundation:** Bismuth Oxychloride (CI 77163), Zinc Oxide (CI 77947), Titanium Dioxide (CI 77891), Iron Oxides (CI 77491, 77492, 77499), Mica (CI 77019).\n\n**Ingredients of Blemish Remedy Mattifying Prep Gel:** Water (Aqua/Eau), Polymethylsilsesquioxane, Adipic Acid/Neopentyl Glycol Crosspolymer, Silica, Sclerotium Gum, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Lecithin, Populus Tremuloides Bark Extract, Ganoderma Lucidum (Mushroom) Stem Extract, Micrococcus Lysate, Serenoa Serrulata Fruit Extract, Dimethicone, Zinc Pca, Vp/Va Copolymer, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Amodimethicone, Hydroxypropyl Methylcellulose, Sodium Hydroxide, Limonene, Phenoxyethanol, Chlorphenesin.\n\nIf it's relevant, I've recently (as in about a week now) started an Oil Cleansing Method routine using jojoba oil, a foaming cleanser with BHA and argan oil - could any of this be part of the issue if it's not the makeup? I know oil dissolves makeup but I usually only apply a light coverage of argan oil as moisturiser in the morning, and let it dry completely for 10+ minutes. It's doing absolute wonders for my skin, so I wouldn't want to drop it but would love to hear if this is the issue so I can try and work around it.\n\nThank you all so much!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "betterrcallsaul",
        "body": "Hi! Sorry I don't know all the technicalities of the water/oil/skincare side, but I do work at bareminerals! The only thing I know to suggest is that honestly a lot of people have seemed to dislike the Blemish Remedy Gel. I've heard better results when it's used with the Blemish Ready Foundation, but overall it doesn't seem to be a favorite. It might be worth just trying out a couple of primers to see if that's the problem. If you have a bareminerals boutique near you, you can ask for samples of a few primers--I'd suggest trying the oil control version of Prime Time and maybe the original!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ghostroast",
        "body": "Are you setting the powder? In many cases, your foundation being a powder formula does not relieve you of that extra product to set, especially if you tend to be oily. I'd also recommend maybe using less product. In cases where that has happened to me, the patchiness is much more apparent in areas where my skin get most oily, (around the nose/inner cheeks) and if there's less product to rub off, the patchiness will be less obvious.  \n\nPersonally I've seen this problem a lot with powder products, although it can happen with and formula. I think they just don't layer very well compared to liquids. \n\nLastly, as you already said, try ditching the primer. If using no primer is unsuccessful, you'll just have to start experimenting with different bases/textures. I know it sounds annoying but if you're wedded to a particular product sometimes that's what you get stuck with!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "lolihull",
        "body": "Hey! So I'm not an expert by any means but my makeup tends to get similar looking to that picture when I'm at work. I've tried using different types of primers, foundations, powders, and setting sprays but so far I've only learned a few things:  \n  \n- It tends to happen on days where I'm quite stressed or sweating a bit more.  \n- It also happens if I keep powdering my nose all day. Basically the build up of too much product getting cakey.  \n- It looks worse when I use primers instead of moisturisers as a base.  \n  \nThings that helped:    \n\n- Using a longer lasting foundation like MAC's pro long wear nourishing foundation or Max Factor's Lasting Performance foundation for a more affordable alternative.  \n- A mineral based loose powder dabbed/patted on (not wiped on)  \n- NYX's matte finish setting spray.   \n  \nIf it starts happening during the day and I'm at work so I can't just take it all off and start again, I sometimes use a very light CC cream (I use Bourjois 123 Perfect CC cream) and pat a tiny bit on the affected area to smooth it out and then after a minute or so pat on some powder.  \n  \nI hope that makes sense or any of it helps :)",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "brandnew_perspective",
        "body": "That's the powder foundation right? If it's powder, it won't be silicone or water based. It would not be powder if it had water in it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "MtF",
    "post_id": "l0gici",
    "title": "Mtf body",
    "url": "https://www.reddit.com/r/MtF/comments/l0gici/mtf_body/",
    "score": 6,
    "num_comments": 7,
    "created": "2021-01-19T09:32:30+00:00",
    "body": "So I’m a male, muscular, around 5’6. Really closeted and wish I could go through with the transitioning aspect but, too much too much of a wall or hurdle in front of me. Anyways, I’ve been taking this natural curves supplements for about a week now and my chest is tender and nipples are way more sensitive. I also take booty cream from amazon, just butt enhancement cream, nothing much. I was wondering if Anybody has any experience with natural curves or can explain further that it may have some differences ? Only thing I noticed is that I’m a little more comfortable behind closed doors dressing up and my attitude about this is a little better, a little more coming out. \n\nIngredients: \n\nFACTS\n\nServing Size  1 Tablet(s)\nServings Per Container  60\nAmount Per Serving\t \t \t% DV\nCalcium (as Dicaclium Phopshate)\t120mg\t \t12%\nProprietary Herbal Blend Equivalent \t443 mg\t \t**\n   Wild Yam Extract (root)\t \t**\n   Saw Palmetto Extract (fruit)\t \t**\n   Fenugreek Extract (seed)\t \t**\n   Damiana Extract (root)\t \t**\n   Fennel Extract (seed)\t \t**\n   Motherwort Extract (leaf)\t \t**\n   Danelion Extract (root)\t \t**\n   Blessed Extract (leaf)\t \t**\n   Chaste Tree Berry Extract (leaf)\t \t**\n   Asian Ginseng Extract (root)\t \t**\n   Black Cohuosh Extract (root)\t \t**\n   Soy Isoflavones (bean)\t \t**\n   BioPerine®* (Piper nigrum) Extract (fruit)\t \t**\n** Daily Value (DV) not established.",
    "flair_text": "[Discussion]",
    "flair_template_id": "e3ed1aca-4115-11e7-959e-0ea81d67f424",
    "comments": [
      {
        "author": "Nobodyknowsmynewname",
        "body": "Don’t close the door on transition permanently. It sounds like you are exploring even while telling yourself that you can’t because it’s too hard.\n\nGive yourself permission to learn more, so you can make an informed decision. Learn all you can from as many of us as you can.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "dolo724",
        "body": "Oh, be super careful with non-hormonal treatments! Supplements generally require such large amounts, liver or kidney damage can occur in some cases.\n\nIf medical transition is a thing, prescribed hrt will be far more effective and less costly in the long run. Also, *people can't tell* because they aren't looking for it.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "IFeelSoftAndMushy",
        "body": "I'm sorry, but I am gonna go ahead and say that I do not think there is such thing as a \"curve enhancing supplement\" or \"butt enhancing cream\". It's a sham. There's no way to get around having no curves or butt without putting in real work, like working out, etc.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "iwmqti",
    "title": "Which cowash would be better for fine hair?",
    "url": "https://www.reddit.com/r/curlyhair/comments/iwmqti/which_cowash_would_be_better_for_fine_hair/",
    "score": 4,
    "num_comments": 6,
    "created": "2020-09-20T21:33:14+00:00",
    "body": "I have fine, low-porosity hair and am debating between the following. \n\nOyin Ginger Mint Co-wash:\n\n    purified water (aqua), cocamidopropyl betaine, behentrimonium methosulfate (and) cetearyl alcohol, ricinus communist (castor) oil, cetrimonium chloride, cetyl alcohol, stearyl alcohol, stearamidopropyl dimethylamine, helianthus annuus (sunflower) seed oil, phenoxyethanol (and) caprylyl glycol (preservative), hydrolyzed oat protein, Camellia Sinensis (green tea) leaf extract, fragrance, mentha arvensis (peppermint) oil, citrus sinensis (sweet orange) oil, citric acid, Zingiber officianalis (ginger) oil\n\nor As I Am Coconut Co-wash:\n\n    Aqua/Water/Eau, Cetyl Alcohol, Cetrimonium Chloride, Cetearyl Alcohol, Cocos Nucifera (Coconut) Oil, Ricinus Communis (Castor) Seed Oil, Cocos Nucifera (Coconut) Fruit Powder, Citrus Reticulata (Tangerine) Fruit Extract, Phytosterols, Camillia Sinensis Leaf Extract, PEG-40 Castor Oil, Stearlkonium Chloride, Serenoa Serrulata Fruit Extract, Quaternium-18, Propylene Glycol, C12-15 Alkyl Lactate, Fragrance/Parfum, Potassium Sorbate, Caprylyl Glycol, Phenoxyethanol, Abies Balsamea (Balsam Canada) Resin, Potassium Chloride, Limonene \n\nI usually use low-poo, but looking to add moisture for the cold weather. Thanks!",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "HMSBee",
        "body": "The Oyin has castor oil which is flagged on the isitcg ingredients checker for potential to build up. I've gone through a few jars of the As I Am cowash with my thin fine 2b hair and been very happy with it. I recently switched to Curl Junkie Daily Fix bc it is a bit lighter but it's also a bit more expensive and you have to order it online. Since the As I Am is widely available and a pretty good product for fine hair I'd recommend trying it. I alternated my wash days between that and a lowpoo so maybe that kept it from being too heavy.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "josiewittmansnark",
    "post_id": "12510i5",
    "title": "Are the serums toxic?",
    "url": "https://www.reddit.com/r/josiewittmansnark/comments/12510i5/are_the_serums_toxic/",
    "score": 4,
    "num_comments": 2,
    "created": "2023-03-28T20:22:08+00:00",
    "body": "Like many of you, I was curious about what is actually in Josie’s serums.\n\nHere are the ingredients listed for the lash growth serum and the Environmental Working Group rating (if available).\n\nIngredients: \n\nAqua - water obvi\n\nHyaluronate - “sodium hyaluronate can help your skin look youthful and supple. It also has benefits for joint and eye health.” Source: healthline \n\nPentylene Glycol: thickening agent EWG score: 1 (low toxicity)\n\nPanax Ginseng Extract: adaptogenic plant used to support hair growth EWG score: 1\n\nSwertia Japonica Extract: Asian botanical to support hair growth EWG score: 1\n\nPumpkin Seed Extract: supports hair growth\n\nAcorus Calamus Root Extract: hair growth EWG score: 1\n\nPanthenol: moisturizer EWG score: 1\n\nSerenoa Serrulata Fruit Extract: also known as saw palmetto EWG score: 1 note: this ingredient is commonly used in hair growth products but can decrease estrogen levels and is not safe for pregnant women. Source: WebMD\n\nBiotinoyl Tripeptide-1: hair growth peptide (EWG score 1, no data)\n\nMyristoyl Pentapeptide-17: hair growth peptide (EWG score 1, no data)\n\nOligopeptide-10: anti-microbial peptide (EWG score 1, no data)\n\nTocopherol: vitamin E EWG score: 1-2\n\nBiotin: hair growth vitamin EWG score: 1",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Ok-Difficulty-4853",
        "body": "That’s a big red flag - Serener Serrulata Fruit Extract ingredient isn’t safe for pregnant women and she said herself that her lash serum is safe to use during pregnancy as it is all natural. So she completely lied to make a buck and put people in danger.",
        "score": 8,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "KoreanBeauty",
    "post_id": "1accimn",
    "title": "Skinfood Shine Muscat BHA 2% Toner. Do they sell this in Korea? Has anyone used this before, if so, what was your experience with it?",
    "url": "https://www.reddit.com/r/KoreanBeauty/comments/1accimn/skinfood_shine_muscat_bha_2_toner_do_they_sell/",
    "score": 3,
    "num_comments": 2,
    "created": "2024-01-27T14:54:13+00:00",
    "body": "In Korea the highest amount allowed for BHA is 0.5% (at least over the counter). Does anyone know how are they able to sell this there or if it’s an overseas only product?\n\nI am planning on using this for pore control. If anyone has tried it, please share your experience along with your skin type and the products you have used with it. \n\n200 ml - 10,19 € (on Stylevana)\n\nIngredient list: Water, Butylene Glycol, Vitis Vinifera (Grape) Fruit Extract, Alcohol, Salicylic Acid, Tromethamine, Sodium Citrate, PPG-13-Decyltetradeceth-24, 1,2-Hexanediol, Polyglyceryl-10 Laurate, Hydroxyacetophenone, Gluconolactone, Betaine, Salix Alba (Willow) Bark Extract, Panthenol, Fragrance, Allantoin, Citric Acid, Sodium Phytate, Prunus Mume Fruit Extract, Lactuca Scariola Sativa (Lettuce) Leaf Extract, Cucumis Sativus (Cucumber) Fruit Extract, Enantia Chlorantha Bark Extract, Argania Spinosa Kernel Oil, Beta-Glucan, Sodium Hyaluronate, Caprylyl Glycol, Sesamum Indicum (Sesame) Seed Oil, Hydroxypropyltrimonium Hyaluronate, Beta-Sitosterol, Serenoa Serrulata Fruit Extract, Oleanolic Acid, Sodium Acetylated Hyaluronate, Hydrolyzed Hyaluronic Acid, Tocopherol, Hyaluronic Acid, Sodium Hyaluronate Crosspolymer, Hydrolyzed Sodium Hyaluronate, Potassium Hyaluronate\n\nEdit: typo ",
    "flair_text": "QUESTION",
    "flair_template_id": "11e82302-dd32-11e3-bf1c-12313d18e464",
    "comments": [
      {
        "author": "Hefty-Pirate3664",
        "body": "it was released not long ago. 0.2 bha is sold in korea. krw 12,000 including shipping. its quite good for managing dead skin rather than pores",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "1izfe1g",
    "title": "I got advice from a dermatologist/skincare webstore - can you help me sanity check if this is a good routine? (Ingredients in post!)",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/1izfe1g/i_got_advice_from_a_dermatologistskincare/",
    "score": 3,
    "num_comments": 5,
    "created": "2025-02-27T13:10:45+00:00",
    "body": "She recommended me the following for my combination skin with acne/redness around the nose area\n\nMORNING\n\n* [Biretix Cleanser](https://incidecoder.com/products/biretix-cleanser)\n* DermaSence Seborra Soothing Gel Cream (INGREDIENTS AT BOTTOM OF POST)\n* [Heliocare A-R Emulsion](https://incidecoder.com/products/heliocare-360o-md-a-r-emulsion-spf50)\n   * I think the above is too expensive, so I want a substitute. Are either of the two below decent subs? I want it to to not be oily/sticky, but dry onto my skin nicely.\n   * [Subtitute one, Isntree Watery Sungel with Hyaluronic Acid](https://incidecoder.com/products/isntree-hyaluronic-acid-watery-sun-gel-spf50-pa)\n   * [Substitute two: Beauty of Joseon Rice Probiotics Sunscreen SPF50+](https://incidecoder.com/products/beauty-of-joseon-rice-probiotics-sunscreen)\n   * (Also, is SPF necessary on overcast days where I do not go out at all?)\n\nEVENING\n\n* Biretix cleanser again\n* [Biretix isorepair cream](https://incidecoder.com/products/cantabria-labs-biretix-isorepair-cream)\n\nAqua, Canola oil, Glycerin, Octyldodecanol, Persea gratissima (avocado) oil, Propanediol, Hydrated silica, Polyglyceryl-6 stearate, Niacinamide, Serenoa serrulata fruit extract, Tocopheryl acetate, Pyridoxine HCl, Brassica campestris (rapeseed) sterols, Zinc PCA, Rheum rhabarbarum extract, Salicylic, Isatis tinctoria leaf extract, Bisabolol, Tocopherol, Helianthus annuus (sunflower) seed oil, Humulus lupulus (hops) extract, Polyacrylate crosspolymer-6, Pentylene glycol, Glyceryl stearate, Polyglyceryl-6 behenate, Ethyl ferulate, Phenoxyethanol, Hydroxyacetophenone, Lactic acid, Sodium hydroxide, Citric acid, Parfum.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "JoesCoins",
        "body": "What is a dermatologist/skincare webstore?\n\nI wouldn't use any Biretix products, they seem like a money grab imo. \n\nI would pick the BoJ sunscreen, but I have never tried it.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "nom0gl",
    "title": "Ducray Kelual DS Cream",
    "url": "https://www.reddit.com/r/SebDerm/comments/nom0gl/ducray_kelual_ds_cream/",
    "score": 3,
    "num_comments": 7,
    "created": "2021-05-30T22:15:55+00:00",
    "body": "Anyone has experience with the Kelual DS Cream by Ducray?\n\nI have very mild SD with only redness and minor flakiness around my nose. Daily zinc pca and BHA make sure it doesn't worsen with stress or cold, but I haven't seen much of a baseline improvement. Wondering if this might help, as there isn't much over the counter available.\n\n&#x200B;\n\n[ WATER \\(AQUA\\), CAPRYLIC\\/CAPRIC TRIGLYCERIDE, DIMETHICONE, DICAPRYLYL ETHER, CETEARYL ALCOHOL, LACTAMIDE MEA., GLYCOLIC ACID, GUANIDINE CARBONATE, GLYCERYL STEARATE, POLYMETHYL METHACRYLATE, CETEARETH-33, BISABOLOL, ETHANOLAMINE, GLYCYRRHETINIC ACID, PIROCTONE OLAMINE, SERENOA SERRULATA FRUIT EXTRACT, SODIUM CHLORIDE, TETRASODIUM EDTA, TOCOPHEROL ](https://preview.redd.it/2i9yzjcf0c271.png?width=235&format=png&auto=webp&s=a0067c0d566f7e34544db9acf3b2629f1244da54)",
    "flair_text": "Product Question",
    "flair_template_id": "9010acb6-e88b-11ea-b1b9-0ef3bc6b5891",
    "comments": [
      {
        "author": "v4Lo",
        "body": "I have tried it. Expect the tube to be empty relatively quickly despite the miniscule outlet. It works, but not better than just using a (German) 2 euro otc piroctone olamine shampoo daily on face / scalp. I find the price of that creme pretty ridiculous in comparison. I needed to use it daily for good effect. Advantage is that it helps skipping showers and you don't dry our your face by using shampoo on it. But it cant really fix itchy scalp if you're not going full bald. The creme actually gave me thoughts of just buying piroctone olamine outright and mixing my own creme but I haven't followed through yet. Optimally something I could use on my scalp (with short hair) too so that I  no longer am dependent on washing facilities. (for camping etc)",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "m4rbel_101",
        "body": "I use it around the nose during acute phases and it is ok!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Eucalypteae",
        "body": "Update op? Did you use it did it help with redness?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTransplants",
    "post_id": "1gz26un",
    "title": "Hair Serums",
    "url": "https://www.reddit.com/r/HairTransplants/comments/1gz26un/hair_serums/",
    "score": 2,
    "num_comments": 2,
    "created": "2024-11-24T21:34:20+00:00",
    "body": "Someone I know recommended to use this hair serum. Is this any good? Following is the list of ingredients.\n\nINGREDIENTS: Aqua, Panthenol, Glycenn, Polysorbate-20, Propylene Glycol, Serenoa Serrulata Fruit Extract, Aloe Barbadensis Leaf Juice, Camellia Sinensis Leaf Extract, Biotin, Equisetum Arvense Extract, Niacin, Calcium Pantothenate, Humulus Lupulus Extract, Arctium Lappa Root Extract, Lawsonia Inermis Extract, Panicum Miliaceum Seed Extract, Betula Alba Leaf Extract, Urtica Dioica Leaf Extract, Chamomilla Recutita Flower Extract, Salvia Officinalis Leaf Extract, Echinacea Purpurea Extract, Calendula Officinalis Flower Extract, Centella Asiatica Extract, Melissa Officinalis Leaf Extract, Hamamelis Virginiana Leaf Extract, Tilia Cordata Flower Extract, Beta-Glucan, Maltodextrin, Benzoic Acid, Dehydroacetic Acid, Pisum Sativum Seed Extract, Phenoxyethanot, Sodium Benzoate, Malus Domestica Fruit Cell Cutture Extract, Lecithin, Xanthan Gum, Opuntia Ficus-Indica Stem Extract, Sodium PCA, Sodium Lactate, Arginine, Aspartic Acid, PCA, Glycine, Alanine, Serine, Valine, Proline, Threonine, Isoleucine, Histidine, Phenylalanine, Hyaluronic Acid, Tocopheryl Acetate, Sodium DNA, Potassium Chloride, Potassium Glutathione Isomerized Linoleate, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Tocopherol, Alcohol, Vitis Vinifera Seed Extract, Parfum, Ethylhexylglycerin",
    "flair_text": "Medication",
    "flair_template_id": "656e2dd8-c946-11ec-8cbe-d23e70b738b5",
    "comments": [
      {
        "author": "hairburner4",
        "body": "That's just snake oil. Don't waste your money",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "ccdfi4",
    "title": "What makes my hair so frizzy ( even wet )",
    "url": "https://www.reddit.com/r/curlyhair/comments/ccdfi4/what_makes_my_hair_so_frizzy_even_wet/",
    "score": 2,
    "num_comments": 18,
    "created": "2019-07-12T16:55:21+00:00",
    "body": "I think it’s the camilla rose conditioner morrocan pear, I used the as I am my hair wet looked well when used as a deep conditioner, but last time I put some camille rose alongside, and my hair was still wet but frizzy and more poofy... I live in high humidity country FIY, the ingredients : \n\nCamille rose moroccan pear conditioner custard : \n\nDistilled Water, Opuntia ficus indica (moroccan pear oil), prunus avium(cherry kernal oil), uritca oil (nettle), cocos nucifera (coconut oil), aloe barbedensis leaf juice (aloe vera juice), simmondsia chinensis (jojoba seed oil), glycerin, cetearyl alcohol, rosa canina (rosehip fruit oil), BTMS, prunus amygdalus dulcis ( sweet almond) oil, theobroma caocas (cocoa) seed butter, Phenoyethanol (optiphen) citric acid, fragrance and LOVE!\n\n\nAs I am leave in : Aqua/Water/Eau, Cetearyl Alcohol, Cetyl Alcohol, Cocos Nucifera (Coconut) Fruit Powder, Phyllanthus Emblica Fruit Powder, Beta Vulgaris (Beet) Root Extract, Phytosterols, Serenoa Serrulata Fruit Extract, Camellia Oleifera Leaf Extract, Glycerin, Pyrus Malus (Apple) Fruit Extract, Citrus Limon (Lemon) Peel Extract, Saccharum Officinarum (Sugar Cane) Extract, Betaine, Behentrimonium Methosulfate, Stearamidopropyl Dimethylamine, Citric Acid, Phenoxyethanol, Caprylyl Glycol, Potassium Sorbate, Polyacrylamide, Fragrance/Parfum, Anise Alcohol, Coumarin, Limonene.",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "MrsTruce",
        "body": "Check out this article from Naturally Curly. You might want to figure out your porosity in order to determine what is causing the frizz. Could be that you're using products that are too heavy (causing buildup), too light (not enough moisture), or that contain humectants (like glycerin, which is in that custard). If you're in a high humidity area and it's particularly hot, too, humectants aren't your friend.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "vanessashares",
        "body": "Living CG for a few months cured me of the frizzies almost completely!  You might want to give it a whirl.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "medicalmedium",
    "post_id": "1c0f1cn",
    "title": "MM shampoo",
    "url": "https://www.reddit.com/r/medicalmedium/comments/1c0f1cn/mm_shampoo/",
    "score": 2,
    "num_comments": 10,
    "created": "2024-04-10T06:36:30+00:00",
    "body": "Hey! \n\nAW recommends this shampoo on his website:   [https://www.amazon.com/Hair-Growth-Organic-Shampoo-Conditioner/dp/B018RERQM0?th=1&linkCode=sl1&tag=anthonwilliai-20&linkId=09563e243fe6f5f5e35f005d8378d746&language=en\\_US&ref\\_=as\\_li\\_ss\\_tl](https://www.amazon.com/Hair-Growth-Organic-Shampoo-Conditioner/dp/B018RERQM0?th=1&linkCode=sl1&tag=anthonwilliai-20&linkId=09563e243fe6f5f5e35f005d8378d746&language=en_US&ref_=as_li_ss_tl)\n\nBut if I take a deeper look on the ingredients, I can almost not believe that there are no chemicals involved:\n\n SHAMPOO: Aloe Barbadensis Leaf Juice (Aloe Vera), Cocamidopropyl betaine, Decyl Glucoside, Propanediol, Xanthan Gum, Tapioca Starch, Cellulose Gum, DL-Panthenol, Galactoarabinan, Matrixyl 3000, Mica (and) Titanium Dioxide, Mentha Piperita (Peppermint) Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Eucalyptus Globulus Leaf Oil, Rosmarinus Officinalis (Rosemary) Oil, Malus Domestica Fruit Cell Culture Extract, Argania Spinosa (Argan) kernel oil, Oat Amino Acids, Glycerin and Water and Serenoa Serrulata Fruit Extract (saw palmetto), Biotin, Benzyl Alcohol (and) Salicylic Acid (and) Glycerin (and) Sorbic Acid, Phenoxyethanol and Ethylhexylglycerin. \\*Organic Ingredients CONDITIONER: Aloe Barbadensis Leaf Juice (Aloe Vera)\\*, Behentrimonium methosulfate and cetearyl alcohol, Diheptyl Succinate (and) Capryloyl Glycerin/Sebacic Acid Copolymer, DL-Panthenol, Galactoarabinan, Organic orange (citrus sinensis) oil\\*, Matrixyl 3000, Eucalyptus globulus Leaf Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil\\*, Biotin, Aqua (and) Glycerin (and) Serenoa Serrulata Fruit Extract, Oat amino acids, Argania Spinosa (Argan) Kernel Oil\\*, Rosmarinus officinalis (Rosemary) Leaf Oil\\*, Malus Domestica Fruit Cell Culture Extract (and) Xanthan Gum (and) Glycerin (and) Lecithin (and) Phenoxyethanol (and) Water, Peppermint (mentha arvensis) oil\\*, Gluconolactone (and) Sodium Benzoate, Phenoxyethanol. \\*Organic Ingredients \n\n&#x200B;\n\nlet me know what you think! \n\n&#x200B;",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "dontfreezemyledger",
        "body": "I have it, never looked at ingredients; just didn´t like it, it didn´t make my hair feel smooth.  in case you look for alternatives: [https://www.myhairprint.com/products/wild-plum-shampoo](https://www.myhairprint.com/products/wild-plum-shampoo)  or ask for more opinions about this lava earth: ( it is not MM recommended)  I think in outer use it must be ok. for the first washes hair might feel dry, but the hair adjusts to that. [https://www.shop-apotheke.at/beauty/D0411298/logona-naturkosmetik-lavaerde-pulver.htm?campaign=priceC/guenstiger/00411298/NOCBP/299104563223585679&expa=gue](https://www.shop-apotheke.at/beauty/D0411298/logona-naturkosmetik-lavaerde-pulver.htm?campaign=priceC/guenstiger/00411298/NOCBP/299104563223585679&expa=gue)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Quietlyhealing",
        "body": "I found the same thing re iron supplements.\n\nAW says that iron supplements feed EBV and so to use a plant based supplement. And yet when  I looked some time ago on the website and it had listed a iron supplement that had elemental iron in it.\n\nSo this is why I don’t think he is the one posting these things on his website.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1fcvsyl",
    "title": "[product question]anyone tried Beauté Pacifique Beauté Pacifique Super 3 Anti-Wrinkle Booster",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1fcvsyl/product_questionanyone_tried_beauté_pacifique/",
    "score": 2,
    "num_comments": 1,
    "created": "2024-09-09T17:57:08+00:00",
    "body": "I have used Paulas Choice retinol 1% for 3 weeks now and i think my wrinkles have turned wors .. \nIs there anyone who has tried the Beauté Pacifique\nBeauté Pacifique Super 3 Anti-Wrinkle Booster. I live in Scandinavia. \nIm a 34 year old Scandinavia male.\n\nThe ingredient list is \n\nAqua (Water), Glycerin, Squalane, Glyceryl Stearate, Tridecyl Stearate, PEG-100 Stearate, Diethylhexyl Succinate, Tridecyl Trimellitate, Argania Spinosa (Argan) Kernel Extract, Butyrospermum Parkii (Shea) Butter Extract, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Tocopheryl Acetate, Cetearyl Alcohol, Serenoa Serrulata Fruit Extract, Sesamum Indicum (Sesame) Seed Oil, Propolis Cera Water Extract (PWE), Hordeum Vulgare Cera (Spent Grain Wax), Tocopherol, PEG-20 Stearate, Dipentaerythrityl Hexacaprylate/Hexacaprate, Argania Spinosa (Argan) Kernel Oil, Phenoxyethanol, Ethylhexylglycerin, Sodium Lactate, Saccharide Isomerate, Marrubium Vulgare Extract, Sodium Benzoate, Potassium Sorbate, Behenyl Alcohol, Stearic Acid, Retinyl Acetate, Arachis Hypogaea (Peanut) Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Lanolin, Tetrasodium Iminodisuccinate, Retinyl Palmitate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Parfum (Fragrance), Citric Acid.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guide [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "dywpzc",
    "title": "Cantu Apple Cider Vinegar Root Rinse?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/dywpzc/cantu_apple_cider_vinegar_root_rinse/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-20T04:25:11+00:00",
    "body": "**Ingredients:** WATER (AQUA, EAU), ALCOHOL DENAT., POLYSORBATE-20, GLYCERIN, ACRYLATES/C10-30 ALKYL ACRYLATE CROSSPOLYMER, VINEGAR (ACETUM), MENTHA PIPERITA (PEPPERMINT) OIL, MELALEUCA ALTERNIFOLIA (TEA TREE) LEAF OIL, PYRUS MALUS (APPLE) FRUIT EXTRACT, BUTYROSPERMUM PARKII (SHEA) BUTTER, ARGANIA SPINSOSA (ARGAN) OIL, SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL, AVENA SATIVA (OAT) KERNEL EXTRACT, MALIC ACID, GLYCOLIC ACID, LACTIC ACID, CITRIC ACID, PERSEA GRATISSIMA (AVOCADO) OIL, SERENOA SERRULATA FRUIT EXTRACT (SAW PALMETTO), ARCTIUM LAPPA ROOT EXTRACT (BURDOCK), URTICA DIOICA (NETTLE) EXTRACT, CAMELLIA SINENSIS LEAF EXTRACT (GREEN TEA), TOCOPHERYL ACETATE (VITAMIN E), MENTHOXYPROPANEDIOL, AMINOMETHYL PROPANOL, FRAGRANCE (PARFUM), ALPHA ISOMETHYL IONONE, BENZYL BENZOATE, BENZYL SALICYLATE, CITRONELLOL, GERANIOL, HEXYL CINNAMAL, HYDROXYCITRONELLAL, LIMONENE, LINALOOL, DISODIUM EDTA  \n\n\n  \nIS this okay to use on fine, thick, wavy hair? I just used it for the first time tonight and it really cut through the waxy sebum on my scalp and felt amazing. I tried searching but I cannot find anyone reviewing this product. Thank you",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "3cll17",
    "title": "Advice on handling possible \"closed comedones\" and oily skin",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/3cll17/advice_on_handling_possible_closed_comedones_and/",
    "score": 1,
    "num_comments": 3,
    "created": "2015-07-08T21:20:36+00:00",
    "body": "Hello /r/SCA! [This](http://imgur.com/lVoZhCm) is my face (After cleansing and moisturizing). The small skin tone shade bumps on my forehead, chin, and cheeks have gone down considerably since I started using my recent routine, but I worry they'll never truly go away. I wonder if I need to use a different cleanser in the morning or evening to target those problem areas and use what I'm currently using to continue the quality of skin I'm experiencing now. Also there is a quite prominent blackhead on my nose that multiple people have asked me to squeeze out. I tried once, but it was difficult and it hurt, so now I'm just self conscious about it. I don't mind spending a bit on skincare, but I trust Boscia products to work on my skin.\n\nI have Oily, Acne-Prone skin.\n\n**My Routine (AM):**\n\n* Boscia Clear Complexion Cleanser\n\n * Water, Diglycerin, Maltitol, Sodium Cocoyl Glutamate, Methyl Gluceth-10, Potassium Cocoyl Glutamate, Tea-cocoyl Alaninate, Butylene Glycol, Potassium Lauroyl Glutamate, Salix Nigra (Willow) Bark Extract, Simmondsia Chinensis (Jojoba) Leaf Extract, Epilobium Angustifolium, Flower/Leaf/Stem Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Sasa Kurilensis Water, Glycerin, Cellulose Gum, Sodium Hydroxide, Pelargonium Graveolens Flower Oil.\n\n* Boscia Clear Complexion Moisturizer\n\n * Water, Butylene Glycol, Isononyl Isononanoate, Pentylene Glycol, Diisobutyl Adipate, Silica, Isopropyl Myristate, Steareth-2, Cellulose, Salix Alba (Willow) Bark Extract, Sasa Kurilensis Water, Pinus Pinaster Bark/Bud Extract, Simmondsia Chinensis (Jojoba) Leaf Extract, Epilobium Angustifolium Flower/Leaf/Stem Extract, Argania Spinosa Kernel Extract, Alanyl Glutamine, Lonicera Caprifolium (Honeysuckle) Flower Extract, Lonicera Japonica (Honeysuckle) Flower Extract, Saccharum Officinarum (Sugar Cane) Extract, Avena Sativa (Oat) Kernel Extract, Vaccinium Myrtillus Extract, Serenoa Serrulata Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Sesamum Indicum (Sesame) Seed Extract, Acer Saccharinum (Sugar Maple) Extract, Centella Asiatica Extract, Citrus Medica Limonum (Lemon) Fruit Extract, Decylene Glycol, Citrus Aurantium Dulcis (Orange) Peel Oil, Geranium Maculatum Oil, Lavandula Angustifolia (Lavender) Oil, Eugenia Caryophyllus (Clove) Flower Oil, Polyglyceryl-10 Stearate, Glycerin, Steareth-21, Squalane, Polysorbate 60, Polysorbate 20, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Lactic Acid, Sclerotium Gum, Hydroxyethylcellulose, Xanthan Gum, Diglycerin, Titanium Dioxide (CI 77891).\n\n* Cover|FX Mattifying Primer with Acne Treatment (All over the face)\n\n * Acer Saccharum (Sugar Maple) Extract, Acetylated Glycol Stearate, Aqua, Bisabolol, Butylene Glycol, C12-15 Alkyl Benzoate, Caprylic/Capric Triglyceride, Caprylyl Glycol, Carbomer, Cetyl Peg/Ppg-10/1 Dimethicone, Citrus Aurantium Dulcis (Orange) Fruit Extract, Citrus Medica Limonum (Lemon) Fruit Extract, Cyclopentasiloxane, Dimethicone, Dimethicone Crossploymer, Dimethicone/Vinyl Dimethicone Crosspolymer, Dimethiconol, Enatia Chlorantha Bark Extract, Ethyl Linoleate, Ethyl Linolenate, Ethyl Oleate, Glycerin, Nordihydroguaiaretic Acid, Oleanolic Acid, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Peg-60 Almond Glycerides, Phenoxyethanol, Phenyl Methicone, Phytosphingosine, Polyglyceryl-4 Isostearate, Saccharum Officinarum (Sugar Cane) Extract, Salix Nigra (Willow) Bark Extract, Silica, Sorbitan Laurate, Squalane, Tetrahexyldecyl Ascorbate, Tocopherol, Tristearin, Vaccinium Myrtillus Fruit Extract.\n\n* (Soon to add) Boscia No Pore No Shine T-Zone Treatment\n\n * Water/Aqua/Eau, Cyclopentasiloxane, Silica, Butylene Glycol, Dimethicone/Vinyl Dimethicone Crosspolymer, Dimethicone, Lactobacillus/Punica Granatum Fruit Ferment Extract, Glycerin, Glycereth-26, Pentylene Glycol, Pentaerythrityl Tetraethylhexanoate, PEG/PPG-19/19 Dimethicone, Dioscorea Villosa (Wild Yam) Root Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Butyrospermum Parkii (Shea Butter), Aloe Barbadensis Leaf Juice, Cynara Scolymus (Artichoke) Leaf Extract, Dipotassium Glycyrrhizate, Tocopheryl Acetate, Squalane, Phytosterols, Ceramide 3, Soy Isoflavones, Lecithin, Arctium Lappa Root Extract, Bisabolol, Azelaic Acid, Niacinamide, Pyridoxine HCl, Zinc PCA, Caprylic/Capric Triglyceride, Caprylyl Glycol, Dipropylene Glycol, Menthyl Lactate, Silica, Ammonium Acryloyldimethyltaurate/VP Copolymer, PEG-11 Methyl Ether Dimethicone, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Hydroxyethylcellulose, Carbomer, Sodium Levulinate, Sodium Anisate, Potassium Hydroxide, Citric Acid.\n\n**My Routine (PM):**\n\n* Sephora Collection Triple Action Cleansing Water (remove makeup)\n\n * Water, PEG-6 Caprylic/Capric Glycerides, Propanediol, PEG-12 Dimethicone, PEG-40 Hydrogenated Castor Oil, Sodium Chloride, Phenoxyethanol, Poloxamer 184, Fragrance, Tetrasodium Edta, Glycerin, Citric Acid, Panthenol, Zinc Gluconate, Butylene Glycol, Calendula Officinalis Flower Extract, Cassia Angustifolia Seed Polysaccharide, D-Limonene, Linalool, Sodium Hydroxide, Hydroxyethylcellulose, BHT.\n\n* Boscia Clear Complxion Cleanser\n\n* Boscia Clear Complexion Moisturizer\n\n* Cover|FX Mattifying Primer with Acne Treatment (spot treatment).",
    "flair_text": "Skin Concerns",
    "flair_template_id": null,
    "comments": [
      {
        "author": "sofiacarolina",
        "body": "you really wanna incorporate some chemical exfoliation to fight against those closed comedones/blackheads. a combination of an AHA and BHA is what most people recommend. Paula's Choice has samples you can buy of both her 2% BHA liquid and 8% AHA gel. you wanna ease into it first by using the BHA one day then the AHA the other day, but some people can do BHA in the morning and AHA at night. make sure to use a sunscreen during the day as well bc the AHA makes your skin photosensitive. the AHA will slough off the layers of skin on the closed comedones and the BHA will penetrate them. If that doesnt work, you can go to the derm for a retinoid which will help the closed comedones and blackheads also.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "inqivb",
    "title": "[acne] Opinions on Dermalogica Toner Spray vs Murad Clarifying Spray?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/inqivb/acne_opinions_on_dermalogica_toner_spray_vs_murad/",
    "score": 1,
    "num_comments": 1,
    "created": "2020-09-06T17:53:01+00:00",
    "body": "Anyone have opinions on these two products, good or bad?\n\nI've been adding an Aha to my routine and the purging is awful.. especially for a face picker like myself. I've been at my wits-end with the acne and soon will be wearing a mask even more so I'm very worried it will get worse. My plan is to try Dr. Pimple Poppers idea of using salicylic acid body spray inside my mask..\n\nThoughts?\n\n&#x200B;\n\n**Dermalogica**\n\n**Clear Start Breakout Clearing All Over Toner**\n\nIngredients:\n\nActive: Salicylic Acid 1.00%. Inactive: Water / Aqua / Eau, Hamamelis Virginiana Water, Isoceteth-20, Ethoxydiglycol, Citrus Aurantium Dulcis Peel Oil, Lavandula Angustifolia Oil, Sodium Hydroxide, Melaleuca Alternifolia Leaf Oil, Camellia Sinensis Leaf Extract, Porphyra Umbilicalis Extract, Glycyrrhiza Glabra Root Extract, Citrus Aurantium Amara Peel Oil, Citrus Limon Fruit Oil, Cymbopogon Schoenanthus Oil, Argania Spinosa Kernel Extract, Serenoa Serrulata Fruit Extract, Sesamum Indicum Seed Extract, Citral, Hexylene Glycol, Geraniol, Limonene, Polysorbate 20, Disodium EDTA, Butylene Glycol, Linalool, Ethylhexylglycerin, Phenoxyethanol.\n\n&#x200B;\n\n**Murad**\n\n**Clarifying Body Spray**\n\nIngredients:\n\nActive: Salicylic Acid 0.5%.\n\nInactive: Water (Aqua), Alcohol Denat, Butylene Glycol, PEG-40 Hydrogenated Castor Oil, Niacinamide, Allantoin, Glycerin, Nymphaea Coerulea Flower Extract, Panthenol, Glycolic Acid, Menthol, Tocopheryl Acetate, Sodium Hydroxide, Cocamidopropyl Betaine, Cymbopogon Schoenanthus Oil.",
    "flair_text": "Acne",
    "flair_template_id": "635ca28e-d0cc-11e3-a662-12313b08b431",
    "comments": [
      {
        "author": "ReaLitTea",
        "body": "I would get the cheapest one since all the product isn’t going to have contact with your skin anyways... there might be more affordable drugstore or online options like Neutrogena salicylic acid spray",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "l4krq4",
    "title": "[Product Question] Cleanser ingredient list check",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/l4krq4/product_question_cleanser_ingredient_list_check/",
    "score": 1,
    "num_comments": 3,
    "created": "2021-01-25T09:54:02+00:00",
    "body": "Hi,\n\nMy dermatologist prescribed me the mesoestetic acne one cleanser. Please check the ingredients list and let me know if it's worth it? \n\nAqua, Propylene, Glycol, Disodium Azelate, Caprylic/Capric Triglyceride, Carbomer, Salicylic Acid, Polysorbate 80, Mandelic Acid, Disodium EDTA, Shikimic Acid, Simethicone, Serenoa serrulata Fruit Extract, Retinoxytrimethylsilane.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "4vixpr",
    "title": "[Product Question] Is this a Retinoid?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/4vixpr/product_question_is_this_a_retinoid/",
    "score": 1,
    "num_comments": 8,
    "created": "2016-07-31T20:46:19+00:00",
    "body": "I've been using [this](http://beaute-pacifique.com/shop/anti-age-og-fugtpleje-nat/super3-booster.aspx) in the belief that it is in fact a retinoid, but wanted to make sure. I've listed the ingredients below, two of which I suspect is in the retinoid family, and if they are indeed, maybe you could help me determine the potency?\n\nThese two ingredients (also listed in the full list) are:\n\n> Retinyl Acetate\n\n> Retinyl Palmitate\n\nFull list:\n> \n    Aqua/Water\n    Glycerin\n    Squalane\n    Glyceryl Stearate\n    Tridecyl Stearate\n    PEG-100 Stearate\n    Diethylhexyl Succinate\n    Tridecyl Trimellitate\n    Argania Spinosa Kernel Extract\n    Butyruspernum Parkii Butter Extract\n    Prunus Amygdalus Dulcis/Sweet Almond Oil\n    Tocopheryl Acetate\n    Cetearyl Alcohol\n    Serenoa Serrulata Fruit Extract\n    Sesamum Indicum / Sesame Seed Oil\n    Propolis Cera Water Extract (PWE)\n    Hordeum Vulgare Cera/Spent Grain Wax\n    Tocopherol,\n    PEG-20 Stearate\n    Dipentaerythrityl Hexacaprylate/Hexacaprate\n    Phenoxyethanol\n    Ethylhexylglycerin\n    Sodium Lactate\n    Saccharide Isomerate\n    Marrubium Vulgare\n    Sodium Benzoate\n    Potassium Sorbate\n    Behenyl Alcohol\n    Stearic Acid\n    Retinyl Acetate\n    Arachis Hypogaea/Peanut Oil\n    Glycyrrhiza Glabra/Licorice Root Extract\n    Lanolin\n    Tetrasodium Iminodisuccinate\n    Retinyl Palmitate\n    Accrylates/C10-30 Alkyl Acrylate Crosspolymer\n    Parfum/Fragrance\n",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "yesnomaybe-idontknow",
        "body": "[This](http://www.skinacea.com/retinoids/types-of-retinoids.html#.V567dpMrJE4) is an amazing read for retinoids. \"retinyl palmitate is not the same thing as retinol. Retinyl palmitate must first be converted to retinol, which is then converted to retinaldehyde, which is finally converted to retinoic acid, with some loss during each conversion step.\" and also \"The extra conversion step it takes for retinyl palmitate to be converted into usable retinoic acid means that you have to use a product with a very high concentration of retinyl palmitate to make it effective. Most products with retinyl palmitate (also labeled \"vitamin A\" products) tend to be moisturizing, but they are often too weak to provide any major skin benefits, especially in terms of anti-aging.\"",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "pig-newton",
        "body": "Those ingredients aren't retinoids, they're retinol esters (ie less potent than true retinoids). If that's original order of ingredients, I would say it's not very potent, since they're so far down.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "15damkw",
    "title": "Could this shampoo that's meant to restore hair cause a shed before causing regrowth?",
    "url": "https://www.reddit.com/r/tressless/comments/15damkw/could_this_shampoo_thats_meant_to_restore_hair/",
    "score": 1,
    "num_comments": 13,
    "created": "2023-07-30T03:07:48+00:00",
    "body": "I started noticing some thinning around this past November and it's been slowly advancing since. I started using this shampoo and it's accompanying conditioner a week and a half to 2 weeks ago: https://www.beautycarechoices.com/actiiv/recover-thickening-shampoo-treafor-men?lid=14097109&utm_source=google&utm_medium=cpc&utm_campaign=%24+Shopping+-+Low&utm_term=go_cmp-1749761000_adg-108589173580_ad-459940757413_pla-2094959671852_dev-m_ext-_prd-65408_sig-CjwKCAjw8ZKmBhArEiwAspcJ7q1YYOE2GOb2c2KeobYjn2hpk64RGl8elsizfRuPu7TbT5zwfN9TghoCvVsQAvD_BwE&gclid=CjwKCAjw8ZKmBhArEiwAspcJ7q1YYOE2GOb2c2KeobYjn2hpk64RGl8elsizfRuPu7TbT5zwfN9TghoCvVsQAvD_BwE&child_redir=65408#65408\n\nHowever I feel like I've noticed quicker thinning since I've started it. Could this product cause a shed before some regrowth, the way fin would?\n\nThe directions say to wet your hair in the shower, rub in the shampoo, and let it sit for 5 minutes before rinsing.\n\nProduct ingredients:\n\nWater (Aqua), Ammonium Laureth Sulfate, Glycerin, Decyl, Glucoside, Sodium Coco-Sulfate, Disodium Laureth Sulfosuccinate, Cocamidopropyl Betaine, Isostearamidopropyl Morpholine Lactate, Panthenol, Aloe Barbadensis Leaf Juice, Bacopa Monniera Leaf Extract, Camellia Sinensis Leaf Extract, Trifolium Pratense (Clover) Flower Extract, Serenoa Serrulata Fruit Extract, Lavandula Angustifolia (Lavender) Flower Extract, Zingiber Officinale (Ginger) Root Extract, Glycine Soja (Soybean) Germ Extract, Hydrolyzed Soy Protein, Polyquaternium-7, Sodium Lactate, Sodium PCA, Aspartic Acid, Arginine, PCA, Glycine, Alanine, Serine, Valine, Proline, Threonine, Isoleucine, Histidine,Phenylalanine, Glycol Distearate, PEG-150 Distearate, Tocopheryl Acetate, Amodimethicone, Laureth-4, Trideceth-12, Cocamide MEA, PEG/PPG-4/12 Dimethicone, Cetrimonium Chloride, Guar Hydroxypropyltrimonium Chloride, Fragrance, Phenoxyethanol, Hippophae Rhamnoides, Methylisothiazolinone",
    "flair_text": "Product",
    "flair_template_id": "406d510a-4ba1-11ea-8492-0e4320351cb3",
    "comments": [
      {
        "author": "Appropriate-Risk3489",
        "body": "Won't do anything to help your hair, it's just marketing nonsense. Need real medication like finasteride.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "StreamingMonkey",
        "body": "Hell no, you can get a Nioxin thickening shampoo and conditioner for 20-30 bucks on Amazon. It’s amazing.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Standard-Sleep7871",
        "body": "letting shampoo sit for 5 minutes is the worst thing you can do. why does it say that? leaving it in for more than a minute will make your hair extremely dry and will lead to hairfall. i rub shampoo on my hair for 30 seconds max and wash it immediately. i dont recommend using shampoo daily, i only use shampoo for my hair once everyday 3 days, washing your hair with just water is perfectly fine.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairTransplants",
    "post_id": "1irpc5e",
    "title": "which mesotherapy serum?",
    "url": "https://www.reddit.com/r/HairTransplants/comments/1irpc5e/which_mesotherapy_serum/",
    "score": 1,
    "num_comments": 0,
    "created": "2025-02-17T17:29:01+00:00",
    "body": "hey guys,\n\na friend of mine offers mesotherapy and has the proper equipment/mesogun to inject the serum right unter the scalp.\n\nhe's using the hair growth booster from \"dermida\", however, he encouraged me to do my own research on what serum is known to be best looking at the ingredients.\n\ni know that other solutions apart from fin/dut/min are generally seen as nothing more than snake oil here, but as he'd offer me the \"treatment\" for free and i'd only have to pay for the serum, i think it's worth a try, especially in the first months after my HT, even if it's just a 10% boost.\n\nso my question is to anyone who has more knowledge about the individual ingredients and their effectiveness than i do. as i don't want to link any specific products here, i thought just listing the ingredients that are listed on the product pages would be fine.\n\nso here you go:\n\ndermida: Biotin, Pyridoxne HCL and Thiamine HCL / essential ingredients: Vitamin B1, B5, B6 and B7. 20€/$ per 10ml\n\nskinderma: Panthenol, Biotin, Methylsilanol Mannuronate, hydrolyzed Collagen, and Glutathione 10€/$ per 10ml\n\ntoskani: Panthenol, Sabal Serrulata, Troxerutine, Glutathione, Biotin, Taurine, Ferrous Gluconate, Pyridoxine, Thiamine 25€/$ per 10ml\n\ndr. balwi mesotherapy: 10€/$ per 10ml essential ingredients: procapil, anagain, phytocelltec (plant-based stem cells). detailed: Aqua, Panthenol, Glycerin, Polysorbate-20, Propylene Glycol, Serenoa Serrulata Fruit Extract, Aloe Barbadensis Leaf Juıce, Camellia Sinensis Leaf Extract, Biotin, Equisetum Arvense Extract, Niacin, Calcium Pantothenate, Humulus Lupulus Extract, Arctium Lappa Root Extract, Lawsonıa Inermis Extract, Panicum Miliaceum Seed Extract, Betula Alba Leaf Extract, Urtica Dioica Leaf Extract, Chamomilla Recutita Flower Extract, Salvia Officinalis Leaf Extract, Echinacea Purpurea Extract, Calendula Officinalis Flower Extract, Centella Asiatica Extract, Melissa Officinalis Leaf Extract, Hamamelis Virginiana Leaf Extract, Tilia Cordata Flower Extract, Beta-Glucan, Maltodextrin, Benzoic Acid, Dehydroacetic Acid, Pisum Sativum Seed Extract, Phenoxyethanol, Sodium Benzoate, Malus Domestica Fruit Cell Culture Extract, Lecithin, Xanthan Gum, Opuntia Ficus-Indica Stem Extract, Sodium PCA, Sodium Lactate, Arginine, Aspartic Acid, PCA, Glycine, Alanine, Serine, Valine, Proline, Threonine, Isoleucine, Histidine, Phenylalanine, Hyaluronic Acid, Tocopheryl Acetate, Sodium DNA, Potassium Chloride, Potassium Glutathione Isomerized Linoleate, Butylene Glycol, PPG-26-Buteth-26, PEG-40 Hydrogenated Castor Oil, Apigenin, Oleanolic Acid, Biotinoyl Tripeptide-1, Tocopherol, Alcohol, Vitis Vinifera Seed Extract, Parfum, Ethylhexylglycerin\n\nThe last one is from the online store of Elithair, the well-known \"Hair Mill\" in Istanbul. That's why I'm most skeptical about this product, even though it's the cheapest and has the most ingredients – though that doesn't necessarily mean anything. But since all the other products in the shop, like dermarollers, etc., are outrageously overpriced, I would be surprised if this particular product was actually worth its price. On the other hand, the other manufacturers are probably making huge margins on their products as well, that's for sure.",
    "flair_text": "Medication",
    "flair_template_id": "656e2dd8-c946-11ec-8cbe-d23e70b738b5",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1ejk49a",
    "title": "URGENT: PROTEIN OVERLOAD | NEED HELP",
    "url": "https://www.reddit.com/r/curlyhair/comments/1ejk49a/urgent_protein_overload_need_help/",
    "score": 1,
    "num_comments": 2,
    "created": "2024-08-04T02:01:25+00:00",
    "body": "After using the 'Shea Moisture Coconut & Hibiscus Curl & Shine Conditioner' for more than a year, I realized I had **protein overload** — characterized by a constant \"dry/brittle\" feeling in the shower, no matter how much water/conditioner I applied on my hair.\n\nUpon realizing this, I began searching for protein-free, moisturizing shampoos for my low-porosity, 2C/3A curly hair — so that I could remove this protein build-up, while providing that much-needed moisture back to the scalp.\n\nThat said, for those who have experienced protein-buildup before / have any advice:  \n**Any MOISTURIZING, Protein-Free Shampoo Recommendations for 2C/3A, Low Porosity Curly Hair?**\n\nSome Common Proteins/Amino acids to avoid are:\n\n* Amino acids\n* Hydrolyzed Keratin\n* Hydrolyzed Oat Flour\n* Hydrolyzed Silk\n* Hydrolyzed Silk Protein\n* Hydrolyzed Soy Protein\n* Hydrolyzed Wheat Protein\n* Hydrolyzed Collagen\n* Quinoa Protein\n* Rice Protein\n\nAlso, I'm not sure if the 'As I am Rosemary Shampoo' contains any proteins / amino-acids, as I want to avoid those (so I'd truly appreciate the help!) – here's the ingredients list:\n\n* Aqua/Water/Eau, Disodium Cocoamphodipropionate, Betaine, Disodium Laureth Sulfosuccinate, Citric Acid, Cocamide Mipa, Rosmarinus Officinalis (Rosemary) Leaf Extract, Rosmarinus Officinalis (Rosemary) Leaf Oil, Mentha Piperita (Peppermint) Oil, Serenoa Serrulata Fruit Extract, Phytosterols, Inositol, Ceramide Np, Copper Tripeptide-1 (Amino Acid???), Menthol, Biotin, Melatonin, Sodium Salicylate, Polyglyceryl-10 Laurate, Potassium Olivate, Glycerin, Polyquaternium-7, Sodium Cacoyl Glutamate, Sodium Lauroyl Lactylate, Propanediol, Caprylyl Glycol, Ethylhexylglycerin, 1.2-Hexanediol, Potassium Sorbate, Sodium Benzoate.\n\n**P.S.: I can't stress enough HOW MUCH I VALUE YOUR HELP! I've been doing a lot of research on this subject, and I'm seeing mixed opinions left & right. Your recommendations on resolving a protein build-up / moisturizing, protein-free shampoos are deeply appreciated :)**",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Alternative-Dog-4634",
        "body": "Following! I over-proteined my hair as well. Excited to read others recs, I feel your pain!!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Key-Association4986",
        "body": "Grab clarifying shampoo and a deep conditioner to bring back moisture. Not sure about low porosity but try the kinky curly line",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "1fcvujw",
    "title": "Beauté Pacifique Super 3 Anti-Wrinkle Booster. Any good ?? ",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/1fcvujw/beauté_pacifique_super_3_antiwrinkle_booster_any/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-09-09T17:59:03+00:00",
    "body": "I have used Paulas Choice retinol 1% for 3 weeks now and i think my wrinkles have turned wors .. \nIs there anyone who has tried the Beauté Pacifique\nBeauté Pacifique Super 3 Anti-Wrinkle Booster. I live in Scandinavia. \nIm a 34 year old Scandinavia male.\n\nThe ingredient list is \n\nAqua (Water), Glycerin, Squalane, Glyceryl Stearate, Tridecyl Stearate, PEG-100 Stearate, Diethylhexyl Succinate, Tridecyl Trimellitate, Argania Spinosa (Argan) Kernel Extract, Butyrospermum Parkii (Shea) Butter Extract, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Tocopheryl Acetate, Cetearyl Alcohol, Serenoa Serrulata Fruit Extract, Sesamum Indicum (Sesame) Seed Oil, Propolis Cera Water Extract (PWE), Hordeum Vulgare Cera (Spent Grain Wax), Tocopherol, PEG-20 Stearate, Dipentaerythrityl Hexacaprylate/Hexacaprate, Argania Spinosa (Argan) Kernel Oil, Phenoxyethanol, Ethylhexylglycerin, Sodium Lactate, Saccharide Isomerate, Marrubium Vulgare Extract, Sodium Benzoate, Potassium Sorbate, Behenyl Alcohol, Stearic Acid, Retinyl Acetate, Arachis Hypogaea (Peanut) Oil, Glycyrrhiza Glabra (Licorice) Root Extract, Lanolin, Tetrasodium Iminodisuccinate, Retinyl Palmitate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Parfum (Fragrance), Citric Acid.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "c1vf8s",
    "title": "[Routine Help]",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/c1vf8s/routine_help/",
    "score": 1,
    "num_comments": 5,
    "created": "2019-06-18T00:28:40+00:00",
    "body": "First time post jitters here. Short backstory: I have been making an effort to invest in selfcare ever since we lost my dad at the start of the year. Skin care, primarily. Prior to January I was not using any products on my face daily, or hardly at all. No cleansers, no sunscreen, no makeup, but my bare skin was not smooth or soft, but dry especially around the mouth and the forehead, tight feeling, and I have occasional blotchy redness to my cheeks that my mum has always said is \"her rosacea\". I've been slowly trying to find products that work for my surprisingly fussy skin (I have had reactions to things like Thayers Witch Hazel, and most moisturizers just sit on my skin instead of absorbing), and despite my attempts so far have not landed on anything that hasn't lead to eventual breakouts. \n\nThe routine I have been using is as follows:\n》Aromatica Orange Cleansing Sherbert (pm)\n((Canola Oil, Sorbeth-30 Tetraoleate, Prunus Armeniaca(apricot) Kernel Oil, Polyethylene, Orbignya Oleifera (babassu) Seed Oil, Tocopherol, Citrus Aurantium Dulcis(orange) Peel Oil, Cananga Odorata Flower Oil, Cedrus Atlantica Wood Oil))\n\n》Atoclassic Real Tonic Soothing Multicleanser (pm)\n((Water, Chamaecyparis Obtusa Leaf Extract, Cocamidopropyl betaine, Chrysanthellum Indicum Extract, Potassium cocoyl glycinate, Lauryl Glucoside Dipropylene Glycol, Codonopsis Lanceolata Root Extract, Glycerin, Aloe Barbadensis Leaf Juice, Algin, 1,2-Hexanediol, Caprylhydroxamic Acid, Butylene Glycol, Disodium EDTA, Xanthium Strumarium Fruit Extract, Nelumbo Nucifera Leaf Extract, Angelica Tenuissima Root Extract, Pogostemon Cablin Leaf Extract, Poncirus Trifoliata Fruit Extract, Nardostachys Chinensis Root Extract, Lysimachia Foenum-graecum Extract))\n\n》 Skinfood Peach Sake Toner (pm)\n((Water, Alcohol Deant., Butylene Glycol, Hexylene Glycol, Propylene Glycol, Diethoxyethyl Succinate, Peg-60 Hydrogenated Castor Oil, Oleanolic Acid, Hydrogenated Lecithin, Allantoin, Bis-Peg-18 Methyl Ether Dimethyl Silane, Dimethicone, Stearyl Glycyrrhetinate, Disodium Edta, Prunus Persica (Peach) Fruit Extract, Rice Ferment Filtrate (Sake), Enantia Chlorantha Bark Extract, Chamomilla Recutita (Matricaria) Flower Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Centella Asiatica Extract, Glycine Soja (Soybean) Seed Extract, Argania Spinosa Kernel Extract, Serenoa Serrulata Fruit Extract, Sesamum Indicum (Sesame) Seed Extract, Imidazolidinyl Urea, Methylparaben, Fragrance, D&C Red No.33(Ci 17200), Fd&C Yellow No.5(Ci 19140), Fd&C Yellow No.6(Ci 15985).))\n\n》 Skinfood Peach Sake Emulsion (pm)\n((Water, Phenyl Trimethicone, Alcohol Denat., Mineral Oil, Bis-Peg-18 Methyl Ether Dimethyl Silane, Isohexadecane, Prunus Persica (Peach) Fruit Extract, Sorbitan Stearate, Polyglyceryl-3 Methylglucose Distearate, Rice Ferment Filtrate (Sake), Sesamum Indicum (Sesame) Seed Extract, Serenoa Serrulata Fruit Extract, Argania Spinosa Kernel Extract, Stearyl Glycyrrhetinate, Propylene Glycol, Hydrogenated Lecithin, Dimethicone, Carbomer, Triethanolamine, Sucrose Cocoate, Oleanolic Acid, Enantia Chlorantha Bark Extract, Butylene Glycol, Allantoin, Tocopheryl Acetate, Glycyrrhiza Glabra (Licorice) Root Extract, Glycine Soja (Soybean) Seed Extract, Chamomilla Recutita (Matricaria) Flower Extract, Centella Asiatica Extract, Disodium Edta, Methylparaben, Propylparaben, Fragrance, Silica, D&C Red No.33(Ci 17200), Fd&C Yellow No.5(Ci 19140), Fd&C Yellow No.6(Ci 15985).))\n\n》 Skinfood Peach Sake Pore Serum (pm)\n((Water, Phenyl Trimethicone, Silica, Cetyl Ethylhexanoate, Hydrogenated Polyisobutene, Isohexadecane, Polymethyl Methacrylate, Dimethicone, Polyglyceryl-3 Methylglucose Distearate, Prunus Persica (Peach) Fruit Extract, Rice Ferment Filtrate (Sake), Sorbitan Stearate, Alcohol Denat., Cetearyl Alcohol, Propylene Glycol, Carbomer, Triethanolamine, Enantia Chlorantha Bark Extract, Magnesium Aluminum Silicate, Oleanolic Acid, Sucrose Cocoate, Titanium Dioxide, Hydrogenated Lecithin, Argania Spinosa Kernel Extract, Serenoa Serrulata Fruit Extract, Sesamum Indicum (Sesame) Seed Extract, Stearyl Glycyrrhetinate, Chamomilla Recutita (Matricaria) Flower Extract, Centella Asiatica Extract, Glycyrrhiza Glabra (Licorice) Root Extract, Synthetic Fluorphlogopite, Tin Oxide, Glycine Soja (Soybean) Seed Extract, Tocopheryl Acetate, Disodium Edta, Methylparaben, Imidazolidinyl Urea, Butylparaben, Fragrance, D&C Red No.33(Cl 17200), Fd&C Yellow No.6(Cl 15985), Fd&C Yellow No.5(Cl 19140).))\n\n》 Tatcha The Indigo Cream (pm)\n((ACTIVE INGREDIENT: Colloidal Oatmeal (2%) - PURPOSE: Skin Protectant\nWater/Aqua, Squalane, Dimethicone, Propanediol, Glycerin, Diisostearyl Malate, Oryza Sativa (Rice) Bran Wax, Behenyl Alcohol, Saccharomyces/Camellia Sinensis Leaf/Cladosiphon Okamuranus/Rice Ferment Filtrate*, Indigofera Tinctoria Leaf Extract, Polygonum Tinctorium Leaf/Stem Extract, Avena Sativa (Oat) Kernel Extract, Sophora Japonica Flower Extract, Oryza Sativa (Rice) Germ Oil, Cocos Nucifera (Coconut) Oil, Inositol, Sericin, Tetrasodium Tetracarboxymethyl Naringeninchalcone, Amorphophallus Konjac Root Powder, Sodium Hyaluronate, Sorbitan Tristearate, Trihydroxystearin, Dimethicone/Vinyl Dimethicone Crosspolymer, Beheneth-20, Bis-Diglyceryl Polyacyladipate-2, Ethylhexylglycerin, Butylene Glycol, Sodium Dilauramidoglutamide Lysine, Disodium Edta, Ethylhexyl Palmitate, Sodium Acrylate/Acryloyldimethyltaurate/Dimethylacrylamide Crosspolymer, Phenoxyethanol, Titanium Dioxide (Ci77891), Tin Oxide (Ci 77861), Mica (Ci 77019)\n*Hadasei-3))\n\n》 Biore Aqua Rich Watery Essence (am)\n((Water, Alcohol, Ethylhexyl Methoxycinnamate, Lauryl Methacrylate/Sodium Methacrylate Crosspolymer, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Dimethicone, Acrylates/C10-30 Acrylate Crosspolymer, Glyceryl Stearate, Agar, Polyvinyl Alcohol, Sodium Hyaluronate, Citrus Grandis, Citrus Medica Limonum, Citrus Aurantium Dulcis, Xylitol, Butylene Glycol, Propylene Glycol, Sodium Hydroxide, Potassium Hydroxide, Phenoxyethanol, Disodium EDTA, BHT, Fragrance.))\n\nThe Aromatica oil cleanser goes on a dry face, and then I wet my hands in warm water and dampen the cleanser in circular motions which causes it to foam a little, then rinse in warm water. Then the Atoclassic gel/foam cleanser which foams lightly upon application, rinse in warm water, rinse with cool water. Pat dry with a towel, then wet a cotton pad with toner which I gently wipe over my face mostly just to remove the billions of tiny towel bits that migrate from the towel into my face when I pat dry. Then emulsion, and serum, and finally just enough moisturizer to be evenly applied.\n\nIt seemed to be working okay (some days I'd even be really happy with my skin), but lo and behold after 3 weeks I started breaking out. I wasn't careful enough after reading up on here about only adding one product at a time, so today I am have reeled back my routine to just double cleansing before bed. I know I should have a moisturizer in addition to that but I think that the Tatcha Indigo Cream may have been what tipped the cart before, so I'm hesitant to add it.\n\nMy question from all of this is- how long should I wait before slowly introducing another product? I don't want to add back too fast to discover what doesn't work. Could this have just been purging? I feel like the answer is no, but skin is weird and there's a lot that I don't know still.",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "BigQuestions5",
        "body": "Purging is only from actives. I would wait until the acne completely clears up and then start reintroducing products.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "dubberpuck",
        "body": "Normally purging may happen if you are using exfoliants. \n\nThough one thing to mention is that moisturizers are suppose to sit on the skin, especially the occlusive parts. \n\nYou don't really need an emulsion since it normally serves the same function as a cream or lotion. \n\nYou can wait about one to two weeks before introducing a new product.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "acne",
    "post_id": "qjl5dh",
    "title": "Analyse this product for me, please",
    "url": "https://www.reddit.com/r/acne/comments/qjl5dh/analyse_this_product_for_me_please/",
    "score": 1,
    "num_comments": 6,
    "created": "2021-10-31T08:19:52+00:00",
    "body": "Hello! If you have great knowledge of good and bad ingredients, I would really appreciate if you took a look at this product - that I have been recommended - and maybe analyze the ingredients as you know about. I just started to go into skincare half a year a go, and some of the products I used really made my skin freak out, so now I have what looks like acne. Have been to the doctors and I have a time at a dermatologist last in January. But until then I wanna do what I can - and two people recommended this products and said it made their acne go away and never come back, so I really feel like trying it out, but its expensive as ..... So really hoping for someone to dig deep with this product. I have normal skin, but dry at the moment.   \nThank you! \n\nProduct is called \"Beauté Pacifique Super Boost 3, high Vitamin-A\":\n\n1. Aqua (Water)\n2. Glycerin\n3. Squalane\n4. Glyceryl Stearate\n5. Argania Spinosa Kernel Extract\n6. Butyrospermum Parkii (Shea) Butter Extract\n7. PEG-100 Stearate\n8. Diethylhexyl Succinate\n9. Lanolin\n10. Tridecyl Stearate\n11. Tridecyl Trimellitate\n12. Cetearyl Alcohol\n13. Prunus Amygdalus Dulcis (Sweet Almond) Oil\n14. Tocopheryl Acetate\n15. Hordeum Vulgare Cera (Spent Grain Wax)\n16. Serenoa Serrulata Fruit Extract\n17. Sesamum Indicum (Sesame) Seed Oil\n18. Beta-Sitosterol\n19. Dipentaerythrityl Hexacaprylate/Hexacaprate\n20. Marrubium Vulgare Extract\n21. PEG-20 Stearate\n22. Argania Spinosa Kernel Oil\n23. Phenoxyethanol\n24. Ethylhexylglycerin\n25. Retinyl Palmitate\n26. Saccharide Isomerate\n27. Sodium Lactate\n28. Retinyl Acetate\n29. Arachis Hypogaea (Peanut) Oil\n30. Propolis Cera Water Extract (PWE)\n31. Stearic Acid\n32. Behenyl Alcohol\n33. Tocopherol\n34. Retinyl Propionate\n35. Parfum (Fragrance)\n36. Glycyrrhiza Glabra (Licorice) Root Extract\n37. Tetrasodium EDTA\n38. Maltodextrin\n39. Aspalathus Linearis (Rooibos) Leaf Extract\n40. Acrylates/C10-30 Alkyl Acrylate Crosspolymer\n41. BHT\n42. Sodium Benzoate\n43. Potassium Sorbate\n44. Citric Acid\n\nIs it a product worth buying to 150 dollars?\n\nThank you  \n\n\nEdit: Added my skintype",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Hour_Tear_219",
        "body": "I wouldn’t buy anything face related for $150, especially a cream that has little Vitamin-A. \n\nThese ingredients are nothing special - I wouldn’t waste your money. Out of all the ingredients, there’s only a couple that are good, but they’re at the bottom of the list. And there aren’t any active ingredients in this product  that fight off acne such as salicylic acid, benzoyl peroxide etc. I see a lot of nourishing ingredients but that’s about it. \n\nLanolin is typically what causes a lot of people to have allergic reactions to their skin. \n\nThe thing about this product that bugs me is that there are so many other ingredients piled on top of some good ones that I’m not really sure it would do a whole lot. It’s like eating a healthy tiny salad then eating a huge burger right after. It doesn’t cut it, or help. \nDermatologists prescribe high potency products that will work- and I know you are waiting for that. I would stay away from creams that are just mixes of things, and find a cream like *Differin Gel*, which is a topical retinoid called Adapalene, that will help keep your skin from becoming too oily, thus stopping majority of breakouts. You can get it at your local store over the counter. it only costs like $12-$30 depending on which size you get - and it’s also affective. \n\nHere is a link you can watch about it, by one of my favorite board certified dermatologists. Take a look around her channel and learn some stuff about skin- it’s amazing and would be a benefit to your knowledge so much! best of luck! \n\nhttps://youtu.be/vbaL-LAPHOk",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "OkRecord2388",
        "body": "Absolutely NOT",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Skincare_Addiction",
    "post_id": "rq9bpb",
    "title": "Can Ya'll help me figure out what order to apply all these skincare products I ordered?",
    "url": "https://www.reddit.com/r/Skincare_Addiction/comments/rq9bpb/can_yall_help_me_figure_out_what_order_to_apply/",
    "score": 0,
    "num_comments": 2,
    "created": "2021-12-28T06:47:59+00:00",
    "body": "I recently turned 30 and while I kind of look young I definitely have not taken care of my skin and its starting to show unless I hide under a ton of makeup and not make any extreme facial expressions. \n\nI touch my face, rub my eyes, pick at my face, pull my eyes to apply makeup, don't wash my makeup off, use old makeup, don't use the correct soap or lotion, and have a pretty bad furrow in my brow from making angry faces and a ton of laugh lines because my husband is hilarious. I have wrinkles under my slightly dark puffy eyes, dry forehead, oily chin, etc etc. \n\nRight now I'm using a very very soft bristled brush with a flower petal shape bunch of bristles and the middle bristle bunch is shorter. I'm using Simple Truth Organic Lavender Orange Facial Cleanser, but it seems to really dry out my skin and isn't great at taking off my eye makeup. I end up scrubbing my eyes with a dry towel trying to get mascara off which I know is really bad. I also have eczema on my forehead/hairline that comes and goes.\n\nThen I use Morgan Miller Rose Hip Oil and apply it lightly with a beauty sponge at night or before makeup.\n\nI use Rico Baby Wipes with calendula to wipe my face in the morning or to try to get off makeup, but am probably too rough.\n\nI like to online shop and I love a good deal so I got three skincare packages of fancy stuff and I've been researching and creating charts for a few hours but I am at a bit of a loss.\n\nI don't want to put this stuff on wrong and fuck my skin up as I think I have sensitive skin.\n\nOk so here is what I got, what the site says what the stuff is for, and so far what I think the order should be. Some steps I have a few different products of but not sure what ingredients shouldn't be used together or maybe what is better?\n\nThanks!\n\n**^MORNING**\n\n* MURAD Renewing Eye Cream 0.5 oz\n* \n* PRIVATE DOCTOR Define Minus Serum 1.35 oz\n* \n* INC.REDIBLE COSMETICS Hemp Hydrating Lip Jelly 4 ml\n* \n* ORIGINS Original Skin™ Matte Moisturizer With Willowherb 15 ml\n* \n* PURLISSE BEAUTY Pineapple Bright Brightening Cleansing Gel 1 oz\n* \n* COMPLEX CULTURE Sonic T-Bar Facial Massager\n* \n* SCENTUALS Vitamin C Facial Serum 60 ml\n* \n* TATCHA Dewy Skin Cream 10 ml\n\n**^What ^It ^Does:**\n\nMURAD Renewing Eye Cream is a hydrating eye treatment that helps brighten, minimize fine lines, and reduce puffiness in one step. Made with a mix of peptides and retinol, it helps boost collagen production, making the delicate skin around your eyes feel more supple and soft.\n\nPRIVATE DOCTOR Define Minus Serum is no average face serum. Inspired by professional derm treatments, it uses micro-tingling spicules to deliver a cocktail of smoothing, firming, and plumping ingredients to the deepest layers of the skin.\n\nINC.REDIBLE COSMETICS Hemp Hydrating Lip Jelly is so soothing that it’s like a refreshing weekend retreat for dehydrated lips. Infused with cannabis sativa oil, this jelly-like balm hydrates and moisturizes dry, flaky lips, leaving them buttery soft and kissably smooth.\n\nORIGINS Original Skin™ Matte Moisturizer With Willowherb does way more than moisturize—this lightweight cream improves skin tone and texture, minimizes the appearance of pores, and helps control oil production so your skin looks matte throughout the day.\n\nPURLISSE BEAUTY Pineapple Bright Brightening Cleansing Gel is the perfect everyday cleanser for dull or lackluster skin. The sulfate-free formula gently removes build-up and grime, while camu camu improves uneven texture, and pineapple extract (loaded with vitamin C) helps brighten your skin tone.\n\nCOMPLEX CULTURE Sonic T-Bar Facial Massager is a sonic-powered tool that delivers a modern facial massage to increase blood flow, reduce puffiness, relieve facial tension, and help tone facial contours. Give yourself the daily luxury of an at-home massage to temporarily smooth and sculpt skin.\n\nSCENTUALS Vitamin C Facial Serum is formulated with vitamin C (the G.O.A.T. of skin brighteners), hyaluronic acid, and edelweiss stem cells. This lightweight serum helps hydrate, plump, and brighten skin tone while working to protect skin from environmental damage\n\nTATCHA Dewy Skin Cream is true to its name. This luxurious cream contains ceramides, algae extract, and purple rice extract to majorly up your skin’s dew factor. It’s ideal for dry, dull skin in need of some extra moisturizing love.\n\n**^INGREDIENTS**\n\nMURAD Renewing Eye Cream\nWater (Aqua), Butylene Glycol, Tricaprylyl Citrate, Pentylene Glycol, Bis-Diglyceryl Polyacyladipate-2, Jojoba Esters, Glycerin, Boron Nitride, Caprylic/Capric/Myristic/Stearic Triglyceride, Cetyl Alcohol, Stearic Acid, Glyceryl Stearate, PEG-100 Stearate, Citrus Unshiu Peel Extract, Mangifera Indica (Mango) Seed Butter, Dimethicone, Cetyl Phosphate, Urea, Yeast Amino Acids, Trehalose, Inositol, Taurine, Betaine, Glycine Soja (Soybean) Seed Extract, Iris Florentina Root Extract, Dioscorea Villosa (Wild Yam) Root Extract, Glycine Soja (Soybean) Sterols, Trifolium Pratense (Clover) Flower Extract, Palmitoyl Oligopeptide, Palmitoyl Tetrapeptide-7, Retinol, Sodium Hyaluronate, Serenoa Serrulata Fruit Extract, Oenothera Biennis (Evening Primrose) Oil, Tocopherol, Ascorbyl Palmitate, Borago Officinalis Seed Oil, Dipeptide-2, Hesperidin Methyl Chalcone, Caprylic/Capric Triglyceride, Sodium PCA, Panthenol, Oleyl Alcohol, Steareth-20, Lecithin, Carbomer, Polysorbate 20, Sodium Potassium Aluminum Silicate, Aminomethyl Propanol, Disodium EDTA, Silica, Phenoxyethanol, Caprylyl Glycol, Chlorphenesin, Titanium Dioxide (CI 77891)\n\nPRIVATE DOCTOR Define Minus Serum\nWater, Dipropylene Glycol, Glycerin, Alcohol Denat., Betaine, Pentylene Glycol, Curcuma Longa (Turmeric) Root Extract, 1,2-Hexanediol, PVP, Dimethicone, Linum Usitatissimum (Linseed) Seed Extract, Lactobacillus Ferment, Hydrolyzed Sponge, PEG-60 Hydrogenated Castor Oil, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Butylene Glycol, Tromethamine, Lecithin, Octyldodeceth-16, Eclipta Prostrata Extract, Glyceryl Polyacrylate, Betaine Salicylate, Polyquaternium-51, Sodium Hyaluronate, Adenosine, Fragrance (Parfum), Xanthan Gum, Alcohol, Disodium EDTA, Dextrin, Phenoxyethanol, Theobroma Cacao (Cocoa) Seed Extract, Sodium Deoxycholate, Prunella Vulgaris Flower/Leaf/Stem Extract, Dioscorea Japonica Root Extract, Morus Alba Root Extract\n\nINC.REDIBLE COSMETICS Hemp Hydrating Lip Jelly\nPolyisobutene, Octyldodecanol, Paraffinum Liquidum, Ethylhexyl Hydroxystearate, Triethylhexyl Trimellitate, c30-45 Olefin, Hydroxystearic Acid, Aroma (Flavor), Cannabis Sativa (Hemp) Seed Oil, Ricinus Communis (Castor) Seed Oil, Citronellol, Hexyl Cinnamal, Isoeugenol, Limonene, Linalool, FD&C Yellow No.5 (CI 19140), D&C Red No.7 ( CI 15850)\n\nORIGINS Original Skin™ Matte Moisturizer With Willowherb\nWater\\Aqua\\Eau, Dimethicone, Alcohol Denat., Glycerin, Silica, Butylene Glycol, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Limon (Lemon) Peel Oil, Pelargonium Graveolens Flower Oil, Lavandula Angustifolia (Lavender) Oil, Amyris Balsamifera Bark Oil, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Eugenia Caryophyllus (Clove) Leaf Oil, Rosa Damascena Flower Oil, Eucalyptus Globulus Leaf Oil, Zingiber Officinale (Ginger) Root Oil, Mentha Viridis (Spearmint) Leaf Oil, Limonene, Linalool, Citronellol, Citral, Geraniol, Eugenol, Dimethicone Crosspolymer, Ammonium Acryloyldimethyltaurate/Vp Copolymer, Pyrus Malus (Apple) Fruit Extract, Cucumis Sativus (Cucumber) Fruit Extract, Epilobium Angustifolium Flower\\Leaf\\Stem Extract, Cistus Incanus Flower/Leaf/Stem Extract, Sucrose, Bambusa Vulgaris (Bamboo) Extract, Pisum Sativum (Pea) Extract, Castanea Sativa (Chestnut) Seed Extract, Albizia Julibrissin Bark Extract, Salicylic Acid, Caffeine, Arginine, Sodium Hyaluronate, Scutellaria Baicalensis Root Extract, Laminaria Saccharina Extract, Laminaria Digitata Extract, Phospholipids, Hydrolyzed Jojoba Esters, Glucosamine Hcl, Lauryl Peg-9 Polydimethylsiloxyethyl Dimethicone, Dimethicone/Vinyl Dimethicone Crosspolymer, Beeswax\\Cera Alba\\Cire D'Abeille, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Tocopheryl Acetate, Tromethamine, Silica Silylate, Hexylene Glycol, Sodium Polyacrylate, Disodium Edta, Phenoxyethanol, Mica, Titanium Dioxide (Ci 77891), Iron Oxides (Ci 77491)  Essential Oil Organic Sucrose (Brown Sugar)\n\nPURLISSE BEAUTY Pineapple Bright Brightening Cleansing Gel\nWater (Aqua), Sodium c14-16 Olefin Sulfonate, Panthenol, Glycerin, Disodium Cocoamphodiacetate, Acrylates/c10-30 Alkyl Acrylate Crosspolymer, 1% And Below, Ascorbic Acid, Vaccinium Myrtillus (Bilberry) Extract, Ananas Sativus (Pineapple) Fruit Extract, Saccharum Officinarum (Sugar Cane) Extract, Citrus Limon (Lemon) Fruit Extract, Citrus Aurantium Dulcis (Orange) Fruit Extract, Acer Saccharum (Sugar Maple) Extract, Myrciaria Dubia Fruit Extract, Polysorbate 20, Phenoxyethanol , Sodium Hydroxide, Ethylhexylglycerin, Disodium Edta, Fragrance (Parfum), Titanium Dioxide (CI 77491), Mica, Iron Oxide (CI 77491), Tin Oxide (CI 77861)\n\nCOMPLEX CULTURE Sonic T-Bar Facial Massager\nN/A\n\nSCENTUALS Vitamin C Facial Serum\nAqua, Glycerin, Volcanic Soil, Aloe Barbadensis, Silk Amino Acids, Tocopherol, Ascorbic Acid, Citrus Aurantium Dulcis Peel Oil Expressed, Leontopodium Alpinum Meristem Cell Culture, Xanthan Gum, Glycine Soja oil, 1,2-Hexanediol, Parfum, Ethylhexlgycerin, Amylopectin, Hyaluronic Acid, Citrus Limon Peel Oil, Citrus Paradisi Peel Oil, Citric Acid, Potassium Sorbate, Sodium Levulinate, Limonene, Benzyl Alcohol, Linalool, Citral\nTATCHA Dewy Skin Cream\nAqua/Water/Eau, Saccharomyces/Camellia Sinensis Leaf/Cladosiphon Okamuranus/Rice Ferment Filtrate, Glycerin, Propanediol, Dimethicone, Squalane, Diisostearyl Malate, Behenyl Alcohol, Myristyl Myristate, Dipentaerythrityl Hexahydroxystearate, Bis-Diglyceryl Polyacyladipate-2, Tridecyl Trimellitate, Chondrus Crispus Extract, Betaphycus Gelatinum Extract, Eisenia Arborea Extract, Oryza Sativa (Rice) Bran Extract, Panax Ginseng Root Extract, Origanum Majorana Leaf Extract, Thymus Serpyllum Extract, Malva Sylvestris (Mallow) Flower Extract, Sodium Hyaluronate, Inositol, Gold, Sericin, Phytosteryl Macadamiate, Butylene Glycol, Beheneth-20, Sorbitan Tristearate, Disodium Edta, Dimethicone/Vinyl Dimethicone Crosspolymer, Sodium Acrylate/Acryloyldimethyltaurate/Dimethylacrylamide Crosspolymer, Caprylyl/Capryl Glucoside, Sorbitan Isostearate, Ethylhexylglycerin, Parfum/Fragrance, Alcohol, Phenoxyethanol, Mica (Ci 77019), Titanium Dioxide (Ci 77891), Tin Oxide (Ci 77861), Violet 2 (Ci 60725). Hadasei-3\n\n\n\n\n\n\n\n\n**^NIGHTTIME**\n\n\n\n\n\n* KORRES Apothecary Wild Rose Night-Brightening Sleeping Facial 40 ml\n* \n* ONEKIND Dream Cream Nighttime Moisturizer 50 ml\n* \n* 111SKIN Hyaluronic Acid Aqua Booster 20 ml\n* \n* MASQUEOLOGY 24k Gold Under Eye Gel 15 ct\n* \n* THE CRÈME SHOP Rose & Gold Fusion Sheet Mask 2ct\n* \n* DR. BRANDT SKINCARE Microdermabrasion Age Defying Exfoliator 2 oz\n\n**^What ^It ^Does:**\n\nDR. BRANDT SKINCARE Microdermabrasion Age Defying Exfoliator is a powerful exfoliating treatment that will get your skin smooth, clear, and feeling like new. Ultra-fine aluminum oxide crystals and lactic acid buff away dead skin cells leaving your complexion ultra-radiant and glowy. Gently massage onto damp skin, leave it on for one to two minutes, then rinse. It also helps minimize the look of fine lines, dark spots, and uneven texture. \n\n111SKIN Hyaluronic Acid Aqua Booster is a hydrating booster serum that is your new secret weapon for soft, dewy skin. It’s full of hyaluronic acid—a humectant that draws moisture to your skin—to help combat dehydration and dryness and help make your complexion more smooth and plump.\n\nKORRES Apothecary Wild Rose Night-Brightening Sleeping Facial is a fluffy souffle-like formula with vitamin C and wild rose extract that helps brighten up dull skin and improve uneven tone and texture while you snooze.\n\nONEKIND Dream Cream Nighttime Moisturizer is made with repairing rosehip oil, anti-inflammatory chamomile, and moisturizing squalane that works its magic while you sleep so you can wake up to healthier, more youthful-looking skin.\n\nMASQUEOLOGY 24k Gold Under Eye Gel is like a good night’s sleep in a bottle (for your eyes, at least), and is formulated with gold, collagen, and niacinamide to help depuff and brighten dark under-eye bags and circles. 24K gold has been used in skincare for hundreds of years due to its anti-aging properties and can reduce the breakdown of elastin and collagen, increasing the suppleness of your skin.\n\nTHE CRÈME SHOP Rose & Gold Fusion Sheet Mask is a fusion sheet mask that delivers the benefits of two powerful ingredients plus the added hydration of hyaluronic acid. Rose oil soothes, calms, hydrates and revitalizes tired skin, while astringent properties help reduce oil production. 24k gold stimulates skin cells for improved circulation and intense brightening, and helps increase skin elasticity for resilience. \n\n**^Ingredients-**\n\n\n\nKORRES Apothecary Wild Rose Night-Brightening Sleeping Facial\nAqua/Water/Eau, Glycerin, Glyceryl Stearate Citrate, Dicaprylyl Carbonate, Triheptanoin, Alcohol Denat., Behenyl Alcohol, Glyceryl Stearate, Aloe Barbadensis Leaf Juice, Isodecyl Neopentanoate, Simmondsia Chinensis (Jojoba) Seed Oil, Cera Alba/Beeswax/Cire D’Abeille, Lecithin, Imperata Cylindrica Root Extract, Acacia Decurrens/Jojoba/Sunflower Seed Wax Polyglyceryl-3 Esters, Rosa Canina Fruit Oil, Acrylates/c10-30 Alkyl Acrylate Crosspolymer, Ascorbyl Tetraisopalmitate, Caprylyl Glycol, Carbomer, Cetearyl Alcohol, Citric Acid, Distarch Phosphate, Galactoarabinan, Glycine Soja (Soybean) Oil, Glycine Soja (Soybean) Sterols, Helianthus Annuus (Sunflower) Seed Oil, Hydrolyzed Sodium Hyaluronate, Hydroxyethyl Acrylate/ Sodium Acryloyldimethyl Taurate Copolymer, Lactic Acid, Parfum/Fragrance, Phenoxyethanol, Rosa Canina Fruit Extract, Rosmarinus Officinalis (Rosemary) Leaf Extract, Rosmarinus Officinalis (Rosemary) Extract, Sodium Benzoate, Sodium Gluceptate, Sodium Hydroxide, Tetrahydrodiferuloylmethane, Tocopherol, Tocopheryl Acetate, Xanthan Gum\n\nONEKIND Dream Cream Nighttime Moisturizer\nAqua/Water/Eau, Coco-Caprylate, Glycerin, Cetearyl Alcohol, Caprylic/Capric Triglyceride, Copernicia Cerifera (Carnauba) Wax, Glyceryl Stearate, Squalane, Phenoxyethanol, Sodium Acrylates Copolymer, Cetearyl Glucoside, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Butyrospermum Parkii (Shea) Butter, Helianthus Annuus (Sunflower) Seed Oil, Rosa Canina (Rosehip) Fruit Oil, Sesamum Indicum (Sesame) Seed Oil, Theobroma Cacao (Cocoa) Seed Butter, Lecithin, Ethylhexylglycerin, Olea Europaea (Olive) Fruit Oil, Sodium Phytate, Lavandula Angustifolia (Lavender) Oil, Alcohol, Chamomilla Recutita (Matricaria) Flower Extract, Hordeum Vulgare (Barley) Seed Extract, Tocopheryl Acetate, Anthemis Nobilis (Chamomile) Flower Oil, Cymbopogon Martini (Palmarosa) Oil, Ormenis Multicaulis (Moroccan Chamomile) Oil, Pelargonium Graveolens (Geranium) Flower Oil, Rosa Damascena (Rose) Flower Oil, Linalool, Canola Oil, Aloe Barbadensis (Aloe Vera) Leaf Juice\n\n111SKIN Hyaluronic Acid Aqua Booster\nAqua / Water / Eau, Glycerin, Hyaluronic Acid, Cellulose Gum, Aloe Barbadensis (Aloe Vera) Leaf Extract, Benzyl Alcohol, Polysorbate 20, Sodium PCA, Fructose, Urea, Niacinamide, Sodium Benzoate, Lactic Acid, Sodium Lactate, Glycine, Inositol, Tocopherol\n\nMASQUEOLOGY 24k Gold Under Eye Gel\nWater, Glycerin, Chondrus Crispus (Carrageenan), Dipropylene Glycol, Butylene Glycol, Ceratonia Siliqua Gum, Phenoxyethanol, Xanthan Gum, PEG-60 Hydrogenated Castor Oil, Allantoin, Niacinamide, Methylparaben, Potassium Chloride, Synthetic Fluorphlogopite, Tocopheryl Acetate, Dipotassium Glycyrrhizate, Adenosine, Disodium EDTA, Fragrance, Calcium Lactate, Titanium Dioxide, Aloe Barbadensis Leaf Juice Powder, CI 77491, Punica Granatum Fruit Extract, Ficus Carica (Fig) Fruit Extract, Morus Alba Fruit Extract, Ginko Biloba Nut Extract, Sodium Hyaluronate, Tin Oxide Maltodextrin, Hydrolyzed Collagen, Gold\n\nTHE CRÈME SHOP Rose & Gold Fusion Sheet Mask\nWater, Glycerin, Butylene Glycol, 1,2-Hexanediol, Sodium Hyaluronate, Salix Alba (Willow) Bark Extract, Origanum Vulgare Leaf Extract, Chamaecyparis Obtusa Leaf Extract, Lactobacillus/Soybean Ferment Extract, Cinnamomum Cassia Bark Extract, Scutellaria Baicalensis Root Extract, Portulaca Oleracea Extract, Colloidal Gold, Rose Canina Fruit oil, Hydroxyacetophenone, Betaine, Carbomer, PEG-60 Hydrogenated Castor Oil, Arginine, Trideceth-10, Allantoin, Disodium EDTA, Fragrance\n\nDR. BRANDT SKINCARE Microdermabrasion Age Defying Exfoliator\nWater (Aqua), Alumina, Glycerin, Caprylic/Capric Triglyceride, Cetyl Alcohol, Glyceryl Stearate, Ammonium Acryloyldimethyltaurate/VP Copolymer, Simmondsia Chinensis (Jojoba) Seed Oil, Xanthan Gum, Peg-100 Stearate, Phenoxyethanol, Lactic Acid, Menthone Glycerin Acetal, Caprylyl Glycol, Allantoin, Disodium Edta, Tocopheryl Acetate, Sodium Benzoate, Aloe Barbadensis Leaf Extract, Vitis Vinifera (Grape) Seed Extract, SD Alcohol 40-A, Camellia Sinensis Leaf Extract, Propylene Glycol, Chamomilla Recutita (Matricaria) Flower Extract, Fragrance (Parfum), Citral, Limonene\n\n\n\n\n**^OTHER**\n\nTotally tugless Take The Day Off Makeup Remover For Lids, Lashes & Lips dissolves and \"lifts away\" long-wearing makeup, even waterproof mascara.\n\nTake The Day Off Cleansing Balm transforms into a silky oil, removing even the most tenacious makeup.\n\nAll About Clean Foaming Facial Soap cleanses gently, at home and away.\n\nMoisture Surge 100H Hydrator replenishes skin with nonstop hydration for 100 hours.\n\nAll About Eyes is a lightweight, refreshing eye cream that hydrates, brightens, and de-puffs.\n\n\n**^Includes**\n\n\n* Full Size All About Clean Foaming Facial Soap (5.0 oz)\n* \n* Full Size Moisture Surge 100HR Auto-Replenishing Hydrator (1.7 oz)\n* \n* Take The Day Off Makeup Remover For Lids, Lashes & Lips (4.2 oz)\n* \n* Take The Day Off Cleansing Balm (0.05 oz)\n* \n* Moisture Surge 100HR Auto-Replenishing Hydrator (0.05 oz)\n* \n* All About Eyes (0.05 oz)\n* \n\nI also got a Clinique Dramatically Different Moisturizing Lotion+ \n\n\n**^How ^to ^Use**\n\nAll About Clean Foaming Facial Soap: Lather between palms with lukewarm water. Massage gently over wet skin, avoiding eye area. Rinse off. Follow with Clarifying Lotion to clear the way for smoother, brighter skin.\n\nMoisture Surge 100HR Auto-Replenishing Hydrator: Use morning and night on clean skin. Can be used under or over makeup and also as a 5-minute mask.\n\nTake The Day Off Makeup Remover For Lids, Lashes & Lips: Shake well before using. Saturate cotton ball. Sweep on. Wipe off. Rinse with cool water before reapplying makeup.\n\nAll About Clean Foaming Facial Soap: Lather between palms with lukewarm water. Massage gently over wet skin, avoiding eye area. Rinse off. Follow with Clarifying Lotion to clear the way for smoother, brighter skin.\n\nTake The Day Off Cleansing Balm: Use fingertips to massage balm over dry skin. Rinse well with warm water. Pat dry. Follow with your 3-Step Skin Care System.\n\nAll About Eyes: Use twice a day, morning and night. With ring finger, apply sparingly to entire eye area using a gentle patting motion.\n\n\n\n**\n**^HOW ^I ^THINK ^IT ^SHOULD ^BE ^APPLIED\n\n^MORNING****\n\n* Oil Based Cleanser-Purlisse\n* \n* Water Based Cleanser-All About Clean\n* \n* Toner or Astringent-Witch Hazel?\n* \n* Antioxidant Serum-Private DR\n* \n* Spot Treatment\n* \n* Eye Cream- All About Eyes or Murad\n* \n* Light Face Oil?\n* \n* Moisturizer-Origins or Moisture Surge Or Tatcha\n* \n* Heavier Face Oil-Rose Hip Oil?\n* \n* Sunscreen\n* \n* Milani Primer Spray and then Maybelline Foundation\n* \n* Lip Jelly\n\n**\n^NIGHT**\n\n* Oil Based Makeup Remover-Take The Day Off Makeup Remover and T.T.D.O Cleansing Balm\n* \n* Water based Cleanser- All About Clean\n* \n* Exfoliator or Clay Mask-Dr Brandt\n* \n* Hydrating Mist or Toner- I have Proactive Toner?\n* \n* Acid Treatment- Whats this?\n* \n* Serums or Essence- Private DR or Scentuals\n* \n* Spot Treatment- \n* \n* Hydrating Serum or Mask- 111skin\n* \n* Eye Cream- All About Eyes or Murad\n* \n* Face Oil- Rose Hip Oil??\n* \n* Night Cream or Sleep Mask- Onekind\n* \n* Lip Jelly\n\n\n\nI have Proactiv Face mask, 2.5% proactiv benzoyl peroxide something, cerave facial foaming cleanser 4% benzoyl peroxide too\n\n\n\nThe ones that dont have a brand could you make a suggestion that wont break the bank? and maybe how important they are?\n\nI know this is a lot but I would appreciate any help\n\nI'm reading this too\n\nhttps://www.masterclass.com/articles/how-to-build-a-skin-care-routine#the-perfect-9step-skincare-routine\n\nThis says anything with Glycol should only be used at night, and a ton of these morning and night have different glycols.....????\n\nok thanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Brymlo",
        "body": "That’s a lot of text and a lot of products. \n\nYou should avoid putting that much on your face. \n\nThe usual order goes like this:\nCleanse - treat - protect\n\nYou could start with micellar water to remove makeup (Cerave micellar water is a good choice), then cleanse with a gentle (that’s important) cleanser. \nThen you put any treatment you are using (you should avoid using much, unless needed). \nAnd finally you use a good moisturizer (depending on the type of your skin) and sunscreen. \n\nI recommend treating only with vitamin c serum / niacinamide in the morning and retinol at night. Retinol is the most effective way to even the skin and reduce wrinkles and spots. \nAvoid any products with alcohol denat (so most toners and astringents) and exfoliants.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  }
]