[
  {
    "subreddit": "SkincareAddiction",
    "post_id": "buzgpq",
    "title": "[Product Question] Aluminum-free deodorant... has anyone tried “By Humankind”? (vs Schmidt’s vs Myro)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/buzgpq/product_question_aluminumfree_deodorant_has/",
    "score": 6,
    "num_comments": 6,
    "created": "2019-05-30T22:26:59+00:00",
    "body": "Was curious if anyone has tried the “by Humankind” aluminum free deodorant? I currently use Schmidt’s, and have tried Myro. Experiences below. \n\nI switched to Schmidt’s about a year ago and had some issues with tenderness and lumps at the beginning that I attributed to my body getting used to sweating again, and probably getting rid of the aluminum. For the most part it’s fine now, and I love the scent, but I have certain times where it really irritates my underarms. It might be irritation from shaving but I’m not sure. Other times it’s totally fine and I find it very effective in combating odor. However, I have also had issues with inconsistencies in their product, and bad customer service, so I have been on the lookout for something else. \n\nI once tried Myro which has no baking soda, and I liked the idea of a refillable container to cut down on plastic waste. However I found it really ineffective even after using for a week to let my body “get used to it.” I had to apply 3-4 times a day. It was also very thin and liquidy feeling. Not a fan!\n\nI saw an ad today for By Humankind and was intrigued. It’s a refillable package to cut down on waste, and has baking soda which I don’t mind, since I think that’s probably why I found the Schmidt’s more effective. Or maybe the coconut oil in Schmidt’s is what makes it more effective? Anyway, has anyone tried this brand?\n\nWas just curious on everyone experiences, or if there are any other brands you recommend. I included the ingredients for each one below in case anyone is interested. \n\nMyro -\nAqua/Water/Eau, Propanediol, Stearic Acid, Parfum/Fragrance*, Hordeum Vulgare Powder, Maltodextrin, Sodium Hydroxide, Isoeicosane, Polyisobutene, Glycerin, Isohexadecane, Hydrolyzed Corn Starch, Cocos Nucifera (Coconut) Oil, Olea Europaea (Olive) Fruit Extract, Oryza Sativa (Rice) Extract, Hydrogenated Starch Hydrolysate, Maltooligosyl Glucoside, Butylene Glycol, Cetearyl Alcohol, Glyceryl Stearate, Polyglutamic Acid, Sodium Dilauramidoglutamide Lysine, Sodium Lauroyl Glutamate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Sodium Hydroxypropylsulfonate Laurylglucoside Crosspolymer, Arginine, Sodium PCA, Limonene\n\nBy Humankind -\nShea Butter, Arrowroot Powder, Squalane, Stearyl Alcohol, Ethylhexyl Palmitate, Baking Soda, Sucrose Stearate, Tapioca Starch, Hydrogenated Castor Oil, Zinc Oxide, Behentrimonium Methosulfate, Cetearyl Alcohol, Beeswax, Eucalyptus Scent Essential Oils: \nEucalyptus, Cedar, Lavandin,  Bergamot, Star Anise, Fir Needle\n\nSchmidt’s Lavender Sage -\nMarantha arundinacea (arrowroot) powder, cocos nucifera (coconut) oil, euphorbia cerifera (candelilla) wax, butyrospermum parkii (shea butter), sodium bicarbonate (baking soda), caprylic/capric triglyceride (fractionated coconut oil), simmondsia chinensis (jojoba) seed oil, lavandula (lavender) essential oil, salvia sclarea (clary sage) essential oil, tocopherol (vitamin E, sunflower derived).",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "dreadedwheat",
        "body": "I use an AHA as a deodorant and it’s the best I’ve ever used. Amazing, actually.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "flowersfromneptune",
        "body": "I use the Dove aluminum free deodorant and have had good results so far!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "kittykiko",
        "body": "Schmidt's offers a few of their deodorant scents in a sensitive skin formula that doesn't have baking soda. I used to use the regular formula and it made me break out into terrible rashes, especially if I used it after shaving. Turns out baking soda can be sensitizing. I have no issues at all with the sensitive skin formula but I am considering switching to Myro since it seems to be one of the low waste options on the market.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hedgehog",
    "post_id": "1emqh61",
    "title": "is this safe for my hedgehogs?",
    "url": "https://www.reddit.com/r/Hedgehog/comments/1emqh61/is_this_safe_for_my_hedgehogs/",
    "score": 1,
    "num_comments": 6,
    "created": "2024-08-07T23:14:43+00:00",
    "body": "ingredients are: Water, decyl glucoside, lauryl glucoside, glycerin, buttermilk powder, linum usitatissimum (flax) seed oil, avena sativa (oat) kernel flour, aloe barbadensis leaf juice, camellia sinensis (green tea) extract, honey, beeswax, sodium hydroxypropylsulfonate laurylglucoside crosspolymer, coco-glucoside, glyceryl oleate, xanthan gum, citric acid, phenoxyethanol, potassium sorbate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "hedgiepumpkin",
        "body": "i’m personally not sure but i’d just recommend soaking oats in water or buying the aveeno baby wash oat shampoo :)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Emotional_Stick_6917",
        "body": "Personally I feel like any shampoos dry them out too much and are harsh. I usually just soak my boy in oats but if I do use a wash it’s the “Aveeno Baby Creamy Wash”. I’ve found the aveeno shampoo or cleansing therapy, anything besides the “creamy wash” is too harsh",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  }
]