[
  {
    "subreddit": "MakeupAddiction",
    "post_id": "4o4cfk",
    "title": "\"Preliminary\" review of Urban Decay Makeup Meltdown Wipes",
    "url": "https://www.reddit.com/r/MakeupAddiction/comments/4o4cfk/preliminary_review_of_urban_decay_makeup_meltdown/",
    "score": 73,
    "num_comments": 29,
    "created": "2016-06-14T23:23:45+00:00",
    "body": "I was on Sephora.com last week about to order some Kat Von D makeup removing wipes (I was hoping to find something that would take off waterproof everything and I recall the sample of hers doing the trick, as in being ridiculously oily.) when I came across something brand new: [Urban Decay's Makeup Removing Wipes](http://www.sephora.com/meltdown-makeup-remover-wipes-P409954?skuId=1850403&icid2=D=c6:products%20grid:p409954). I can literally not find these anywhere else, not a review, nothing. Or at least I couldn't prior to Friday. I was trying to find an ingredient list before ordering, but it was as though they did not exist other than the listing on Sephora.com to buy.  Since they were really reasonably priced (ETA: reasonable by Sephora standards.) and you get 100 wipes in the pack, I figured what the hell. I seem to have no self control when it comes to anything makeup related and just buy it like it's nothin'. \n\nhttp://imgur.com/b2kCl2Z\n\nThey arrived today and even though it's only 530 pm, and I really don't normally take my makeup off this early so as not to scare small children or offend their sensibilities (my niece has some pretty strong opinions about me going out without makeup on: she \"doesn't prefer it.\") I could not wait to test them out and see if they worked better than the [Aveeno ones](http://www.ulta.com/ulta/browse/productDetail.jsp?productId=xlsImpprod5600049)  (shit, yo, Ulta charges way more, get em at Target or Drugstore.com or something!) I'd been using or if they burned any less. (FYI--they still burn but not as badly, but I have ridiculously sensitive skin, plus retinoids. So, everything burns.) \n\n\n\n*Sizing, and about the wipe:*\n\nThe sheets themselves are bit smaller (6.5\" x 4.5\") than the Aveeno ones (7.4\" x7.2\" per the package, so a little over 7\" square), but compared to the Aveeno ones were slightly damper--not as wet as I would like though and not as wet as I recall the Aveeno ones being in the past--and certainly not as damp as the Simple Micellar Wipes are.  I've had several packs of Aveeno ones that have been really dry lately from the start, and dried out before the pack was even half done. \n\nThe wipes themselves are texturally similar. The Aveeno ones are slightly thicker, and stronger than the UD ones, but the UD ones are labeled as biodegradable. \n\nA used UD wipe:\n\nhttp://imgur.com/tcuMw6M\n\n\n\n*Efficacy/Usage:*\n\nI usually use one Aveeno wipe (out of a 25 wipe pack) at a time, and that will take off most or all of my waterproof eye makeup (yknow, assuming it is wet enough) and then will go over my whole face with one of the Simple Micellar wipes to make sure any oiliness is gone. There are still times where I don't get all of the eye makeup off, because I pile it on. Often what is left is mascara, and I either give up, or will go over my lashes with another wipe OR use one of the Ocusoft scrub pads to get it off. \n\nI felt due to the size of the Urban Decay wipes that I needed two. I probably didn't, but for the sake of comfort, I did use two. Given that 100 come in the pack, even if I use two at a time, I will still get twice as much out of this pack assuming it doesn't dry out before I run out.  I still used the Simple wipe afterward, because again, oily.  I did not really have anything left on my eyes or lashes afterwards, and didn't feel like I needed to go over my lashes or eyes at all. There might be a tiny bit of something still on there, but not enough that I feel like I need to worry about it. I'd go to bed like this.   Tonight I have boxing, so I will still shower, so I don't care--I'll be washing my face again.\n\nBefore/After photos, try not to have nightmares:\n\nB:  http://imgur.com/P4MOMdb\n\nB:  http://imgur.com/qmJiPAq\n\nA:  http://imgur.com/1BbCxIF\n\n\n\n*Pricing:*\n\nThe price difference is significant, but I felt worthwhile.  The Aveeno wipes are around $6.99 (at Target) for a pack of 25. The Urban Decay were $20 for a pack of 100. So basically to get as many Aveeno wipes as UD wipes, you'd pay $27.96 assuming you didn't find them on sale/coupon deal. Though, I guess considering you're using two UD wipes, it's really half that, so $13.98, given I need one Aveeno for every two UD wipes (need...maybe. Used, yes.) And again, that assumes the Aveeno ones are not dried out. \n\n\n\n*Ingredients:*\n\nI took a photo of the package, it's not great. \nhttp://imgur.com/Gqw4mWc\n\nList is:\n\nWater, C12-15 Alkyl Benzoate, Ethyl Macadamiate, Polysorbate 20, Sodium Citrate, Gluconolactone, Polyglyceryl-3 Polyricinoleate, Sunflower Seed Oil, Sodium Benzoate, Olive Oil, Lavender Oil, Jojoba Seed Oil, Sodium Laurylglucosides Hydroxypropylsulfonate, Calcium Gluconate, Tocopheryl Acetate, Sodium Chloride, Rice Bran Extract, Tocopheryl, Malic Acid, Sunflower Extract, Rosemary Leaf Extract\n\n\nBut this product has five natural oils in it, vs none in the Aveeno.  Here's the list from Ulta on the Aveeno:\n\nWater, Isononyl Isononanoate, Pentaerythrityl Tetraethylhexanoate, Cetyl Ethylhexanoate, Isostearyl Palmitate, Cyclopentasiloxane, Hexylene Glycol, PEG-6, Caprylic/Capric Glycerides, Phenoxyethanol, Sucrose Cocoate, Fragrance, Carbomer, PEG-4 Laurate, Sodium Hydroxide, Benzoic Acid, Dehydroacetic Acid, Chrysanthemum Parthenium(Feverfew) Flower/Leaf/Stem Juice, Iodopropynyl Butylcarbamate, Glycerin, Cucumis Sativus (Cucumber) Fruit Extract, Aloe Barbadensis Leaf Extract.  The package says there's a 3 month shelf life, which I think given the ingredient list is interesting, though, it's heavy on the natural oils, and maybe they're less stable?  Compared to the Aveeno list, it's significantly more natural. \n\n\n\n*Bottom Line:*\n\nI am pretty impressed after one use. I will see how I feel after several more. I want to see if they dry out and how quickly they dry out if they do.   But efficacy in the first use made them worth my while. \n\nedited to correct stupid typo\n\n\n**24 hours later update:**\n\nI just did my second use today and I was able to use ONE wipe this time (well that was my requirement of myself this time), and it worked just fine, both eyes completely clean. I followed with the Simple Micellar wipe all over and briefly around my eyes, bec I am just that anal, and my face is spiffy.  Then I just applied my serums and all that after like normal.  *Fingers crossed* that my face doesn't lose it's marbles with all the natural oils. ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "temptalia",
        "body": "I picked up a pack, too!! I usually use MAC Wipes, but I got these mostly for removing swatches vs. daily makeup. Excited to try mine now!",
        "score": 20,
        "is_top_level": true
      },
      {
        "author": "TheTurdSmuggler",
        "body": "I am obsessed with Urban Decay. Ob. Sessed. However, for what it is, the price is too steep even for me. If anyone feels the same, I recommend the Simple wipes. Target has a double pack for $7-$8 usually, for 30 or 40 (I forget right now). They are in green packaging, and work wonderfully! (Now Simple-send me my free wipies lol). :)",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "dweekss",
        "body": "Thank you for doing a review! I was eyeing these and debated whether or not I should pick them up. I think I'll definitely give them a try now.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "DRHPSL05",
        "body": "That does seem like a pretty good deal for 100 wipes!  Plus the convenience of not having to buy them for 3 months (assuming 1 wipe per day). I've been using the Garnier Micellar for waterproof makeup first and then the Simple because the Garnier feels way too greasy for me (it separates in the bottle which the pink cap version & Simple don't do). I didn't want to toss it so I've been doing this combo until it runs out and then I'll go back to just Simple (I'm pretty addicted to that one).  Neither burn no matter how dehydrated my skin is, thankfully.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "sarcastinatrix",
        "body": "*Really* happy you reviewed these!  Was debating between these and a pack of MAC wipes the other night, but decided to wait until I had heard something about these. Was there any fragrance to these?  The price seems good, so I think I may order a pack since they're cheaper than the MAC ones.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "misseff",
        "body": "The price is not bad at all. ELF makeup wipes, which aren't even that great but probably the cheapest I've seen that still work somewhat, would be $15 for 100(they come in 20 packs for $3).",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "me0wdihanah4ppy",
        "body": "Thank you for your review! I appreciate how in depth you went into the wipes! I'm normally a die hard for the Nurture Me wipes by Ole Hendriksen. I saw these in our shipment at work today and was super curious as to if they were worth getting. I'm definitely going to have to try them!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ajj0061",
        "body": "I use Neutrogena wipes and I felt like they used to dry out but I started storing them upside down and it helps a lot! They don't dry out anymore :) just thought I would share in case it might help you!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "8mia6q",
    "title": "[Routine help] Fungal acne sufferer here. How/when to include zinc pyrithione shampoo in routine?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/8mia6q/routine_help_fungal_acne_sufferer_here_howwhen_to/",
    "score": 6,
    "num_comments": 1,
    "created": "2018-05-27T15:01:58+00:00",
    "body": "Hi all, \n\nI have fungal acne and slightly dehydrated skin and wasn't sure when to implement this product in my routine. It's Dr Eddie's happy cappy shampoo with zinc pyrithione 0.95% unlike other dandruff shampoos the ingredients don't appear to be as harsh, however it's still a shampoo and I don't know if I should be using it as a daily cleanser or perhaps cleanse my face with it as a weekly treatment?\n\nThe creator of the product said it's safe to use on the face but I imagine he's going to be bias\nhere are the ingredients:\nWater (Aqua), Glycerin, Sodium Lauroyl Methyl Isethionate, Sodium Laurylglucosides Hydroxypropylsulfonate, Cocamidopropyl Hydroxysultaine, Acrylates Copolymer, Pyrus Malus (Apple) Fruit Extract, Phenoxyethanol, Sodium Chloride, Guar Hydroxypropyltrimonium Chloride, Sodium Hydroxide, Dipotassium Glycyrrhizate, Panthenol, Ethylhexylglycerin, Citric Acid\n\nunsure about the PH, but I imagine it's not going to be too high as it contains citric acid and doesn't have sodium lauryl sulphate",
    "flair_text": "Routine Help",
    "flair_template_id": null,
    "comments": [
      {
        "author": "rnonavegas",
        "body": "I’ve heard good things about the happy cappy shampoo and the ingredients don’t look very irritating either. I personally use Vanicream Z-bar (2% ZnP). I was using it every single day and while it was gentle at first, a couple of weeks in the skin around my eyes started burning and became really sensitive. So I’ve scaled it down to around 4x a week and my skin is much happier. \n\nI think that since yours has half the strength of ZnP, 3-4x a week should be good while starting out.  Good luck!!",
        "score": 5,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "7k5h31",
    "title": "[Product question] The cleanser that I loved is discontinued. Help!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/7k5h31/product_question_the_cleanser_that_i_loved_is/",
    "score": 6,
    "num_comments": 6,
    "created": "2017-12-16T06:04:14+00:00",
    "body": "Hello all,   \nI was using Galderma's Benzac Skin Balancing Foaming Cleanser which had .5%SA and it was fragrance free. After not being able to find it anywhere I contacted them and it's no longer being manufactured and distributed in the US! I'm heartbroken and not sure where to turn.  \nHere are the ingredients: Salicylic Acid (0.5%). Purpose: Acne Treatment. Inactive Ingredients: Alcohol Denatured, Backhousia Citriodora Leaf Extract, Butylene Glycol, Caprylic/Capric Triglyceride, Citric Acid, Citrus Aurantium Dulcis (Orange) Peel Oil, Citrus Grandis (Grapefruit) Peel Oil, Citrus Reticulate (Tangerine) Peel Oil, Glycerin, Glycine Soja (Soybean) Oil, Lauramidopropyl Betaine, Lonicera Caprifolium (Honeysuckle) Flower Extract, Lonicera Japonica (Honeysuckle) Flower Extract, Phenoxyethanol, Polysorbate 80, Potassium Benzoate, Potassium Sorbate, Santalum Album (Sandalwood) Oil, Sodium Laurylglucosides Hydroxypropylsulfonate, Terminalia Ferdinandiana Fruit Extract, Tocopherol, Water.   \nDoes anyone know of a cleanser similar to this? It had a pH of 3.5-5.   \nI'm nervous about using a new cleanser because my skin is so sensitive and breaks out very easily. This cleanser has helped to clear my skin and calm it.   \nI would love to hear your suggestions. I looked at CosRx SA cleanser but that has such a high pH I'm worried it'll strip my skin.   \nThoughts?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Souliria",
        "body": "If you don't find anything that matches that ingredient lost, many dermatologists recommend cerave and cetaphil. Both with a foaming version and they're excellent.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "loloholmes",
        "body": "I just googled it and found people selling multipacks on ebay.com\nMight be worth buying one of those then you're stocked up for a while!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "messenia",
        "body": "CeraVe's [Renewing Cleanser](http://www.cerave.com/Our-Products/Cleansers/Renewing-SA-Cleanser) has SA. You can get that almost anywhere.\n\nYou might also want to request some samples of [Paula's Choice Skin Balancing Cleanser](http://www.paulaschoice.com/skin-balancing-oil-reducing-cleanser/115.html).\n\n> but that has such a high pH I'm worried it'll strip my skin.\n\n3.5 is a rather low pH for a cleanser.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Quynh138",
        "body": "Copy and paste the ingredient list to google and hopefully some similar cleansers will come up. Good luck!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ChoosyParents",
    "post_id": "1443pwe",
    "title": "Happy Cappy Dr. Eddie’s Medicated Shampoo",
    "url": "https://www.reddit.com/r/ChoosyParents/comments/1443pwe/happy_cappy_dr_eddies_medicated_shampoo/",
    "score": 4,
    "num_comments": 0,
    "created": "2023-06-08T08:47:42+00:00",
    "body": "&#x200B;\n\n[ ](https://preview.redd.it/9mei4yukar4b1.png?width=699&format=png&auto=webp&s=0a5d73d2c7f0e276d56815d8f564bb05282259d2)\n\n**Caution:** It's important to remember that these evaluations are guides to potential health concerns and not definitive measures of a product's safety or efficacy. They are based on individual ingredients rather than **any negative effects the final product may have.** The way ingredients interact in a formulation can influence their potential impact, and the presence of a specific ingredient does not automatically equate to harm when used in a product. It's always crucial to do your own research, consider the product as a whole, and keep in mind that personal reactions can vary greatly. When making decisions about personal care products, it is recommended to consult with healthcare professionals.\n\n&#x200B;\n\n**Brief**: This baby shampoo has gentle cleansing agents like Sodium Lauroyl Methyl Isethionate and Sodium Laurylglucosides Hydroxypropylsulfonate. However, the presence of Pyrithione Zinc signifies the shampoo is aimed at treating specific scalp conditions, such as cradle cap. It's important to use this only under a healthcare professional's advice for infants. The formula also includes Apple Extract, known for its antioxidant properties, and Panthenol, beneficial for skin hydration. Despite the inclusion of Phenoxyethanol as a preservative, it's typically safe in concentrations below 1%. Always perform a patch test to monitor possible allergic reactions.\n\n&#x200B;\n\n**Ingredients:** Pyrithione Zinc, Water (Aqua), Glycerin, Sodium Lauroyl Methyl Isethionate, Sodium Laurylglucosides Hydroxypropylsulfonate, Cocamidopropyl Hydroxysultaine, Acrylates Copolymer, Pyrus Malus (Apple) Fruit Extract, Phenoxyethanol, Sodium Chloride, Guar Hydroxypropyltrimonium Chloride, Sodium Hydroxide, Dipotassium Glycyrrhizate, Panthenol, Ethylhexylglycerin, Citric Acid.\n\n&#x200B;\n\n# Typical ingredients description and side effects\n\n&#x200B;\n\n* Sodium Hydroxide\n   * Sodium hydroxide, also known as caustic soda or lye, is a strong alkaline compound that is sometimes used in the manufacturing process of personal care products, including baby lotions. It is used to adjust the pH of the formulation to ensure stability and efficacy. However, it is important to note that sodium hydroxide itself is not typically listed as an active ingredient in baby lotions, but rather used in very small amounts for pH adjustment purposes.\n   * **Potential Side Effects:**\n      * Skin Irritation: Sodium hydroxide, if present in higher concentrations, can cause skin irritation in some individuals. This may manifest as redness, itching, burning sensation, or rash. It is important to discontinue use if your baby experiences any of these symptoms and consult a healthcare professional.\n      * Eye Irritation: Direct contact of baby lotion containing sodium hydroxide with the eyes can cause mild to moderate eye irritation. It is crucial to avoid contact with the eyes and rinse thoroughly with water if accidental exposure occurs.\n      * Chemical Burns: Sodium hydroxide is a caustic substance and can cause chemical burns if used undiluted or in high concentrations. However, in properly formulated baby lotions, the concentration of sodium hydroxide is typically low and safe for use.\n   * **EWG Skin Grade:** 4\n\n&#x200B;\n\n* Zinc Pyrithione\n   * Zinc Pyrithione is a coordination complex of zinc that's primarily used as an antifungal and antibacterial agent. It's often found in products like dandruff shampoos, certain types of soap, and some skin care products due to its ability to treat seborrheic dermatitis, an inflammatory skin disorder that causes flaky, scaly patches on the skin. In baby shampoo, Zinc Pyrithione would likely be used to help manage cradle cap (a form of seborrheic dermatitis in infants) or other minor skin conditions. However, it's worth noting that not all baby shampoos will contain this ingredient, as its use will depend on the specific formulation of the product.\n   * **Potential Side Effects:**\n      * Skin Irritation: Some individuals may experience skin irritation, including redness, itching, or a rash, particularly if they have sensitive skin.\n      * Allergic Reactions: While rare, allergic reactions can occur. Symptoms might include severe redness, itching, hives, or swelling. In extreme cases, difficulty breathing could occur, which requires immediate medical attention.\n      * Eye Irritation: If a product with Zinc Pyrithione gets into the eyes, it can cause redness, watering, and irritation.\n   * **EWG Skin Grade:** 6\n\n&#x200B;\n\n* Phenoxyethanol\n   * Phenoxyethanol is used as a preservative in cosmetic products and also as a stabilizer in perfumes and soaps. Exposure to phenoxyethanol has been linked to reactions ranging from eczema to severe, life-threatening allergic reactions. Infant oral exposure to phenoxyethanol can acutely affect nervous system function.\n   * **Potential Side Effects:**\n      * Skin Irritation: In some cases, phenoxyethanol can cause skin irritation or an allergic reaction, presenting as redness, itching, or a rash. Babies have sensitive skin and may be more susceptible to such reactions.\n      * Allergic Reactions: Though less common, some people may experience an allergic reaction to phenoxyethanol, which could result in symptoms like hives, swelling, or difficulty breathing.\n      * Eczema: It is also a common allergic reaction to skin exposure of products containing one percent or more phenoxyethanol. Reactions only occur in the area of application and eczema subsides after avoidance of the product causing irritation.\n      * Acute nervous system effects (infants): In 2008, the FDA warned consumers not to purchase Mommy’s Bliss Nipple Cream. Phenoxyethanol, found in the cream, was depressing the central nervous system and causing vomiting and diarrhea in breast feeding infants. Symptoms of a depressed nervous system include a decrease in infant’s appetite, difficulty waking the infant, limpness of extremities and change in skin color. There is no known health risk to the mother.\n   * **EWG Skin Grade:** 4\n\n&#x200B;\n\n&#x200B;\n\nThe grading system used by EWG in the Skin Deep database is as follows:\n\n1 to 2: Low hazard\n\n3 to 6: Moderate hazard\n\n7 to 10: High hazard",
    "flair_text": "Info",
    "flair_template_id": "3f0434d0-2930-11ee-af70-e2258d5ae2b6",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Allergies",
    "post_id": "1bbmnmd",
    "title": "Help Identify Allergenic Shampoo Ingredients",
    "url": "https://www.reddit.com/r/Allergies/comments/1bbmnmd/help_identify_allergenic_shampoo_ingredients/",
    "score": 3,
    "num_comments": 6,
    "created": "2024-03-10T22:10:21+00:00",
    "body": "I used [Avalon Organics Tea Tree Shampoo](https://www.avalonorganics.com/products/scalp-treatment-tea-tree-shampoo) the other day. After getting out of the shower, everywhere on my body it had touched when rinsing it off started itching like crazy. The only thing I can compare it to is the prank itching power stuff I had a couple times when i was a kid.\n\nI'm not aware of any allergies I may have... Are any of these ingredients known to be allergenic?\n\nIngredients:\n\n* Aloe Barbadensis Leaf Juice\n* Sodium Coco-Sulfate\n* Sodium Laurylglucosides Hydroxypropylsulfonate\n* Decyl Glucoside\n* Citrus Aurantium Dulcis (Orange) Peel Oil\n* Eucalyptus Globulus Leaf Oil\n* Melaleuca Alternifolia (Tea Tree) Leaf Oil\n* Mentha Arvensis Leaf Oil\n* Mentha Piperita (Peppermint) Oil\n* Rosmarinus Officinalis (Rosemary) Leaf Oil\n* Avena Sativa (Oat) Bran\n* Calendula Officinalis Flower Extract\n* Chamomilla Recutita (Matricaria) Flower Extract\n* Chenopodium Quinoa Seed\n* Tocopheryl Acetate\n* Babassu Oil Polyglyceryl-4 Esters\n* Beta-Glucan\n* Bisabolol\n* Citric Acid\n* Coco-Glucoside\n* Glyceryl Oleate\n* Inulin\n* Sodium Chloride\n* Sodium Phytate\n* Sodium Sulfate\n* Alcohol\n* Benzyl Alcohol\n* Potassium Sorbate\n* Sodium Benzoate\n* Limonene",
    "flair_text": "Question",
    "flair_template_id": "479b07f2-7c85-11e3-a97f-22000a0b8292",
    "comments": [
      {
        "author": "ariaxwest",
        "body": "Lots and lots of salicylic acid in there. That would do it for me. Aloe vera and most of those essential oils are things I avoid completely. \n\nAnother component of the oils could also be the culprit. \n\nLimonene is also a potential allergen.\n\nSo are sulfates.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "beccaboobear14",
        "body": "You can be allergic to anything. Try another shampoo and then see which ones overlap if you still react, if you don’t you know it’s one not in the new one but is in the old one",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "laisser_etre_",
        "body": "Essential oils are known skin irritants. I cannot use anything with essential oils on my face without developing a rash.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Hairloss",
    "post_id": "x9iesk",
    "title": "Which shampoo would you choose as a part of your hair loss regimen ?",
    "url": "https://www.reddit.com/r/Hairloss/comments/x9iesk/which_shampoo_would_you_choose_as_a_part_of_your/",
    "score": 2,
    "num_comments": 5,
    "created": "2022-09-09T01:49:49+00:00",
    "body": "Ok, so I know that no shampoo will stop or cure MPB completely on its own. Nevertheless, I do believe it can still be an effective addition to a hair loss treatment. \n\nAnyway, after lots of research and filtering, I settled to only these 2 shampoos. I won't mention the brand names but will write the ingredients of each to avoid bias. And judging from their ingredients, I would love to hear your thoughts which shampoo would yield a better result. By result, I mean nourishing and strenghtening hair, increasing exsisting hair thickness, improving circulation and maybe even blocking some of the scalp DHT. \n\n\nShampoo No 1 \n\nDecolorized aloe barbadensis (aloe vera) leaf juice*, sodium laurylglucosides hydroxypropylsulfonate, hydroxypropyl bis-hydroxyethyl dimonium chloride, cocamidopropyl hydroxysultaine, sodium cocoamphoacetate, polyquaternium-73, cocamide mipa, melaleuca alternifolia (tea tree) leaf oil*, argania spinosa (argan) kernel oil*, biotin (vitamin H), nigella sativa (black cumin) seed oil*, cymbopogon flexuosus (lemongrass) oil*, emblica officinalis (amla) oil*, grateloupia elliptica (red Korean seaweed) extract, urtica dioica (nettle) leaf extract*, serenoa serrulata (saw palmetto) extract*, cedrus atlantica (cedarwood) bark oil*, rosmarinus officinalis (rosemary) leaf oil*, salvia sclarea (clary sage) oil*, polygonum multiflorum (he shou wu) root extract*, citrus limon (lemon) peel oil*, citrus grandis (grapefruit) seed extract*, hibiscus sabdariffa (hibiscus) flower extract*, nicotinic acid (niacin)*, cucurbita pepo (pumpkin) seed oil*, prunus africana (pygeum) bark extract*, zinc pyrithione, tocopherol (vitamin E)*, soy isoflavone**, beta-sitosterol, camellia sinensis (green tea) leaf extract*, xylitol sesquicaprylate, lactobacillus ferment, salix nigra (willow) bark extract*, citric acid. \n\n\n\n\n\nShampoo No 2\n\nAqua, Cocamidopropyl Betaine, Coco-Glucoside, Sodium Cocoyl Isethionate, Sodium Lactate, Vegetable Glycerin, Aroma Natural (Orange), Behenamidopropyl Dimethylamine, Fulvic Acid, Betaine, Lactic Acid, Caffeine, L-arginine, Sodium Benzoate, Potassium Sorbate, Benzyl Alcohol.\n\n\nFirst one has lots of interesting and hair health promoting and nourishing ingredients.  Second one formula is much simpler with much fever active ingredients. Except it has caffeine which is one of the very few natural compounds that is very promising. \n\n\nThoughts?\n\nThank you.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Acidbaseburn",
        "body": "I would say definitely get one that has ketoconazole in it. I really like the DS labs revita shampoo. It has keto, caffeine, and some other stuff. And it leaves my hair feeling really good as well.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "peasarelegumes",
        "body": "I use dr regepure whcih has 1% ketoconazole and then I mix in a bit of ketoconazole 2% to bump up the percentage. Using keto alone too often can be pretty drying due to the sulphites etc",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ChoosyParents",
    "post_id": "13uzv7p",
    "title": "Hello Bello Premium Shampoo and Body Wash, Calming Soft Lavender",
    "url": "https://www.reddit.com/r/ChoosyParents/comments/13uzv7p/hello_bello_premium_shampoo_and_body_wash_calming/",
    "score": 2,
    "num_comments": 0,
    "created": "2023-05-29T16:41:11+00:00",
    "body": " \n\nhttps://preview.redd.it/ucma9fi38u2b1.png?width=423&format=png&auto=webp&s=0a7a0b747909bd9e0935a23d426c7e5013d67603\n\n**Caution:** It's important to remember that these evaluations are guides to potential health concerns and not definitive measures of a product's safety or efficacy. They are based on individual ingredients rather than **any negative effects the final product may have.** The way ingredients interact in a formulation can influence their potential impact, and the presence of a specific ingredient does not automatically equate to harm when used in a product. It's always crucial to do your own research, consider the product as a whole, and keep in mind that personal reactions can vary greatly. When making decisions about personal care products, it is recommended to consult with healthcare professionals.\n\n&#x200B;\n\n**Brief**: I believe this product stands as one of the top baby shampoo options available at a reasonable price. It has obtained the EWG's certification for safety compliance, containing only a single moderate hazard ingredient. While there are reports from the EWG associating Aloe Barbadensis (Aloe Vera) Leaf Juice with potential carcinogenic risks, it's worth noting that most commercial aloe vera products, including skincare and topical applications, utilize the clear gel from within the aloe vera leaf, excluding the outer part containing aloin. Manufacturers typically employ processes that remove aloin to undetectable levels. However, parents who harbor concerns regarding the presence of Barbadensis (Aloe Vera) Leaf Juice may opt for alternative products. Nevertheless, I strongly recommend this product.\n\n&#x200B;\n\n**Ingredients:** Water, Sodium Laurylglucosides Hydroxypropylsulfonate, Cocamidopropyl Hydroxysultaine, Sodium Lauroyl Methyl Isethionate, Glycerin, Sodium Methyl Cocoyl Taurate, Aloe Barbadensis Leaf Juice\\*, Helianthus Annuus (Sunflower) Seed Oil\\*, Simmondsia Chinensis (Jojoba) Seed Oil\\*, Persea Gratissima (Avocado) Fruit Extract\\*, Calendula Officinalis Flower Extract\\*, Cucumis Sativus (Cucumber) Fruit Extract\\*, Lavandula Angustifolia (Lavender) Oil, Sodium Chloride, 1,2-Hexanediol, Hydroxyacetophenone, Dehydroacetic Acid, Tetrasodium Glutamate Diacetate, Citric Acid \\*Organic.\n\n&#x200B;\n\n# Typical ingredients description and side effects\n\n&#x200B;\n\n* Aloe Barbadensis (Aloe Vera) Leaf Juice\n   * Aloe Barbadensis (Aloe Vera) Leaf Juice is widely used in skincare products, including baby shampoos, due to its soothing, hydrating, and anti-inflammatory properties. It is generally considered safe for topical use.\n   * However, it's worth noting that certain parts of the aloe vera plant contain a compound called aloin, which has been linked to potential carcinogenic effects when ingested in large amounts. Most commercial aloe vera products, including skincare products and topical applications, are made from the clear gel found inside the aloe vera leaf, not the outer part of the leaf where aloin is found. The process used to prepare aloe vera for commercial use generally removes aloin to non-detectable levels.\n   * **Potential Side Effects:**\n      * Skin Irritation: Aloe vera is usually soothing, but some individuals may experience skin irritation or allergic reactions, such as redness, rash, burning or itching sensations, especially with frequent use.\n      * Allergic Reactions: Rarely, some individuals may have a more severe allergic reaction to aloe vera. This could result in symptoms like swelling, severe redness, or difficulty breathing.\n   * **EWG Skin Grade:** 3\n\n&#x200B;\n\n&#x200B;\n\nThe grading system used by EWG in the Skin Deep database is as follows:\n\n1 to 2: Low hazard\n\n3 to 6: Moderate hazard\n\n7 to 10: High hazard",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "o9d574",
    "title": "[Product Question] Has anyone heard of this Christine Valmy product line?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/o9d574/product_question_has_anyone_heard_of_this/",
    "score": 2,
    "num_comments": 1,
    "created": "2021-06-28T04:44:55+00:00",
    "body": "The product that came to my attention was \"[Lotion X](https://shop.christinevalmy.com/products/lotion-x)\". Supposedly it's marketed to professional estheticians to \"melt blackheads\" and has been around a long time.  I can't see anything in the ingredients that would do what they say. It's basically a surfactant with a lot of plant extracts and it looks chock full of peppermint!   \n\n\n *Aqua, Sodium Laurylglucosides Hydroxypropylsulfonate, Hamamelis Virginiana (Witch Hazel) Extract, Mentha Piperita (Peppermint) Leaf Extract, Rhodophyta (Red Algae) Extract, Arctium Lappa (Burdock) Root Extract, Saponaria Officinalis (Soapwort) Leaf Extract, Salvia Officinalis (Sage) Leaf Extract, Melissa Officinalis (Balm Mint) Leaf Extract, Salvia Sclarea (Clary) Extract, Algae Extract, Viscum Album (Mistletoe) Fruit Extract, Hypericum Perforatum (St. John's Wort) Extract, Juniperus Communis (Juniper) Fruit Extract, Achillea Millefolium (Yarrow) Extract, Rhodomyrtus Tomentosa (Rose Myrtle) Fruit Extract, Caprylhydroxamic Acid (and) Propanediol, Solanum Lycopersicum (Tomato) Fruit/Leaf/Stem Extract, Glyceryl Caprylate (and) Glyceryl Undecylenate, Cardiospermum Halicacabum (Balloon Vine) Seed Extract, Arginine, Mentha Piperita (Peppermint) Oil, Phytic Acid*",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "obuggv",
    "title": "[Product Question] Pacifica Rose Kombucha Face Wash Formula",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/obuggv/product_question_pacifica_rose_kombucha_face_wash/",
    "score": 2,
    "num_comments": 1,
    "created": "2021-07-01T20:28:22+00:00",
    "body": "Pacifica Rose Kombucha Face Wash Formula change?\n\nI’ve been using Pacifica’s Rose Kombucha Wash for over 2 years now and it’s absolutely perfect it doesn’t overdry and leaves the skin moisturized but recently I noticed the face wash went from a clearish semi-transparent liquid to a white foamy liquid and I noticed the ingredients list changed when comparing my old bottle to the newer one, Old INGREDIENTS: (aqua, cCocamidopropyl betaine, sodium C14-16 olefin sulfonate, aloe barbadensis leaf juice, lauryl glucoside, stearyl citrate, saccharomyces/ seed oil, panthenol (vitamin B5), glycerin, lavandula flower extract, allantoin, sodium laurylglucosides hydroxypropylsulfonate, sodium benzoate, potassium > camellia sinensis (white tea) extract, arnica montana xylinum/black tea ferment, rosa canina (rose hip) angustifolia (lavender) flower/leaf/stem extract, sorbate, ethylhexylglycerin, geraniol, parfum'. chamomile recutita (matricaria) flower extract, *our scent blend with natural and/or essential oils xylinum/black tea ferment, rosa canina) & \n\nNew Ones (aqua, sodium cocoyl isethionate, disodium laureth sulfosuccinate, cocamidopropyl oxide, cocamidopropyl hydroxysultaine, guar hydroxypropyltrimonium chloride, cyamopsis tetragonoloba (guar) gum, glycol distearate, myristic acid, argania spinosa (argan) kernel oil, olea europaea (olive) fruit oil, saccharomyces/xylinum/black tea ferment, rosa canina flower extract, cocos nucifera (coconut) water, sodium citrate, hydrolyzed quinoa protein,hydrolyzed rice protein, carica papaya (papaya) extract, sodium hyaluronate, phenoxyethanol, ethylhexylglycerin, citric acid, parfum (natural).)",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "1f3a1oi",
    "title": "cocamidopropyl betaine substitute",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/1f3a1oi/cocamidopropyl_betaine_substitute/",
    "score": 2,
    "num_comments": 5,
    "created": "2024-08-28T13:21:42+00:00",
    "body": "Hi, I have an extreme sensitivity to cocamidopropyl betaine (probably the betaine part). I've been making shampoo bars for fine hair with Plantapon TF instead of CAPB, but discovered yesterday that it has been discontinued. Does anybody have any experience or opinions regarding Sodium laurylglucosides hydroxypropylsulfonate as a possible replacement? \n\nThis is my current formula:\n\nSodium cocoyl isethionate (SCI) Powder (32%)  \nPlantapon TF (18%)  \nSodium Lauryl Sulfoacetate (SLSa) (35%)  \nSodium lactate (5%)  \nHydrolyzed Oat Protein (1.5%)  \nPolyquat 7 (3%)  \nPropanediol 1,3 (3%)  \nFragrance (1%)  \nPanthenol (1%)  \nGermall Plus (.5%)\n\nAs an aside, I'm planning to reduce the SLSa by 3% and adding 3% cetyl alcohol to make the bars harder.\n\nThanks!\n\n# ",
    "flair_text": "question",
    "flair_template_id": "51c2fb6e-2823-11e4-b071-12313b0e52a2",
    "comments": [
      {
        "author": "MrsSeanTheSheep",
        "body": "Never used it but it looks like it will work. You could also look at Foaming Apple/Oat/ETC.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "CPhiltrus",
        "body": "A direct replacement would be decyl glucoside and polyglyceryl-10 laurate/myristate/oleate. Both are readily available. \n\nThe sulfonate will be more stripping than a betaine. And it probably isn't the betaine itself that's causing issues but byproducts like alkylamines that can be sensitizing. If you're not getting high quality CAPB, that can happen.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "fxicul",
    "title": "Hair incredibly frizzy/fly away after using new shampoo. Help!",
    "url": "https://www.reddit.com/r/curlyhair/comments/fxicul/hair_incredibly_frizzyfly_away_after_using_new/",
    "score": 2,
    "num_comments": 3,
    "created": "2020-04-09T00:31:26+00:00",
    "body": "I started using this no poo and my hair is INCREDIBLY frizzy and my new growth fly always are out of control! Any idea what ingredient could be causing it so I can avoid it in future products?\n\nWater, Sodium Laurylglucosides Hydroxypropylsulfonate, Sodium Methyl Cocoyl Taurate, Cocamidopropyl Hydroxysultaine, Sodium Bis-Hydroxyethylglycinate Coco-Glucosides Crosspolymer, Cocamidopropyl Pg-Dimonium Chloride Phosphate, Gluconolactone, Sodium Stearoyl Lactylate, Lactobacillus Ferment, Avena Sativa (Oat) Kernel Extract*, Althaea Officinalis Root Extract (Marshmallow)*, Chenopodium Quinoa Seed Extract (Quinoa)*, Sodium Benzoate\n\nNot to mention it’s almost impossible to shampoo with zero lather. I don’t know how you guys do it!",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Awkward_Sort",
        "body": "What other products do you use with it?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "ct9xut",
    "title": "[Product Question] Thoughts on Volition Turmeric Polish? (Walnut Shell Powder is an Ingredient)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/ct9xut/product_question_thoughts_on_volition_turmeric/",
    "score": 1,
    "num_comments": 6,
    "created": "2019-08-21T01:45:15+00:00",
    "body": "Hi can you give me your thoughts on this product:\n\nhttps://www.sephora.com/product/turmeric-brightening-polish-P421953\n\nIngredients:\nGlycerin, Caprylic/Capric Triglyceride, Ethyl Macadamiate, Sodium Laurylglucosides Hydroxypropylsulfonate, Olea Europaea (Olive) Fruit Oil, Juglans Regia (Walnut) Shell Powder, Helianthus Annuus (Sunflower) Seed Oil, Sesamum Indicum (Sesame) Seed Oil, Graham Flour, Tocopherol, Sucrose Palmitate, Glyceryl Caprylate, Silica, Curcuma Longa (Turmeric) Root Extract, Ground Turmeric, Glyceryl Undecylenate, Leuconostoc/Radish Root Ferment Filtrate, Santalum Album (Sandalwood) Extract, Water.\n\n\n\nI had taken this off my list after seeing it had ground walnut shell powder as an ingredient, but I talked to a sephora rep today and he said this walnut shell powder is different because it is very finely ground and will dissolve so it does not cause microtears. However I read on Paula's Choice that walnut shell powder cannot be ground evenly so it's always a hazard. Do you guys think the rep is correct or not? \n\nI have sensitive skin that's allergic to many skincare ingredients so it has been hard to find a suitable exfoliator.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "Shopping_addict_2018",
        "body": "I tried a sample and found it way too rough and grainy on my skin. Maybe ask the Sephora rep for a sample.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Mk0505",
        "body": "I use this and I really love it. I am very gentle and use almost no pressure when I use this and then let it sit on my skin for a few minutes and my skin is so silky soft afterwards.\n\nI only use it once a week but it really has made a big difference for me",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "quspork",
        "body": "I really enjoy this. I'm someone who can't stand overly harsh physical exfoliants, but this one doesn't bother me at all. It leaves my skin soft and bright after use.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "becclynn",
        "body": "I love this!!! I got a sample from Sephora and it’s super impressive. Like other users, I GENTLY massage into a slightly damp face then let it sit for 2-3 mins per the instructions. My face feels amazing after and looks smoother after only one use. Also, Volition is having a 25% off sale this weekend on their website. :)",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "v6fq5r",
    "title": "[Product Question] Pacifica Rose Kombucha Face Wash Formula Change",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/v6fq5r/product_question_pacifica_rose_kombucha_face_wash/",
    "score": 1,
    "num_comments": 1,
    "created": "2022-06-06T22:38:45+00:00",
    "body": "Pacifica Rose Kombucha Face Wash Formula change?\n\nI’ve been using Pacifica’s Rose Kombucha Wash for over 2 years now and it’s absolutely perfect it doesn’t overdry and leaves the skin moisturized but recently I noticed the face wash went from a clearish semi-transparent liquid to a white foamy liquid and I noticed the ingredients list changed when comparing my old bottle to the newer one and the newer one leaves my face overly dry and leaves my skin with a horrible texture almost like a dermatitis reaction\n\nOld INGREDIENTS: (aqua, cCocamidopropyl betaine, sodium C14-16 olefin sulfonate, aloe barbadensis leaf juice, lauryl glucoside, stearyl citrate, saccharomyces/ seed oil, panthenol (vitamin B5), glycerin, lavandula flower extract, allantoin, sodium laurylglucosides hydroxypropylsulfonate, sodium benzoate, potassium > camellia sinensis (white tea) extract, arnica montana xylinum/black tea ferment, rosa canina (rose hip) angustifolia (lavender) flower/leaf/stem extract, sorbate, ethylhexylglycerin, geraniol, parfum'. chamomile recutita (matricaria) flower extract, *our scent blend with natural and/or essential oils xylinum/black tea ferment, rosa canina) &\n\nNew Ones (aqua, sodium cocoyl isethionate, disodium laureth sulfosuccinate, cocamidopropyl oxide, cocamidopropyl hydroxysultaine, guar hydroxypropyltrimonium chloride, cyamopsis tetragonoloba (guar) gum, glycol distearate, myristic acid, argania spinosa (argan) kernel oil, olea europaea (olive) fruit oil, saccharomyces/xylinum/black tea ferment, rosa canina flower extract, cocos nucifera (coconut) water, sodium citrate, hydrolyzed quinoa protein,hydrolyzed rice protein, carica papaya (papaya) extract, sodium hyaluronate, phenoxyethanol, ethylhexylglycerin, citric acid, parfum (natural).)",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1gdtp1m",
    "title": "[Product Question] Is the Amazon Basics Benzoyl Peroxide any good?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1gdtp1m/product_question_is_the_amazon_basics_benzoyl/",
    "score": 1,
    "num_comments": 5,
    "created": "2024-10-28T04:14:40+00:00",
    "body": "I recently saw the Amazon Basics Benzoyl Peroxide wash which is significantly cheaper than the Panoxyl that I use, but I don't know if the ingredients are good for the skin. Here are the ingredients and a comparison to Panoxyl:\n\nAmazon: Active: Benzoyl peroxide 10% Inactive: water, cetyl alcohol, petrolatum, acrylates/C10-30 alkyl acrylate crosspolymer, zinc lactate, steareth-2, glycerin, potassium cetyl phosphate, xanthan gum, benzyl alcohol, fragrance, disodium EDTA, laureth-4, BHT, sodium hydroxide, lactic acid, menthol\n\nPanoxyl: \n\nBenzoyl Peroxide (10%) Inactive Ingredients: Carbomer Homopolymer Type C, Carbomer Interpolymer Type A, Decyl Glucoside, Dimethicone, Dioctyl Sodium Sulfosuccinate, Glycerin, Palmitic Acid, Polyacrylate Crosspolymer-6, Polyoxyl 40 Stearate, Propanediol, Purified Water, Silica, Sodium Chloride, Sodium Citrate, Sodium Hydroxide, Sodium Laurylglucosides Hydroxypropylsulfonate, Sorbitan Stearate, Stearic Acid, t-Butyl Alcohol, Xanthan Gum.",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "Significant_Hat_2066",
        "body": "Ingredients lists don't tell the whole story. Formulation matters too.\n\nIngredient wise, the amazon cleanser would work too and even has zinc. On the other hand, it has both menthol and fragrance. Those ingredients would irritate some people's skin. Also if you don't like minty cleansers, don't buy it.\n\nI personally would choose panoxyl  because I don't trust amazon to store skincare properly (high summer temperatures in warehouses) and because my skin is sensitive to fragrance.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "kerodon",
        "body": "It has fragrance and menthol. Don't buy that. \n\nGet the acnefree oil free benzoyl peroxide cleanser 2.5%. it's very nice and much cheaper",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guide [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BabydollMitsy",
        "body": "OP, found this off Google but the Amazon Basics one works amazingly for me. I've tried everything under the sun for body acne and KP before and this is my holy grail! Of course your results may vary! No purge stage at all, just instantly started clearing up my skin.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "kourset",
        "body": "Found this while searching for the cleanser but tbh, I have closed comedones, and it worked wonders for getting rid of them. I used it once a day in the night, followed by a moisturizer and aquaphor. Clear skin within 2 months",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  }
]