[
  {
    "subreddit": "ninjacreami",
    "post_id": "1is7xl4",
    "title": "Ingredients, their functions & potential substitutes",
    "url": "https://www.reddit.com/r/ninjacreami/comments/1is7xl4/ingredients_their_functions_potential_substitutes/",
    "score": 85,
    "num_comments": 13,
    "created": "2025-02-18T08:19:19+00:00",
    "body": "I bought my Creami to try to make low calorie, low fat and low sugar frozen treats so that I didn't feel like I was missing out. Also, because the store bought alternatives are ridiculously expensive. I compiled this ingredient guide for myself but thought that it might be useful to others with similar dietary goals.\n\nI am not vegan, so will mostly be using straight Skim Milk whenever milk is required. Because of this I have not done a deep dive into plant based milks.\n\nCountry I am based in is Australia.\n\nHope this is useful for someone:\n\n**ALLULOSE:**\n\nAllulose is a sugar substitute (technically a “rare sugar”) with a low freezing point, so that it prevents complete freezing of water. As such, it doesn’t get rock-hard like other non-sugar sweeteners can. Allulose has about double the freezing point depression of regular sugar. It contributes to a creamy texture and reduced ice crystals. It may reduce the requirement for re-spinning if you do not consume the whole tub in one sitting. Allulose is 70% as sweet as regular sugar. It contains 0.2 - 0.4 calories per gram (sources vary), compared to regular sugar, which contains 4 calories per gram.\n\nAllulose occurs naturally in small quantities in some foods, including wheat, raisins and figs. It can be made naturally when processing fructose and sucrose, or it can be chemically synthesised.\n\nAllulose mimics the properties of sugar in cooking and baking more than most sugar substitutes e.g. it browns and caramelises when cooked and it lowers the freezing point of water.\n\nUnlike sugar, Allulose does not cause spikes in blood sugar or insulin.\n\nUse 1.33 cups Allulose for every 1 cup of Sugar. 1 cup of Allulose = 160g. 1 cup of White Sugar = 200g.\n\nUse 0.8g Allulose for every 1g of Sugar.\n\nAs a guide, use 2 – 3 Tbs per pint.\n\n\\* Excess consumption may have a laxative effect for some people. There is little long-term data surrounding the consumption of Allulose. Some scientists believe that like other artificial sweeteners, it may be detrimental to heart health.\n\n**AQUAFABA:**\n\nAquafaba can replace eggs and egg whites in ice cream because it has a similar foaming texture, resulting in a light and fluffy texture.\n\nThe proteins, carbohydrates and other soluble plant solids emulsifying, foaming, binding, gelatinising and thickening properties.\n\nAquafaba can be used to replace cream in ice creams, providing a lower fat and calorie content.\n\nAquafaba is vegan and does not have a bean-y taste.\n\n**CAPELLA SUPER SWEET (Liquid Sucralose) :** A highly concentrated form of Sucralose aka “Splenda”\n\nSucralose is made from sugar, but is not recognised as sugar by the body. Sucralose is 600 times sweeter than sugar. It provides a sugar-like taste with no strong aftertaste and is a very stable ingredient in most recipes. Sucralose contains groups of hydroxyls that may provide an emulsifying action. Sucralose is considered to be one of the safest artificial sweeteners and has undergone rigorous testing. Most studies show that Sucralose has little to no effect on blood sugar and insulin levels, however some studies indicate that Sucralose could reduce insulin sensitivity and increase blood sugar and insulin levels. There are conflicting studies around the safety of Sucralose in cooking and baking. One 2010 study found that heating Sucralose with Glycerol (a compound found in fat molecules) produced harmful substances named chloropropanols, which may increase the risk of cancer. For this reason, some people may wish to use alternative sweeteners when baking at temperatures above 175 degrees Celsius.\n\n1 Drop Capella Super Sweet is Equivalent to 1 tsp Sugar\n\n4 Drops Capella Super Sweet are Equivalent to 4 tsp Sugar (20ml capacity, Tablespoon)\n\nAs per Tanya at Capella USA – 2.4ml Super Sweet = 1 US cup (237ml capacity) Sugar… Therefore… ***2.53ml (half a metric teaspoon) Super Sweet = 1 Metric Cup of Sugar***\n\nAs a guide, add 1 drop per 225g to your food or beverage to taste.\n\nCapella Super Sweet is a Zero Calorie sweetener. It has zero freezing point depression qualities and offers no bulking effect to a Creami mix.\n\nWhile Sucralose is calorie-free, “Splenda” contains the carbohydrates dextrose (glucose) and maltodextrin and provides 3.36 calories per gram.\n\n**CHICKPEAS:**\n\nLegumes contain protein, fibre and many micronutrients. Chickpeas can provide bulk, structure and a creamy texture and mouth feel to Creami blends. Chickpeas contain a protein that simulates the taste and texture of dairy better than most other vegan ingredients. The protein also stabilises, prevents crystallisation and reduces graininess and iciness. Chickpeas have quite a neutral taste in ice cream.\n\n**CONDENSED MILK:**\n\nCondensed Milk contributes to the sweetness, texture and flavour of ice cream. The high sugar content lowers the freezing point of the mixture, providing a softer, creamier texture. The higher sugar content also makes it easier to scoop. Condensed Milk also absorbs some of the liquids in the mix, preventing large ice crystals and providing a smoother, silkier texture. The gooey texture of Condensed Milk acts as a binder, holding the ingredients in the mixture together.\n\nCondensed Milk is made by evaporating 60% of the liquids from Regular Milk and adding about double its weight in sugar.\n\n1 Metric Cup (250ml) Condensed Milk weighs 320g. 1 Australian can of Condensed Milk (395g) contains 308ml Condensed Milk.\n\nTo convert recipes using Condensed Milk substitute with a 340g can Carnation Light & Creamy Evaporated Milk (1 can equals 318ml) **PLUS** 357g Sugar (1.8 metric cups) or equivalent sugar substitute e.g. 288g Allulose, 7ml Capella Super Sweet etc.\n\n1 metric cup of Evaporated Milk equals 266g. To convert 1 cup of Evaporated Milk to the same sweetness as Condensed Milk, add 1 ¼ cups Sugar (281g) or equivalent sugar substitute e.g. 266g Allulose **OR** 3.16ml Capella Super Sweet\n\n**CORN SYRUP: (Used in Recipes in the Ninja Creami Manual)**\n\nCorn Syrup behaves similar to invert sugar (a liquid sugar made from table sugar, made up of 50% Glucose and 50% Fructose). It makes ice creams and especially sorbets smoother, richer and less icy. It is more thick or viscous than sugar syrup and 67% less sweet than Sugar by weight. Unlike honey, agave nectar, molasses and maple syrup it has a neutral taste. Corn Syrup adds creaminess and improves texture. Because has less sweetness than sugar, you can use much more of it to improve the texture of the mix without making it too sweet. If Corn Syrup is unavailable, a mild flavoured Honey or Golden Syrup can be substituted. If available. Allulose Syrup can be used as a low calorie Corn Syrup substitute.\n\n**COTTAGE CHEESE:** Cottage Cheese adds is MSNF or Milk Solids Non Fat to Creami blends . It adds more protein, and some salt and water to an ice cream. Cottage Cheese can be used as a thickener and stabiliser in your Creami formulation. It adds a creamy mouth feel to low fat formulations and many people that hate cottage cheese swear that they cannot taste it in their ice cream. Some recommendations include adding approximately 150g of Cottage Cheese per pint (550ml). Regular or low fat Cottage Cheese can be used according to taste and dietary requirements. Cottage Cheese may include various ingredients that act as thickeners, gelling agents, emulsifiers, stabilizers and fat substitutes in Creami recipes, including Carrageenan, Rennet, Vegetable Gums and Firming Agents.\n\n**CREAM:**\n\nCream helps to create a smooth, rich and creamy texture. The fat in cream makes the ice cream firmer and slows melting by stabilising air bubbles. It provides a good taste and mouth feel. Fat does not freeze as hard as water, so the fat makes it easier on the Ninja Creami machine. Cream is a thickener. Most creams in Australia also contain thickening agents.\n\n***Try substituting Carnation Light & Creamy Evaporated Milk for Cream.***\n\n**CREAM CHEESE:**\n\nCream Cheese acts as a stabiliser, a thickener to provide body to the ice cream and a binder to prevent ice crystals. It helps to provide a smooth, creamy texture. Philadelphia brand contains Vegetable Gums (Locust Bean Gum \\[extracted from the seeds of the Carob tree – It Stabilises and Thickens the mixture (increases its Viscosity), and improves the ice cream’s texture, smoothness and mouth feel by binding water. It prevents ice crystals and controls how the ice cream melts. Locust Bean Gum is one of the best gums at reducing ice crystal size, however it requires heating in order to fully hydrate\\] and / or Guar Gum).\n\nUse 1 Tablespoon Cream Cheese per pint (570ml).\n\n***Substitute Cream Cheese with Cottage Cheese or Guar Gum.***\n\n**DATES – SWAPPING WITH SUGAR OR SUBSTITUTING SWEETENER FOR DATES IN A RECIPE TO REDUCE CALORIES:**\n\n* 100g Dried Dates contains 65.9g Sugars and 290 Calories. / 100g Sugar contains 100g Sugars and 382 Calories. ***Try substituting 66g Sugar (or Sugar Replacement for 100g Dates e.g. 86g Allulose / 0.83ml Capella Super Sweet / 17 Drops Capella Super Sweet***\n* 1g Dried Dates contains 0.7g Sugars and 3 Calories. / 1g Sugar contains 1g Sugars and 4 Calories. ***Try substituting 0.66g Sugar (or Sugar Replacement for 1g Dates e.g. 0.88g Allulose / 0.66 Drops Capella Super Sweet***\n* 1 Dried Date (Pitted) weighs approximately 6 grams and contains 4g Sugars and 17 Calories. ***Try substituting 4g Sugar \\[1 teaspoon\\] (or Sugar Replacement for 1 Date e.g. 5g Allulose / 1 Drop Capella Super Sweet***\n\n***To replicate the Caramel flavour provided by the Dates when substituting with artificial sweetener, try adding Roberts Sticky Date Pudding Essence, More Max Flavour Maple Fudge Essence or Caramel Essence.***\n\n* ***You can also try substituting Dates with*** **Queen Sugar Free Maple Syrup*****, which has a similar flavour profile e.g. -***\n   * ***100g Dried Dates = 62g / 62ml Sugar Free Maple Syrup***\n   * ***1g Dried Dates = 0.68g /0.68ml Sugar Free Maple Syrup***\n   * ***1 Dried Date = 3.75g / 3.75ml Sugar Free Maple Syrup***\n\n***\\* 1 cup Sugar Free Maple Syrup weighs approximately 250g, whereas 1 cup Regular Maple Syrup weighs 333g \\****\n\n**EGGS:**\n\nEggs contribute to the flavour, texture and consistency of Ninja Creami ice creams. When heated, the protein in eggs coagulates into a thick gel that traps water, providing a smooth, creamy ice cream.\n\nEggs improve the stability of ice cream, making it slower to melt. When it does melt, the fat and water do not break out of the emulsion, so the ice cream doesn’t become icy when it re-freezes.\n\nEggs prolong the shelf life of ice cream in the freezer.\n\nEggs are typically used in a custard style base.\n\n**EVAPORATED MILK:**\n\nEvaporated Milk contributes to the texture, flavour and body of ice creams. The high protein content provides a fresh-churned texture and limits iciness when stored. It provides a cleaner, milkier flavour than milk powder, which can be chalky. It provides chewiness and body to the ice cream base.\n\nEvaporated Milk is thicker and creamier than regular milk and can be a lower calorie alternative to Heavy Cream.\n\nTo convert recipes using Condensed Milk substitute with a 340g can Carnation Light & Creamy Evaporated Milk (1 can equals 318ml) **PLUS** 357g Sugar (1.8 metric cups) or equivalent sugar substitute e.g. 288g Allulose, 7ml Capella Super Sweet etc.\n\n1 metric cup of Evaporated Milk equals 266g. To convert 1 cup of Evaporated Milk to the same sweetness as Condensed Milk, add 1 ¼ cups Sugar (281g) or equivalent sugar substitute e.g. 266g Allulose **OR** 3.16ml Capella Super Sweet\n\n**GELATINE:**\n\nEmulsifies (mixes two liquids together), Texturises (gives ice cream its texture and prevents large ice crystals from forming, Stabilises (keeps ice cream fresh). Commonly used in other foods and desserts as a thickener or stabilizer e.g. can be used to simulate the mouthfeel of fat in fat-reduced foods.\n\nTo use: Sprinkle gelatine into a small amount of hot water. Whisk until completely mixed. Add the gelatine mix to the remaining liquid. The more water in a recipe, the more gelatine you will need. Do not use more than a teaspoon of gelatine per quart of ice cream (946ml).\n\n**GLYCERIN / VEGETABLE GLYCERIN (Food Grade):**\n\nGlycerine workS extremely well to depress the freezing point of Creami bases in lieu of sucrose (sugar). Glycerine is a humectant. It can be used to make Ninja Creami leftovers scoopable straight out of the bowl. Glycerine tends to make the ice cream mixture expand a bit after blending. It is OK if the container is a little bit past the maximum fill line. The extra bubbles will deflate during freezing. It is fine to leave the mixture to freeze with the lids on because humps do not tend to develop in the Glycerine mixture during freezing.\n\nUse 1.5 teaspoons per Deluxe Pint for high sugar and fat ice cream bases.\n\nUse 2.25 teaspoons for high protein ice cream bases.\n\nUse 3 teaspoons for low fat and low sugar ice cream bases.\n\n**GUAR GUM:**\n\nGuar Gum is a Thickener and Stabiliser. It minimises ice crystals in low fat ice creams and increases Viscosity. It prevents ice crystals from forming and creates a smooth, creamy texture.\n\nUse 0.25 – 0.5 teaspoons Guar Gum per Creami jar.\n\nUse a ratio of 1.5 parts Guar Gum for each 1 part Xanthum Gum when converting recipes containing Xanthum Gum to Guar Gum.\n\n\\*\\* Or buy Aeroplane Lite custard mix (in blue packet), which contains Guar Gum and sprinkle about a heaped teaspoon into your Creami base to create a soft serve texture.\n\nBe careful not to overuse Guar Gum as it has a slight taste and the product can come out gluey if you use too much.\n\n**INULIN (*****I have purchased*** **AGAVE INULIN):**\n\nInulin is a naturally occurring carbohydrate found in some bacteria and fungi, and a variety of plants (e.g. leeks, onions, garlic, asparagus, bananas, Yacon and Chicory). Chicory is the most widely used source of Inulin in the food industry.\n\nInulin is a “Fat Replacer” and “Sugar Replacer”, adding creaminess to an ice cream blend. It minimises ice crystals to give a smooth, creamy texture.\n\nSeveral types of Inulin are available, including Native Inulin, Short-Chain Oligofructose and Long-Chain High Performance Inulin.\n\nNative Inulin contains 6 – 10% Sugars (glucose, fructose and sucrose), and tastes slightly sweet. It is mainly used as a fat replacer in low or reduced fat ice creams. Fat can be reduced by 30% with 5% native inulin.\n\nShort-Chain Oligofructose is produced from Native Inulin. Its sweetness profile is very similar to sugar, and it has about 30 – 50% of the sweetness. Short-Chain Oligofructose is used in ice cream mainly as a low calorie sugar replacement. It can replace up to 30% of the sugar in full-fat ice cream, reduces ice crystals and increases the amount of air that is whipped into the mix, decreasing air-cell size and increasing creaminess. The ice cream produced however, is harder than ice creams using straight sucrose.\n\nInulin is a great, low calorie fat replacer. In milk or water it forms a particle gel network, providing a smooth, creamy texture with a fat-like mouth feel, and can replace up to 100% of the fat in a product. Large amounts of water are bound in the gel network. Long-Chain High Performance Inulin is the best form of inulin for fat replacement. It has double the effectiveness of standard inulin and zero contribution to sweetness. It increases the perception of creaminess, increases resistance to melting and extends the shelf life of the product better than Oligofructose.\n\nBecause the amount of frozen water increases, lowering the fat content of ice cream with inulin does result in a harder ice cream.\n\nAdding Native Inulin, Short-Chain Inulin *and*Oligofructose to a low fat ice cream depresses its freezing point, resulting in less frozen water, and therefore provides a softer texture. Oligofructose depresses the freezing point of the mix more than Native Inulin and Long-Chain Inulin, producing a softer ice cream.\n\nAs the viscosity, or thickness of a liquid increases, so does the perception of creaminess and its resistance to melting. Inulin increases the viscosity of an ice cream blend. This is because Inulin and Oligofructose hydrate and bind water. Long-Chain High Performance Inulin thickens mixes more than Native Inulin and Oligofructose.\n\nInulin and Oligofructose extend the shelf life of ice cream by retaining and binding water, and enhancing the viscosity of the unfrozen mix, decreasing the diffusion of water molecules and retarding the growth of ice crystals. Long-Chain High Performance Inulin extends shelf life better than Oligofructose.\n\nInulin and Oligofructose have several health benefits, including being prebiotics, suitable for diabetics, reducing the risk of diarrhea, constipation, breast cancer, colon cancer, osteoporosis, heart disease and changes to the immune system. They regulate serum cholesterol and triglyceride levels, improve calcium absorption, reduce plasma glucose levels and have anti-inflammatory effects and help prevent tooth decay.\n\nAlthough there are no safety concerns around eating Inulin or Oligofructose, excess consumption may cause flatulence, bowel movements and abdominal discomfort.\n\nAdults can tolerate 20g Inulin per day or 5-10g Oligofructose.\n\nInulin and Oligofructose contain 2 Calories per gram. Fat contains 9.45 Calories per gram and Sugar contains 4 Calories per gram.\n\n***Approximately 22 grams of Agave Inulin can be added to a Deluxe Creami pint to improve texture, melting qualities and increase the sweetness of the mix.***\n\n**JUNKET / RENNET:**\n\nJunket tablets or Rennet partially curdle milk, creating a custard base without eggs or requiring much cooking.\n\n**MILK:**\n\nMilk contributes to the texture and creaminess of the Creami blend.\n\nMilk fat lubricates the palate, reducing the perception of large ice crystals and making the ice cream feel smoother and creamier.\n\nSkim Milk can be used in the Ninja Creami to reduce the fat and calorie content, however the ice cream will taste less creamy and may have an inferior texture. Ingredients such as Guar Gum, Cottage Cheese, Pudding Mix etc will help to mitigate this.\n\n**PEANUT BUTTER POWDER:**\n\nMost brands recommend a ratio of 2 parts Peanut Butter Powder to 1 part Water or other liquid when reconstituting Peanut Butter Powder to Peanut Butter.\n\nTo substitute Powdered Peanut Butter for Regular Peanut Butter in a recipe, PB2 brand recommend using a ratio of 2 parts Peanut Butter Powder for each 1 part of Regular Peanut Butter.\n\nTo substitute / make 1 Metric Cup of Regular Peanut Butter (250ml capacity / 271g weight) using Peanut Butter Powder would require 202 grams of Peanut Butter Powder **plus** 250ml Water or preferred liquid.\n\nTo substitute / make 1 teaspoon of Regular Peanut Butter (5ml capacity / 5.4g weight) using Peanut Butter Powder would require 4 grams of Peanut Butter Powder **plus** 5ml Water or preferred liquid.\n\n**PROTEIN POWDER:**\n\nIn addition to being a high source of protein nutritionally, Protein Powder helps to create structure and can make the ice cream thicker and creamier. Structure is created through whipping, emulsification and water holding capacity. Many Protein Powders contain fat, which increases the creaminess of the mix. Flavoured Protein Powders can add thickness and flavour to the Creami mix. Many Protein Powders contain stabilisers, which improve the texture of the ice cream.\n\n**PUDDING MIX:**\n\nUse 2 Tbs / 8g per pint if not using gums or other thickeners.\n\nAccording to [aqua-calc.com](http://aqua-calc.com), 1 metric teaspoon Dry Pudding Mix weighs an average of 1.06 grams (for both regular and low calorie pudding mixes)\n\n* **Aeroplane Lite Creamy Mousse Mix** (available from Coles and Woolworths), contains –\n   * Polydextrose (a Modified Starch) used as a low-calorie bulking agent that can replace all or part of the sugars and some of the fats in foods while maintaining a pleasant texture and mouthfeel. Polydextrose can also be used as a humectant, texturiser, thickener, stabilizer, and cryoprotectant (reduces the amount of ice that will form at a given temperature).\n   * Gelatine (see above)\n   * Thickener 1442 (Hydroxypropyl-di-starch phosphate) – Stabilizer (ensures the physical properties of products are maintained and that a mixture remains in a uniform state), Emulsifier (forms an emulsion by allowing the mixing of two immiscible (i.e. unmixable) liquids such as water and oil), Thickener (gives the liquid more texture by increasing its viscosity). Forms gels without the need for heating. Has good freeze – thaw properties – after thawing and freezing foods do not lose their flavour and have a more uniform texture and colour. A type of Modified Starch.\n   * Milk Solids (e.g. Skim Milk Powder) assists with\n      * Water Balance (absorbs water, reducing the amount of \"free water\" in the mixture, preventing ice crystals from forming.\n      * Structure: (provides structure and body)\n      * Emulsification: (acts as an emulsifier, binding to both the fat and liquid in the base)\n      * Flavor: (contributes to the dairy flavour of ice cream)\n      * Stabilization: (helps to stabilize the final product by trapping air bubbles in the fat globules)\n      * Contributes to richness, creaminess, and melting characteristics\n* **Aeroplane Lite Custard** (available at Coles and Woolworths), contains –\n   * Thickener 1422 (Acetylated di-starch adipate) - a food additive of the thickening agent type, more specifically a bulking agent. Gels and improves texture. It is also used as a stabilizer. A type of Modified Starch.\n   * Thickener 1442 (Hydroxypropyl-di-starch phosphate) – See above.\n   * Guar Gum – See above\n\nSome recipes specifically use the Aeroplane Lite Custard as an ingredient. If not using Guar Gum, Xanthum Gum or Cottage Cheese, 1 heaped teaspoon of Aeroplane Lite Custard can be added per batch to thicken, creamify and stabilise.\n\n* **Cottee’s Instant Vanilla Pudding** (available at Coles and Woolworths), contains –\n   * Maize Thickener \\[1422\\] (Acetylated di-starch adipate) - a food additive of the thickening agent type, more specifically a bulking agent. Gels and improves texture. It is also used as a stabilizer. A type of Modified Starch.\n* **Simply Delish Pudding Mix** (available from Health Food Shop in Burnie, also available online), ingredients vary by flavour, but can include –\n* Starch: Corn starch / Maize Starch, Potato Starch (\\*Ingredient panels do not state that these are Modified Starches, but the fact that the puddings are mixed with cold milk indicates that they probably are).\n* Emulsifier: Sunflower lecithin - combines incompatible liquids into a suspension and prevents them from mixing with other substances.\n* Dextrin - a carbohydrate derived from starch that has many uses, including: used as a thickener, preservative, crisping agent, and anti-caking agent in many foods, such as soups, sauces, sweets, and baby food. Dextrin is more soluble in cold water than most starches, making it easier to use in food. Dextrins are carbohydrates made from starch naturally present in vegetables and grains. As do many other starch-based ingredients, dextrins have useful thickening properties, which means they help bind ingredients together in food and prevent them from dispersing.\n* **Jell-O Sugar Free Pudding Mix** (available online), ingredients vary by flavour, but typically include –\n* Modified Cornstarch - Thickens, Binds (Holds ingredients together to create a cohesive product with the right structure, texture, and mouthfeel. Can also help with moisture retention, flavour encapsulation, and gelation), Emulsifies (Combines incompatible liquids into a suspension and prevents them from mixing with other substances) and Stabilizes (Reduces ice crystal growth, Reduces air bubble size, Slows down melting, Increases smoothness, body and creaminess, Delivers flavour cleanly). Can reduce the growth of ice crystals during freezing. Locks water into place, creating a smoother, more satisfying ice cream. Often used in non-custard ice cream. Will thicken in cold liquid. Regular corn starch and most other starches (tapioca, potato, arrowroot, etc) require heat to gelatinize. Modified starches serve as “fat mi­metics”—creating “a fat-like mouthfeel”. As fat replacers, they act “directly as fat globules.”\n* Corn Maltodextrin – Another Modified Cornstarch that provides smooth, creamy texture, provides body and mouthfeel, contributes bulking or solids, produces a firmer ice cream that melts slowly during consumption and extends shelf-life during storage. Gels (turns a liquid into a gel-like state, creating a texture that is a combination of solid and liquid), binds and prevents crystallization. Assists with control of freezing, and fat replacement.\n* Maltodextrin - A non-sweet, nutritive saccharide polymer (Modified Starch) that is used as a thickener, filler, preservative, emulsifier, stabilizer and source of carbohydrates in many foods. Derived from starches like corn, potato, wheat, and rice. Used in puddings to increase volume and thicken texture. Can also be combined with artificial sweeteners to sweeten desserts. Used as a Fat Replacer in dairy products, confectionary, frozen desserts, cereal, baked goods, and meat products due to its ability to form soft, spreadable, thermoreversible gels (forms a gel when cooled and returns to a viscous fluid state when exposed to heat) with melt-in-the-mouth properties. Imparts a full-bodied texture and mouth coating. Often used as a bulking agent or a sweetener in various food products, providing a source of carbohydrates without the intense sweetness of table sugar. Can improve texture and consistency.\n* Sodium Phosphate – Used to Thicken, Stabilize and Emulsify.\n* Tetrasodium Pyrophosphate – Inorganic Salt. Emulsifier, Thickening Agent, improves Stability and Gel Strength.\n* Disodium Phosphate – A water soluble Artificial Salt. A Thickener, Emulsifier (helps to bind fats and water together, which is important for the texture and consistency of dairy products), Stabilizer and pH buffering agent A Preservative, helping to extend the shelf life of foods. An Anti-caking agent, added to powdered products to prevent caking.\n* Calcium Sulfate – A Firming Agent and Coagulant (changes proteins from a liquid to solid state – Thickens, Binds and Stabilizes. Creates a custard texture and mouth-feel.\n* Xanthan Gum (see above)\n* Monoglycerides - Produced by partially hydrolysing vegetable fats like soybean and palm oil. Commonly used as emulsifiers, stabilizers, thickeners, and flavouring agents. Monoglycerides are amphiphilic, meaning they have both hydrophilic (water-attracting) and lipophilic (oil-attracting) components. This allows them to reduce surface tension between water and oil, preventing separation and improving emulsion stability. They improve consistency and texture, helping to stabilise air bubbles and keep them small i.e. prevent foaming.\n* Diglycerides - A type of emulsifier produced from vegetable or animal fats and glycerol through partial hydrolysis. Used in ice cream to improve texture and consistency. Effective at stabilizing air bubbles, keeping them small i.e. prevent foaming. They help oil and water to blend, providing a creamier consistency.\n* Tetrapotassium Pyrophosphate - An Emulsifier, Stabilizer and Thickening Agent that helps to give ice cream a smooth, even texture. It promotes binding proteins to water. Used to improve expansion of ice cream and maintain fat dispersion.\n* Dipotassium Phosphate - A synthetic salt made by combining phosphate, phosphorus, and sodium, resulting in a white, powdery substance that easily dissolves in liquid. Used as an emulsifier, stabilizer, buffering agent (acidity regulator) and texturiser. A Chelating Agent (prevents lipid oxidization), especially for the calcium in milk products.\n* Bha (Butylated hydroxyanisole) - A synthetic, , waxy, solid petrochemical antioxidant. Used in many foods as a preservative to prevent fats and oils from going rancid.\n\n**SUGAR:**\n\nSugar provides sweetness and helps to release flavours from the other ingredients.\n\nSugar improves the Creami’s texture, providing body and structure, making it scoopable and soft.\n\nSugar reduces the freezing point of ice cream, reducing the amount of ice that forms. This also makes it easier for the Creami blade to process the ice cream mixture.\n\nSugar prevents the formation of ice crystals.\n\nAllulose is the best low calorie sugar substitute for use in the Creami because for the most part, it possesses the same qualities as sugar and behaves just like sugar. It also has a lower freezing point than sugar. Allulose is not as sweet as sugar.\n\nUse 1.33 cups for every cup of Sugar. 1 cup of Allulose = 160g. As a guide, use 2 – 3 Tbs per pint.\n\n**SWEET POTATO / PUMPKIN / STARCHY VEGETABLES:**\n\nPumpkin and Sweet Potato can provide flavour and sweetness to ice cream, as well as a rich, smooth texture.\n\nSweet potatoes can increase the firmness, consistency and hardness of an ice cream, while also increasing its dry matter content (the material remaining after water is removed). The addition of Sweet Potato can increase the first melt temperature and complete melting temperature of an ice cream.\n\nPumpkin’s high water content and low fat can make it difficult to achieve a creamy ice cream texture.\n\n**TOFU**\n\nSoft or Silken Tofu can be used as a replacement for heavy cream to create a fluffy, creamy texture. Tofu is a vegan source of protein. It creates an ice cream which is lower in fat than cream-based ones.\n\n**XANTHUM GUM:**\n\nXanthan Gum is created when glucose is fermented with a bacterium known as Xanthomonas campestris, which is found in cabbage. Its neutral flavour mixes well with nearly any cuisine without changing its original taste. It helps to add a smoother texture to liquid-based treats such as ice cream. Xanthan gum creates ice cream with a perfect, full-bodied mouthfeel, which churns beautifully, melts uniformly and keeps well in the freezer. Xanthan gum's high water-binding capacity helps limit the diffusion of water from and to ice crystals, which can make sorbet less hard and decrease the size of ice crystals. This is one of the best stabilizers to reduce ice crystal size and protect against the heat-thaw cycle. Xanthan gum is unique in its ability to hydrate and disperse at any temperature. Because it does this so quickly, it is one of the few ingredients that you can instantly see results from. As a thickener, blend it into the liquid that you would like to thicken, stir it around, and it will thicken instantly. While xanthan gum powder will work with liquid of any temperature, it may have trouble hydrating if the liquid is overly sugary. This is something to make note of when creating sweets high in processed sugars. Xanthan gum in large amounts will negatively impact the texture of goods, making them slimy, and may cause digestive upset. Xanthan gum can be dispersed into hot or cold liquids, and many grades of gum are available. The powder has a strong tendency to form lumps when added to water and a number of dispersion and hydration methods are used to try and overcome this. *For this reason, many users prefer to use Guar Gum for their Ninja Creami recipes.* Use ⅛ - half a teaspoon of Xanthan Gum per recipe.\n\n**YOGHURT:**\n\nFrozen yoghurt processed in the Creami results in a creamy texture, even when using fat-free yoghurt. Yoghurt, especially Greek Ypoghurt is high in protein and most yoghurts contain beneficial pre and / or probiotic gut bacteria. Many shop-bought frozen yoghurts are high in sugar. Making frozen yoghurt in the Ninja Creami allows you to control the amount of sugar in the blend by selecting which yoghurt is used as a base.\n\nIce cream tends to be fluffier, while frozen yogurt is tangier. The healthiest frozen yogurt will contain live and active cultures, which are beneficial to your gut.\n\nCommercial ice creams and frozen yoghurts are both made with dairy and sugar, although ice cream is made with cream, and frozen yogurt uses cultured milk.",
    "flair_text": "Inspo!",
    "flair_template_id": "8c7a4922-501f-11ef-a1cf-e61147715ff0",
    "comments": [
      {
        "author": "DovhPasty",
        "body": "Thanks for writing this all up. I feel like this should be pinned or something.",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "badcobber",
        "body": "Awesome.  I needed something like this a few months back it would have sped up my recipe tinkering.  Thanks",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "neurobonkers",
        "body": "And the winners are... Cottage Cheese and Xanthan gum, in my personal experience!",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "lockbox77",
        "body": "I wanted to love allulose. But I must mention that it gave me terrible stomach pains, even in small amounts. Just in case anyone else might have this reaction too.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi /u/Sparey2025, thank you for your post! If you have not already, please read your manual, this subs [rules](https://www.reddit.com/r/ninjacreami/wiki/index/rules/) including the [posting guidelines](https://www.reddit.com/r/ninjacreami/wiki/index/postingguidelines/) and [wiki](https://www.reddit.com/r/ninjacreami/wiki/index/). Many common questions can be answered in your manual or wiki. The standard and deluxe manuals are listed [here](https://www.reddit.com/r/ninjacreami/wiki/index/manuals/).\n\nPlease report any rule breaking posts and posts that are not relevant to the subreddit.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ninjacreami) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "gye1",
        "body": "This information is so helpful. Thank you for posting.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Artistic-Insect-4326",
        "body": "Thank you..Great compilation! Bless your heart!💓",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "j_hermann",
        "body": "Possible improvements:\n\n* Describe how to replace sugar in recipes while keeping POD **AND** PAC constant. This requires combining allulose and sucralose, and deviates from your 0.8 replacement based on POD alone.\n* When mentioning pints, you should qualify 16 vs. 24oz.\n* Mention cream should not be blended, but stirred in after blending.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "thefoodcorner",
        "body": "How do you handle the eggs? Do you cook the mixture before you freeze it or just put the raw egg in it?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 9,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "scacjdiscussion",
    "post_id": "90zu6m",
    "title": "Review: The Body Shop Chinese Ginseng and Rice Clarifying & Polishing Mask",
    "url": "https://www.reddit.com/r/scacjdiscussion/comments/90zu6m/review_the_body_shop_chinese_ginseng_and_rice/",
    "score": 46,
    "num_comments": 9,
    "created": "2018-07-22T18:27:10+00:00",
    "body": "Hey everyone! Before I got super busy with my new job, I used to regularly post reviews over on r/AsianBeauty. I really enjoyed that process, and now that things have mellowed out a bit for me, I wanted to start doing the same here. \n\nI generally try to review products that I don't see too often on skincare subs. Past reviews have included [Missha Near Skin Madecanol Cream] (https://www.reddit.com/r/AsianBeauty/comments/87r241/review_missha_near_skin_madecanol_cream/), [Missha Near Skin Total Ceramide Cream] (https://www.reddit.com/r/AsianBeauty/comments/82f8h9/review_missha_near_skin_total_ceramide_cream/), [Missha Near Skin Phyto Azulen Cream] (https://www.reddit.com/r/AsianBeauty/comments/8cejd0/review_missha_near_skin_phyto_azulen_cream/), [Tosowoong Apricot Seed Cleansing Oil] (https://www.reddit.com/r/AsianBeauty/comments/7u2j65/review_tosowoong_apricot_seed_cleansing_oil/), and [Benton Honest TT Mist] (https://www.reddit.com/r/AsianBeauty/comments/7trt3u/review_benton_honest_tt_mist/). Today I wanted to review one of my favorite masks: The Body Shop Ginseng and Rice Polishing and Clarifying Mask. \n\nI hope you enjoy the review, and as always, please feel free to leave questions and feedback!\n\n**The Body Shop Chinese Ginseng and Rice Clarifying and Polishing Mask**\n\nI *love* masks. Like seriously **love** them. And as much as I enjoy a good sheet mask, there's still something about a nice wash-off mask that feels like you're really pampering yourself. I still have very high expectations for my wash-off masks though...they can't just feel nice. I also expect them to address my skin concerns, which are mainly acne, PIE, and dryness/dehydration. \n\nI spotted this particular mask in someone's shelfie over on ScA, and hadn't heard of it before, so I popped into the Body Shop one day to have a look. I was a bit hesitant to try it, as I was worried it might be too drying. It's ended up being one of my favorite products, and I'm so glad I took the risk. \n\n**Packaging:** This product comes in a 3oz/75ml dark brown glass jar with a black plastic lid. It's surprisingly heavy for its size, but has proven fairly durable...the lid has stayed intact for as long as I've had it, and while I haven't dropped it, the jar did survive an international move with no problems. Aesthetically, it's apothecary/minimal, so if you're into Aesop's vibe, you'll probably like this too. I know not everyone is keen on jar packaging, but I personally don't mind it. \n\n**Ingredients:**\n\nThe star ingredients in this mask are kaolin, salicylic acid, ginseng, and rice extract. The first two are acne-fighters; kaolin is a type of clay that's known for being less drying than other types of clay while still providing similar acne-fighting, pore-reducing benefits. And we all know salicylic acid as everyone's favorite BHA. While the percentage isn't listed, it's high enough on the ingredients list that I'd estimate (very unscientifically) it's somewhere in the 1% range, and expect to see an impact. Rice bran extract is an emollient ingredient ([source] (https://cosmeticsinfo.org/ingredient/oryza-sativa-rice-extract)) but in its powdered form, can be a mild exfoliant. I'm not sure which form it's used in here, but given the slightly grainy texture of the mask, I'd expect it's powdered, and is acting as an exfoliant rather than an emollient. Ginseng is touted for its anti-aging benefits, and has been shown to act as an antioxidant, have an anti-inflammatory effect, and stimulate blood flow to give you a bit of a glow ([source] (https://www.refinery29.com/42123). Beeswax and shea butter in the ingredients list also made me a bit more optimistic when considering the product--it seems like there was definitely some thought that went into making this a clarifying product that still wouldn't strip dry skin too much. \n\nThat's the good stuff. However, there are a lot of potentially sensitizing ingredients in there. Denatured alcohol features pretty high on the ingredients list. I personally don't have issues with alcohol in skincare, but it's something to watch for those who do. Fragrance is also higher on the list than I'd generally like, so those who are sensitive to fragrance, beware. There are also some fatty alcohols, as well as limonene, and linalool. If you have especially sensitive skin, this product is probably not for you.\n\nThe full ingredients list is:\n\nAqua/Water/Eau, Glycerin, Luffa Cylindrica Fruit, Kaolin, Sesamum Indicum Seed Oil/Sesamum Indicum (Sesame) Seed Oil, Cetyl Alcohol, Glyceryl Stearate, Magnesium Aluminum Silicate, PEG-100 Stearate, Alcohol Denat., Decyl Glucoside, Cera Alba/Beeswax/Cire d’abeille, Perlite, Butyrospermum Parkii Butter/Butyrospermum Parkii (Shea) Butter,Parfum/Fragrance, Phenoxyethanol, Tocopheryl Acetate, Salicylic Acid, Xanthan Gum, Limonene, Sodium Benzoate, Citric Acid, Propylene Glycol, Myristyl Alcohol, Stearyl Alcohol, Menthol, Panax Ginseng Root Extract/Panax Ginseng (Ginseng) Root Extract, Disodium EDTA, Citral, Citronellol, Linalool, Menthoxypropanediol, Tetrasodium Pyrophosphate, Eugenol, Dextrin, Oryza Sativa Extract/Oryza Sativa (Rice) Extract, CI 77891/Titanium Dioxide.\n\n**Price:** I bought mine in the UK for £17; it retails for $28 in the US, but The Body Shop often runs sales and 3 for 2 deals. \n\n**Use and Performance:**\n\nLike I mentioned when talking about the ingredients, this is a clarifying mask that seems to have been formulated with dry skin in mind. This is very clearly reflected in the texture of the mask. It's far creamier than your typical clay mask, and doesn't dry down as completely. The mask itself is an off-white colour, and the creamy clay consistency also includes a grainy element (most likely from the rice). It smells very strongly of ginseng, which I love. You apply this like you would any other clay mask--spread a thin layer over your face using your fingers or a brush, then wait 15-20 minutes for the mask to dry down, and then rinse it off. \n\nI don't find that this mask dries down as aggressively as other clay masks I've tried, and I don't feel like my face is about to crack at the end of 20 minutes. I usually prefer to wash this mask off in the shower, because it can be a bit difficult to wash it off cleanly without making a total mess--consider yourself warned! My face does feel a bit tight afterwards, but it's nothing that a few layers of Hada Labo Gokujyun Lotion and Scinic Honey AIO can't fix. \n\nI see instant results from this mask. My pores immediately look smaller, and my skin has much more of a glow. If I use it at night, I wake up the next morning with a significant reduction in my acne. I also find it reduces my PIE, which was something I wasn't expecting! I use this mask once a week, or twice a week if my skin is especially congested, and I find that it clears up any random acne or texture issues that I'm dealing with. \n\n**Final Thoughts:** This is a really great mask option for someone who needs an occasional serious acne-fighter, but is also worried about dryness. Oilier skin types may be able to use the mask more often than dryer skin types. It's definitely not a one-stop miracle acne product...I rely on Differin (currently, previously Skinoren) to keep my acne under control in the long-term, and use this mask to address random breakouts and congestion. It's also probably not great for more sensitive skin types, I'm sorry to say. And if you're dehydrated, you'll probably want to steer clear as well--clay and salicylic acid won't do your moisture barrier any good!\n\nOverall, it's a very effective, pleasant to use mask that I consider a holy grail, and will continue to repurchase for as long as I can. \n\n**My Rating: 5/5**\n\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Here4Doggos",
        "body": "This mask has been on my to try next list for while, but I think this review pushed me over the edge! Awesome review👍🏻",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "purple_noodles",
        "body": "Great review! Thanks for posting😊 I'm definitely going to look into this",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Ronrinesu",
        "body": "This is my favorite mask! <3 I bought a second one when I finally caught it on sale because these are never discounted. :( I need to finally do a detailed review of it.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dentistry",
    "post_id": "j0nauc",
    "title": "What is the difference with all these Toothpaste for sensitive teeth?",
    "url": "https://www.reddit.com/r/Dentistry/comments/j0nauc/what_is_the_difference_with_all_these_toothpaste/",
    "score": 41,
    "num_comments": 17,
    "created": "2020-09-27T07:56:33+00:00",
    "body": "There are three Colgate tooth pastes i usually buy when they are on sale. These are:  \n\n\n**Colgate Sensitive -** [Multi Protection](https://www.chemistwarehouse.com.au/buy/64972/colgate-sensitive-prorelief-multi-protection-sensitive-teeth-pain-fluoride-toothpaste-110g)  \n*Ingredients:* Calcium Carbonate, Water, Sorbitol, Arginine, Bicarbonate, Sodium Lauryl Sulphate, Sodium Monofluorophosphate, Flavour, Carmellose Sodium, Sodium Bicarbonate, Tetrasodium Pyrophosphate, Titanium Dioxide, Benzyl Alcohol, Sodium Saccharin, Xanthan Gum.  \n*Active Ingredients:* Arginine 8% w/w, Sodium Monofluorophosphate 1.1% w/w.  \n*Contains:* This product contains Arginine 8% w/w and Sodium Monofluorophosphate 1.1% w/w (equivalent to 1450 ppm F).  \n\n\n**Colgate Sensitive -**[Repair and Prevent](https://www.chemistwarehouse.com.au/buy/82497/colgate-sensitive-prorelief-repair-prevent-sensitive-teeth-pain-fluoride-toothpaste-110g)  \n*Ingredients:* Calcium Carbonate, Water, Sorbitol, Arginine, Flavour, Polaxamer, Sodium Monofluorophosphate, Zinc Oxide, Cocamidopropyl Betaine, Benzyl Alcohol, Carmellose Sodium, Zinc Citrate, Sodium Bicarbonate, Tetrasodium Pyrophosphate, Xanthan Gum, Saccharin Sodium, Sucralose, Titanium Dioxide.  \n*Contains:* This product contains Arginine 8% w/w and Sodium Monofluorophosphate 1.1% w/w (equivalent to 1450ppmF).  \n\n\n**Colgate Sensitive -** [Enamel Repair](https://www.chemistwarehouse.com.au/buy/65794/colgate-sensitive-prorelief-enamel-repair-sensitive-teeth-pain-fluoride-toothpaste-110g)  \n*Ingredients:* Calcium Carbonate, Water, Sorbitol, Arginine, Bicarbonate, Sodium Lauryl Sulphate, Sodium Monofluorophosphate, Flavour, Carmellose Sodium, Sodium Bicarbonate, Tetrasodium Pyrophosphate, Titanium Dioxide, Benzyl Alcohol, Sodium Saccharin, Xanthan Gum.  \n*Active Ingredients:* Arginine 8% w/w, Sodium Monofluorophosphate 1.1% w/w.  \n*Contains:* This product contains Arginine 8% w/w and Sodium Monofluorophosphate 1.1% w/w (equivalent to 1450 ppm F)\n\n  \nIs there any actual difference between these products? And what toothpaste ingredient should i seek for in a toothpaste for sensitive teeth?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "drillme103",
        "body": "The big key to ANY of these toothpastes is to not rinse for 30 minutes after you use it.\nBrush your teeth, swish it around in your mouth then spit out the extra and don’t rinse with water.\nThe ingredients need to “sit” on the teeth for at least 30 minutes in order to be effective.\nI tell my patients to use this type of toothpaste at night and just go to bed afterwards.\nAlso, don’t expect to start to see any results for at least 7-10 days once you start using it",
        "score": 36,
        "is_top_level": true
      },
      {
        "author": "jeremypr82",
        "body": "Pick one with arginine, and get another toothpaste with potassium nitrate. They both work for sensitivity in different ways and complement each other. They can't put them together into one paste because, well, reasons that don't matter much to you as a consumer.",
        "score": 32,
        "is_top_level": true
      },
      {
        "author": "shineyn",
        "body": "Is it safe to use toothpaste for sensitive teeth, like Sensodyne, long term? Even if you don't have sensitive teeth?",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "KoperKat",
        "body": "The only difference I see is that the middle one has no Sodium Lauril Sulphate, but Polaxamer as a surfactant instead. It also has a lower concentration of Sodium Bicarbonate.\n\nWhile SLS has been demonised quite a bit (for better or worse), it can cause issues for people with bullous diseases or issues with sensitive soft tissues. This however doesn't really affect the tooth sensitivity issue.\n\nThis second might be better for those that have issues with recurring mouth ulcers triggered by SLS sensitivity.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Vivid_Dreams_",
        "body": "get one with potassium nitrate. That’s what they teach us in school 🙂",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "blinkyvx",
        "body": "eliminate anything with SLS, do some reading, terrible for us and all it does is create 'foam\" cuz they think buyers want it.\n\n&#x200B;\n\nLook into Biomin",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "cudam221",
        "body": "My dentist prescribed me a Floride toothpaste because my enamel is so bad but I also use sensodine. Someone commented not to rinse. Which I didn’t know till a few weeks ago. This is so it can build enamel on your teeth (Don’t quote me on that I’m not a dentist)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Tinyfishy",
        "body": "Honestly, if the active ingredients are the same, they are probably going to work the same for you. If you need an antisensitivity paste, go buy one and use it correctly for two weeks (one inch strip, no rinsing after). If it isn’t making a difference in two weeks, buy one with a different antisensitivity active ingredient (usually another brand) and repeat.",
        "score": -2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HistamineIntolerance",
    "post_id": "onc15d",
    "title": "Toothpaste was holding me back in emptying the bucket",
    "url": "https://www.reddit.com/r/HistamineIntolerance/comments/onc15d/toothpaste_was_holding_me_back_in_emptying_the/",
    "score": 27,
    "num_comments": 18,
    "created": "2021-07-19T11:18:30+00:00",
    "body": "So I'm trying to recover from an acute histamine intoxication I had last months, since I started SIGHI 0 list I was doing fine, until I realized there was something that was holding me back pretty strong.\n\nI couldn't understand why sometimes the same food was giving me reactions and others time don't\n\nOne day I realized that I was always brushing my theet after eating! So I tryed to brush my teeth far from the meal time, I put a generose amount of toothpaste and washed the teeth with it for 3-5 minutes\n\nFuck me! I got a terrible rinitis, itchy and all achy in my body for days!\n\nSince I quit that toothpaste I got so much better in a couple of days, it's crazy!\n\nSo I incredibly found a strong factor\n\nI don't know what it's in it that was giving me reaction here's the list of ingredients:\n\nAqua, glycerin, hydrated silica, zinc coco-sulfate, cellulose gum, sodium monofluorophosphate, sodium saccharin, tetrasodium pyrophosphate, sodium carbonate, sodium fluoride, eugenol, geraniol, limonene, CI 77891\n\nI switched to a super basic one with just these ingredients and I'm doing fine with it:\n\nAqua, Hydrated Silica, Sorbitol, Hydroxyethylcellulose, Olaflur, Aroma, Saccharin, Limonene\n\nHope this helps you too!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "hey_look_its_shiny",
        "body": "TBH that doesn't sound like histamine intolerance; it sounds more like an allergy or MC sensitivity to one of the ingredients.\n\nI'm not saying that's definitely what it is, of course... just offering food for thought.",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "lalagirl550",
        "body": "Yes, its the glycerin. Most comes from soy, so you have to be careful.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "phenixwars",
        "body": "What are the brand names of both toothpastes? Just to know.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "pilclo",
        "body": "Yes! I've noticed this, too. When my bucket is full, my tongue swells up and my sinuses clog up after brushing my teeth. What brand did you find that had such a nice, simple ingredients list?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "missandei77",
        "body": "Might be the CI77891, titanium dioxide? I think France has forbidden it in food last year as they don't consider it safe anymore, and hopefully others will follow.  It's in a lot of things as food dye (to make products look more white), toothpaste, makeup, sunscreen etc. Having trouble finding toothpaste without it here... https://www.efsa.europa.eu/en/news/titanium-dioxide-e171-no-longer-considered-safe-when-used-food-additive",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "tropicalsoul",
        "body": "Limonene (oil from citrus fruit peels), eugenol (extracted from essential oils including cinnamon), and saccharin, maybe?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "5fvn2a",
    "title": "[Review] Bonvivant Botanical Mellow Clay Mask vs. Innisfree Jeju Volcanic Pore Mask",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/5fvn2a/review_bonvivant_botanical_mellow_clay_mask_vs/",
    "score": 25,
    "num_comments": 2,
    "created": "2016-12-01T09:05:22+00:00",
    "body": "Hey guys, so a couple days ago someone on one of the daily help threads asked for a comparison review of the Bonvivant Botanical Mellow Clay Mask and the Innisfree Jeju Volcanic Pore Mask. And since I have both, I said I'd do a comparison! This is my first review so I'm glad to be helping people :) so let's get started!\n\nNOTE: I caught a head cold when I went home for my Thanksgiving break, so please keep that in mind! I'll specify where things were affected as a result of my head cold. (Don't worry, I'm doing better now and was already on the mend by the time I got back to campus to be able to test these!)\n\nBonvivant Botanical Mellow Clay Mask in Hawaiian Pink Calamine\n- Scent: It has a very faint herbal scent. I could smell it when it first arrived, before I got sick, but when I opened it up again to actually use it, I couldn't smell it any more because my nose had gotten so plugged up...\n- Color: It was a very cute pastel pink!\n- Texture: It's kinda like jello! I pushed on it and it pushed back like a soft rubber; it was kinda fun to play with! Normally I hate having long nails when I put on clay or gel masks (I'll admit I'm too lazy to trim them if they still look good), but having longer nails was actually useful this time to get past the bouncy top and scoop it out of the jar. It was also useful when breaking apart the chunks to smooth it onto my face.\n- Time: 10 minutes\n- First impression: It slightly stung on my nose, but my nose was very dry and raw from having to blow it so much (darn you, head cold!). After about 30 seconds, though, the stinging went away and I could enjoy the cooling sensation all over my face.\n- In progress thoughts: You definitely want to do more than a thin layer. Mine was thin because I got less than I thought I did once I broke the chunks apart and smoothed it out, and it dried faster than I thought it would have. I could see it sinking into my pores though.\n- Final thoughts: It's easy to wash off, but I recommend using a sponge to get it off easier than using just your hands like I did. My skin felt very soft afterwards, and even after just one use the raw and dry skin on my nose seemed nice and calm! Definitely still red, but not as extreme as before. Granted this was just one use, but I think it did what it was advertised to do!\n- Ingredients (cosdna.com): Water, Kaolin, Glycerin, PEG/PPG-17/6, Copolymer, Calamine, Portulaca Oleracea Extract, Betulla Platyphylla Japonica Juice, Papain, Maltodextrin, Cymbopogon Schoenanthus Extract, Castanea Crenata (Chestnut) Shell Extract, Lavandula Angustifolia (Lavender) Flower Extract, Volcanic Ash, Ammonium Acryloyldimethyltaurate/Beheneth-25 Methacrylate Crosspolymer, Cellulose Gum, Hydroxyacetophenone, Hydroxyethylcellulose, Betaine, Titanium Dioxide (CI 77891), Tetrasodium Pyrophosphate, Disodium EDTA, Phenoxyethanol, Chlorphenesin, Caprylyl Glycol, 1,2-Hexanediol\n\nInnisfree Jeju Volcanic Pore Clay Mask\n- Scent: It was like natural clay (different from art clay). It was very very faint, and while I'm basically done with my head cold, I would not have noticed it if I hadn't just taken a hot shower that cleared my sinuses.\n- Color: It was kind of a brownish gray.\n- Texture: It's like any normal clay mask.\n- Time: 15 minutes\n- First impression: It was very easy to spread on and get a nice even layer. (It was a bit annoying to try to clean out from under my nails, though.) There wasn't really much of a feel to it aside from a somewhat subdued cooling sensation along my cheekbones.\n- In progress thoughts: There really isn't too much of a cooling effect. There was somewhat more in other areas (my forehead and cheeks) than when I first put it on, but not much. I didn't see much sinking into my pores, but I also got a more generous layer with this than I did with the Bonvivant mask.\n- Final thoughts: There still wasn't much visible pulling out stuff from my pores, but I guess that means that the blackheads I thought I had are either large pores or they're closed over (yikes!). It was easy to wash off, but again, a sponge would be easier than your hands (also use warm water, it likes to cling with cool water). Not much of a softening effect immediately (I noticed my skin felt softer maybe 10 minutes later, before I started the rest of my routine for the night), but some of the healing acne that's been popping up due to the stress of finals look less red. It's probably better for those who have more blackheads or sebaceous filaments than I do.\n- Ingredients: Water, Butylene Glycol, Titanium Dioxide, Silica, Glycerin, Caprylic/Capric Triglyceride, Trehalose, Volcanic Ash, Cetearyl Alcohol, Stearic Acid, Glyceryl Stearate, Bentonite, Zinc Oxide, Polysorbate 60, Camellia Sinensis Leaf Extract, Citrus Unshiu Peel Extract, Opuntia Coccinellifera Fruit Extract, Orchid, Camellia Japonica, Cryptomeria Japonica Leaf Extract, Bambusa Vulgaris Extract, Theobroma Cacao Seed Extract, Kaolin, Polyvinyl Alcohol, Hydrogenated Vegetable Oil, PVP, Dextrin, PEG-100 Stearate, Sorbitan Stearate, Cellulose Gum, Xanthan Gum, Lactic Acid, Tetrasodium Pyrophosphate, Disodium EDTA, Ethylhexylglycerin, Phenoxyethanol, CI 77491\n\nThe Bonvivant mask will be more useful for me personally, but the Innisfree one was nice too. They definitely have different purposes, but I only reviewed one version of the Bonvivant mask, the one meant to calm troubled skin. They also have them in Jeju Volcanic, meant for blackhead removal like the Innisfree one, and in Mint Tea Tree, meant for removing dead skin cells. If you're looking for something to soothe your skin, I'd definitely say try the Hawaiian Pink Calamine version of the Bonvivant mask. If you want something more like the Innisfree one, I'd say give the Jeju Volcanic one a try. (I don't have the other two to try out, so sorry!) My skin problem is more keeping skin soft and healing non-blackhead acne, so for me the Hawaiian Pink Calamine mask is better. But that is just me!\n\nHopefully this helps! I kind of tried to model what other reviews I've seen here and over other parts of the Internet look like, so I hope that all the important information is there! Thanks!",
    "flair_text": "Reviews",
    "flair_template_id": null,
    "comments": [
      {
        "author": "kitty_mayo",
        "body": "Excellent! I bought the Innisfree Jeju volcanic mask and the 3 set of Bonvivant clay masks too. Hoping to get some results for my nose which doesn't have a lot of black heads, but does get a lot of sebaceous filaments. Not sure how that happens. But yeah! Glad to have more confirmation that I didn't just buy art clay mixed with silly putty and food coloring. lol",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AsianBeauty",
    "post_id": "10qeu70",
    "title": "My first modeling pack: One Thing H Cordata Modeling Pack",
    "url": "https://www.reddit.com/r/AsianBeauty/comments/10qeu70/my_first_modeling_pack_one_thing_h_cordata/",
    "score": 18,
    "num_comments": 2,
    "created": "2023-02-01T00:04:34+00:00",
    "body": "Modeling packs have been an interesting concept for me for a while and I’ve talked myself into and out of buying them several times. This week, while I was ordering some things to restock soon-to-be empties, the store had a special on One Thing (15% off at Lila Beauty until the end of today for Aussie-based folks), so I figured why not?\n\nI got the H Cordata one because that’s one of my favourite ingredients, and I’m always looking for soothing products because my skin can be on the sensitive side and I also deal with hormonal acne on my chin.\n\nI used it this morning for the first time. It’s probably a little gimmicky/mad scientist in the way you have to mix it yourself, but it’s kinda fun. The instructions suggested two scoops of powder to 1.5-2 scoops of water, but I saw reviews that said one scoop of powder was sufficient so I did that and it was enough.\n\nIt felt pretty cooling on my face and it peeled off nicely except in a few small areas where it wasn’t thick enough. I have a fair amount of peach fuzz on my face and, unlike peeling masks, it didn’t get caught in that nor did I feel as though it was ripping the hairs out.\n\nMy skin has a nice glow to it today and my chin feels a little calmer and is less red. So, I think it was a success. I probably won’t be using it too regularly but it’s a great product for when you want to do like an at home spa day.\n\nIngredients: Diatomaceous Earth, Glucose, Algin, Calcium Sulfate, Tetrasodium Pyrophosphate, Magnesium Oxide, Sodium Benzoate, Spirulina Platensis Powder, Potassium Sorbate, Purified Water, Houttuynia Cordata Powder (1,000ppm), Allantoin, Glycerin, 1,2-Hexanediol, Houttuynia Cordata Extract (10ppm), Glycyrrhiza Glabra (Licorice) Root Extract",
    "flair_text": "Review",
    "flair_template_id": "2cceaa7e-4407-11e4-b535-12313b0eaace",
    "comments": [
      {
        "author": "Scatterland_Catnip",
        "body": "Hi, I see that they sell 30gr packs instead of a whole jar, so how many scoops are there in one pack of powder? TIA!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "mealkits",
    "post_id": "y19p0f",
    "title": "Home chefs cream sauce base",
    "url": "https://www.reddit.com/r/mealkits/comments/y19p0f/home_chefs_cream_sauce_base/",
    "score": 16,
    "num_comments": 12,
    "created": "2022-10-11T13:55:05+00:00",
    "body": "Does anyone know what's in it? Most of the googling I do has the roux but I want the sauce base they use. Some of the recipes I want to re-create use that but I'm unsure.\n\n&#x200B;\n\nEdit: I message homechef lol This is what they sent me:\n\n \" Cream Sauce Base: Light Cream, Water, Food Starch-Modified \\[Corn\\], Contains 2% or Less of Each of the Following: Mono- and Diglycerides, DATEM, Tetrasodium Pyrophosphate, Sodium Citrate, Dextrose, Carrageenan, Guar Gum, Sodium Phosphate, Salt, Natural Flavor, Yeast Extract, Hydrolyzed Corn Protein, Onion Powder, Spice, Natural Extractive of Turmeric and Annatto \\[Color\\], Vitamin A Palmitate, Vitamin D3 \"",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "chantillylace9",
        "body": "It’s so good!! HelloFresh uses it too. It’s a bechamel sauce \n\nhttps://www.epicurious.com/recipes/food/views/white-sauce-or-bechamel-sauce-40046",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Umbreonnnnn",
        "body": "I've been asking this same question for awhile and I don't think it's actually a bechamel. It just doesn't have the buttery taste of one and if they answered and said it was light cream, water, and corn starch (plus additives), I'll bet you can make something similar in a shaker bottle with just half and half and cornstarch, adding water to thin it out til it's the same consistency. \n\nNo hate to the people who are saying it's a bechamel, but I've tried recreating their recipes by making a bechamel in place of the cream sauce base and it doesn't match quite as well.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "tiltedsun",
        "body": "Bechamel is the correct answer below but if you want something shelf stable and prepared, try one of those jarred alfredo sauces.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Klutzy-Addition5003",
        "body": "There is options to pick out just certain items like this sauce on their website. I’m not sure if this specific sauce is there but they have an amazing Demi that I love on there.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "LittleMissMuffinButt",
        "body": "I know this post is old but I recently had this question also and went hunting for an answer before just messaging home chef.\nI'll be posting the response I got from home chef but wanted to make sure you see it too, hence the response.\n\napologies for any funky formatting I am on mobile.\n\n\nThanks for reaching out with this inquiry! The Cream Base sauce is by Darifair Foods and isn't sold separately in grocery stores. If you would like to prepare this sauce base here are the ingredients:\n \nCream Sauce Base\n \nPrep time: 3 mins\nCook time: 5 mins\nTotal time: 8 mins\n \nIngredients\n\n2 tablespoons butter\n\n2 tablespoons all-purpose flour\n\n2 cups heavy whipping cream (16 ounces)\n\nsalt and pepper (to taste with your preference)\n\n(optional: 1 cup or more of your favorite cheese)\n\n\nInstructions\n\nMelt butter in a medium saucepan.\n\nOnce butter is melted, add 2 tablespoons of flour and stir with a whisk to prevent any lumps.\n\nAdd salt and pepper. Cook and stir for 2 minutes.\n\nPour 1 cup of heavy whipping cream into the butter-flour mixture and continue stirring. It will start thickening in less than 1 minute.\n\nAdd the rest of the cream and stir.\n\nThe sauce will then start reheating back up and be thicker within 3-5 minutes.\n\nTake off heat once thickened.\n\n(Optional: Stir in your favorite cheese to melt.)\n\nPour over your favorite pasta! \n\n\nMakes 2 cups of Cream Sauce.\n \nI hope this helps! please let me know if I can be of further assistance.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Few_Patience5501",
        "body": "I know, now it's a reeeeeeally old post, but I wanted to add that it keeps in the freezer really well for a few months.\n\nI made a batch and put it in four freezer ziplocks with 1/2 cup each. Just let it defrost and squish it around with your fingers before adding to something. It makes cooking HomeChefishly easy without the cost.\n\nIf it looks like it's separated, don't panic. Reheat in the microwave for all of 10 seconds, max, and squish it around again before opening the bag to add it to something. Works like a charm.\n\nThanks again to u/LittleMissMuffinButt for her intrepid research and generous sharing. This has been life-changing. Imma drink it straight up with her if we ever meet. I'm pretty sure I could get drunk off the stuff.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IBD",
    "post_id": "1kybp2k",
    "title": "Highly recommend trying to avoid emulsifiers for a week to see how it goes",
    "url": "https://www.reddit.com/r/IBD/comments/1kybp2k/highly_recommend_trying_to_avoid_emulsifiers_for/",
    "score": 12,
    "num_comments": 3,
    "created": "2025-05-29T14:07:10+00:00",
    "body": "I've been learning more about emulsifiers potentially impacting inflammation and being used to simulate IBD inflammation in mouse models.\n\nThe past 3 months I've been in a crohns flare despite my biologics.\n\nTurns out I've suddenly become sensitive to the emulsifiers in the work half and half and as soon as I cut it out I had immediate relief. \n\nI hadn't really been paying much attention to them until recently and I'm glad I did. I was getting really really bad, like gastritis, no energy, sleep interruptions, etc. \n\nBig ones are polysorbates, and the half and half I was using had DATEM, tetrasodium pyrophosphate, and carrageen.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "TummyIBD",
        "body": "How do you know what does and doesn't contain emulsifiers? i'm a big believer in diet contributing to at a minimum symptoms and potentially underlying inflammation as well.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "DIYBeauty",
    "post_id": "fuiqdt",
    "title": "Can anyone tell me if these ingredients in toothpaste are ok?",
    "url": "https://www.reddit.com/r/DIYBeauty/comments/fuiqdt/can_anyone_tell_me_if_these_ingredients_in/",
    "score": 12,
    "num_comments": 40,
    "created": "2020-04-03T23:13:52+00:00",
    "body": "Ingredients: Baking soda, Natural herbal extracts, Sorbitol, Water, Hydrated Silica, Glycerin, Polyethylene Glycol-8, Propylene glycol, Sodium Lauryl Sulfate, Menthol, Wrinkle Carrageenan, Cellulose Gum, Sodium Phytate, Tetrasodium Pyrophosphate, Sodium Saccharin, Titanium Dioxide, Menthyl for Melamine.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "alternativecatlady",
        "body": "I’ve seen concerns about baking soda being too abrasive for prolonged use on enamel. I’d look up dentist recommendations/scientific articles on that one",
        "score": 8,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "LCHF",
    "post_id": "1ytv44",
    "title": "Getting INSTANT pudding to work without real milk",
    "url": "https://www.reddit.com/r/LCHF/comments/1ytv44/getting_instant_pudding_to_work_without_real_milk/",
    "score": 7,
    "num_comments": 1,
    "created": "2014-02-24T21:27:37+00:00",
    "body": "Anyone who has ever tried to create instant pudding using either almond or soy milk knows that it doesn't work. It tastes delicious but it never \"sets\" or solidifies into a pudding consistency. [Jello](http://www.jello.com/products/sugar-free-desserts/) has about a dozen sugar free flavors with a net 6 or 7 carbs per serving BEFORE you add milk so if someone could figure this out it would be a boon to low carbers.\n\nI searched and found three basic approaches that low carbers have taken to get it to work. The first is using less fake milk (like replacing 2 cups of real milk with only 1 cup of almond milk). Obviously the result will be more solid if you start with less liquid but this means you end up with fewer servings and doubles the carbs per serving. And after experimenting with this I can tell you it still never reaches a real pudding consistency. \n\nThe second approach is adding a thickening agent. I've seen Xanthan gum and Guar gum used. But this stuff is expensive and the final result is slightly slimey.\n\nThe third approach delivers the best consistency. You use some real milk product and cut it with fake milk. I've seen both skim milk and heavy cream used but the former adds carbs and the latter massively increases the calories (and adds an incidental amount of carbs despite what the label says). But at least the result is actually pudding.\n\nSo obviously there is something in instant pudding which when exposed to real dairy turns into a gel. It wasn't hard to \nfind, its right there in the ingredients list \"TETRASODIUM PYROPHOSPHATE AND DISODIUM PHOSPHATE (FOR THICKENING)\". But why do these components thicken when exposed to dairy? What is the mechanism? \n\nIt took more research than I like to admit but I've figured it out. There are 2 primary proteins in milk: whey (making up approximately 20% of milk protein) and casein (making up approximately 80% of milk protein). Whey is well known as the most popular protein powder consumed by bodybuilders the world over. Casein is better known for its use in cheese making. It seems casein coagulates when acidified or when exposed to certain compounds universally found in the stomach's of mammals. Aha!\n\nIs the problem with instant pudding that real dairy contains casein and almond and soy milk don't? The way to test my theory would be to add casein to fake milk and see if the pudding thickens. Luckily although whey protein powder is far and away the better seller, casein protein powder also exists. Bodybuilders like to take it at bedtime because it turns into a gel in their stomach's and slowly makes protein available to the body throughout the night. So I plunked down $30 bucks for a 2 lb tub of unflavored casein powder (which contains no carbs).\n\nThe first time I tried it I could tell in the first 60 seconds that I was on the right track. I stuck it in the fridge and came back in an hour and it had worked. We have achieved pudding! It took a little trial and error but I determined that the correct amount of casein to use is about 7 grams per cup of fake milk. \n\nJust replace the dairy milk cup for cup with either almond or soy milk (or theoretically any liquid; even water). Add 7 grams of unflavored casein powder and \n stir thoroughly making sure that it gets completely dissolved. Then add the instant pudding mix and stir thoroughly again. Then stick it in the fridge and an hour later you have no compromise low carb instant pudding. From my 2 lb tub of casein powder I have enough to make about 90 batches.\n\nYou must be thinking at this point; this guy, this guy really likes pudding. Well now that we know how to do this we can make mousse, no-bake cheesecake and pudding pies! Now we can think of pudding as an ingredient low carbers can use to make all kinds of things. And we can do it with off-the-shelf  flavors like cheesecake, butterscotch, banana cream, lemon, pistachio and chocolate fudge. At only 6 or 7 net carbs per serving (depending on the flavor) you can afford to have dessert again once in a while.\n\ntl;dr Add 7 grams of unflavored casein powder per cup of liquid to get instant pudding to work without real milk",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Muppets_Attack",
        "body": "or just replace the milk with heavy whipping cream and cry tears of moussey joy.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ostomy",
    "post_id": "1dntpsi",
    "title": "WHY are marshmallows good for slowing down output?",
    "url": "https://www.reddit.com/r/ostomy/comments/1dntpsi/why_are_marshmallows_good_for_slowing_down_output/",
    "score": 8,
    "num_comments": 12,
    "created": "2024-06-25T01:06:49+00:00",
    "body": "It is an *uphill battle* to convince the hospital that a tasty sugary confection is probably the best thing for a new overactive ileostomy. What are the magical ingredients? Modified corn starch (what kind? there are lots!) It can't just be gelatin or the hospital Jell-O would do the trick. Is it the tetrasodium pyrophosphate? Or all of the above, in just the right combination? Are there any other foods that aren't perceived as candy for children that have a similar effect? ",
    "flair_text": "Ileostomy",
    "flair_template_id": "b1f1550c-679a-11e3-828e-12313b074434",
    "comments": [
      {
        "author": "WoodwifeGreen",
        "body": "Things with gelatin or pectin work. Both absorb moisture. Concentrated gelatin though. Like marshmallows or gumdrops.\n\nApplesauce and bananas work for me too. Apples have pectin, not sure what the bananas have.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "goldstandardalmonds",
        "body": "The gelatin.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "MGSA_99",
        "body": "Yes I always always told by my surgeon it was because of the gelatine , the same for he always told me if I don't have marshmallows get Harbos, so in my car and my partners and parents they always have one bag of each for me in my emergency bag spot in the boot ahah but I swear by them 💕",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "cope35",
        "body": "I used Dandies marshmallows at times. Better than the cheep stuff that's filled with corn syrup etc. Ingredients are,Tapioca Syrup, Cane Sugar, Filtered Water, Tapioca Starch, Carrageenan, Soy Protein, Natural Vanilla Flavor. It has 24 grams of carbs, the carbs are what slows the output.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "derekvandreat",
        "body": "My doc specifically said anything with pectin. Pectin is the binding agent you want here.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "foodscience",
    "post_id": "ojlzkp",
    "title": "Ingredient functionality help",
    "url": "https://www.reddit.com/r/foodscience/comments/ojlzkp/ingredient_functionality_help/",
    "score": 9,
    "num_comments": 12,
    "created": "2021-07-13T18:42:09+00:00",
    "body": "Hello,\n\nI am trying to get involved more in the plant-based alternative product R&D space, and want to better understand ingredients that are used and what their functionalities are. For example, in JUST Eggs, there are a lot fo ingredients I don't recognize. \n\nWhat are the functionalities of these ingredients?:\n\nPotassium Citrate\n\nTetrasodium Pyrophosphate\n\nTransglutaminase\n\nAlso why do you think they use Mung Bean Protein Isolate, specifically?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "lennartcm",
        "body": "Mung bean protein is a relatively strong gelling plant protein. Transglutaminase is a enzyme which crosslinks certain amino-groups of protein and by doing this will enhance the gel strength.\n\nPotassium Citrate and tetrasodium pyrophosphate can have multiple functions. They are both buffers which can be used to control the pH and may improve the solubility of proteins. They are also chelators which can bind minerals like calcium to control gelation of alginate.",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "UpcomingCarrot25",
        "body": "Potassium Citrate is a buffer - helps keep the pH where it should be\n\nTetrasodium Pyrophosphate - flavor enhancement (think new age MSG)\n\nTransglutaminase - Helps with texture",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskChemistry",
    "post_id": "1jsi0lk",
    "title": "Cleaning Plasma Sputter from Fused Silica - Detergent Question",
    "url": "https://www.reddit.com/r/AskChemistry/comments/1jsi0lk/cleaning_plasma_sputter_from_fused_silica/",
    "score": 4,
    "num_comments": 4,
    "created": "2025-04-06T00:38:17+00:00",
    "body": "Hello, I am trying to clean vacuum chamber windows for a magnetic confinement fusion-ish experiment at my University. The windows are fused silica. The dominant impurity deposition to be removed is carbon. Tungsten and copper are also present in considerable quantities, but exact ratios aren't known. \n\nI say \"fusion-ish\" above because we run elemental hydrogen to observe relevant plasma physics behaviors without producing neutrons and alphas. \n\n**The main problem:** we have a detergent on-hand from a company that no longer exists, and any student with experience using it graduated long ago. We have safety information (PPE, fume hood, exothermic reaction while mixing may call for ice bath), but not instructions for our actual use-case. \n\nI would like help figuring out:\n\n1. How to determine the necessary detergent mass to mix in per unit of DI water to be useful in an ultrasonic cleaner\n2. Which chemicals in the detergent are actually doing the heavy lifting in removing carbon, copper, and tungsten from fused silica (This question is relevant because we only have 2 small jars and how long they will stretch us depends on the answer to question 1. If I must make my own version of this detergent, I would like to leave out any unnecessary components to reduce the total number of hazardous chemicals I am responsible for)\n\n**Here is the relevant info I do have:**\n\nName: Dislodge, Cat. No. 49140\n\nManufacturer: either \"Ariel\" or \"Oriel\" corporation, bottle label is faded\n\nComposition:\n\n* Sodium hydroxide (45-55%)\n* Tetrasodium pyrophosphate (20-30%)\n* Triton X-100 (<5%) - \\[part of motivation for question 2, seems like a biology thing, might be more danger label than utility for my use-case\\]\n* Dipentene (<5%) \n\nLaboratory heritage: according to legend passed down from PhD candidates of old, this chemical was the only option which was effective at cleaning our windows. When it became commercially unavailable, our lab switched to something called \"Alconox,\" which was easy to get approved by EH&S but just doesn't do the job nearly as effectively. \n\nFor background, I am getting my MS in Aeronautics and Astronautics, and I haven't really studied chemistry (outside of combustion) in a formal setting since community college 4 years ago. Any information will be sincerely appreciated, thank you!",
    "flair_text": "Inorganic/Phyical Chem",
    "flair_template_id": "4e429b78-e808-11eb-9fad-0e8a12468285",
    "comments": [
      {
        "author": "jtjdp",
        "body": "Its not very often astronauts ask for help from us well-grounded chemists. But don't worry, Major Tom, I'm gonna  bring you home. I'm sending a fair and balanced evaluation of your situation and before you know it, we'll have some CO2 scrubbers built outta spare socks, the elastic band from your boxer briefs, a frozen hot dog w/ a pencil-sized hole drilled thru the middle (think of it like turning an apple or soda can into an ersatz hash pipe when you were in high school), an eight-track cassette player, and the 'collection nozzle' for the command module's...um...little boys room.   \n  \nThat's' right Capt Lovell and the other guys played by Tom Hanks and Kevin Bacon (in that one movie)....you're all coming home...as long as you're heat shield don't fail.  \n\\------------------------------------------------------------------------------------------------------------\n\nHey astro(not), Lost the manual for your legacy \"Dislodge\" window cleaner? Happens to the best of us when the previous crew jumps ship (graduates). Here’s the quick flight plan\n\n# Fuel Mixture (Concentration):\n\nStart with a 2% w/v solution (20 g powder per 1 Liter DI water). Think of it as your initial burn.\n\nIf that doesn't reach escape velocity for the grime, nudge it up to 3% or 4% (30-40 g/L).\n\nSafety First! Add the NaOH powder *slowly* to water (it heats up like atmospheric entry!), wear your PPE, use a hood. The ultrasonic cleaner is your friend here – adds cavitation thrust\n\n# Meet the Crew (Chemical Roles)\n\nNaOH (Sodium Hydroxide): *Main Engine.* Strong base, blasts carbon & tungsten oxides. The powerhouse.\n\nTetrasodium Pyrophosphate: *Guidance & Control + Debris Net.* Helps NaOH, *grabs* dissolved metal ions (Cu, W) so they don't redeposit (chelation!), keeps particles suspended. Likely *why* it beats phosphate-free Alconox.\n\nTriton X-100: *Wetting Agent.* Makes water \"wetter\" to penetrate grime, lifts junk off the surface. Standard stuff, not weird alien tech.\n\nDipentene**:** *Degreaser Thruster.* Zaps any oily/greasy components in the crud.\n\n\n\n**Can We Ditch Some Stages? (remind Challenger to avoid 'going for throttle up', it didn't work well last time...perhaps consider lightening the load, by pushing that useless 2nd grade teacher out the window)**\n\nProbably not without losing performance. This looks like a synergistic mix where every part has a job. (just like the Morton Thiokol contractor who recommended those 'lifesaving' O-rings...you know, the ones that were approved for all-temperature and all-weather...even Floridian winters) Leaving out the Phosphate or Triton would likely cripple its effectiveness (like losing GNC or your comms array). Leaving out Dipentene *might* be okay if your crud isn't greasy, but why risk it if the original formula worked?\n\nThe legend of it being \"the only option\" suggests the full cocktail is needed for your specific plasma-induced crud.\n\nTL;DR: Try 20 g/L, increase if needed. Be careful mixing NaOH. All ingredients likely matter, especially the phosphate for metal control (unlike Alconox). Don't try to simplify unless you have to, and handle NaOH like it's hypergolic if you DIY.\n\nGood luck clearing those viewports so you align the stars for that critical manual burn that should catapult you around the moon on a course back home...that's up to you Jim, so don't mistake the little dipper for the big one!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "mprevot",
        "body": "Just use Decon 90 (used to decontaminate from radioactive metals), scratch and rince with water, then eau régal (nitric acid + sulfuric acid) bath for 24h, rince with water a lot then pure water, optionnally with pure ethanol or formaldehide, then dry.\n\nYou can find this recipe in scientific papiers.\n\nWe use that (in high end nanomaterials research lab) to clean nanoparticule of gold and silver on glass, the most sticky metals. This should be fine with yours.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "bluebell",
    "post_id": "15cidvi",
    "title": "Flavor Deep Dive: Rocky Road",
    "url": "https://www.reddit.com/r/bluebell/comments/15cidvi/flavor_deep_dive_rocky_road/",
    "score": 4,
    "num_comments": 0,
    "created": "2023-07-29T04:05:19+00:00",
    "body": "**Rocky Road:** A rich, dark chocolate ice cream generously sprinkled with chopped, roasted almonds and miniature marshmallows.\n\n \n\n# INGREDIENTS:\n\nMilk, cream, skim milk, sugar, high fructose corn syrup, almonds (almonds, canola oil, salt), marshmallows \\[corn syrup, sugar, modified food starch (corn), water, gelatin, tetrasodium pyrophosphate (improves whipping)\\], cocoa (processed with alkali), cellulose gum, vegetable gums (guar, carrageenan, carob bean), salt.\n\nContains Bioengineered Food Ingredients.\n\n&#x200B;\n\n#### ALLERGENS:\n\nContains milk and tree nuts (almonds)\n\n*Please check actual product label as information may change*\n\n&#x200B;\n\nhttps://preview.redd.it/hys64xwnd80b1.png?width=447&format=png&auto=webp&s=cdb158defcedc21262198aab08a6248a5e1b3ef4",
    "flair_text": "Flavor Deep Dive",
    "flair_template_id": "b23a9aca-f406-11ed-bf1e-96bc9d5b9f5e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "islam",
    "post_id": "1it94q5",
    "title": "Is this cake suitable for my Muslim friend? Ingredients are listed below.",
    "url": "https://www.reddit.com/r/islam/comments/1it94q5/is_this_cake_suitable_for_my_muslim_friend/",
    "score": 4,
    "num_comments": 12,
    "created": "2025-02-19T16:10:13+00:00",
    "body": "Good morning everyone! My Muslim friend has requested a Tres Leches cake for his birthday, and I want to ensure the ingredients in this cake are not haram.  If anyone is in Texas, I am looking at the HEB Tres Leches cake. The halal bakeries in my area do not have Tres Leches cake, and this is short notice, so I don't have time to make one myself. I know this cake has many ingredients, and it may not be the healthiest, but that is my current option. Thank you in advance for your help.\n\n  \nHere is a link to the product: [https://www.heb.com/product-detail/h-e-b-bakery-two-fruit-tres-leches-cake/1534512](https://www.heb.com/product-detail/h-e-b-bakery-two-fruit-tres-leches-cake/1534512)\n\n  \nTres Leches Cake (Creme Cake(Sugar, Enriched Bleached Wheat Flour (Wheat Flour, Niacin, Reduced Iron, Thiamine Mononitrate, Riboflavin, Folic Acid), Modified Corn Starch, Soybean Oil, Milk, Contains 2% Or Less Of:, Leavening (Sodium Aluminum Phosphate, Sodium Bicarbonate), Emulsifier (Propylene Glycol Ester Of Fatty Acids (Emulsifier), Mono & Diglycerides, Sodium Stearoyl Lactylate), Vital Wheat Gluten, Artificial Flavor, Egg Whites, Soy Flour), Sweetened Condensed Milk (Milk, Sugar), Eggs, Whole Milk, Evaporated Milk (Milk, Dipotassium Phosphate, Carrageenan, Vitamin D3), Soybean Oil, Sugar, Water, Baking Powder (Sodium Acid Pyrophosphate, Sodium Bicarbonate, Corn Starch, Monocalcium Phosphate), Soy Lecithin (Bleached), Potassium Sorbate (Preservative)) Sweetened Whipping Cream (Cream (Milk), Corn Syrup, Sugar, Skim Milk, Milk(Milk, Vitamin D3), Contains 2% Or Less Of:, Modified Food Starch(Corn, Tapioca), Natural & Artificial Flavors, Sodium Citrate, Xanthan Gum, Polysorbate 80), French Sponge Cake (Cake Mix(Enriched Bleached Wheat Flour(Wheat Flour, Niacin, Reduced Iron, Thiamine Mononitrate, Riboflavin, Folic Acid), Eggs, Water, Sugar, Emulsifier Blend (Rice Starch, Glucose Syrup Solids, Mono & Diglycerides, Skim Milk, Polyglycerol Ester, Tetrasodium Pyrophosphate), Wheat Starch, Contains 2% Or Less Of:, Leavening (Sodium Bicarbonate, Sodium Aluminum Phosphate), Soy Protein, Cellulose Gum, Soybean Oil, Artificial Flavor, Beta Carotene (Color), Cultured Corn Syrup Solids, Citric Acid, Tricalcium Phosphate)), Harmony Glaze (Water, Sugar, Corn Syrup, Contains 2% Or Less Of:, Pectin, Citric Acid, Carrageenan, Xanthan Gum, Artificial Flavor, Preservatives (Potassium Sorbate, Sodium Metabisulfite), Sodium Citrate, Sodium Phosphate, Paprika (Color)).\n\n",
    "flair_text": "General Discussion",
    "flair_template_id": "3d4d0d5c-8288-11e6-a34a-0e0536d0c06b",
    "comments": [
      {
        "author": "Hufflepuff_Proud",
        "body": "To be on the safe side, I'd pick a cake that is labeled as kosher or vegetarian friendly...it doesn't eliminate all the issues (alcohol could still be present in various forms) but it eliminates a lot of major ones.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Bunkerlala",
        "body": "Im amazed at the number of chemicals in American food.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Brghuti",
        "body": "Mono and diglycerides and riboflavin are usually animal derived unless stated otherwise. There could be other i gredients as well, if you or others want me to dig deeper I can do that. \nDoes the cake have any symbols on it (the packaging), like a C or COR or K or something like that? That usually means Kosher (there are other signs that could mean kosher too), and kosher usually means halal as well unless alcohol is involved.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "microgreens",
    "post_id": "hwbe0w",
    "title": "Most effective way to remove mold from microgreens",
    "url": "https://www.reddit.com/r/microgreens/comments/hwbe0w/most_effective_way_to_remove_mold_from_microgreens/",
    "score": 3,
    "num_comments": 2,
    "created": "2020-07-23T07:26:10+00:00",
    "body": " \n\nI've seen a few ways to remove mold from microgreens, but I'm not sure how to do this exactly to be harmless for my customers. I've read this [article](https://www.healthline.com/health/food-grade-hydrogen-peroxide) and as far as I understand I need to use 35% since this is for food grade. Do you know any others ways to fight the mold or how exactly should I use peroxide? Any resources with information are welcome, thanks\n\nFrom the resource:\n\n>Hydrogen peroxide (H2O2) is a clear, colorless, odorless liquid. It’s a combination of hydrogen and oxygen and is available in many strengths (indicated by the percentage of dilution with water).  \nOne dilution of hydrogen peroxide is 35 percent H2O2 and 65 percent water. Food producers use 35 percent H2O2 for a variety of purposes, including processing cheese and bleaching wheat flour. It’s also used to kill microorganisms in food packaging materials.  \nThis 35 percent dilution is called “food grade” in part because it doesn’t contain certain stabilizers:  \nacetanilide phenol sodium stanate tetrasodium pyrophosphate",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "JaCrispy440",
        "body": "Dilute it to a 3% solution and be really careful handling concentrated peroxide... Like, no bs - that stuff (concentrated peroxide) if mishandled/misused will react violently, outgas pure o2 rapidly which is obviously a huge fire hazard and instantly chemical burn/bleach your skin.\n\nI use a spray of 15ml 3% h2o2 per 500ml water and spray as needed.  Water is pH'd appropriately, of course.\n\nEdit:  also, h2o2 is photosensitive and needs to be stored in a light-proof bottle.  Buy regular peroxide at the store, dump it out, rinse and mix/store your own diluted peroxide in that bottle.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Cooking",
    "post_id": "eplsk3",
    "title": "[Chefs / Food Chemists] What is in Just Egg that makes it fluffy?",
    "url": "https://www.reddit.com/r/Cooking/comments/eplsk3/chefs_food_chemists_what_is_in_just_egg_that/",
    "score": 5,
    "num_comments": 8,
    "created": "2020-01-16T16:40:56+00:00",
    "body": "Here are the ingredients for the [vegan fake egg product Just Egg](https://www.ju.st/en-us/stories/100-plant-based?gclid=CjwKCAiAsIDxBRAsEiwAV76N8xBhEdZ00pzP8PKtroqki7CX2MUZiUMcoFpHZhbjoljNvAgzpy0cRxoCx70QAvD_BwE)\n\n>Water, mung bean protein isolate, expeller-pressed canola oil, contains less than 2% of calcium citrate, enzyme, gellan gum, natural carrot extractives (color), natural flavors, natural turmeric extractives (color), onion puree, salt, soy lecithin, sugar, tetrasodium pyrophosphate, preservative (nisin, potassium sorbate).\n\nI have tried [replicating this recipe with whole mung beans](https://www.youtube.com/watch?v=ZhTbzzYGJV4) and the taste is spot on, but there is a fluffy/airy quality that the Just Egg product has that does not come through. The result of this particular recipe is almost like a bean-bun. \n\nAre some of the additive ingredients creating this reaction? \n\nIs it the difference between using protein isolate vs. whole beans? \n\nHow would you go about trying to add \"fluff\" to a recipe like this?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Racerx1967",
        "body": "Try adding baking powder.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "supersuperduper",
        "body": "In real eggs, it's the protein in the egg white that allows them to foam, so in the vegan product, it's probably the \"mung bean protein isolate\" doing that job. I think pea protein isolate is commercially available.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "getonmyhype",
        "body": "Air I'd imagine. A fluffier egg generally means whisking...",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ron_Textall",
        "body": "If you're looking for vegan egg alternatives you should check out Lauren Toyota's tofu scramble recipe. It's incredible.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "alanmagid",
        "body": "You can't replicate at home. The fluff is air, whipped in during production. Bean protein is what's left after starch and fat are removed. The many gums added trap the air. The alkali TSPP may be part of the trick.\n\nI avoid heavily processed foods. Poor value. So called health foods are at best unproven. Evolution favors natural foods.",
        "score": 0,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "uubls7",
    "title": "Does Garnier Nutrisse's 210 have any lightening ingredients?",
    "url": "https://www.reddit.com/r/HairDye/comments/uubls7/does_garnier_nutrisses_210_have_any_lightening/",
    "score": 3,
    "num_comments": 0,
    "created": "2022-05-21T00:27:23+00:00",
    "body": "Hi, i'm looking to dye my darkest brown/black hair with Garnier Nutrisse's 210 blue black. I **don't** want it bleaching my hair at all in a way that the colour fades to lighter than my natural hair. Can anyone who's used it or knows what they're looking at say if it will?\n\n1053057 – NOURISHING COLOUR CREAM / CRÈME COLORANTE NUTRITIVE : AQUA•CETEARYL ALCOHOL•PROPYLENE GLYCOL•DECETH-3 •LAURETH-12•AMMONIUM HYDROXIDE•OLETH-30•LAURIC ACID•HEXADIMETHRINE CHLORIDE•GLYCOL DISTEARATE•POLYQUATERNIUM-22•2,4- DIAMINOPHENOXYETHANOL HCl•ETHANOLAMINE•SILICA DIMETHYL SILYLATE•CI 77891•ASCORBIC ACID•SODIUM METABISULFITE•THIOGLYCERIN •TOLUENE-2,5-DIAMINE•DIMETHICONE•PENTASODIUM PENTETATE•N,N-BIS(2-HYDROXYETHYL)-p-PHENYLENEDIAMINE SULFATE•CARBOMER •RESORCINOL•VITIS VINIFERA SEED OIL•PARFUM. (FIL C26169/10) 178914U – CREAM DEVELOPER / RÉVÉLATEUR CRÈME : AQUA•HYDROGEN PEROXIDE•CETEARYL ALCOHOL•TRIDECETH-2 CARBOXAMIDE MEA•CETEARETH-25•GLYCERIN•PENTASODIUM PENTETATE•SODIUM STANNATE•TETRASODIUM PYROPHOSPHATE•PHOSPHORIC ACID. (FIL K56/35) 1051655F – RICH NOURISHING CONDITIONER CREAM / SOIN CRÈME RICHE NOURRISSANT : AQUA•CETEARYL ALCOHOL•BEHENTRIMONIUM CHLORIDE•PEG-180•CETYL ESTERS•NIACINAMIDE•RIBES NIGRUM OIL•SACCHARUM OFFICINARUM EXTRACT•HYDROXYETHYLCELLULOSE•OLEA EUROPAEA OIL•TRIDECETH-6•CHLORHEXIDINE DIHYDROCHLORIDE•CAMELLIA SINENSIS LEAF EXTRACT•BENZYL ALCOHOL•LINALOOL•AMODIMETHICONE•ISOPROPYL ALCOHOL•PYRUS MALUS EXTRACT•PYRIDOXINE HCl•PERSEA GRATISSIMA OIL•METHYLPARABEN•BUTYROSPERMUM PARKII BUTTER•CITRIC ACID• CETRIMONIUM CHLORIDE•BUTYLPHENYL METHYLPROPIONAL•CITRUS MEDICA LIMONUM PEEL EXTRACT•PARFUM. (FIL K161805/4)",
    "flair_text": ":txt: Question",
    "flair_template_id": "8e1f8a30-b3da-11e9-9adb-0efd305d1176",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "s5uu73",
    "title": "Methode Brigitte Kettner Foaming Cleansing Cream Dupe?",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/s5uu73/methode_brigitte_kettner_foaming_cleansing_cream/",
    "score": 3,
    "num_comments": 1,
    "created": "2022-01-17T04:24:14+00:00",
    "body": "The lady in the french pharmacy recommended getting the MBK Foaming Cleansing Cream to me many moons ago and I could see the improvement to my skin (combo-oily) after using it several times. \n\nUnfortunately, I’ve tried googling and searching the brand on reddit over the years and I surprisingly don’t see much information about it, much less reviews of the products, aside from what’s available on its website. (Also wondering if anyone is familiar with the brand?)\n\nI live in Asia so I need some help finding a dupe for their Foamy Cleansing Cream, since I highly doubt I can easily ship the actual product here. Anyway, here’s the ingredient list from the website:\nAQUA (WATER), COCO-GLUCOSIDE, ZINC COCETH SULFATE, XANTHAN GUM, PANTHENOL, LITHIUM MAGNESIUM SODIUM SILICATE (NANO), TITANIUM DIOXIDE, PARFUM (FRAGRANCE), SIMMONDSIA CHINENSIS (JOJOBA) SEED OIL, POTASSIUM SORBATE, LACTIC ACID, ETHYLHEXYLGLYCERIN, TETRASODIUM EDTA, TETRASODIUM PYROPHOSPHATE, CITRIC ACID",
    "flair_text": "Question",
    "flair_template_id": "83ee51da-fb91-11e6-bdf0-0e6edcf73938",
    "comments": [
      {
        "author": "InterTree391",
        "body": "PM ya",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "28n2bj",
    "title": "Questions re my clay mask & exfoliation",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/28n2bj/questions_re_my_clay_mask_exfoliation/",
    "score": 3,
    "num_comments": 1,
    "created": "2014-06-20T13:46:07+00:00",
    "body": "I am pretty new here and have browsed the guides/wiki and done searches, but can’t find answers to my specific questions so please bear with me.  \n\nI recently started using the [Innisfree Super Volcanic Pore Clay Mask]( http://global.innisfree.co.kr/global/en/eng_bestsellerView7.jsp?parm=8) and would love to keep it in my routine (1x per week).  I see that it has lactic acid listed as one of its many ingredients, but it does not seem to be a chemical exfoliant based on the knowledge I’ve gleamed from here so far (from its consistency; and also the box lacks info on percentages and pH).  Is this considered to be a physical exfoliant then?  \n\nIf so, I’d like to add a chemical exfoliant to my routine.  Would that be ok (not to rough on my skin)?  I just assume on the days I use the clay mask I should skip the chemical exfoliation step.  \n\nAny insight would be greatly appreciated, thanks!  And below is an ingredient list in case it helps.  \n\nInnisfree Super Volcanic Pore Clay Mask Ingredients:  \nWater, titanium dioxide, butylenes glycol, volcanic ash, glycerin, silica, trehalose, kaolin, bentonite, polyvinyl alcohol, caprylic/caprictriglyceride, zinc oxide (CI77947),glyceryl stearate, cetearyl alcohol, juglans regia (walnut) shell powder, camellia sinensis leaf extract, citrus unshiu peel extract, opuntia coccinellifera fruit extract, orchid extract, camellia japonica leaf extract, pvp, PEG-100 stearate, polysorbate 60, stearic acid, palmitic acid, hydrogenated vegetable oil, xanthan gum, iron oxides (CI 77499), zea mays (corn) starch, sorbitan stearate, polyacrylate-13, mannitol, microcrystalline cellulose, lactic acid, polyisobutene, menthoxyporopanediol, ethylhexylglycerin, tetrasodium pyrophosphate, polysorbate 20, iron oxies (CI 77491), disodium edta, phenoxyethanol",
    "flair_text": "Exfoliation",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Quolli",
        "body": "I'd say even if it were at the correct pH to exfoliate the lactic acid content is absolutely miniscule. Definitely get a chemical exfoliant if you want to exfoliate. And yes, it's a good idea to skip exfoliation of mask days.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dentistry",
    "post_id": "6p1uwt",
    "title": "Question about toothpaste ingredient",
    "url": "https://www.reddit.com/r/Dentistry/comments/6p1uwt/question_about_toothpaste_ingredient/",
    "score": 3,
    "num_comments": 3,
    "created": "2017-07-23T15:23:30+00:00",
    "body": "I was just curious.  I was looking at the back of the box of Colgate Enamel Health toothpaste.  \n\nIngredients: Potassium Nitrate, Sodium Fluoride, water, sorbitol, hydrated silica; glycerin, PEG-12, tetrasodium pyrophosphate, sodium lauryl sulfate, flavor, microcrystalline cellulose, zinc phosphate, cellulose gum, cocamidopropyl betaine, benzyl alcohol, sodium saccharin, xantham gum, mica, titanium dioxide, FD&C blue no. 1\n\n\nWhat is the purpose of the zinc phosphate?  I looked it up and it seems to be used for dental cement, but what does it do in toothpaste?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "happykitchen",
        "body": "Zinc helps protect your teeth from acid erosion! :)",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "foodscience",
    "post_id": "1fyn9bc",
    "title": "Sugar Free Pudding Mix?",
    "url": "https://www.reddit.com/r/foodscience/comments/1fyn9bc/sugar_free_pudding_mix/",
    "score": 2,
    "num_comments": 7,
    "created": "2024-10-08T00:34:56+00:00",
    "body": "Hi guys,\n\nI want to play around with a sugar-free pudding mix, similar to this one: [https://www.target.com/p/jell-o-instant-sugar-free-fat-free-chocolate-fudge-pudding-38-pie-filling-1-4oz/-/A-12985360](https://www.target.com/p/jell-o-instant-sugar-free-fat-free-chocolate-fudge-pudding-38-pie-filling-1-4oz/-/A-12985360)\n\n  \nBut I can't figure out what type of Modified Corn Starch they are using to achieve that texture. I recently played around with acetylated distarch adipate, but it didn't give me that same texture that the pudding mix has. It came out as more of a gel. \n\nAny suggestions on which MCS I should try out? I think that I need pre-gelatinised MCS, but I have no idea where to source something like that.\n\n  \nAlso, do we reckon that the Sodium Phosphate, Tetrasodium Pyrophosphate and Calcium Sulfate are necessary? I'd prefer to use the least amount of ingredients where possible, and/or \"cleaner label\" alternatives. I define clean label as being anything which looks more like a common ingredient.",
    "flair_text": "Research & Development",
    "flair_template_id": "3e4cd694-57ba-11ec-8a5b-b2cc7c226cb4",
    "comments": [
      {
        "author": "FoodWise-One",
        "body": "I sm always curious as to what \"playing around\" really means. Is this a corporate project or a hobby?The best source on clean label starches is Ingredion as someone already suggested.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "themodgepodge",
        "body": "Yes to pregelatinized.\n\nTSPP gels when combined with calcium, so that's also doing some thickening.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "ConstantPercentage86",
        "body": "There are 100s of different modified starches out there.  You might try contacting Ingredeon for specific recommendations.   Are you open to making a cook up style pudding?  If so, you could use a native starch for a cleaner label.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Levols",
        "body": "Contact me if you want consulting, I've reverse engineer those products in the past",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ChemicalEngineering",
    "post_id": "9qmzaj",
    "title": "What happens to deflocculant after molding?",
    "url": "https://www.reddit.com/r/ChemicalEngineering/comments/9qmzaj/what_happens_to_deflocculant_after_molding/",
    "score": 2,
    "num_comments": 0,
    "created": "2018-10-23T08:29:40+00:00",
    "body": "I am making a project in which we mold alumina crucibles. I read that you need to add a deflocculant, but I wonder how it affect the composition. Is there a way to remove the deflocculant (in this case tetrasodium pyrophosphate)?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dentistry",
    "post_id": "4s54b5",
    "title": "Can anyone please tell me what ingredient in my new toothpastes and mouthwash is causing the dreadful stains on my teeth?",
    "url": "https://www.reddit.com/r/Dentistry/comments/4s54b5/can_anyone_please_tell_me_what_ingredient_in_my/",
    "score": 2,
    "num_comments": 5,
    "created": "2016-07-10T11:20:58+00:00",
    "body": "I suddenly have suuuuuper dark stains between all of my top front teeth only two months after having them professionally cleaned. The hygienist I saw at the time recommended that I switch to sensitive toothpaste for the root sensitivity I'm experiencing from a couple of spots of recession.\n\n\nHere are all of the toothpastes I've been using since that appointment:\n\n\n* **Colgate sensitive pro relief repair and prevent toothpaste** (I have used this the most by far)\n\nActive Ingredient: Arginine 8%\nOther Ingredients: Calcium Carbonate, Aqua, Sorbitol, Aroma, Poloxamer 407, Sodium Monofluorophosphate (1450 ppm F¯), Cocamidopropyl Betaine, Zinc Oxide, Benzyl Alcohol, Cellulose Gum, Zinc Citrate, Sodium Bicarbonate, Tetrasodium Pyrophosphate, Xanthan Gum, Sodium Saccharin, Sucralose, Limonene, CI 77891)\n\n* **Sensodyne pronamel toothpaste**\n\nAqua, Sorbitol, Hydrated Silica, Glycerin, Potassium Nitrate, PEG-6, Cocamidopropyl Betaine roma, Xanthan Gum, Sodium Saccharin, Sodium Fluoride, Titanium Dioxide, Sodium Hydroxide, Limonene, Anise Alcohol, Contains Sodium Fluoride (1450 ppm Fluoride), Potassium Nitrate 5% w/w\n\n* **Colgate sensitive pro relief mouthwash** (I only used this very briefly as a post-lunch mouthwash intermittently in May and early June)\n\nActive Ingredients: Arginine 0.8%\nOther Ingredients: Aqua, Glycerin, Sorbitol, Propylene Glycol, Tetrapotassium Pyrophosphate, PEG-40 Hydrogenated Castor Oil, PVM/MA Copolymer, Polysorbate 20, Tetrasodium Pyrophosphate, Aroma, Benzyl Alcohol, Sodium Fluoride (225 ppm F¯), Menthol, Sodium Saccharin, Citric Acid, Methylisothiazolinone, CI 42051, CI 17200\n\n* **Sensodyne repair and protect toothpaste** (I only used this a handful of times in May through to early June)\n\nGlycerin, PEG-8, Silica, Calcium Sodium Phosphosilicate (Novamin), Sodium Lauryl Sulfate, Sodium Monofluorophosphate, Aroma, Titanium Dioxide, Carbomer, Potassium Acesulfame, Limonene, Contains Sodium Monofluorophosphate 1.08% w/w (1450 ppm Fluoride)\n\n\nI'm going to make an appointment with my dentist to see if they will remove the stains for me. However, I want to make sure that I cut out whatever is causing these stains to develop before it can happen again.\n\nDo I need to go back to using an electric toothbrush? I've been using a manual one twice daily for a long while and flossing every single night.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Mentioned_Videos",
        "body": "Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r4s54b5?feature=playlist)\n\n\tVIDEO|COMMENT\n\t-|-\n[How To Brush Your Teeth with an Electric Toothbrush  Oral-B](https://youtube.com/watch?v=HkdgyXHEboE)|[1](https://reddit.com/r/Dentistry/comments/4s54b5/_/d572omn?context=10#d572omn) - That's precisely why I personally don't use an Oral B, but if that's what you have make sure you use the sensitive gum care brush heads and follow this video. Also, hold the brush with your fingertips as opposed to your fist. You're less likely to us...\n[How to brush with Philips Sonicare DiamondClean](https://youtube.com/watch?v=gjoR91BmJJQ)|[1](https://reddit.com/r/Dentistry/comments/4s54b5/_/d56ty6b?context=10#d56ty6b) - It's hard to say definitively what caused it, but I doubt using the mouthwash just once had any effect. It'll take some trial and error to figure it out. After you get your teeth cleaned again, stick to one toothpaste (obviously without cpc) and try ...\n[Triple Clean Floss Picks by DenTek](https://youtube.com/watch?v=H9GCF0Ad5bk)|[1](https://reddit.com/r/Dentistry/comments/4s54b5/_/d56ry4g?context=10#d56ry4g) - As far as I know cetylpyridinium chloride is the only OTC ingredient that causes staining, but I just scanned your list and didn't see it. Have you been drinking tea (black or green), wine, coffee, or smoking lately?   I always recommend electric too...\nI'm a bot working hard to help Redditors find related videos to watch.\n***\n[Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get it on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "askdentists",
    "post_id": "nrqhoy",
    "title": "Is it safe to put toothpaste (specifically Arm & Hammer) on my tonsils?",
    "url": "https://www.reddit.com/r/askdentists/comments/nrqhoy/is_it_safe_to_put_toothpaste_specifically_arm/",
    "score": 2,
    "num_comments": 2,
    "created": "2021-06-03T23:00:09+00:00",
    "body": "I'm 25 and all of my life, I have had enormous tonsils that can get very swollen, even when I'm not sick. And despite good dental hygiene, I'm very prone to tonsil stones. My dentist keeps recommending that I get them removed, but I'm quite nervous about actually going through with the surgery.\n\nOne day when my tonsils were especially swollen, I randomly decided to put a small amount of Arm & Hammer Advanced White toothpaste on my tonsils. Surprisingly, it resulted in immediate relief. My tonsils shrunk, stones came out, and even my ears, face, and lymph nodes seemed to drain / get less swollen. Literally felt like such a big break through.\n\nBut google hasn't really provided any answers as to whether this is actually safe to do. I know fluoride can be bad, but I don't actually swallow the toothpaste... The ingredients in my toothpaste are: \n\n* Active: Sodium Fluoride (0.24%). \n* Inactive: Sodium Bicarbonate (Baking Soda), PEG - 8, PEG/PPG - 116/66 Copolymer, Sodium Carbonate Peroxide, Tetrasodium Pyrophosphate, Silica, Sodium Saccharin, Flavor, Water, Sodium Lauryl Sulfate, Sodium Lauroyl Sarcosinate.\n\nSo, is this something that is safe to do, either regularly or semi-regularly? If not, are there any safe alternatives that would have the same effect?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for seeking advice from r/askdentists. **Please note that a response does not constitute a doctor-patient relationship.** While this is a place for advice, replies may not be medically accurate. Do not assume that what others on here say is correct in any way. Reddit is not a replacement for an in-person dental professional. \n\n  **Please abide by the following rules in order to get an accurate answer to your question:**\n      (1) Ensure you include a title of your dental problem.\n      (2) Include whether you drink, smoke or if you have any medical conditions relevant to your main concern.\n      (3) Include a photograph if the question relates to something you can see in your mouth, include x-rays if you have them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askdentists) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Onearmssss",
        "body": "NAD and have no answers besides that you shouldn't be swallowing toothpaste and I can only assume you're ingesting more than you would while brushing. \n\nI had horribly swollen tonsils for a good chunk of my life. Id get them removed if I were you, the relief you described is what you'd feel all the time since they would probably take your adenoids as well. I won't lie to you, it's not an easy recovery but I'd do it again if I had to.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskCulinary",
    "post_id": "uzabaw",
    "title": "How do i make homemade marshmellows toasted like store bought ones",
    "url": "https://www.reddit.com/r/AskCulinary/comments/uzabaw/how_do_i_make_homemade_marshmellows_toasted_like/",
    "score": 3,
    "num_comments": 5,
    "created": "2022-05-27T23:10:07+00:00",
    "body": "i've made a batch of marshmellow and they don't melt properly\n\nthey melt too fast and dont brown like the store bought ones\n\n[https://thumbs.dreamstime.com/b/toasted-marshmallows-12732502.jpg](https://thumbs.dreamstime.com/b/toasted-marshmallows-12732502.jpg)\n\nthe store bought ones melt like this and they soft and hard dont melt easily\n\nlike real toasted marshmellows\n\ni followed this recipe\n\n[https://www.youtube.com/watch?v=I1tZ35pzhfw](https://www.youtube.com/watch?v=I1tZ35pzhfw)\n\nit was hard and squishy like the store bought\n\nbut they burn too fast and dont evenly brown like the store ones\n\n[https://i.pinimg.com/736x/62/5b/3d/625b3d5945ae845a09abbe2c33c7aca5--vegan-marshmallows-homemade-marshmallows.jpg](https://i.pinimg.com/736x/62/5b/3d/625b3d5945ae845a09abbe2c33c7aca5--vegan-marshmallows-homemade-marshmallows.jpg)\n\nit burned like this but faster and it melts as well like gooey liquid leaking out\n\nhow do i replicated the store bought ones?\n\nthe store bought ingredients: **Glucose Syrup, Refined Sugar, Water, Gelatin (Beef), Sorbitol, Modified Cornstarch, Stabiliser: (Tetrasodium Pyrophosphate E450), Artificial Food Flavour: (Ethyl Vanillin)**",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "aspiring_outlaw",
        "body": "The recipe you linked isn't a great one. For starters, you should have glucose, corn syrup, honey, and/or invert sugar in your recipe for stability. The gelatin should not be boiled (this weakens the gelatin). And while you can make cooked confections without a thermometer, it's much less accurate for beginners. The consistency of the finished marshmallow is much too thin which is going to give you a denser finished product.\n\nTry a different recipe - you can absolutely toast homemade marshmallows.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "9317fs",
    "title": "How to dissolve a peel-off mask?",
    "url": "https://www.reddit.com/r/chemistry/comments/9317fs/how_to_dissolve_a_peeloff_mask/",
    "score": 2,
    "num_comments": 4,
    "created": "2018-07-30T04:56:48+00:00",
    "body": "My wife used a peel-off mask made of:  \n\nSOLUM DIATOMEAE, ALGIN, CALCIUM SULFATE, TETRASODIUM PYROPHOSPHATE, MALTODEXTRIN, AUTERPE OLERACEA, RIBES NIGRUM CALLUS POWDER, MORUS ALBA FRUIT POWDER, VACCINIUM MYRTILLUS FRUIT EXTRACT, PARFUM, CITRIC ACID, CD 77491  \n\nAnd it clogged our drain. Conventional methods give no results.\n\nWhat would dissolve all or some of these ingedients?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "CausinACommotion",
        "body": "The calcium and the alginate in the mask forms a gel. To break this gel you a chelator, something like sodium EDTA or oxalis acid. Try looking for shower cleaning agent which would contain either of these. (Chelators are used to aid in the break up of soap residues found in the showers.)\n\nThe mask also contains clay. Which you can’t dissolve at home safely. Therefore,  I fear you need to use some wire tool and manually break down the clog..",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Sweetpar",
        "body": "So drain o didn't work? I am not going to recommend a strong acid but maybe really hot water and the plunger would help. I'm guessing you will need to repeat steps if first attempt dosen't work.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "askdentists",
    "post_id": "txs2j3",
    "title": "Toothpaste Selection",
    "url": "https://www.reddit.com/r/askdentists/comments/txs2j3/toothpaste_selection/",
    "score": 1,
    "num_comments": 1,
    "created": "2022-04-06T17:56:47+00:00",
    "body": "Hi,\n\nI'm about to need new toothpaste and there are a few options on sale at Sam's Club right now.\n\nI am currently using Colgate Total SF. Sam's has this on sale for $11.98USD for 5 6oz tubes ($.40 per oz).\n\nThey also have 'Colgate Cavity Protection\" for $5.98USD for 5 oz tubes ($.15 per oz.)\n\n( Active Ingredient: Sodium Monofluorophosphate (0.76% (0.15% with Fluoride Ion)). Purpose: Anticavity.\n\nInactive Ingredients: Dicalcium Phosphate Dihydrate, Water, Glycerin, Sodium Lauryl Sulfate, Cellulose Gum, Flavor, Tetrasodium Pyrophosphate, Sodium Saccharin.)\n\nIs the Colgate Total SF worth \\~3 times the price, or should I just stick to basic toothpaste? I am 26 and don't have any dental issues. I have also seen where some people say that the SF causes long term issues with gum health -- is this still an issue?\n\n&#x200B;\n\nTIA",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for seeking advice from r/askdentists. **Please note that a response does not constitute a doctor-patient relationship.** While this is a place for advice, replies may not be medically accurate. Do not assume that what others on here say is correct in any way. Reddit is not a replacement for an in-person dental professional. \n\n  **Please abide by the following rules in order to get an accurate answer to your question:**\n      (1) Ensure you include a title of your dental problem.\n      (2) Include whether you drink, smoke or if you have any medical conditions relevant to your main concern.\n      (3) Include a photograph if the question relates to something you can see in your mouth, include x-rays if you have them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askdentists) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "15yh7cj",
    "title": "Dental care on an elimination diet",
    "url": "https://www.reddit.com/r/AskVet/comments/15yh7cj/dental_care_on_an_elimination_diet/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-08-22T20:15:18+00:00",
    "body": "My 40lb 2-year-old spayed poodle mix with chronic ear infections and itching for the past year has been started on a hydrolyzed protein diet. What can I do for dental care? I've been brushing her teeth with nothing currently, but since she has to be on it for a while, I didn't know if it would be better for her to have some kind of chews or toothpaste.\n\nI was doing purina dental life chews but those contain chicken. I also have a water mix-in and a toothpaste. \n\nThe water mix-in is tropiclean fresh breath dental health solution for dogs. The ingredients list on amazon is: Water, Glycerin, Sodium Benzoate, Citric Acid, Cetylpyridinium Chloride, Zinc Gluconate, Green Tea Leaf Extract.\n\nHer toothpaste is well and good tartar control toothpaste and contains: Sorbitol, Water, Hydrated Silica, Polysorbate 20, Tetrasodium Pyrophosphate, Cellulose Gum, Sodium Chloride, Flavor, Sodium Bicarbonate, Perlite, Zinc Gluconate, Calcium Carbonate, Tocopheryl Acetate, Proteases, Glucose Oxidase, Chlorophyllin.\n\nI'm fine with just buying new stuff, too.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. Please also check [the FAQ](https://www.reddit.com/r/AskVet/wiki/index) to see whether your question is answered there.\n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "acne",
    "post_id": "96w4el",
    "title": "They say if its the worst it will only get better?",
    "url": "https://www.reddit.com/r/acne/comments/96w4el/they_say_if_its_the_worst_it_will_only_get_better/",
    "score": 1,
    "num_comments": 3,
    "created": "2018-08-13T06:49:25+00:00",
    "body": "LOL fuck this acne\n\n[https://ibb.co/jQJAi9](https://ibb.co/jQJAi9)\n\nOOF MY SKIN LITERALLY GOT WORSE IN 14 DAYS OF USING GLYCOLIC ACID. My forehead now gets acne like jesus i should have knooown. Also 2 big acne sprout up because of using a wrong toner ARGHH i accidentally used moms toner which awas for anti aging and probably clog it hard :((((.\n\nalso my forehead had like closed comedones and pretty much became acne beacuse of this glycolic acid\n\nRoutine\n\nAM\n\nCosxr Salicylic Acid CLeanser\n\nSpot Treat\n\nMoisturize\n\nPM\n\nCosxr Salicylic acid cleanser\n\nTO glycolic acid toning sol. (Removed since i think this one cause acne?)\n\nSpot treat\n\nMoisturize \n\nalso i added a face mask AC CLEAN UP PINK POWDER ( Ing is this  Water, Kaolin, Propanediol, Zinc Oxide (Ci 77947), Glycerin, Chamaecyparis Obtusa Water, Caprylic/Capric Triglyceride, Cetearyl Alcohol, Glyceryl Stearate, Polyvinyl Alcohol, Stearic Acid, Polysorbate 60, Palmitic Acid, Salicylic Acid, Madecassoside, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Chamaecyparis Obtusa Leaf Extract, Ampelopsis Japonica Root Extract, Allium Cepa (Onion) Bulb Extract, Allium Sativum (Garlic) Bulb Extract, Carica, Papaya (Papaya) Fruit Extract, Glycoproteins, Colloidal Sulfur, Iron Oxides (Ci 77491), Glyceryl Caprylate, Lactose, Lactic Acid, Iron Oxides (Ci 77492), Microcrystalline Cellulose, Butylene Glycol, Sorbitan Stearate, Sucrose, Silica, Zea, Mays (Corn) Starch, Xanthan Gum, Tetrasodium Pyrophosphate, Tocopheryl Acetate, Titanium Dioxide (Ci 77891), Peg-100, Stearate, Hydrogenated Vegetable Oil, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Disodium, Edta, Phenoxyethanol, Fragrance \n\nNot sure if it also made my acne worse because i i recently added it) once a week",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Tachikokoma",
        "body": "i heard glycolic acid makes skin purge sometimes, maybe try to stop using it and see if your skin improves? and are you breaking out in new places or in areas where you are already breakout prone?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "beeswasps",
        "body": "What are you using to spot treat? And I would ditch the mask. \n\nHave you tried using more hydrating products? Hydrating cleanser instead of the salicylic cleanser? Have you tried cleansing once a day instead of twice?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "bladetrilogy66669",
        "body": "The cosrx salicylic acid cleanser broke me out and made my acne way worse! Idk if its like that for everyone tho 😥",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "askdentists",
    "post_id": "180wvvt",
    "title": "Is Colgate Optic White O2 Enamel-Safe?",
    "url": "https://www.reddit.com/r/askdentists/comments/180wvvt/is_colgate_optic_white_o2_enamelsafe/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-11-22T01:04:29+00:00",
    "body": "Here's the ingredient list:\n\nPoloxamer 105, Calcium Pyrophosphate, PEG-12, PEG/PPG-116/66 Copolymer, PVP, Silica, Tetrasodium Pyrophosphate, Flavor (Aromatic menthol), Potassium Caroate, Sodium Lauryl Sulfate, Disodium Pyrophosphate, Sodium Monofluorophosphate, Sodium Saccharin, Cocamidopropyl Betaine, Sucralose, BHT\n\nAny insight is appreciated!",
    "flair_text": "question",
    "flair_template_id": "c3d8dade-6656-11eb-a8c6-0eee40bcb183",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for seeking advice from r/askdentists. **Please note that a response does not constitute a doctor-patient relationship.** While this is a place for advice, replies may not be medically accurate. Do not assume that what others on here say is correct in any way. Reddit is not a replacement for an in-person dental professional. Verified professionals will have flair assigned to them.\n\n  **Please abide by the following rules in order to get an accurate answer to your question:**\n      (1) Ensure you include a title of your dental problem.\n      (2) Include whether you drink, smoke or if you have any medical conditions relevant to your main concern.\n      (3) Include a photograph if the question relates to something you can see in your mouth, include x-rays if you have them.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/askdentists) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "1ki9n6v",
    "title": "Is this safe for a cat?",
    "url": "https://www.reddit.com/r/AskVet/comments/1ki9n6v/is_this_safe_for_a_cat/",
    "score": 1,
    "num_comments": 3,
    "created": "2025-05-09T04:07:37+00:00",
    "body": "Is this toothpaste for dogs okay for a cat?\n\nIt is Arm & Hammer tartar control. Its ingredients are sorbitol, water, hydrated silica, calcium carbonate, polysorbate 20, tetrasodium pyrophosphate, cellulose gum, sodium chloride, flavor, sodium bicarbonate, zinc gluconate, proteases, and thymol. \n\nThank you in advance for your help!! ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. Please also check [the FAQ](https://www.reddit.com/r/AskVet/wiki/index) to see whether your question is answered there.\n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi, it looks like you did not include the information we require in the side bar. Having this information is very important for us to be able to give accurate advice. **Please copy the points below and edit your post to include the answers**:\n\n* Species:\n* Age:\n* Sex/Neuter status:\n* Breed:\n* Body weight:\n* History:\n* Clinical signs:\n* Duration:\n* Your general location:\n* Links to any test results, X-rays, vet reports etc. that you have:\n\nIf your post already includes this information please disregard this message.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_jblakesmithlittle1",
    "post_id": "zgrg99",
    "title": "Nine High Sodium Foods And What To Eat Instead",
    "url": "https://www.reddit.com/r/u_jblakesmithlittle1/comments/zgrg99/nine_high_sodium_foods_and_what_to_eat_instead/",
    "score": 1,
    "num_comments": 0,
    "created": "2022-12-09T08:34:41+00:00",
    "body": " \n\nHow much quantity of high-sodium foods do we have to take in our daily routine? It estimates that at least half of hypertensive patients have blood pressure affected by salt intake. In other words, they are sensitive to salt. In addition, the risk of salt sensitivity increases with age by [**J**. **Blake** ](https://jblakesmithlittlerockarkansas.com/doctor/assist-me-in-managing-my-diabetes/)[**Smith Little Rock Arkansas**](https://jblakesmithlittlerockarkansas.com/doctor/assist-me-in-managing-my-diabetes/). \n\nThe Reference Daily Intake (RDI) for sodium is 2,300 mg or one teaspoon of salt.\n\nStill, the average daily sodium intake in the United States is 3,400mg, well above the recommended upper limit. That is primarily due to processed foods and restaurant foods rather than the overuse of salt shakers. \n\nSodium is added to foods for flavor and as part of some food preservatives and additives. \n\nAccording to[ **J.Blake Smith Little Rock Arkansas**](https://www.healthline.com/nutrition/foods-high-in-sodium), nine foods are high in sodium and what to eat instead.\n\n## 1. Shrimp\n\nPackaged plain frozen shrimp are commonly salted for flavor and are a high-sodium preservative. For example, sodium tripolyphosphate is frequently added to minimize water loss during thawing.\n\nThree ounces (85 grams) of unbreaded frozen shrimp can contain up to 800 mg of sodium, equivalent to 35% of the RDI. Breaded and fried shrimp are similarly salty.\n\nIn contrast, 85 grams of freshly caught shrimp with no salt or additives contains just 101 mg of sodium or 4% of the RDI.\n\nChoose freshly caught shrimp if possible, or look for additive-free frozen shrimp at your health food store. \n\n## 2. Soup\n\nCanned, packaged, and restaurant-made soups are often high in sodium, but you can find reduced-sodium options in some canned varieties.\n\nSodium comes primarily from salt, but some soups contain sodium-rich flavor additives such as monosodium glutamate (MSG).\n\nOn average, canned soups contain 700 mg of sodium per 1 cup (245 g) serving or 30% of the RDI. \n\n## 3. Ham\n\nHam is high in sodium because salt is helpful to salt meat. An 85-gram serving of cooked ham contains an average of 1,117 mg sodium or 48% of the RDI.\n\nThere is no indication of food companies restricting the salting of this popular meat. In a recent national sample of U.S. food, researchers found that ham contained 14 percent more sodium than in previous analysis.\n\nConsider using ham in small portions as an occasional seasoning rather than eating it whole.\n\n## 4. Instant Pudding\n\nPuddings are not salty, but instant pudding mixes have a lot of salt.\n\nThis sodium comes from salt and sodium-containing additives (disodium phosphate and tetrasodium pyrophosphate) and thickens instant puddings.\n\nA 25-gram instant custard mix (used for a 1/2 cup serving) contains 350 mg of sodium or 15% of the RDI.\n\nIn contrast, the same regular custard mix has only 135 mg sodium, which is only 6% of the RDI. \n\n##  5. Cottage Cheese\n\nCottage cheese is a good source of calcium and protein but is also relatively high in sodium.  1/2 cup (113 grams) of cottage cheese contains an average of 350 mg of sodium, or 15% of the RDI.\n\nThe salt in cottage cheese not only adds flavor but also adds texture and acts as a preservative. Therefore, low-sodium versions are typically not found. However, one study found that rinsing cottage cheese under running water for 3 minutes and draining it reduced sodium levels by 63%\n\n## 6. Vegetable Juice\n\nDrinking vegetable juice is easy to get your veggies in, but you need to read the nutrition label to avoid consuming too much salt.\n\nEight ounces (240 mL) of vegetable juice could contain 405 mg sodium or 17% of the RDI.\n\nLuckily, some brands offer low-sodium versions. That means you cannot consume more than 140 mg of sodium per serving per FDA regulations.\n\n## 7. Salad Dressing\n\nSome of the sodium in salad dressings comes from salt. In addition, some brands are adding sodium-based flavor additives, such as MSG and its cousins, disodium inosinate and disodium guanylate.\n\nIn a review of significant food brands sold in U.S. stores, salad dressings contained an average of 304 mg sodium per 2 tablespoons (28 g) serving, or 13% of the RDI ( 9 reliable sources).\n\nHowever, sodium ranged from 10 to 620 mg per serving in the salad dressing samples. So if you shop carefully, you can find one with less sodium. An even better option is to create your own. Try extra virgin olive oil and vinegar.\n\n## 8. Pizza\n\nNearly half of Americans’ sodium intake comes from pizza and other food-based meals.\n\nMany ingredients, such as cheeses, sauces, batters, and processed meats, contain large amounts of sodium that quickly add up when combined. A large 140-gram slice of store-bought frozen pizza includes an average of 765 mg sodium or 33% of the RDI. A similarly sized restaurant-cooked portion contains even more sodium – an average of 957 mg, or 41% of the RDI.\n\nEating multiple slices will give you a quick sodium boost. Instead, limit yourself to one piece and supplement your diet with low-sodium foods such as B. Green leafy salad with low-salt dressing.\n\n## 9. Sandwich\n\nSandwiches are another multi-ingredient dish that accounts for nearly half of Americans’ sodium.\n\nThe bread, processed meats, cheeses, and condiments commonly used to make sandwiches contribute significant amounts of sodium \n\nFor example, a 6-inch Cold Cut Submarine Sandwich contains an average of 1,127 mg sodium, or 49% of the RDI. \n\nYou can significantly reduce sodium by choosing raw sandwich toppings, such as grilled chicken breast with sliced avocado and tomato.\n\n[ ](https://preview.redd.it/8nalhck83u4a1.jpg?width=1140&format=pjpg&auto=webp&s=ace12f84ad56670561c9fe015494a11f640374da)\n\n\\#BlakeSmithLittleRockArkansas#JBlakeSmithLittleRockArkansas #JBlakeSmith #JBlakeSmithArkansas #BlakeSmithArkansas #JosephBlakeSmith #JosephBlakeSmithLittleRockArkansas #JosephBlakeSmithArkansas #JosephBlakeSmithLittleRock #josephblakesmithlittlerockAR #josephblakesmithAR #blakesmithAR  #JBlakeSmithLittleRockArkansas",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "mffn1i",
    "title": "Tetrasodium cleaning agents",
    "url": "https://www.reddit.com/r/chemistry/comments/mffn1i/tetrasodium_cleaning_agents/",
    "score": 1,
    "num_comments": 4,
    "created": "2021-03-29T02:19:49+00:00",
    "body": "Looking at the MSDS of a cleaner I have in the shop and I noted that it contains EDTA tetra sodium salt. I use TSP ( Tetrasodium pyrophosphate ) often for prep work before painting. Is this a similar substance? I am obviously not very astute with chemistry so I thought I would ask, is this consumer cleaning product just a very diluted perfumed jug of TSP?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "pussYd3sTr0y3r69_420",
        "body": "the sodium is a counter ion. it’s actually the least interesting part of both molecules. edta and pyrophosphate are different chemically and likely perform differing functions in both cases. you wouldn’t compare sodium chloride to either of these right?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Mr_Chemical_Chaos",
        "body": "EDTA is a strong metal chelating agent, meaning it forms complexes with metals so they are more easily removed. In cleaning agents this is useful for removing build ups of minerals such as calcium and magnesium. \n\nLooking at the TSP molecule, it will have a similar effect of removing metals like that but it is a different mechanism, without getting into detail.\n\nThink of EDTA being like a claw that will grab metal ions and TSP being like a magnet for the ions to stick to the outside of it in a very crude explanation. They ultimately  have similar effects, either should work fine.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "1bf6fw9",
    "title": "Can aq tetrasodium pyrophosphate dissolve rust? Can it dissolve metal?",
    "url": "https://www.reddit.com/r/chemistry/comments/1bf6fw9/can_aq_tetrasodium_pyrophosphate_dissolve_rust/",
    "score": 1,
    "num_comments": 3,
    "created": "2024-03-15T05:18:36+00:00",
    "body": "",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Doug_Nightmare",
        "body": "no",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "ChemicalInsightReport",
    "post_id": "dvqhc7",
    "title": "Tetrasodium Pyrophosphate (TSPP) Market Size and Growth Factors Research and Projection to 2024",
    "url": "https://www.reddit.com/r/ChemicalInsightReport/comments/dvqhc7/tetrasodium_pyrophosphate_tspp_market_size_and/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-13T11:32:31+00:00",
    "body": " \n\n&#x200B;\n\n**Tetrasodium Pyrophosphate (TSPP) Market**  \n\n\nThe latest market report by Acquire Market Research with the title **‘**Global [**Tetrasodium Pyrophosphate (TSPP) Market**](https://www.acquiremarketresearch.com/industry-reports/tetrasodium-pyrophosphate-tspp-market/116100/) size and **CAGR between 2019 and 2024.'** The new report on the worldwide Tetrasodium Pyrophosphate (TSPP) market is committed to fulfilling the necessities of the clients by giving them thorough insights into the market. Exclusive information offered in this report is collected by analysis and trade consultants. The reports provide Insightful information to the clients enhancing their basic leadership capacity identified. The various providers involved in the value chain of the product include **manufacturers, suppliers, distributors, intermediaries, and customers.**  \n\n\nSWOT analysis and Porter’s Five Forces analysis gives a **deep explanation of the strengths and weaknesses** of the global Tetrasodium Pyrophosphate (TSPP) market and different players operating therein. The authors of the report have also provided qualitative and quantitative analyses of several microeconomic and macroeconomic factors impacting the global Tetrasodium Pyrophosphate (TSPP) market. In addition, the research study helps to understand the changes in the **industry supply chain, manufacturing process and cost, sales scenarios, and dynamics of the global Tetrasodium Pyrophosphate (TSPP) market.**  \n\n\n**Have Questions? Request a sample or make an Inquiry before buying this report by clicking the link below @** [**https://www.acquiremarketresearch.com/sample-request/116100/**](https://www.acquiremarketresearch.com/sample-request/116100/)   \n\n\n**Based on products type, the report describes major products type share of regional market. Products mentioned as follows:**  Industrial Grade, Food Grade, Others  \n\n\n**Leading vendors in the market are included based on profile, business performance etc. Vendors mentioned as follows:**  Aditya Birla Chemicals, Innophos, Sovika Group, BANGYE Inc, Sundia, Chengdu Talent Chemical Co., Yunnan BK Giulini Tianchuang Phosphate Co., Hubei Xingfa Chemicals Group, Jiangsu Sunrise Biotech  \n\n\n**Based on Application, the report describes major application share of regional market. Application mentioned as follows:**  Food Additives, Electroplating Industry, Detergent Builder, Bleaching, Toothpaste Additive, Others   \n\n\n  \n\n\n[ Tetrasodium Pyrophosphate \\(TSPP\\) Market ](https://preview.redd.it/ai9r28c9wfy31.jpg?width=700&format=pjpg&auto=webp&s=0359a047d7465043572b5473acf21636ea82d36d)\n\n**To get this report at a profitable rate @** [**https://www.acquiremarketresearch.com/discount-request/116100/**](https://www.acquiremarketresearch.com/discount-request/116100/)   \n\n\n**Research Methodology**  \nThe research report provides trustworthy primary and secondary research. It also relies on the latest research techniques to prepare highly detailed and accurate research studies such as this Tetrasodium Pyrophosphate (TSPP) Market. It uses data triangulation, top-down and bottom-up approaches, and advanced Tetrasodium Pyrophosphate (TSPP) Market research processes to come out with comprehensive and industry-best market research reports.  \n\n\n**Regions Covered in the Global Tetrasodium Pyrophosphate (TSPP) Market:**  \nThe Middle East and Africa (GCC Countries and Egypt)  \nNorth America (the United States, Mexico, and Canada)  \nSouth America (Brazil etc.)  \nEurope (Turkey, Germany, Russia UK, Italy, France, etc.)  \nAsia-Pacific (Vietnam, China, Malaysia, Japan, Philippines, Korea, Thailand, India, Indonesia, and Australia)  \n\n\n**Market Penetration:** Comprehensive information on different types of Tetrasodium Pyrophosphate (TSPP) markets offered by the top players operating in the market.  \n\n\n**Product Development/Innovation:** Detailed insights on the upcoming technologies, R&D activities, and new product launches in the market.  \n\n\n**Market Development:** Comprehensive information about emerging markets as the report analyzes the markets for the across varied regions.  \n\n\n**Market Diversification:** Exhaustive information about new products, untapped geographies, recent developments, and investments in the Tetrasodium Pyrophosphate (TSPP) market.  \n\n\n**Competitive Assessment:** In-depth assessment of the market shares, strategies, products, and manufacturing capabilities of the leading players operating in the market.  \n\n\n**Read Full Report of a Tetrasodium Pyrophosphate (TSPP) with TOC, figures, and data tables @** [**https://www.acquiremarketresearch.com/industry-reports/tetrasodium-pyrophosphate-tspp-market/116100/** ](https://www.acquiremarketresearch.com/industry-reports/tetrasodium-pyrophosphate-tspp-market/116100/)   \n\n\n**Key Questions Answered**   \nWhat will be the size and CAGR of the global Tetrasodium Pyrophosphate (TSPP) market in the next five years?  \nWhich segment will take the lead in the global market?  \nWhat does the average manufacturing cost?  \nWhat are the key business tactics adopted by top players of the global Tetrasodium Pyrophosphate (TSPP) market?  \nWhich region will secure a lion’s share of the global market?  \nWhich company will show dominance in the global Tetrasodium Pyrophosphate (TSPP) market?  \n\n\n**The report provides insights on the following pointers:**  \nFurther, the Tetrasodium Pyrophosphate (TSPP) industry research report determines the Marketing Analysis, Regional Market Analysis, International Trade Analysis. The market Traders or Distributors with Contact Information by Region and Supply Chain Analysis. That is followed by various business strategies, the report contains essential outcome help could boost the interest level of the individuals in the market.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Dentistry",
    "post_id": "5h1155",
    "title": "Which toothpaste should I use?",
    "url": "https://www.reddit.com/r/Dentistry/comments/5h1155/which_toothpaste_should_i_use/",
    "score": 1,
    "num_comments": 1,
    "created": "2016-12-07T17:00:30+00:00",
    "body": "Let's assume some days I eat only raw fruits and vegetables, and other days I indulge in sugary treats.  Should I use different toothpastes on those days?  \n\nI want something minimally abrasive because I tend to brush too long.   \n\nAvoid SLS, triclosan, glycerin, yes?  Xylitol, tetrasodium pyrophosphate, sodium carbonate peroxide, good?  Hippy, natural kinds with fluoride good?  Arm & Hammer brands good?\n\nAlso I'm using MI paste as my toothpaste right now because this Hello toothpaste I have feels super abrasive, astringent, or something.  \n\nThanks in advance, this sometimes causes me a lot of anxiety.  ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "hygenius",
        "body": "All you need is a toothpaste with flouride, the rest is bells and whistles. Brush twice a day for two minutes each time and floss your teeth and you'll be fine. (I use Arm and Hammer because I like the way it tastes.)",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "l8phlh",
    "title": "Lupus, prednisone, fur loss",
    "url": "https://www.reddit.com/r/AskVet/comments/l8phlh/lupus_prednisone_fur_loss/",
    "score": 1,
    "num_comments": 5,
    "created": "2021-01-30T16:38:46+00:00",
    "body": "Good morning,\n\nIt’s Saturday and due to Covid our vet has discontinued weekend hours so I thought I would reach out here.\n\nInformation:\n6 year old female mixed breed dog (the rescue called her a “hound mix”).  Location is northern New England, US. \n\nHistory: \nFor about 3 years she’s gotten “cuts” on her nose that always resolved, we had assumed she was bugging the cats and gotten whacked.  This late this past winter (almost a year ago) they stopped healing.  We had a biopsy and a the vet diagnosed an auto-immune disease (mar 2020).  \n\nShe’s been on prednisone and multiple doses of antibiotics to heal the ulcers on her nose since then. She’s had ~3/4 rounds of antibiotics for a 2-4 weeks at a time, though it’s been at least 2 months since she’s had any.  \n\nWe had her in after ~6 months on the prednisone and her liver levels were high so we added cyclosporine(modified) @ 150 mg 1x/day and tried weening her off the prednisone.  We’re on at least the third attempt to ween her but we hit 10mg every other day of the prednisone and she started getting worse.  Last last Friday her nose split back open  and we upped her back to 20mg (10 mg 2x a day).\n\nThis Thursday I called to tell our vet I noticed that she was balding on top of her thighs.  We had already called to tell them we had upped the prednisone again and sent in photos of the lesions.  Our vet is calling in tacrolimus ointment .1% that is hopefully coming in today.  \n\nToday, it seems like all of her fur is falling out (with flakes of dry skin).  I’m thinking it might be from the prednisone?  \n\nI wanted to see if there was anything more urgent (requiring a weekend intervention) that I should be concerned with?  \n\nIs there anything more we could be doing for the lupus?  \n\nI’m not sure if this is relevant but: She’s not taking anything else.  She eats Earthborn food (plus we wrap her pills in bread) she gets dog treats before bed including a dental treat.  I brush her teeth with a tetrasodium pyrophosphate enzymatic tooth paste.\nWe keep free range chickens and she occasionally eats their poop.\n\nWe switched all the dishes to stainless steel and wash them every other day.  We have a lot of pets, I’ve been sweeping every day in case the fur is aggravating her.  \n\nIt’s winter and dark after work so we’ve only been able to walk them on weekends when it’s not too cold and icy so UV exposure has been pretty limited for the past month or two.  They usually go out 5-6x a day for 5-10 minutes at a time.  For walks I bought her a uv protected fabric nose guard and we usually try to go early or late in the day to minimize sun exposure, though now we try and time it for when it’s warmest and won’t take them if it’s below 20 f.\n\nI’m not sure if there are other lupus triggers I should be considering or if there’s anything I’m doing that could be setting it off.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. Please also check [the FAQ](https://www.reddit.com/r/AskVet/wiki/index) to see whether your question is answered there.\n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "miss3lle",
        "body": "Forgot to mention in that wall of text that she is spayed and gets bravecto and interceptor except for dec-feb when there are no bugs.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "whitnianajonesy",
        "body": "Hello!\n\nYou gave so much great detail, have a lot of good questions, and are doing a lot for your pet, thank you for that! Dermatology lesions rarely qualify as something that needs to be seen on an emergency basis (i.e. a weekend trip, midnight visit). \n\nHowever, given the questions you have, the various treatments that your pet has gone through, and the amount of changes you have made to daily home life for your pet, it may be helpful to get a specialist on your pets case. As such, I recommend a veterinary dermatologist (if there is one in your area) as soon as possible. Dermatologists are specialized in skin problems (including lupus), and can evaluate your pet thoroughly, go through all history and treatments that you have done thus far, and make a potential plan for the future based on the condition and needs of your pet. You and your veterinarian have put in a lot of hard work for your baby, and as difficult as skin problems can be, you're doing a great job sticking with it! \n\nHope this helped, good luck!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_walkerisaac736",
    "post_id": "dyjg7f",
    "title": "Global Tetrasodium Pyrophosphate Market 2019 - Porter Five Forces Analysis, Growth Opportunities & Forecasts 2024",
    "url": "https://www.reddit.com/r/u_walkerisaac736/comments/dyjg7f/global_tetrasodium_pyrophosphate_market_2019/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-11-19T11:54:55+00:00",
    "body": " \n\nhttps://preview.redd.it/0v1lvb7itmz31.png?width=300&format=png&auto=webp&s=f89f9b176c6f49cce871c88c61fe8c217dc96587\n\n[**Global Tetrasodium Pyrophosphate market 2019**](https://market.biz/report/global-tetrasodium-pyrophosphate-market-2018-mr/251367/)  is a very recent research report which focuses on providing a primary overview of the industry including Segmentation, definitions, implementation, and industry structure. The Global Tetrasodium Pyrophosphate Industry analyzes the worldwide markets involving the changing trends, competitive landscapes, and key geographic development status. Expansion strategies and plans are also well discussed along with the processes of manufacturing and cost structures of the product. Supply and demand Figures, import/export consumption, cost, price, revenue, and gross margins are also stated in this report.\n\n**Scope and limitation of the Tetrasodium Pyrophosphate Market:**  \nThis Research Mostly pinpoints on the **PESTEL** analysis (i.e. Political, Environmental, social, Technological, Legal and Economical factors) as they are the opportunity generation as well as the challenging factors of any industry. The technology is changing day by day depending on the consumer's tastes and preferences. Along with the changing market trends, the surrounding Factors also influence changes either positive or negative to any business.\n\n[Sample PDF Request Link](https://market.biz/report/global-tetrasodium-pyrophosphate-market-2018-mr/251367/#requestforsample)\n\n**Tetrasodium Pyrophosphate Market Competitive Outlook:**  \nThe Profiles of Active Competitors of the Tetrasodium Pyrophosphate Market are also analyzed based on their geographical activity, product type, Market Potential, Productions, sales, future strategies, and the technological status Forecast of the leading manufacturers are also included here. This Report is estimated from the global aspect of Market that is the reason this data can assist any consumer or business and help them to observe the rival strategies.\n\n**Top Competitors the Global Industry:**\n\nShifang Zhixin Chemical  \nWynca  \nSichuan Blue Sword Chemical  \nJIANGYIN CHENGXING INDUSTRIAL GROUP  \nChuanlin Chemical  \nPotash Corp  \nSichuan Shengfeng Phosphorus Chemical  \nWengfu\n\n**Specific Types:** Food Grade, Industrial Grade\n\n**Application/Usage:** Food Industry, Fertilizer Industry\n\n**Geographical Distributions of the Tetrasodium Pyrophosphate:** North America Country, South America, Asia Country, Europe Country Also Other Countries (Middle East, Africa, GCC)\n\n### Center of Attention in this Global Tetrasodium Pyrophosphate Market Report:\n\n1. The **growth factors** of the Global Tetrasodium Pyrophosphate Market are explained in-detail, whereas different users of the market are also described.\n\n2. This report includes the views and opinions of the **experts and professionals** in the industry.\n\n3. The report is a proper source of data for any **investor, policymaker, stakeholder, manufacturer, supplier, service provider, and the player** who is interested in the Tetrasodium Pyrophosphate market dynamics\n\n**Looking for an Inquire then** [CLICK HERE](https://market.biz/report/global-tetrasodium-pyrophosphate-market-2018-mr/251367/#inquiry)\n\n**Contents covered in the Tetrasodium Pyrophosphate Research Report:**  \n\\- Executive Summary.  \n\\- Profiles of Leading International Players.  \n\\- Market Dynamics.  \n\\- Key Players of the Market and the Strategies.  \n\\- Key Findings of the research.\n\nThe report provides a worthwhile analysis of the **Competitive landscape and its Dynamics** that keeps the user ahead of their respective competitors. The Tetrasodium Pyrophosphate Market report provides a five-year forecast estimated on the basis of the market growth. So, with the help of this report user gets a direction to business decisions by having insights into the Global Tetrasodium Pyrophosphate Market.\n\n**THANKS!** Reader For Visiting This Article.\n\n**Published** By [**Market.Biz**](http://market.biz/)\n\n**Trending Articles:** \n\n[Global Night Light Industry Market Research Report](https://market.biz/report/global-night-light-market-2017-mr/159602/)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "breastfeeding",
    "post_id": "17bzmwk",
    "title": "Teeth whitening while BF",
    "url": "https://www.reddit.com/r/breastfeeding/comments/17bzmwk/teeth_whitening_while_bf/",
    "score": 1,
    "num_comments": 1,
    "created": "2023-10-20T01:42:29+00:00",
    "body": "Has anyone used the Hismile v34 corrector while breastfeeding? Or know if it’s safe to use ? Here’s the ingredients: Glycerin, Aqua/Water, Sorbitol, Hydrated Silica, Xylitol, Polysorbate 80, Cellulose Gum, Mentha Piperita (Peppermint) Oil, Phenoxyethanol, Sucralose, Tetrasodium Pyrophosphate, CI17200/D&C Red No. 33, CI42090/FD&C Blue No.1, Ethylhexylglycerin.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "HelpfulSheepherder25",
        "body": "The website says to consult a midwife or doctor for info but my office doesn’t really give me the option to directly contact or speak to a doctor without an appointment",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Buddhism",
    "post_id": "3ebgoh",
    "title": "Atman in detail (on the 'Vanilla Continent')",
    "url": "https://www.reddit.com/r/Buddhism/comments/3ebgoh/atman_in_detail_on_the_vanilla_continent/",
    "score": 1,
    "num_comments": 3,
    "created": "2015-07-23T12:58:08+00:00",
    "body": "On the ‘subtle mind’ question itself I have nothing to add, but I do have an indirect comment in connection with ‘soul/atman’, a term that occurs in the original post, also in a half-dozen of the comments (which total 75 as I write). It is almost impossible to discuss certain ideas without relying on shorthand, so the occurrence of such a term as ‘soul/atman’ in a forum on Buddhism, with forays into Hinduism, is hardly surprising. At the same time, that particular phrase is not being employed as genuine shorthand in my opinion, rather as a *straw man*. A straw man suggestive of what? Something closely akin to the static, personal (egocentric), eternal soul of the Abrahamic religions. Meanwhile, the (actual) Atman of Hinduism has attributes that are wholly or subtly different from those three attributes. This post is an attempt to remedy the straw man situation by presenting a more nuanced face of Atman. [Source: The presentation below is based on Prabhavananda, The Spiritual Heritage of India (1979) where the following analogy occurs several times: Brahman:individual::ocean:wavelet (see pp. 57, 289, 346). That model is a good starting point, as is the well-known Brahman/Maya framework, but both of those models suffer a binary, either/or bias that prevents us seeing the whole. In the analogy below, I attempt to merge the various components into a comprehensive three-part model instead. Disclaimer: I do not profess to be either Buddhist or Hindu myself.] \nImagine a vast continent made of vanilla ice-cream. Thanks to breezes from the four points of the compass, temperatures vary across the surface of this Vanilla Continent, causing the ice-cream nearest the top to periodically soften and refreeze. These interactions with the wind cause various shapes appear, the predominant one being a spiral form that might remind one of a soft-serve ice-cream cone. Moreover, each of these notional soft-serves is chocolate dipped, i.e., clothed somehow in a form-fitting sheath of silky chocolate. (With apologies to those who, in a word-association exercise, would respond to ‘Dairy Queen’ with ‘tetrasodium pyrophosphate’, our aim is to take a time-out from those health concerns and think of a soft-serve cone as something wholesome, as an untutored child would. Why? I've racked my brains for an alternative analogy but the ice-cream continent, as introduced above and detailed below, is the only way I know to create a framework sufficiently versatile for explaining Atman.)\nThe ice-cream continent itself is not Atman but our metaphor for Brahman, of course: Brahman the eternal, the infinite. Next comes Maya. For our special purpose here, I've chosen to let Maya be represented by the thin layer of chocolate dip that encases the soft-serve cone shapes. (If that seems insufficient for Maya, one might add the whole atmosphere and ‘weather system’ above as additional constituents of Maya.) Reminder: Maya is not a mirage or illus*ion*; rather it is illus*ory*, the stage upon which the [pseudo-]drama of our day-to-day lives plays out.\nAt this point, we have a two-part structure, comprised of Brahman and Maya only. How do we bring Atman into the picture? The Atman layer is tricky: it may be said to inhabit the Maya layer while being simultaneously *of* the Brahman layer. In short, it is comprised of vanilla only -- meaning all of the \"soft-serve cones\"  collectively, minus their chocolate-dip casings (= false egos). Caveat: If we take it down to the level of one individual Atman, we must bear in mind that ‘the Atman’ in that sense is not something eternally unique that is ‘owned’ by you or me, the individual in question. Rather, it is a fleeting shape (‘fleeting’ because on the cosmic time scale a human lifetime is only an instant), a shape that will melt back into the body of the Vanilla Continent at some point: the moment of one’s death. This is the crux of the matter: While the Atman’s substance is eternal, its particular shape and ‘identity’ are transient. The melting away of the interior leaves an empty chocolate shell, emblematic of one’s false ego and one’s illusory ‘soul’ that wasn't the real soul and one’s imaginary ‘life’ in the realm of Maya. (To round out the analogy, let's say the empty shell then disappears via sublimation.)\nTat Tvam Asi (That Thou Art): For an even richer understanding of Atman, let’s now imagine that each of the chocolate-covered soft-serves described earlier has an ‘eye’. If the eye of one such structure gazes into the eye of its neighbor, what does it see? Recalling the conventional wisdom that “The eyes are the windows to the soul,” here we shall assume that the line of sight bypasses or penetrates the chocolate dip and goes vanilla-to-vanilla (Atman-to-Atman). Thus, what the eye encounters is ‘itself’, but only in the limited sense of “*This* dollop of vanilla ice-cream is just like *that* dollop of vanilla ice-cream” (cf. the concept of fungible funds in economics). Bringing it back to real life now, this means that when I look at \"you,\" meaning anybody at all, I sometimes have a sensation of “You and I are really the same person.” \nTo summarize, once we get beyond a simple dictionary gloss for Atman, we find that it has less in common with the Abrahamic notion of an ‘eternal soul’ than with the ‘subtle mind’ of Buddhism. (Conversely, when Tat Tvam Asi becomes the basis for Hindu compassion, we can see that this compassion has a different flavor from Buddhist compassion, for its tone is not pitying or condescending, rather neutral and matter-of-fact: Yep, we’re all in this together, so many transient dollops of the same substance.)",
    "flair_text": "Dharma Talk",
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "1fojgcf",
    "title": "Will this hurt my cats?",
    "url": "https://www.reddit.com/r/AskVet/comments/1fojgcf/will_this_hurt_my_cats/",
    "score": 1,
    "num_comments": 3,
    "created": "2024-09-24T18:22:11+00:00",
    "body": "I got some “Arm & Hammer Tartar Control” dental water additive to add to my dogs water to help with their teeth. I was wondering if this would hurt my cats if they drank some. My cats have their own water but occasionally they drink from the dogs bowl too. Any advice is appreciated! \nHere’s the ingredient list: WATER, CELPYRIDINUM CHLORIDE, SORITOL,\nPOLYSORBATE 20, SODIUM BICARBONATE, TETRASODIUM PYROPHOSPHATE, PROTEASES, THYMOL, SODIUM CHLORIDE, ZING GLUCONATE, SODIUM BENZOATE, POTASSIUM SORBATE.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. Please also check [the FAQ](https://www.reddit.com/r/AskVet/wiki/index) to see whether your question is answered there.\n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "14minul",
    "title": "Replacement for No7 Radiant Results Purifying Clay Cleanser",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/14minul/replacement_for_no7_radiant_results_purifying/",
    "score": 1,
    "num_comments": 0,
    "created": "2023-06-29T22:31:41+00:00",
    "body": "Hi\n\nSo  No7 Radiant Results Purifying Clay Cleanser was my holy grail product, nothing else seemed to help clear up my skin.....but they stopped making it and nothing else they do seems anything like it.\n\nCan anyone recommend me anything that's similar? Thanks! \n\n&#x200B;\n\n&#x200B;\n\nNo7 Radiant Results Purifying Clay Cleanser  Ingredient list - Aqua (Water), Kaolin, Caprylic/capric triglyceride, Glycerin, Alcohol denat., Isostearyl isostearate, Cetearyl alcohol, Glyceryl stearate, Dimethicone,  Butyrospermum parkii (Shea) butter, PEG-100 stearate, Phenoxyethanol, Panthenol, Caprylyl glycol, Xanthan gum, Carbomer, Parfum (Fragrance), Tocopheryl acetate, Butylene glycol, Ascorbyl glucoside, Ethylhexylglycerin, Potassium hydroxide, Tetrasodium EDTA, Tetrasodium pyrophosphate, Dipropylene glycol, Spiraea ulmaria extract.  ",
    "flair_text": "Recommendation",
    "flair_template_id": "82c2a9d6-4a65-11e8-b502-0ebe546b917e",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AskVet",
    "post_id": "1517rr0",
    "title": "Ingredients check? Trying to avoid chicken",
    "url": "https://www.reddit.com/r/AskVet/comments/1517rr0/ingredients_check_trying_to_avoid_chicken/",
    "score": 1,
    "num_comments": 2,
    "created": "2023-07-16T14:32:13+00:00",
    "body": "Looking at new foods for fur baby and have been advised(vet) to try remove chicken. Rx foods are a bit pricey ATM so searching for others that arent GF. Can anyone advise if anything in this list is a form of chicken? \n\nBEEF, BEEF MEAL (SOURCE OF GLUCOSAMINE AND CHONDROITIN SULFATE), WHOLE GRAIN BROWN RICE, WHOLE DRIED PEAS, WHOLE GRAIN SORGHUM, PORK FAT (PRESERVED WITH MIXED TOCOPHEROLS), NATURAL FLAVORS, MENHADEN FISH MEAL (SOURCE OF DHA - DOCOSAHEXAENOIC ACID), DEHYDRATED ALFALFA MEAL, PORK MEAL, POTASSIUM CHLORIDE, YEAST CULTURE, DRIED CARROTS, TOMATO POMACE, SALT, ORGANIC DRIED SEAWEED MEAL, TAURINE, CHOLINE CHLORIDE, ZINC PROTEINATE, VITAMIN E SUPPLEMENT, DL-METHIONINE, IRON PROTEINATE, HYDROLYZED YEAST, MANGANESE PROTEINATE, L-CARNITINE, SELENIUM YEAST, BREWERS DRIED YEAST, COPPER SULFATE, NIACIN SUPPLEMENT, VITAMIN B12 SUPPLEMENT, VITAMIN A SUPPLEMENT, D-CALCIUM PANTOTHENATE, MONO AND DIGLYCERIDES OF FATTY ACIDS, THIAMINE MONONITRATE, BIOTIN, YUCCA SCHIDIGERA EXTRACT, CALCIUM CARBONATE, RIBOFLAVIN SUPPLEMENT, CALCIUM IODATE, PYRIDOXINE HYDROCHLORIDE, VITAMIN D3 SUPPLEMENT, TETRASODIUM PYROPHOSPHATE, INULIN, LECITHIN, FOLIC ACID, DRIED BACILLUS COAGULANS FERMENTATION PRODUCT, DRIED BACILLUS SUBTILIS FERMENTATION PRODUCT",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Bitter-Metal5620",
        "body": "It doesn't appear to have any chicken, however sources of ingredients aren't always listed. The best way to be sure is to call the food company directly.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Greetings, all!\n\nThis is a sub for professional veterinary advice, and as such we follow strict rules for participating. \n\nOP, your post **has NOT** been removed. Please also check [the FAQ](https://www.reddit.com/r/AskVet/wiki/index) to see whether your question is answered there.\n\nThis is an *automated* general reminder to **please follow [The Sub Rules](https://www.reddit.com/r/AskVet/about/rules/)** when discussing this question:\n\n- **Do not comment with anecdotes** about your own or others' pets.\n- **Do not give OP specific treatment instructions,** including instructions on meds and dosages.\n- **Do not give possible diagnoses** that could explain the symptoms described by OP.\n\n**Your comment will be removed, and you may be banned.**\n\nThank you for your cooperation!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskVet) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FancyFollicles",
    "post_id": "hz4842",
    "title": "Does L’Oréal Féria copper crave metallic salts?",
    "url": "https://www.reddit.com/r/FancyFollicles/comments/hz4842/does_loréal_féria_copper_crave_metallic_salts/",
    "score": 0,
    "num_comments": 1,
    "created": "2020-07-28T00:15:55+00:00",
    "body": "Hello!\nI’ve been curious about if my main box due has metallic salts in it, but have seen contradicting posts on whether Féria contains metallic salts. Are any of these under that category? \n-\nFeria Color Coppery Shimmer 7.40 INGREDIENTS AQUA / WATER / EAU ALCOHOL DENAT. PEG-4 RAPESEEDAMIDE GLYCERYL LAURYL ETHER DECETH-3 PROPYLENE GLYCOL LAURETH-5 CARBOXYLIC ACID ETHANOLAMINE DIPROPYLENE GLYCOL HEXYLENE GLYCOL AMMONIUM HYDROXIDE POLOXAMER 338 POLYQUATERNIUM-6 OLEYL ALCOHOL p-AMINOPHENOL 4-AMINO-2-HYDROXYTOLUENE 2-AMINO-3-HYDROXYPYRIDINE 6-HYDROXYINDOLE AMMONIUM THIOLACTATE 2-METHYL-5-HYDROXYETHYLAMINOPHENOL PARFUM / FRAGRANCE RESORCINOL EDTA ERYTHORBIC ACID FIL CODE D44189/2 L'ORÉAL PARIS 20 VOLUME RETAIL DEVELOPER INGREDIENTS AQUA / WATER HYDROGEN PEROXIDE CETEARYL ALCOHOL TRIDECETH-2 CARBOXAMIDE MEA CETEARETH-30 GLYCERIN PENTASODIUM PENTETATE SODIUM STANNATE TETRASODIUM PYROPHOSPHATE F.I.L. Code D56/21 Formula 1084487 A ACCENTING AFTER COLOR INGREDIENTS AQUA / WATER / EAU DISODIUM COCOAMPHODIPROPIONATE SODIUM LAURYL SULFATE PPG-5-CETETH-10 PHOSPHATE PHOSPHORIC ACID PPG-12-PEG-50 LANOLIN GLYCOL DISTEARATE POLYQUATERNIUM-10 HEXYLENE GLYCOL SODIUM BENZOATE PARFUM / FRAGRANCE TARTARIC ACID PEG-55 PROPYLENE GLYCOL OLEATE SALICYLIC ACID PROPYLENE GLYCOL FIL CODE D43589/4 Formula 1087179 D AFTER COLOR CONDITIONER INGREDIENTS AQUA / WATER / EAU CETEARYL ALCOHOL GLYCERIN BEHENTRIMONIUM CHLORIDE AMODIMETHICONE CETYL ESTERS ISOPROPYL ALCOHOL PARFUM / FRAGRANCE SODIUM PCA TRIDECETH-6 PANTHENOL CANDELILLA CERA / CANDELILLA WAX / CIRE DE CANDELILLA CETRIMONIUM CHLORIDE CHLORHEXIDINE DIHYDROCHLORIDE HYDROXYPROPYLTRIMONIUM HYDROLYZED WHEAT PROTEIN 2-OLEAMIDO-1,3-OCTADECANEDIOL SOLUBLE COLLAGEN FIL CODE D52825/3 Formula 437752 FERIA COPPER BOOSTER INGREDIENTS AQUA / WATER / EAU BASIC YELLOW 87 BASIC ORANGE 31 FIL CODE D14559/4",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "erebusstar",
        "body": "Did you ever find out?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "foodscience",
    "post_id": "1eu8cop",
    "title": "How to copy instant vanilla pudding?",
    "url": "https://www.reddit.com/r/foodscience/comments/1eu8cop/how_to_copy_instant_vanilla_pudding/",
    "score": 0,
    "num_comments": 22,
    "created": "2024-08-17T03:39:17+00:00",
    "body": "Im trying to copy instant royal vanilla puddings recipe for my cookies that require it except without the preservatives and food dyes. The instant pudding seems to contain 3 main ingredients, sugar, modified cornstarch and tetrasodium pyrophosphate.\n\n\nThere are a few main issues:\n\n1. What percentage of each ingredient are in vanilla pudding\n\n2. Could I have a lab test this and give me results of the proportion of each ingredient?\n\n3. Would it be dangerous for me to make my own vanilla pudding with tetrasodium pyrophosphate?\n\n4.If it is dangerous could I use something like xantham, guar or arrowroot?\n\n\n\nSorry for the difficult question, I have searched far and wide for an answer and cant seem to find anything.",
    "flair_text": "Food Chemistry & Biochemistry",
    "flair_template_id": "e1b7eb08-57b9-11ec-8361-8694cd0f5fc4",
    "comments": [
      {
        "author": "Enero__",
        "body": "How instant? Just add hot water?",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "bumbah",
        "body": "Most instant puddings are cold set. So a basic cold set pregelatinized starch is really all you need. The TSPP is just a buffer, not super critical for a home recipe. Start at 3:1 ratio of sugar to starch and go from there. Thicken and thin, as needed",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "UpSaltOS",
        "body": "Instant Vanilla Pudding Composition:\n\n**52% - Milk Powder**\n\n**33% - Sugar**\n\n**14.8% - Modified Starch (Cold Set, Pregelatinized)**\n\n**0.1% - Tetrasodium Pyrophosphate**\n\n**0.07% - Kappa-Carrageenan**\n\n**0.06% - Vanilla**\n\n[Reference](https://sci-hub.se/https://onlinelibrary.wiley.com/doi/abs/10.1111/1471-0307.12487)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Cooking",
    "post_id": "navhpq",
    "title": "Does anybody have a marshmallow recipe with a secret strategy of ingredient?",
    "url": "https://www.reddit.com/r/Cooking/comments/navhpq/does_anybody_have_a_marshmallow_recipe_with_a/",
    "score": 0,
    "num_comments": 14,
    "created": "2021-05-12T18:17:32+00:00",
    "body": "A lot of marshmallow recipes are the same, and I know the saying if it aint broke dont fix it, but I would still like to know something that could take it to the next level, some spice or liquid. Even some chemical binder like a phosphate or something or xantham gum or gellen or peptin or idk something. I keep seeing Tetrasodium Pyrophosphate as an ingredient but I dont know if adding that in homemade marshmallows would make it better or worse, or how much I should add.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Realistic_Ear_4924",
        "body": "You're thinking about what's inside the marshmallow. You should be thinking about what's outside of it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MIDEFENDER",
        "body": "Add Peppermint extract to the corn syrup mixture. Dip the completed and cooled marshmallows in dark chocolate glaze. You are welcome.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "idledaylight",
        "body": "I once made bourbon marshmallows and put them in hot chocolate. It was amazing.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "prettyplum32",
        "body": "The tetrasodium is added as a whipping aid, likely to account for the high shear forces the product has to go through being extruded. Any force on a whipped item is no good, as it destroys your foam. \n\nThere isn’t really anything secret about mallows, it’s just corn syrup whipped up and stabilized. You’ll likely have better results refining your % of gelatin to get silkier, softer mallows",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "JadedFlower88",
        "body": "Have you made Guimauve? They’re French marshmallows and they’re lighter than your common American marshmallows. Fluffy, soft and melt in your mouth. They use whipped egg whites to get a lighter texture, but they don’t age well because of that and should be consumed fairly quickly (2-3days) after making.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  }
]