[
  {
    "subreddit": "tressless",
    "post_id": "1hcfj43",
    "title": "Is it too much to hop on topical Dutasteride and get Dutasteride mesotherapy while already being on oral Dutasteride?",
    "url": "https://www.reddit.com/r/tressless/comments/1hcfj43/is_it_too_much_to_hop_on_topical_dutasteride_and/",
    "score": 1,
    "num_comments": 0,
    "created": "2024-12-12T07:03:23+00:00",
    "body": "Some background:\n\n(28 Male)\n\nI have been on about 2.5 years of topical Minoxidil (5%), oral Minoxidil (2.5 mg), and oral Finasteride (1 mg). I had maintained the density on my scalp really well until this October when I started noticing excessive hair fall. Only then I looked up into causes for hair loss in men and learned about DHT. So, I started using topical Dutasteride (0.025%) for about 1 month and 20 days until my dermatologist suggested replacing it with Palsons Q Sera hair serum (contains red clover flower extract for targeting DHT), which I have now used for 10 days. I also switched to oral Dutasteride (0.5 mg) instead of oral Finasteride (1 mg) about a month ago. My oral Minoxidil intake has remained the same while the topical Minoxidil now also contains Finasteride (0.1%).\n\nWill going back to topical Dutasteride help combat the DHT in scalp more compared to oral Dutasteride? Or is the Finasteride (0.1%) enough for targeting scalp DHT? Or is that too much?\n\nShould I also ask for Dutasteride mesotherapy? Or is this unnecessary?",
    "flair_text": "Finasteride/Dutasteride",
    "flair_template_id": "5438ef14-216b-11e6-a07f-0ebfe7658481",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_woolashreview",
    "post_id": "cbd6ec",
    "title": "Woolash Reviews",
    "url": "https://www.reddit.com/r/u_woolashreview/comments/cbd6ec/woolash_reviews/",
    "score": 1,
    "num_comments": 0,
    "created": "2019-07-10T06:36:52+00:00",
    "body": "**WooLash Review 2018: Ingredients, Side Effects, And Where To Buy It**\n\nWomen love to look their best and attractive at all ages, hence the growing need to enhance various body physique as we advance in age. One of the body parts affected by ageing is the Eyelash. They become thinner and grow shorter as we age.\n\nThe good news is, a renowned company in the beauty industry, WooPure is also proactive in making sure we get our bodies safely enhanced to become almost ageless with the safest technological advances utilised in the production of beauty products. One top-rated product raking in great reviews of its potency is [WooLash eyelash growth serum](https://woolash.com).\n\n&#x200B;\n\nhttps://preview.redd.it/bncbcxvc4f931.png?width=752&format=png&auto=webp&s=29e1411b94d3f138507401d70390b598a650d050\n\nWith amazing daily reviews gathered from customers, it is celebrated as the best treatment for lash growth and regeneration. Even celebrities are not holding back on their praise for this [top eyelash serum](https://medium.com/@TopEyelashGrowthSerum/woolash-reviews-f743fe7722ea), as it improves eyelash volume and increases lash length.\n\nIs **WooLash** eyelash growth serum worth buying or is it just another lash serum with zero effectiveness? Read on to know all about this beautiful lash growth serum.\n\n&#x200B;\n\nhttps://preview.redd.it/8t2qbw4e4f931.png?width=749&format=png&auto=webp&s=1022ad3d7fcac9953e86f3fe66821411a2a209b1\n\n## What is WooLash?\n\n**WooLash** is formulated to condition, strengthen and enhance lash growth from its roots. It takes care of short lashes, falling off of lashes and brittle lashes. It contains 100% natural composition of ingredients to provide a safe and irritation-free serum. It comes highly recommended by top ophthalmologists and dermatologists in the beauty industry.\n\nIt contains a list of active ingredients that are engineered to stimulate lash follicle from its roots and conditions the lash line to ensure hydration and growth — thus eliminating the burden of short and brittle lashes.\n\n&#x200B;\n\n[Woolash Reviews](https://reddit.com/link/cbd6ec/video/06rrtml15f931/player)\n\n## WooLash Producers\n\nWooLash is manufactured in the USA by Woopure, a top-notch beauty company situated in the heart of Los Angeles, CA. They have an excellent reputation for using ONLY 100% natural, skin-friendly ingredient**s.** And their customers trust them always to deliver the best every time.\n\n&#x200B;\n\nhttps://preview.redd.it/vj5c1tzp5f931.png?width=748&format=png&auto=webp&s=9a09663e42c10472b420f5484f0fd8476b8992e8\n\n## The Potency of the 2-Peptides Used in WooLash Eyelash Growth Serum\n\nUnlike the other top **lash growth** products in the market in 2018,( [WooLash reviews](https://www.eyelashgrowthproductsreviews.com/woolash-reviews/) ) went above and beyond to use dermatologist and ophthalmologist tested and approved peptides that work in synergy to boost and **enhance lash growth.** These peptides are:\n\n**Myristoyl Pentapeptide – 17**: Helps lashes look fuller and thicker by providing the needed protein and vitamins to the lash follicles, fixing the broken communication strands between the dermal papilla and lash follicles.\n\n**Myristoyl Hexapeptide - 16**:  It works best when combined with Myristoyl Pentapeptide-17. It significantly improves the look of eyelashes making them appear longer, thicker, and fortified (provides a visible result within 2 to 4 weeks). It prolongs the active phase (Anagen) of the lash growth and extends the Catagen phase (resting phase) to over three months.\n\n&#x200B;\n\nhttps://preview.redd.it/cvuf6jvs5f931.png?width=749&format=png&auto=webp&s=10eb0c4cd9da1904796393d83036db43e0d3a267\n\n## Other Potent ingredients.\n\nGrapefruit Extract: Shields lash follicles from the lash destructive hormone Dihydrotestosterone).\n\nPanthenol: It thickens lashes by penetrating and saturating the interior lash shaft. It also moisturises lashes, preventing dryness and breakage.\n\nCalcium Pantothenate: Strengthens lashes follicles and activates lash cells by feeding them with the needed vitamins.\n\nClover Flower extract: Makes lash stronger, adding volume and lustre to it. It also prevents lash eczema.\n\nGreen Tea Extract: Like Grape Fruit Extract, it blocks the action of DHT while enhancing lash volume.\n\n&#x200B;\n\nhttps://reddit.com/link/cbd6ec/video/4fzknupr6f931/player\n\n## How Does WooLash Work?\n\nThere are so many lash products in the market that promises [lash growth](https://woolash.com). However, **WooLash** eyelash growth serum raises the standard. The combination of Myristoyl Pentapeptide – 17 and Myristoyl Hexapeptide-16 works best to significantly improve the look of eyelashes making them appear longer, thicker, and beautiful.\n\nIt also prolongs the active phase (Anagen) of the lash growth and extends the Catagen phase (resting phase) to over three months. To ensure your lashes look fuller for a longer period.\n\n&#x200B;\n\nhttps://preview.redd.it/rttk7bc87f931.png?width=1000&format=png&auto=webp&s=1afd9b94c862907b19445c928e1aabff78d432c4\n\n## How To Use WooLash?\n\nApplying **WooLash** is quite easy. However, these tips will help you get a faster, better result:\n\n· Follow the product label instruction carefully.\n\n· Although the ingredients used in [WooLash Reviews](https://www.besteyelashgrowthserums.com/) are 100% natural, you might want to check with your ophthalmologist if you have sensitive eyes, before using this **serum for eyelashes**.\n\n· The product is for external use only.\n\n· Wash and cleanse your face, especially the eye area before applying this serum\n\n· It is advisable to use it at night to allow absorption while you sleep.\n\n· Use it regularly to see incredible results.\n\n&#x200B;\n\nhttps://preview.redd.it/mvu52ou97f931.png?width=1000&format=png&auto=webp&s=6dce5f46ebdfd00e7e8061fe9a1afee6a8cf2366\n\n## Benefits of WooLash?\n\n· It rejuvenates your lash follicles.\n\n· It conditions and hydrates the lash lines.\n\n· It darkens the eyelash and increases the length and volume of lashes without changing the colour of your iris.\n\n## When To Experience Result?\n\nIn about 30-days you should begin to see thicker lash lines with improved length. However, it is advisable to apply continuously for 60 days to enjoy the full benefits **WooLash** **eyelash growth serum.**\n\n&#x200B;\n\nhttps://preview.redd.it/miszf8va7f931.png?width=750&format=png&auto=webp&s=baf0da77d5df227013154d3e81d13800f1939124\n\n## What are the Side Effects of WooLash?\n\nThe ingredients used are 100% natural. It is prostaglandin free. Therefore it comes with zero side effects. It might take a while to get into the habit of applying the serum daily fully. You will get used to it eventually.\n\n## Where To Buy WooLash?\n\nPresently, you can only purchase **WooLash** from their [Official Website](https://woolash.com)  this is to curtail the menace of buying a fake **WooLash** serum.\n\nSee you on the Lash side of life!\n\n&#x200B;\n\n&#x200B;\n\nhttps://preview.redd.it/1i6jjkpf7f931.png?width=748&format=png&auto=webp&s=8b9c6def4219df4b2f28f75c57d72ab5f728650b",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  }
]