[
  {
    "subreddit": "EuroSkincare",
    "post_id": "18ty7pu",
    "title": "Balea has a new cleansing balm. Can't say anything about its quality because I haven't tried it yet.",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/18ty7pu/balea_has_a_new_cleansing_balm_cant_say_anything/",
    "score": 41,
    "num_comments": 17,
    "created": "2023-12-29T21:39:28+00:00",
    "body": " GLYCINE SOJA OIL, PENTAERYTHRITYL DISTEARATE, LAURETH-4, CETEARYL ALCOHOL, GLYCERYL BEHENATE, HYDROGENATED CASTOR OIL, SQUALANE, BUTYROSPERMUM PARKII BUTTER, VITIS VINIFERA SEED OIL, TOCOPHERYL ACETATE, PRUNUS ARMENIACA KERNEL OIL. \n\nhttps://preview.redd.it/uecr0x5lza9c1.jpg?width=1321&format=pjpg&auto=webp&s=d07506b848491686bbca8f43546e937a90bf161d",
    "flair_text": "Cleanser",
    "flair_template_id": "2a65d906-f539-11ec-963c-7e9d1b2c9e4b",
    "comments": [
      {
        "author": "SuspiciousAdvice217",
        "body": "Huh, had I known... Was at two dm stores today and didn't see it. Might get it tomorrow.\n\nThanks! :)",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "Waste-Ostrich-5929",
        "body": "Hahaha looks exactly like Geek & Gorgeous😅 i hope it performs just as well!",
        "score": 15,
        "is_top_level": true
      },
      {
        "author": "kittywae",
        "body": "really excited to try this one when it comes to my country. the cleansing sorbet was a major disappointment",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "magispie",
        "body": "Packaging wise it looks like a dupe to the one from Geek&Gorgeous. I’ll definitely try it out as soon as I see it in store",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "LetMeInYourWindowH",
        "body": "Love this line. Haven't bought anything from it since it's not available in my country, but the ingredients look great.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "simplybobi",
        "body": "i am from Austria and our DM does not carry this - would someone be interested to buy it for me and ship it? including the cica body cream from balea - i would pay via PayPal and of course pay the postal service as well",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "FutureEyeDoctor",
        "body": "Not available in CZ yet but ill be in Germany in two weeks, thanks for letting me know 🫶🏼",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "coffeeandsneks",
        "body": "I'm excited for it to come to Serbia so I can try it out. I'm currently using their cleansing oil",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 8,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionUK",
    "post_id": "7rr8xa",
    "title": "Waitrose Pure Skincare now 1/3 off - mini reviews of 'Pure Moisture' cleanser, oil, day cream",
    "url": "https://www.reddit.com/r/SkincareAddictionUK/comments/7rr8xa/waitrose_pure_skincare_now_13_off_mini_reviews_of/",
    "score": 35,
    "num_comments": 1,
    "created": "2018-01-20T16:13:44+00:00",
    "body": "Waitrose have a skin/hair care line called 'Pure' which is fragrance free, hypoallergenic, cruelty free and uses mostly 'naturally derived' ingredients, whatever that means. It's also really cheap, and regularly on offer. I know this isn't a hair care sub, but their shampoo and conditioners are fab, and extremely good value. The dry/damaged conditioner is how I make it up to my hair for bleaching it to all hell. \n\nAnyway, I got a few of the skincare products a few months ago when they were doing 3 for 2. They're now on 1/3 off, so I thought I'd post some mini-reviews. \n\nI would describe my skin as oily, somewhat congested, and quick to anger. It’s also probably somewhat dehydrated by bad office aircon and just, like, winter in general. \n\n**Waitrose Pure Hydration Hot Cloth Cleanser** RRP £5, currently £3.33\nhttps://www.waitrose.com/ecom/products/waitrose-pure-hydration-hot-cloth/508007-539993-539994\n\n**Ingredients:** Prunus Amygdalus Dulcis Oil, Candelilla Cera, Butyrospermum Parkii Butter, Ricinus Communis Seed Oil, Vitis Vinifera Seed Oil, Oryza Sativa Powder, Cetearyl Olivate, Sorbitan Olivate, Triticum Vulgare Germ Oil, Gossypium Herbaceum Seed Oil, Aqua, Tocopherol,  Lecithin, Polyglyceryl-3 Diisostearate, Glycerin, Glyceryl Stearate, Xanthan Gum, Phenoxyethanol, Potassium Sorbate, Sodium Benzoate, Sodium Phytate\n\n**Verdict:** God, I wanted to like this. I love hot cloth cleansers, and this one was so simple and cheap - and it even comes with a cloth! However, the rice powder totally ruins it for me - using a face cloth is exfoliating enough, and I don’t want even a gentle scrub on my face. If you are super into scrubbing your face, this might be perfect - it’s not going to rip you to shreds like walnut shells, and it’s not illegal  and murderous like microbeads. \n\nI was very sad about this until I realised that what I did now have was a super-luxurious body scrub. I used it the other day - I spent a long time massaging it into dry skin before taking a hot shower and washing it all off with a sponge. Because the cleanser’s so rich, my skin was very soft and moisturised afterwards, and a couple of days later the patches of KP I had were almost gone. I might do it again next weekend - it’s not really a weekday type thing because rubbing it all in takes ages, washing it all off also takes ages, and they’re both kind of the point (it’s sort of like a soothing diy massage) so you don’t want to hurry it.\n\n**Waitrose Pure Hydration Facial Oil** RRP £5, currently £3.33\nhttps://www.waitrose.com/ecom/products/waitrose-pure-hydration-facial-oil/862289-541045-541046\n\n**Ingredients:** Coco-Caprylate/Caprate, Prunus Amygdalus Dulcis Oil, Vitis Vinifera Seed Oil, Shea Butter Ethyl Esters, Gossypium Herbaceum Seed Oil, Simmondsia Chinensis Seed Oil,  Olea Europaea Fruit Oil, Prunus Persica Kernel Oil, Tocopherol, Citric Acid\n\n**Verdict:** Blergh. I sometimes do really well with facial oils - I really love the Boots Botanics Organic one - but this was just a nope all round. Bar the absence of smell, it just feels like I rubbed coconut oil into my skin. I shine with a thin film of grease. I might try it on my hair, maybe? Or try doing the OCM with it? I will say this, the packaging’s nice - a lovely frosted glass bottle - so I suppose if nothing else I can empty it out and put other things into it. As you can see, I’m trying really hard to find positives here.\n\n**Waitrose Pure Hydration Day Cream SPF 15** RRP £5, currently £3.33\nhttps://www.waitrose.com/ecom/products/waitrose-pure-hydration-day-cream-spf-15/450717-539849-539850\n(It says ‘this product is unavailable’ but it’s definitely for sale in multiple shops.)\n\n**Ingredients:** Aqua (Water), Zinc Oxide (Nano), Coco-caprylate/Caprate, Shea Butter Ethyl Esters, Caprylic/Capric Triglyceride, Glycerin, Cetearyl Olivate, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Sorbitan Olivate, Propanediol, Cetyl Alcohol, Simmondsia Chinesis (Jojoba) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Titanium Dioxide (Nano), Phenoxyethanol, Polyhydroxystearic Acid, Argania Spinosa Kernel Oil, Triticum Vulgare (Wheat) Germ Oil, Caprylhydroxamic Acid, Xanthan Gum, Citric Acid, Aluminum Stearate, Sodium Phytate, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Butyrospermum Parkii (Shea) Butter, Cocos Nucifera (Coconut) Oil, Isostearic Acid, Alumina, Methylpropanediol, Tocopherol, Sodium Hydroxide, Gossypium Herbaceum (Cotton) Seed Extract, Lecithin, Polyglyceryl-3 Disostearate, Potassium Sorbate, Sodium Benzoate, Glyceryl Stearate\n\n**Verdict:** Hell to the yeah. I really really love this moisturiser, and have just rebought it as I’m getting near the bottom of the jar and it’s on offer again. I think it’s just that my skin is a big fan of zinc oxide, since I find that Sudocrem also calms my skin down a whole bunch. It’s thick and creamy, and feels very protective against the winter wind, and it’s the only thing that seems capable of withstanding a day in the weird dry recirculated air in my office. It’s not every day you find a physical-only sunscreen for such a low price, either, even if it is only SPF15. There’s a slight whiteness as you rub it in, and people with darker skin tones might find it leaves a cast - I’m not sure, as I haven’t noticed one, but my underlying skin colour’s quite pale and so it’s not always visible on me. On days when I especially don’t care about ruining the SPF aspect (ie most days right now because it’s deepest winter and I’m barely leaving the house anyway) I will often mix in a bit of Sea Kelp Bioferment. \n\nThe Pure Natural line is even cheaper. In particular, I think it’s great that they offer some really basic thick face creams with no fragrance. I’m probably going to try out their SLS free face wash at some point.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "GiantFlightlessBird",
        "body": "Thanks this is great!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Wetshaving",
    "post_id": "m4x8cv",
    "title": "[Review] Officina Artigiana Milano - Stay Traditional Shave Soap",
    "url": "https://www.reddit.com/r/Wetshaving/comments/m4x8cv/review_officina_artigiana_milano_stay_traditional/",
    "score": 31,
    "num_comments": 2,
    "created": "2021-03-14T15:33:01+00:00",
    "body": "Let's review a soap some of you didn't know existed or probably didn't even give a thought about trying. Which is fine because we all do it, myself included. \n\nOfficina Artigiana Milano Stay Traditional, from here on out it will be mentioned as OAM is a shaving soap out of Italy. They are relatively new maybe a year or two old but new in the soap world. Their main focus on their soap is the \"5 Wellness Oils\" they use which are: *Jojoba, Argan, Almond, Grapeseed, and Castor*. Can these 5 oils make a difference in this soap or is it just advertising? \n\n**The Base**\n\nOAM like majority of Italian soaps use a vegan base, this base is a bit more involved with the oils they use. The ingredients are:\n\n> Aqua (Water), Stearic Acid, Cocos Nucifera Oil, Castor Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Argania Spinosa (Argan) Kernel Oil, Potassium Hydroxide, Parfum (Fragrance), Simmondsia Chinensis (Jojoba) Oil, Vitis Vinifera Seed Oil, Sodium Hydroxide, Linalool\n\nAs you can see not too complicated but lots of oils in this so for a vegan soap a bit more appealing to me than something loaded up heavy on coconut oil that drys my face out faster than hungover thirst. \n\n**The Scent**\n\nOAM as of now has 2 scents and their packaging is pretty plain so may be hard to distinguish the two and both scents are very different. The one I'm reviewing is Stay Traditional and the scent profile is: \n\n> The fragrance chosen for the Officina Artigiana Stay Traditional shaving line is citrusy, with predominant notes of grapefruit softened by lemon peel on a bed of peach and wild strawberries. The central notes are ozonic and saline that close dancing on a base of white musk.\n\nTo my nose off the tub I get the grapefruit and lemon followed by strawberry. I honestly wish I got more peach than strawberry but it's a nice citrus scent. A bit of a change up from the citrus scents you see in most soaps. \n\n**Presentation/Packaging**\n\nThis is where OAM shines, the jar is a very large and heavy glass jar with a metal lid. If anyone is familiar with Abbate Y La Mantia Krokos it's the same jar as that. For reference the mouth of this jar is about the same as the outside diameter in your standard Parkway or Colt jar. So this is big and luckily it's also filled with 5oz of soap with a unique \"floral pattern\" from the fill nozzels that they use. All of this is packaged in a thick card stock box with ingredients, scent profile, and instructions/tips. \n\nI think this a nice bonus and standout but I've seen other nice containers but the soap lathers like shampoo. Is this one of those? \n\n**Price**\n\nAll mentioned above OAM comes in a price at $25 USD, $32 CAD, £18.00 or €20. A little high but the glass jar, the amount of soap and shipping from Italy to vendors it's not too bad I think. Definitely not a cheap buy but some artisan soaps are much more than this.\n\n**Loading & Lathering**\n\nLike most Italian soaps they are on the softer side, OAM is one of those at a medium soft firmness. But it's not super soft, you can easily load it right off the puck. One thing I will suggest is because of the design from filling the jar I'd flatten the soap with a spoon, just because I found I got a lot of water sitting in the side of the jar. If you bowl lather or scoop and smear this is easy enough to do it. \n\nOne thing you may see with OAM soaps is they mentioned to give this soap extra water. For me this is no problem and honestly it was super easy to get this to lather and get a lather I like to shave with. The need for extra water just meant it wouldn't fall apart like i've seen with some Italian soaps.\n\n**The Shave**\n\nNow the good stuff, the lather from OAM provided great slickness and protection. My straight just glided over my face taking any and all hair with it. I did my usual 2 pass shave with some clean up and was quite pleased with the results. An effortless shave is honestly all I ask for with soaps these days. So the performance does go along with the presentation. \n\n**Post Shave**\n\nThe \"5 Wellness Oils\" I'd say do help the post shave feel, most Italian soaps can be a bit drying but this one I had no issue with. Following it up with a splash and a balm per my usual shave routine and my face was feeling nice. Not that overly soft feel you get from some artisan soaps but comfortable if that makes sense. \n\n**Conclusion**\n\nYeah this is a good soap, I'm not going to say it's a world beater but it doesn't really disappoint me. I'll get a good shave from it, I'll enjoy it what else is needed? I like my Italian shave soaps, I know how they perform and how to handle them and I'd say this is probably a top Italian soap for me. \n\nBut who is this for? Lets list some point:\n\n* People who want to ball on a semi decent budget. \n* Anyone looking for a quality vegan soap.\n* Someone looking for a more unique/interesting citrus scent. \n* Someone who enjoys Italian soaps.\n\nSo if that's you or what I wrote sounds interesting give it a try.\n\n**Disclaimer: I paid for this with my own money, OAM didn't provide this soap or provide compensation for my review as all thoughts are my own.**",
    "flair_text": "Review",
    "flair_template_id": null,
    "comments": [
      {
        "author": "sgrdddy",
        "body": "I think the folks who make this are now the ones who make the new croap for Fine Accoutrements.\n\nAlso, thanks for the very nice review.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "1czfloq",
    "title": "Simple and cheap cleansing oil?",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/1czfloq/simple_and_cheap_cleansing_oil/",
    "score": 16,
    "num_comments": 12,
    "created": "2024-05-24T08:02:31+00:00",
    "body": "Hello, I was wondering if anyone can suggest an alternative to Kruidvat cleansing oil which I used and loved, it has quite a short ingredient list:\n\nEthylhexyl stearate, Caprylic/Capric Triglyceride, Peg40 Sorbitanperisostearate, Tocopheryl Acetate, Vitis Vinifera Seed Oil, Simmondsia Chinensis Seed Oil, Helianthus Annuus Seed Oil, Parfum\n\nIt was discontinued, I then swtiched to Nivea cleansing oil which ALSO got discontinued (sigh), I still have some backup but once it'll run out and I cannot find anything to replace it. I'd prefer it to be simple, with no acne triggers, something that emulsifies and is available in Europe (and is cheaper than Asian alternatives). Mineral oil is OK, but Kruidvat didn't have any and was much nicer to use than Nivea (which does have it)... Of course I've tried to find something myself already, but I only find expensive alternatives, or with acne triggers, or something that's not readily available, or someting that is not a true oil cleanser at all. Or something without an emulsifier! It just sucks when something works well and is perfect and then you just can't buy it anymore.\n\nThanks in advance!",
    "flair_text": "Cleanser",
    "flair_template_id": "2a65d906-f539-11ec-963c-7e9d1b2c9e4b",
    "comments": [
      {
        "author": "alkemicalgold",
        "body": "Balea cleansing oil (~4€ per 100ml):\n\nHelianthus Annuus Hybride Olie | Isopropyl Palmitate | Isopropyl Myristate | PEG-20 Glyceryl Triisostearate | Ethylhexyl Stearate | Tocopherol | Argania Spinosa Kernel Olie\n\n\nSanaka huile demaquillante (~10€ per 200ml):\n\nHELIANTHUS ANNUUS (SUNFLOWER) SEED OIL, POLYGLYCERYL-4 OLEATE, CANNABIS SATIVA SEED OIL*, CANNABIDIOL – DERIVED FROM EXTRACT OR TINCTURE OR RESIN OF CANNABIS, TOCOPHEROL, BETA-SITOSTEROL, PARFUM (FRAGRANCE), EUCALYPTUS GLOBULUS OIL, POGOSTEMON CABLIN OIL, LINALYL ACETATE, LIMONENE.\n\n\nBLANCRÈME Pomegranate & Cranberry Cleansing Oil (~25€ per 400ml):\n\nHELIANTHUS ANNUUS (SUNFLOWER) SEED OIL, POLYGLYCERYL-2 SESQUIOLEATE, VACCINIUM MACROCARPON (CRANBERRY) SEED OIL, PUNICA GRANATUM SEED OIL, PARFUM (FRAGRANCE), TOCOPHEROL",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "amora_obscura",
        "body": "You could also consider cleansing balms, they are very similar but in a solid form that melts. I know Balea does a cleansing balm, but I've not tried it. Geek and Gorgeous does a cleansing balm for about €12.\n\nPersonally, use the Softymo cleaning oil. You don't need a lot, and it's reasonably priced.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "flyasfuk",
        "body": "Muji cleansing oil (27€ 400ml):\n\nOlive Oil, Octyl Palmitate, Sorbeth-30 Tetraoleate, Polysorbate 80, Sorbitan Oleate, Water, Pentylene Glycol, Tocopherol, Glycosyl Trehalose, Butylene Glycol, Hydrogenated Starch Hydrolysate, Glycerin, Polyquaternium-51, Grapefruit Seed Extract, Purslane (Portulaca Olearcea) Extract\n\nIt has no perfume and emulsifies really well",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "terpsykhore",
        "body": "Following! I also still miss the cheap Nivea especially. I’ve used the Geek & Gorgeous balm which is okay and currently Softymo Speedy cleansing oil. It’s more expensive than the G&G but I find it’s more economical to use because of the pump and liquid consistency. But still three times more expensive than the Nivea :(",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HaircareScience",
    "post_id": "8059sp",
    "title": "Allergy to ammonia?",
    "url": "https://www.reddit.com/r/HaircareScience/comments/8059sp/allergy_to_ammonia/",
    "score": 11,
    "num_comments": 5,
    "created": "2018-02-25T15:57:50+00:00",
    "body": "About 5 years ago I became allergic to hair dyes. I'm starting to go grey now so my henna is getting very orange, and adding indigo just makes it too dark. So I' looking at possibly dyeing with chemical dyes again.\nMy allergies seem to be caused by \"lightnening hair dyes\" or the cream part in prelightners. For example I had a bad reaction to a skin test with Garnier pre-lightnener. \n\nThese are the ingredients: \n484559 - Pre Lightening Cream: Aqua / Water, Cetearyl Alcohol, Propylene Glycol, Deceth-3, Laureth-12, Ammonium Hydroxide, Oleth-30, Lauric Acid, Glycol Distearate, Polyquaternium-22, Ethanolamine, Silica Dimethyl Silylate [Nano], Pentasodium Pentetate, Alpha-Isomethyl, Ionone, Carbomer, Vitis Vinifera Seed Oil / Grape Seed Oil, Parfum / Fragrance \nRead more at http://www.boots.com/garnier-nutrisse-truly-blonde-creme-pre-lightener-10087856#gBeIKpPssPdoXFlb.99\n\nI googled all of the ingredients and the only potential allergen/skin irritant is the ammonia as far as I can tell. Unless I'm missing something?\n\nAnyone had a similar reaction to lightning products?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "iamdisillusioned",
        "body": "Yes, ammonia can be irritating to any scalp. I've heard many people that develop allegies to hair color have problems with the aniline derivatives in the dye.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "EricJamesHair",
        "body": "I would look at Wella Innosence,  The majority of my clients have allergic reactions to PPD and PTD not Ammonia, BUT Ammonia can be an irritant. I would say have a patch test done at a professional salon and see what happens. Also professional products (not Garnier) will have higher quality ingredients. Good luck!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "gayshitlord",
        "body": "Go to a professional salon that has ammonia free dyes, tell them about your henna and everything else you have done to your hair.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "goody-goody",
        "body": "You'll need to get that Henna cut off prior to using a professional tint, sorry to say. Look for a colorist that uses O&M or Kevin Murphy color.me hair color. Zero ammonia and super shiny.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "vividamnesia",
        "body": "I use ( in my salon) Farouks \"CHI Ionic permanent haircolor\" It is ammonia free & acts just like traditional ammonia based color. It covers grey the best out of all the ammonia free lines....I've tried a few over the years! It is a pro line but you may be able to find it online. I think Sally's carries it http://premierhairstudioboise.com/wp-content/uploads/2015/02/CHI-ionic-2.jpg?quality=100.3015041915161 They have their own cream developers in 10-40vol but I have used it with any traditional cream based developer with success. Do a skin/test patch first! My ammonia sensitive clients love it!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "lgs1n1",
    "title": "Recommendations for moisturizer with spf",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/lgs1n1/recommendations_for_moisturizer_with_spf/",
    "score": 8,
    "num_comments": 21,
    "created": "2021-02-10T11:51:09+00:00",
    "body": "Being homemakers we spent our maximum time indoors. with very little sky exposure using seperate sunscreen seems futile to me. Rather we can use moisturizer with spf.\n Below is the list I have curated from various sources but I am unable to choose from them. I am currently bf so is little cautious about ingredients. I have normal to dry skin.\n\n1. Episoft ac spf 30 ₹525/75gm\nIngredients:Purified Water, Ethylhexyl Methoxycinnamate,Benzophenone-3,Butyl Methoxydibenzoylmethane,Capric/ Caprylic Triglycerides, Glycerin, Propanediol, Propylene Glycol, Hydroxyethyl Acrylate. Sodium Acryloyldimethyl Taurate Copolymer,D-Panthenol,Diazolidinyl Urea, Disodium EDTA\nPros: raved by ShwetaVijay,decent spf and boot rating\nCons: contains Benzophenone-3\n\n2. Facemoist spf 15 ₹425/60gm\nIngredients:Allantoin, Aloe Vera,Peg-100 Stearate, Avobenzone, CCTG (Caprylic/CapricTriglycerides), Cetyl Alcohol, D.Panthanol, Dimethicone, Disodium Edetate, Glabridin (Licorice Extract), Glycerin, Glyceryl Monostearate, Grape Seed Oil, Isopropyl Myristate, Kokum Butter, Niacinamide, Octyl Methoxycinnamate, Olive Oil, Oxybenzone, Propylene Glycol, Prunus Amygdalus Dulcis Oil, Rice Bran Oil, Sepiplus 400, Sesarash, Simmondsia Chinesis Seed Oil, Sodium Hyaluronate, Sodium PCA, Stearic Acid, Triticum Vulgare Germ Oil, Vitamin E Acetate Fragrance, Purified Water\nPros: recommended by Shweta Vijay\nCons: less spf, contains Oxybenzone, fragrance\n\n3. Simple light protecting spf 15 ₹395/125 gm\nIngredients: Aqua, Ethylhexyl Salicylate, Glycerin, Stearic Acid, Butyl Methoxydibenzoylmethane, Phenylbenzimidazole Sulfonic Acid, Glycol Stearate, Octocrylene, PEG-100 Stearate, Dimethicone, Allantoin, BHT, Bisabolol, Caprylyl Glycol, Carbomer, Cetyl Alcohol, Disodium EDTA, Glyceryl Stearate, Panthenol, Phenoxyethanol, Potassium Carbonate, Potassium Hydroxide, Sodium Hydroxide, Stearamide AMP, Tocopheryl Acetate, Xanthan Gum. \nPros: good ingredients,cheap\nCons: less spf, may be less hydrating\n\n4. Aromamagic aloevera sunscreen spf 20 ₹180/50 gm\nIngredients:Purified water, organic beeswax, aloe barbadensis gel, zinc oxide, persea gratissima oil, vegetable glycerin, Triticum vulgare germ oil, calendula officinalis essential oil, vitis vinifera seed oil, ascorbic acid, anthemis nobilis essential oil, mentha piperita essential oil, sodium riboflavin phosphate, aloe barbadensis leaf extract, panthenol\nPros: cheap, physical\nCons: contain peppermint oil \n\nHave you used any of the above? Please share your experiences and help me choose. Any other recommendations are also welcomed.",
    "flair_text": "General Discussion",
    "flair_template_id": "be47b7e8-2aae-11e8-9065-0e37aceca9de",
    "comments": [
      {
        "author": "oilinfinityskin",
        "body": "I've used episoft moisturizer SPF. It is the only chemical sunscreen which does not cause breakouts usually. I love it. It is fragrance free too. Honestly any chemical sunscreen burns near my eyes so that's that. Otherwise it's good.",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "TrackThat8812",
        "body": "As a dry skin girl i love the episoft 30 as my moisturiser + sunscreen for when I’m staying at home. It’s my HG product.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "kyralkat",
        "body": "I've been using the episoft one for a while now. I am prone to fungal acne on my forehead and it did not trigger it nor did it break me out. It does make your face shiny though, not sure it oily skin folks would like that. Great indoor suncreen 🙌🏼",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "calypsohadley",
        "body": "Episoft is great for normal-dry skin, it's very moisturizing, leaves no whitecast, doesn't sting, is very easy to apply. But I'd only recommend it for use indoors because unless your skin is like sahara desert dry, it's gonna make you look greasy.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "HiImNoob11",
        "body": "https://www.reddit.com/r/IndianSkincareAddicts/comments/sxpwkt/my_doctor_recommended_this_please_give_your/?utm_medium=android_app&utm_source=share",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Suspicious-Egg-2648",
        "body": "Hey hi OP have any of them any good . Im here trying to find some good moisturiser with spf. Thank you",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 6,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "dhup7v",
    "title": "[Product Question] Anyone have thoughts on these new *affordable* bakuchiol products?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/dhup7v/product_question_anyone_have_thoughts_on_these/",
    "score": 5,
    "num_comments": 4,
    "created": "2019-10-14T18:24:06+00:00",
    "body": "I noticed bakuchiol is getting a lot of buzz and I'm happy to see some more affordable options becoming available at in-store retailers! Has anyone tried any of the following? Anyone seen any others which look interesting?\n\n&#x200B;\n\n* Inkey List - [Bakuchiol](https://www.sephora.com/product/bakuchiol-P447778?icid2=products%20grid:p447778:product) \\- 1oz, $9.99 available at Sephora\n   * More of a moisturizer texture\n   * Claims: Bakuchiol-Helps to reduce the appearance of fine lines and wrinkles. Squalane-Helps to hydrate and protect the skin. Sacha Inchi Oil - Nurtures the skin with Omega-3.\n   * Ingredients:  Water (Aqua), Squalane, Glycerin, Propanediol, Plukenetia Volubilis Seed Oil (Sacha Inchi oil), Dicaprylyl Carbonate, Bakuchiol, Phenoxyethanol, Sodium Caproyl Prolinate, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, Carbomer, Sodium Hydroxide, Ethylhexylglycerin, Sodium Stearoyl Glutamate, Polysorbate 60, Phytic Acid, Glyceryl Polyacrylate, Sorbitan Isostearate, Tocopherol.\n* Revolution Skincare - [1% Bakuchiol Serum](https://www.ulta.com/1-bakuchiol-serum?productId=pimprod2008981) \\- 1oz, $14.00, available at Ulta\n   * Thinner lotion texture\n   * Claims:  Works to reduce the appearance of fine lines and discourages uneven skin tone. Gentle on the skin and formulated with grape seed oil an antioxidant with moisturizing properties.\n   * Ingredients:  Aqua (Water, Eau), Propanediol, Isopropyl Myristate, Caprylic/Capric Triglyceride, Vitis Vinifera Seed Oil, Bakuchiol, Phenoxyethanol, Polyacrylamide, Xanthan Gum, C13-14 Isoparaffin, Titanium Dioxide, Laureth-7, Ethylhexylglycerin, Ci 17200 (Red 33), Ci 42090 (Blue 1).\n* Indeed Labs - [Bakuchiol Reface Pads](https://www.ulta.com/bakuchiol-reface-pads?productId=pimprod2006508) \\- 30 pads, $19.99, available at Ulta\n   * Watery serum in pad form, also contains niacinamide\n   * Claims:  Will not increase photosensitivity and are safe and gentle enough for daytime and daily use. Improves skin texture, cell turnover, collagen building, photo-ageing and acne. Anti-irritant and soothing ingredients ensure minimal to no skin irritation or discomfort. Suitable for all skin types including sensitive and acne prone and are ideal for those with skin concerns such as wrinkles, fine lines, UV damage, uneven surface texture, acne and acne scarring\n   * Ingredients: Aqua (Water), Niacinamide, Caprylyl/Capryl Glucoside, Bakuchiol, Hydroxyacetophenone, Phenoxyethanol, Allantoin, Heptyl Glucoside, Sodium Benzoate, Sodium Cocoyl Glutamate, Ethylhexylglycerin, Citric Acid, Glyceryl Caprylate, Polyglyceryl-6 Oleate, Disodium Edta, Sodium Hydroxide, Sodium Surfactin, Heptanol.\n* Pacifica - [Future Youth Crystal Ball Serum](https://www.ulta.com/future-youth-crystal-ball-serum?productId=pimprod2004041) \\- 0.6oz, $16.00, available at Ulta\n   * Watery serum in a \"soothing amethyst crystal\" (eyeroll) roller ball applicator, contains \"natural parfum\"\n   * Claims:  Supercharged serum with natural bakuchiol extract, hyaluronic acid and sugar (??)\n   * Ingredients:  Aqua, Sucrose, Bakuchiol, Sodium Hyaluronate, Quartz Powder, Glycerin, Xanthan Gum, Phenoxyethanol, Ethylhexylglycerin, Parfum (Natural).\n* Burt's Bees - [Renewal Intensive Firming Serum](https://www.cvs.com/shop/burt-s-bees-renewal-intensive-firming-serum-1-oz-prodid-360648) \\- 1oz, $20.99, available at CVS and Target\n   * Watery Serum, contains \"natural fragrance\", there's another version in this line called dark spot correcting serum which looks pretty much the same but also includes a water-soluble vitamin c.\n   * Claims:  The anti-aging serum works with your skin to improve it's elasticity and firmness while reducing the appearance of deep lines and wrinkles. Restore a fresh youthfulness to your face and reveal skin that looks beautifully regenerated and glowy with this nutrient-rich serum made from 98.6 natural origin.\n   * Ingredients:  Water, helianthus annuus (sunower) seed oil, glycerin, silica, bakuchiol, tocopherol, hydrolyzed f-fucoidan, citric acid, gellan gum, xanthan gum, lauryl glucoside, myristyl glucoside, polyglyceryl-6 laurate, fragrance\\*, potassium sorbate, sodium benzoate, phenoxyethanol, eugenol, geraniol, limonene, linalool \\*natural fragrance",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "quuuark",
        "body": "Michelle Wong, the genius behind Lab Muffin Beauty Science recently did a blog about this!! \n\n [https://labmuffin.com/bakuchiol-better-than-retinol/](https://labmuffin.com/bakuchiol-better-than-retinol/)",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "fraufrau",
        "body": "I use the inkey list product. I purchased it because I could’t deal with the photosensitivity and peeling/burning/redness. I live in Arizona.  I have sensitive skin and this hasn’t broken me out. It has made my lips peel though. I’m not a huge fan of lip balm. \n\nI’ve been using it for almost two months twice a day with nothing else except for Supergoop’s mineral matte tinted sunblock during the daytime. I’m still using the same bottle. I don’t have to use very much. Product is white and has a moisturizer consistency. Spreads easily. Very little smell unlike the very chemical-smells of TO retinol products. It’s easy to get too much product out of the little container. \n\nThis gives me similar results to The Ordinary’s granactive retinoid 2% emulsion that uses an encapsulated form of retinol so it is less irritating. I haven’t gotten any bad photosensitivity from it which is nice unlike retinol. \n\nThis gave me a lot of smoothness like the ordinary’s above mentioned product, but I still haven’t seen a big change in scars. I didn’t see a big change with my scars or discoloration/uneveness with other retinol products. I don’t have wrinkles so I can’t say anything about that. \n\nI wouldn’t say this is enough alone as a moisturizer if you have dry skin. My skin is normal to dry and I’m okay with putting on a second layer in areas that are drier. No greasiness. Absorbed by my skin quickly. I’ll probably have to go back to putting my Saturday skin glacial water cream and or my le prunier plum elixir on in the next few months though. \n\nIt’s really cheap and I like that it gives my skin a poreless look. I think I’ll keep buying it until something nicer comes along without EOs and other irritants.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/dhlc2v/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "xcicee",
        "body": "Super interested in the answers! Someone did a detailed positive review of the inkey list recently.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "qz7qcf",
    "title": "[Product Question] Alternative to Skinceuticals Emollience? Love it, but the $$!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/qz7qcf/product_question_alternative_to_skinceuticals/",
    "score": 5,
    "num_comments": 8,
    "created": "2021-11-21T23:46:56+00:00",
    "body": "I love how my skin feels and looks with this, but I can’t justify $134 AUD a jar. Anyone know of a similiar moisturiser? \n\nAlso, I’ve gone through the wiki on moisturisers, but I’m not sure what kind of moisturiser Emollience is, despite the name. I’ve tried other drugstore oil-based moisturisers but they aren’t nearly as good. I may be a bit confused, but if I could understand the type perhaps I could understand why my skin likes it so much and that would make finding an alternative easier. Any help on that would also be appreciated!\n\nIngredients: Aqua/​Water/​Eau, Glycerin, Sesamum Indicum Oil/​Sesame Seed Oil, Propylene Glycol, Glyceryl Stearate, Vitis Vinifera Seed Oil/​Grape Seed Oil, Rosa Canina Fruit Oil, Macadamia Ternifolia Seed Oil, Mangifera Indica Seed Butter/​Mango Seed Butter, Stearic Acid, Palmitic Acid, Triethanolamine, Caprylic/​Capric Glycerides, Phenoxyethanol, Panthenol, Carbomer, Chlorphenesin, Caprylyl Glycol, Aloe Barbadensis /​ Aloe Barbadensis Leaf Juice, Disodium EDTA, Allantoin, Laminaria Ochroleuca Extract, Ginkgo Biloba Extract /​ Ginkgo Biloba Leaf Extract, Chlorella Vulgaris Extract, Algae Extract",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "makesuretohydrate",
        "body": "It seems like your skin really likes one or a combination of the oils they use in this moisturizer. You should look fo products that contain these oils:\n\nFrom highest concentration to lowest concentration: sesame oil, grape seed oil, rosehip oil, macadamia nut oil, mango seed butter\n\nMany moisturizers that have a similar ingredient list to Emollience are quite pricey or hard to purchase in Australia). So while they are not perfect dupes, here are some I found that contain some of the ingredients that you’re looking for.\n\nKiehl's Centella Sensitive Cica-Cream (A$62)\n- Similar oil ingredient(s): sesame oil\n- Fragrance free.\n\nAesop Mandarin Facial Hydrating Cream (A$55)\n- Similar oil ingredient(s): rose hip oil, sesame oil\n- Contains fragrance: mandarin peel oil, citral, linalool\n\nSukin Australia:\nSukin carries a lot of beauty products that use sesame oil as a main ingredient (within the first 3 ingredients) and rose hip oil just like Skinceutical’s Emollience. This includes moisturizers, night creams, cleansers, body lotions, etc. In my opinion, their formula looks the closest to emollience. This would be my top recommendation.\n\nIf you can handle fragranced products:\nSukin Purely Ageless Rejuvenating Day/Night Cream (A$17.46)\n- Similar oil ingredient(s): sesame, rose hip, macadamia\n- Contains fragrance: limonene, linalool\n\nIf you prefer fragrance free:\nSukin Sensitive Facial Moisturizer (A$11.95)\n- Similar oil ingredient(s): sesame, rose hip\n- Fragrance free.\n\nAnother option for you could be to purchase premixed or single ingredient face oils that include these ingredients and mix or layer them with any moisturizer. \n\nFor example: Since the Sukin moisturizers don’t contain grape seed oil, and it seems like there’s a high concentration of that in Emollience, you could purchase a generic bottle of (face safe) grape seed oil and mix a few drops into the sukin moisturizer of your choice. This would probably mimic Emollience very closely. \n\nExamples of premixed face oils: \n\nPalmers Rosehip Skin Therapy Face Oil (A$17.99)\n- Similar oil ingredient(s): Grape seed, macadamia, sesame, rose hip\n- Heavily fragranced\n- Contains coconut oil\n\ne.l.f. Nourishing Facial Oil (A$13.20)\n- Similar oil ingredient(s): Rose hip, grape seed\n- Fragrance free.\n\nI’ve also heard of people buying all of the single ingredient facial oils they need and mixing a custom bottle for themselves, this would likely be the most inexpensive way to go about it but I don’t know much about the process. \n\nHope this helps!",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Informal_Geologist42",
        "body": "[https://m.maccosmetics.com.au/product/13824/13268/products/skincare/moisturisers/complete-comfort-creme](https://m.maccosmetics.com.au/product/13824/13268/products/skincare/moisturisers/complete-comfort-creme) \n\nCan I suggest this MAC complete comfort moisturizer. it’s bomb.   \n\n\nalso weleda Skinfood?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "tofumeatballcannon",
        "body": "This skinceuticals product is sooooo overpriced for what it is.  They do have cutting edge science backed products but this isn’t one of them.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Shot_Friend4391",
        "body": "Now that you are a couple years out, what product did you go with? I’m trying to find a dupe because of how expensive it is!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 5,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "BeardTalk",
    "post_id": "uuz8w1",
    "title": "Help picking beard oil, please!",
    "url": "https://www.reddit.com/r/BeardTalk/comments/uuz8w1/help_picking_beard_oil_please/",
    "score": 5,
    "num_comments": 5,
    "created": "2022-05-22T00:02:14+00:00",
    "body": "Hey guys, i have bought two beard oil brands and been wondering which one of these is the best, here are the ingredients, of anyone can help me pick please! Or teach how to identify good ingredients.\n\nBrand 1: helianthus annuus seed oil, vitis vinifera seed oil/grape seed oil, cyclomethiconas, ricinus communiseed oil, essence cocos nucifera-vainillin.\n\nBrand 2: crambe abyssinica seed oil, simmondsia chinesis seed oil, prunus amygdalus dulcis oil, ethylhexyl cocoate, diisostearyl malate, parfum, tocopherol, helianthus annuus (sunflower) seed oil, BHT, linalool, eugenol, limonene.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Findley563",
        "body": "So, to be completely honest with you, beard oil is subjective. Not all oils work the same on everyone. And the only way you are going to find what works best for you, is to try a bunch and watch the ingredients. Note what works and what doesnt. You will eventually have a handful of companies that you have to go to and wont want to use anything else. Best of luck.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "KBGtheMemeLord",
        "body": "Honest Amish Premium is the only oil I use.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "twineffect",
        "body": "What brands are they? Some brands are just known to be trust worthy and some aren't. There are some very common base oils that get used, and I see none of them in those lists!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "poopsmcgeehere",
        "body": "I would absolutely not use either of those brands, ever. Those both sound absolutely terrible.  A great place to start would be to follow DanC Bearded on YouTube https://youtube.com/c/DanCBearded. He is extremely knowledgeable and has videos explaining a ton of different carrier oils and the benefits of each, as well as discussing different brands. \n\nA great starter brand would be Fable Beard Co. https://fablebeardco.com/ But if you want to go for the best of the best right off the bat,  which is what I wish I did, try Black Rebel Beard Co. https://r.efer.me/6201722175738",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "10un26o",
    "title": "No-poo/claryfing shampoo UK",
    "url": "https://www.reddit.com/r/NoPoo/comments/10un26o/nopooclaryfing_shampoo_uk/",
    "score": 3,
    "num_comments": 1,
    "created": "2023-02-05T20:48:29+00:00",
    "body": "Hi I've read through the wiki and saw VO5 were recommended. Just seen this one on amazon for £1.10 (bargain). I'm hoping I'll only need it for one good wash. Would it be appropriate? I did use the search and it said probably ok but just wanted some advice off the gurus 😊 Thanks \n\nVO5- Nourish my shine\n\nAqua Sodium Laureth Sulfate Sodium Chloride Cocamidopropyl Betaine Glycerin Argania Spinosa Kernel Oil Helianthus Annuus Seed Oil Hydrolyzed Keratin Persea Gratissima Oil Prunus Armeniaca Kernel Oil Rosmarinus Officinalis Leaf Extract Simmondsia Chinensis Seed Oil Vitis Vinifera Seed Oil Guar Hydroxypropyltrimonium Chloride Magnesium Nitrate PEG-45M Parfum Carbomer Magnesium Chloride PPG-12 Dimethiconol PEG-20 Castor Oil TEA-Dodecylbenzenesulfonate TEA-Sulfate Disodium EDTA Glycol Distearate Mica Silica Sodium Sulfate Citric Acid Sodium Hydroxide Triethanolamine DMDM Hydantoin Methylchloroisothiazolinone Methylisothiazolinone Phenoxyethanol Potassium Sorbate Sodium Benzoate Benzyl Alcohol Butylphenyl Methylpropional Hexyl Cinnamal Limonene CI 77891",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "shonaich",
        "body": "Unfortunately that one has dimethiconol in it, a silicone. Try one of the more basic ones instead. I just checked and they don't have silicone. Like this one\n\nhttps://www.cvs.com/shop/vo5-daily-revitalizing-shampoo-15-oz-prodid-308886",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "HairDye",
    "post_id": "uubls7",
    "title": "Does Garnier Nutrisse's 210 have any lightening ingredients?",
    "url": "https://www.reddit.com/r/HairDye/comments/uubls7/does_garnier_nutrisses_210_have_any_lightening/",
    "score": 3,
    "num_comments": 0,
    "created": "2022-05-21T00:27:23+00:00",
    "body": "Hi, i'm looking to dye my darkest brown/black hair with Garnier Nutrisse's 210 blue black. I **don't** want it bleaching my hair at all in a way that the colour fades to lighter than my natural hair. Can anyone who's used it or knows what they're looking at say if it will?\n\n1053057 – NOURISHING COLOUR CREAM / CRÈME COLORANTE NUTRITIVE : AQUA•CETEARYL ALCOHOL•PROPYLENE GLYCOL•DECETH-3 •LAURETH-12•AMMONIUM HYDROXIDE•OLETH-30•LAURIC ACID•HEXADIMETHRINE CHLORIDE•GLYCOL DISTEARATE•POLYQUATERNIUM-22•2,4- DIAMINOPHENOXYETHANOL HCl•ETHANOLAMINE•SILICA DIMETHYL SILYLATE•CI 77891•ASCORBIC ACID•SODIUM METABISULFITE•THIOGLYCERIN •TOLUENE-2,5-DIAMINE•DIMETHICONE•PENTASODIUM PENTETATE•N,N-BIS(2-HYDROXYETHYL)-p-PHENYLENEDIAMINE SULFATE•CARBOMER •RESORCINOL•VITIS VINIFERA SEED OIL•PARFUM. (FIL C26169/10) 178914U – CREAM DEVELOPER / RÉVÉLATEUR CRÈME : AQUA•HYDROGEN PEROXIDE•CETEARYL ALCOHOL•TRIDECETH-2 CARBOXAMIDE MEA•CETEARETH-25•GLYCERIN•PENTASODIUM PENTETATE•SODIUM STANNATE•TETRASODIUM PYROPHOSPHATE•PHOSPHORIC ACID. (FIL K56/35) 1051655F – RICH NOURISHING CONDITIONER CREAM / SOIN CRÈME RICHE NOURRISSANT : AQUA•CETEARYL ALCOHOL•BEHENTRIMONIUM CHLORIDE•PEG-180•CETYL ESTERS•NIACINAMIDE•RIBES NIGRUM OIL•SACCHARUM OFFICINARUM EXTRACT•HYDROXYETHYLCELLULOSE•OLEA EUROPAEA OIL•TRIDECETH-6•CHLORHEXIDINE DIHYDROCHLORIDE•CAMELLIA SINENSIS LEAF EXTRACT•BENZYL ALCOHOL•LINALOOL•AMODIMETHICONE•ISOPROPYL ALCOHOL•PYRUS MALUS EXTRACT•PYRIDOXINE HCl•PERSEA GRATISSIMA OIL•METHYLPARABEN•BUTYROSPERMUM PARKII BUTTER•CITRIC ACID• CETRIMONIUM CHLORIDE•BUTYLPHENYL METHYLPROPIONAL•CITRUS MEDICA LIMONUM PEEL EXTRACT•PARFUM. (FIL K161805/4)",
    "flair_text": ":txt: Question",
    "flair_template_id": "8e1f8a30-b3da-11e9-9adb-0efd305d1176",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1g2brz",
    "title": "Anyone have experience with the latest cult must-haves? Emma Hardie Cleansing Balm and Biologique Recherche P50 exfoliator?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1g2brz/anyone_have_experience_with_the_latest_cult/",
    "score": 3,
    "num_comments": 3,
    "created": "2013-06-10T19:27:17+00:00",
    "body": "It feels like more and more beauty articles/bloggers/gurus are going apeshit for both of these (very pricey) items. It doesn't help that both are perpetually sold out and backordered everywhere. So I was wondering if any of the sane, level-headed folks here have had any experience with either of these?\n\n\n[Emma Hardie Natural Lift Moringa cleansing balm](http://uk.spacenk.com/Natural-Lift-Moringa-Cleansing-Balm/MUK200005032,en_GB,pd.html?start=5&cgid=SPUK3010102)\n\nIngredients: \nVitis Vinifera Seed Oil Prunus Amygdalus Dulcis Oil Caprylic/Capric Triglyceride Cetearyl Alcohol Peg-8 Beeswax Peg-6 Caprylic/Capric Glycerides Sorbitan Stearate Peg-60 Almond Glycerides Limonene Citrus Aurantium Dulcis Oil Silica Glycerin Phenoxyethanol Benzyl Alcohol Lecithin Citrus Aurantium Bergamia Oil Aqua Citrus Aurantium Amara Oil Juniperus Virginiana Oil Citrus Nobilis Oil Crithmum Maritimum Extract Linalool Butylene Glycol Octyldodecyl Pca Menthyl Pca Ascorbyl Palmitate Helianthus Annuus Seed Oil Tocopherol Moringa Pterygosperma Extract Geraniol Jasminum Officinale Oil Farnesol Disodium Phosphate Rosa Damascena Oil Citric Acid Citral Citronellol\n\n\n\nAnd the exfoliant: [Biologique Recherche P50 lotion](http://www.biologique-recherche.com/produit.php?pro_id=75). Here is the [CosDNA on the ingredients](http://www.cosdna.com/eng/cosmetic_86c952515.html) (not copy-paste friendly).",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "nihilcupio",
        "body": "The \"Caroline Hirons effect\". Overpriced, over hyped but not bad products.",
        "score": 3,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "5jeyvp",
    "title": "[Product Question] Body AHAs: Paula's Choice 10% vs Alpha Skincare (formerly Alpha Hydrox) 12%?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/5jeyvp/product_question_body_ahas_paulas_choice_10_vs/",
    "score": 3,
    "num_comments": 1,
    "created": "2016-12-20T18:48:38+00:00",
    "body": "Has anyone ever tried both the Paula's Choice RESIST Skin Revealing Body Lotion With 10% AHA and the Alpha Skin Care Revitalizing Body Lotion 12% AHA? I'm looking to buy an AHA body lotion and I know the PC one has a lot of love, but the Alpha has a higher concentration of acid and is less expensive for more product. \n\nHere's an ingredient comparison:\n\n* **Paula's Choice** Water, Glycolic Acid , Cyclopentasiloxane , Dimethicone, Glycerin, Glyceryl Stearate, Stearic Acid, Cetyl Alcohol, Butyrospermum Parkii, Sodium Hydroxide, PEG-100 Stearate, Tetrahexyldecyl Ascorbate, Tocopheryl Acetate, Chamomilla Recutita Matricaria Flower Extract, Vitis Vinifera Seed Oil, Camellia Oleifera Extract, Epilobium Angustifolium Flower/Leaf/Stem Extract, Butylene Glycol, Xanthan Gum, Disodium EDTA, sodium benzoate, phenoxyethanol\n\n* **Alpha Skin Care** Water, Petrolatum, Glycolic Acid, Glycerin, Ammonium Hydroxide, Stearic Acid, Dimethicone, Mineral Oil, Cetyl Alcohol, Glyceryl Stearate, PEG-100 Stearate, Lanolin Alcohol, PEG-40 Stearate, Sorbitan Stearate, Propylene Glycol, Diazolidinyl Urea, Idopropynl Butylcarbmate\n\nI don't mind losing the botanical extracts for a more effective acid, if that's the only trade-off. Any insight is appreciated!",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "green-nalgene",
        "body": "I picked up the alpha AHA body lotion and it is great! It really helped with some KP on my legs. I didn't even have to use it every day to see a difference. Not sure about the PC but I can vouch for the Alpha being a good product. There are no frills to it but it definitely does exfoliate.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "d2o5ec",
    "title": "Washing curls with shampoo bar - does it get better?",
    "url": "https://www.reddit.com/r/curlyhair/comments/d2o5ec/washing_curls_with_shampoo_bar_does_it_get_better/",
    "score": 3,
    "num_comments": 4,
    "created": "2019-09-11T10:45:50+00:00",
    "body": "Hello r/curlyhair, this is my first post here.\n\nLately I’ve been trying to make my routine more environment-friendly (and hair- friendly!) by switching to solid shampoo. So I’ve purchased the first one that was available to me locally, which was Balade en Provence brand. On paper it seemed great - 100% vegan, ethically made in France, no harsh ingredients (list included below) and all that jazz.\n\nBut after few tries the effects are... underwhelming to say the least. Granted, I’m aware that after years of using regular shampoos, it takes some getting used to for the hair and scalp to work with milder cleaning agents and that I shouldn’t give up just yet, but I’d really love an opinion from curlies who have more experience with shampoo bars than I do. Is it my technique that’s wrong or is this shampoo just not suited for my hair?\n\nMy complaints/questions are as follows:\n\n- I can’t get the bar to lather well. I’ve tried both rubbing it against my hair and lathering it in my hands first and then putting it in my hair but in either case the foam disappears very quickly and I don’t feel like I’ve actually washed my hair clean\n\n- I’m rinsing A LOT, way more than with regular shampoo, but this one seems to make a gummy layer in my hair that doesn’t wash out with water. When it’s soaked, my hair feels nice and soft, but once it dries even a little bit, the gummy feeling returns\n\n- My hair takes much longer to air dry, but once it finally does, the length and ends are nice enough, with good definition but my roots still feel a little gummy and look stringy and flat. Not a great look, overall. I can tell that the shampoo is still there, because I can smell it when I run my hands through my hair. How the hell do I get it to rinse?\n\n- Can I still put oil in my hair before washing it with a shampoo bar? I feel like it makes all of the above effects worse.\n\n- Should I cut down on styling products? So far I can’t imagine a shampoo bar could deal with product buildup well.\n\nAny advice is much appreciated!\n\nFor reference, I have long, fine (but lots of it) 2c/3a type, medium porosity hair and the products I normally use are:\n\n- Garnier Fructis Hair Food Aloe Multi-Purpose Mask\n\n- Boots Essentials Curl Creme\n\n- Umberto Giannini scrunching jelly\n\n- Umberto Giannini Weather Proof Curls finishing cream\n\n- Organix Coconut Water, Hydration Oil for the ends\n\n- walnut oil before washing\n\nAnd the shampoo bar ingredient list:\nCocos nucifera oil, Vitis vinifera seed oil, Aqua, Sodium hydroxyde, Butyrospermum parkii butter, Brassica campestris seed oil, Limonene, Citrus nobilis peel oil, Citrus paradisi peel oil, Citrus sinensis peel oil expressed, Illite, Eugenia caryophyllus bud oil, Pinus sylvestris oil, Eugenol.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "msmalleable",
        "body": "The issue people tend to have with shampoo bars is that they are not pH balanced for the hair, which can cause dryness and other issues. This page explains it well: [https://ethique.com/blogs/how-to/why-are-our-bars-so-much-more-than-other-shampoo-bars](https://ethique.com/blogs/how-to/why-are-our-bars-so-much-more-than-other-shampoo-bars) . The shampoo bar you are using is basically a soap (contains sodium hydroxide) so the pH is likely way too high for your hair. I have also had this issue with Chagrin Valley shampoo bars. I would recommend trying a shampoo bar that does not have sodium hydroxide in its ingredients.\n\n&#x200B;\n\nI have similar hair to yours and I get good results just cowashing and using a curl cream or mousse. I hope this comment was helpful!",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlygirl",
    "post_id": "hm0e3i",
    "title": "I can't tell if this will work as a reset shampoo?",
    "url": "https://www.reddit.com/r/curlygirl/comments/hm0e3i/i_cant_tell_if_this_will_work_as_a_reset_shampoo/",
    "score": 3,
    "num_comments": 0,
    "created": "2020-07-06T03:46:10+00:00",
    "body": "Hi, I bought [this](https://www.amazon.ca/Live-Clean-Restorative-Shampoo-Conditioner/dp/B07121T2GR) intending it to be a reset shampoo but now I'm unsure because '[isitcg.com](https://isitcg.com/)' is telling me it's CG approved. It has no silicone, and has Sodium Lauryl Sulfoacetate and Sodium Methyl 2-Sulfolaurate which the site lists as a cleansing agent (to be used with caution) and a gentle cleanser.\n\nHere's the full list of ingredients:  \nAqua, Sodium Lauryl Sulfoacetate, Cocamidopropyl Betain, Sodium Methyl 2-Sulfolaurate, Argaania Spinosa Kernel, Vitis Vinifera Seed Oil, Olea Europaea Fruit Oil, Vitis Vinifera Seed Extract, Olea Europaea leaf extract, Argania Glycol Distearate, Glycerin, Glyceryl Oleate, Coco Glucoside, Glyceryl Stearate, Phenoxyethanol, Ethylhexylglycerin, Potassium Sorbate, Sodium Benzoate, Benzoic Acid, Benzyl Benzoate, Hexyl Cinnamal, Parfum, Citric acid, soduim hydroxide.\n\n  \nThe product is Live Clean Exotic Nectar Argan Oil Restorative Shampoo.  \nIf it's not qualified for reset, could I use this as a low-poo? (My hair is type 2 wavy.)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "beardoil",
    "post_id": "bj3dpu",
    "title": "List of 18 new oils with the ingredients",
    "url": "https://www.reddit.com/r/beardoil/comments/bj3dpu/list_of_18_new_oils_with_the_ingredients/",
    "score": 3,
    "num_comments": 16,
    "created": "2019-04-30T13:35:02+00:00",
    "body": "[Here's](https://www.reddit.com/r/beardoil/comments/bfcnzh/im_so_excited_i_finally_found_a_shop_with_many/) the link to the first list with 8 oils and relative ingredients.\n\nI found other oils and collect all the ingredients to understand which one is the best and which one the worst. Any comment that could help in this is really appreciated.\n\nThese oils are the ones you can find in a shop or online and are not home made.\n\n&#x200B;\n\n**Oil 9**\n\nEthylhexyl Stearate\n\nOctyldodecanol\n\nHelianthus Annuus Seed Oil\n\nCoco-Caprylate/Caprate\n\nArgania Spinosa Kernel Oil\n\nPrunus Amygdalus Dulcis Oil\n\nSimmondsia Chinensis Seed Oil\n\nParfum\n\nTocopherol\n\nLinalool\n\nLimonene\n\nHexyl Cinnamal\n\n&#x200B;\n\n**Oil 10**\n\nIsopropyl Palmitate\n\nCaprylic/Capric Triglyceride\n\nPolybutene\n\nAlcohol Denat\n\nParfum / Fragrance\n\nCaprylyl Glycol\n\nBenzyl Salicylate\n\nPentaerythrityl Tetra-Di-Tbutylhydroxyhydrocinnamate\n\nButyrospermum Parkii Butter / Shea Butter\n\nBenzyl Alcohol\n\nLimonene\n\nCoumarin\n\nAlpha-Isomethyl Ionone\n\nCedrus Atlantica Bark Oil\n\nLinalool\n\nEugenol\n\nCinnamal\n\nEucalyptus Globulus Leaf Oil\n\nFusanus Spicatus Wood Oil\n\nCitronellol\n\nTocopherol\n\nCitric Acid\n\n&#x200B;\n\n**Oil 11 Natural**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nArgania Spinosa Kernel Oil\n\nPrunus Armeniaca (apricot) Kernel Oil\n\nTocopherol\n\n&#x200B;\n\n**Oil 11 Cocos**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nParfum (fragrance)\n\nCocos Nucifera (coconut) Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nCoumarin\n\nTocopherol\n\n&#x200B;\n\n**Oil 11 Old Wood**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nParfum (fragrance)\n\nBenzyl Benzoate\n\nOlea Europaea (olive) Fruit Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\nRosa Moschatat (rosehip) Seed Oil\n\nLinalool\n\nButylphenyl Methylpropional\n\nTocopherol\n\nHydroxyisohexyl 3-Cyclohexene Carboxaldehyde\n\n&#x200B;\n\n**Oil 12**\n\nPrunus Amygdalus Dulcis Oil\n\nPersea Gratissima Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nMelaleuca Alternifolia Leaf Oil\n\nTocopherol\n\nCedrus Atlantica Bark Oil\n\nLimonene\n\nLinalool\n\n&#x200B;\n\n**Oil 13**\n\nHelianthus Annuus Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nCocos Nucifera Oil\n\nBorago Officinalis Seed Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nCamelina Sativa Seed Oil\n\nParfum\n\nLimonene\n\nCaprylic/Capric Triglyceride\n\nGlycine Soja Oil\n\nTocopherol\n\nEvernia Prunastri Extract\n\nLinalool\n\nCitronellol\n\nGeraniol\n\nAloe Barbadensis Leaf Extract\n\nCitral\n\nCamellia Sinensis Leaf Extract\n\n&#x200B;\n\n**Oil 14**\n\nSesamum Indicum Seed Oil\n\nRicinus Communis Seed Oil\n\nSimmondsia Chinensis Seed Oil\n\nParfum\n\nArgania Spinosa Kernel Oil\n\nLimonene\n\nIsopropyl Myristate\n\nLinalool\n\nP-Cymene\n\nCitral\n\nDipropylene Glycol\n\nEugenol\n\nCoumarin\n\nTriethyl Citrate\n\n&#x200B;\n\n**Oil 15**\n\nHelianthus Annuus (Sunflower) Seed Oil\n\nPersea Gratissima (Avocado) Oil\n\nMacadamia Ternifolia Seed Oil\n\nJuglans Regia (Walnut) Shell Extract\n\nEucalyptus Globulus Leaf Oil\n\nParfum (Fragrance)\n\nMenthol\n\nTocopheryl Acetate\n\nBht\n\nAlpha-Isomethyl Ionone\n\nLimonene\n\nCoumarin\n\n&#x200B;\n\n**Oil 16**\n\nCyclomethicone\n\nDimethiconol\n\nHelianthus Annuus Seed Oil\n\nSclerocarya Birrea Seed Oil\n\nArgania Spinosa Kernel Oil\n\nPrunus Armeniaca Kernel Oil\n\nMacadamia Ternifolia Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nOlea Europaea Fruit Oil\n\nSesamum Indicum Seed Oil\n\nOctocrylene\n\nParfum\n\nCitronellol\n\nLinalool\n\nHexyl Salicylate\n\nLimonene\n\nCi 40800\n\n&#x200B;\n\n**Oil 17**\n\nSimmondsia Chinensis Seed Oil\n\nHelianthus Annuus Seed Oil\n\nCaprylic/Capric Triglyceride\n\nCarthamus Tinctorius Seed Oil\n\nSesamum Indicum Seed Oil\n\nParfum\n\nTocopheryl Acetate\n\nTocopherol\n\nLinalool\n\nLimonene\n\nCitronellol\n\n&#x200B;\n\n**Oil 18**\n\nAloe Barbadensis Leaf Juice (ALOE Vera)\n\nCetearyl Alcohol\n\nAlcohol Denat\n\nPlukenetia Volubilis Seed Oil (SACHA Inchi)\n\nCannabis Sativa Seed Oil (HANF)\n\nArgania Spinosa Kernel Oil (ARGAN)\n\nAqua\n\nSodium Lactate\n\nBetaine\n\nPentaclethra Macroloba Seed Oil (PRACAXI)\n\nGlyceryl Stearate Citrate\n\nChondrus Crispus (CARRAGEENAN)\n\nButyrospermum Parkii Butter (SHEA Butter)\n\nXanthan Gum\n\nParfum\n\nGlycerin (PFLANZLICH)\n\nGlyceryl Caprylate\n\nTocopherol (VITAMIN E)\n\nSodium Phytate\n\nLactic Acid (PFLANZLICHE Milchsäure)\n\nLevulinic Acid\n\nP-Anisic Acid\n\nSodium Levulinate\n\nSodium Hydroxide\n\nLimonene\n\n&#x200B;\n\n**Oil 19**\n\nVitis Vinifera Seed Oil\n\nPrunus Amygdalus Dulcis Oil\n\nDecyl Oleate\n\nArgania Spinosa Kernel Oil\n\nParfum\n\nTocopheryl Acetate\n\nPropyl Gallate\n\nHydroxycitronellal\n\nLimonene\n\nLinalool\n\nCitronellol\n\nGeraniol\n\nCitral\n\n&#x200B;\n\n**Oil 20**\n\nPrunus Dulcis (Almond) Oil\n\nButyrospermum Parkii (Shea Butter)\n\nRicinus Communis (Castor) Seed Oil\n\nParfum (Fragrance)\n\nOlea Europaea (Olive) Oil\n\nArgania Spinosa Kernel (Argan) Oil\n\nTocopheryl Acetate (Vitamin E)\n\nDimethicone\n\nLinalool\n\nLimonene\n\nButylphenyl Methylpropional\n\nBenzyl Salicylate\n\nCoumarin\n\n&#x200B;\n\n**Oil 21**\n\nPrunus Amygdalus Dulcis (sweet Almond) Oil\n\nVitis Vinifera (grape) Seed Oil\n\nPrunus Armeniaca (apricot) Kernel Oil\n\nTocopherol\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis (jojoba) Seed Oil\n\n&#x200B;\n\n**Oil 22**\n\nPrunus Amygdalus Dulcis Oil\n\nArgania Spinosa Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nTocopherol\n\nParfum\n\nLimonene\n\nLinalool\n\n&#x200B;\n\n**Oil 23**\n\nRicinus Communis Seed Oil\n\nVitis Vinifera Seed Oil\n\nPrunus Armeniaca Kernel Oil\n\nSimmondsia Chinensis Seed Oil\n\nCrambe Abyssinica Seed Oil\n\nAdansonia Digitata Seed Oil\n\nArgania Spinosa Kernel Oil\n\nCannabis Sativa Seed Oil\n\nCitrus Limon Peel Oil\n\nMauritia Flexuosa Fruit Oil\n\nShea Butter Ethyl Esters\n\nSqualane\n\nTocopherol\n\nCitric Acid\n\nCitral\n\nGeraniol\n\nLimonene",
    "flair_text": "BEARDOIL",
    "flair_template_id": "24f86e72-e229-11e5-a702-0e910d110fab",
    "comments": [
      {
        "author": "HockeyBeard32",
        "body": "My apologies if I come across snappy, but your new list doesn’t seem to be a reflection of a single bit of advice you had received from your first list. There are still alcohols and synthetic components in these.\n\nYou’re starting from too complicated of a controlled perspective. You say you wish to determine what ingredients are subjectively preferred by yourself, and I doubt even the most oil-affluent human on the planet would be able to independently judge each of these 10 ingredients in each bottle. Too much combination happening at once. \n\nAdvice:\nIf you can’t pronounce an ingredient, don’t use it. If you were to use your own judgement system and be successful with finding the right oils, you’d be using natural stuff in the end. Save yourself the time now. \n\nIt was said before, but stay simple. Use your classic base oils, a little essential, and added vitamin E if you’d like. Parfume and Fragrance typically refers to alcohol-based, and you don’t want that on your skin or hair. \n\nSpend $50-75 on amazon and you’ll be able to make yourself quality beard oil for at least a few months.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "not_my_business",
        "body": "I think theses oils are the most natural (?) but I still not sure. Some of the listed ones looks more chemical, some other a lots of oils but maybe cheap oils?\n\n&#x200B;\n\noil 11\n\noil 12 \n\noil 13\n\noil 20 (?)\n\noil 21\n\noil 22",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1jckf3a",
    "title": "[Routine Help] How to oil cleanse with broken skin barrier",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1jckf3a/routine_help_how_to_oil_cleanse_with_broken_skin/",
    "score": 2,
    "num_comments": 2,
    "created": "2025-03-16T12:31:44+00:00",
    "body": "It was recommended to me that I try oil cleansing because of my broken skin barrier. My skin has a really hard time when I clean with just water or gentle cleansers.\n\nI used [Sensitiv Reinigungsöl with Chamomille](https://www.dm.de/alverde-naturkosmetik-sensitiv-reinigungsoel-kamille-traubenkernoel-p4066447759143.html) . Ingredients list: Helianthus Annuus Hybrid Oil, Polyglyceryl-2 Sesquioleate, Simmondsia Chinensis Seed Oil, Tocopherol, Bisabolol, Chamomilla Recutita Flower Extract, Vitis Vinifera Seed Oil, Caprylic/Capric Triglyceride, Helianthus Annuus Seed Oil\n\nAfter massaging the oil into the skin, using a warm kitchen paper towel to wipe it off and few splashes of luke warm water I can still feel my skin to be different than before washing - as If I didn't get it off completely. The package says I should rinse it thoroughly. Am I missing something? I know that I can use a water based cleanser, but the whole point here is to avoid it. \n\nWhat is the correct way to do oil cleansing if your barrier is broken and have a really hard time with cleansing in general? Is it okay to leave some oil cleanser on the skin?",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guide [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and we might remove your post if it is).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "ReaLitTea",
        "body": "If this one leaves residue then you’ll need to double cleanse by following up with a water based cleanser",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Haircare",
    "post_id": "19en7g6",
    "title": "Are these ingredients on the Mark Antony shampoo and conditioner bad? (It's a long list so ignore if you don't wanna check lol)",
    "url": "https://www.reddit.com/r/Haircare/comments/19en7g6/are_these_ingredients_on_the_mark_antony_shampoo/",
    "score": 2,
    "num_comments": 3,
    "created": "2024-01-24T18:22:10+00:00",
    "body": "**Shampoo: Marc Anthony Repairing Shampoo, Repair Bond**  \nIngredients: Rescuplex™ Bond Rescue Complex, Rice Bran Oil, Rosemary Oil, Hydrolyzed Quinoa, Vitamin C, Aqua/water/eau, Sodium C 14-16 Olefin Sulfonate, Sodium Cocoyl Isethionate, Cocami-dopropyl Betaine, Cocamidopropyl Hydroxysultaine, Glycerin, Sodium Chloride, Oryza Sativa (Rice) Bran Oil, Rosmarinus Officinalis Leaf Oil, Hydrolyzed Quinoa, Tocopherol (Vitamin -E), Tocopheryl Acetate, Brassica Campestris/aleurites Fordi Oil Copolymer, Hydrolyzed Vegetable Protein Pg-propyl Silanetriol, Disodium Peg-12 Dimethicone Sulfosuccinate, Peg/ppg-120/10 Trimethylolpropane Trioleate, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Hydroxypropyl Methylcellulose, Coconut Acid, Decyl Glucoside, Glyceryl Oleate, Bis-pca Dimethicone, Citric Acid, Glycol Distearate, Butylene Glycol, Laureth-2, Dicaprylyl Ether, Aminomethyl Propanol, Sodium Isethionate, Sodium Benzoate, Sodium Metabisulfite, Benzoic Acid, Benzyl Alcohol, Potassium Sorbate, Polyquaternium-6, Polyquaternium-7, Chlorphenesin, Phenoxyethanol, Fragrance/parfum, Limonene, Linalool, Hydroxycitronellal\n\n**Conditioner: Marc Anthony Coconut Oil & Shea Butter Shampoo & Conditioner**   \nIngredients: 100% Extra Virgin Coconut Oil, Shea Butter, Biotin, Cetyl Alcohol, Stearyl Alcohol, Dimethicone, Cocos Nucifera (Coconut) Oil, Cetyl Esters, Butyrospermum Parkii Butter, Biotin (Vitamin- B7), Tocopheryl Acetate (Vitamin - E), Panthenol (Vitamin - B5), Hydrolyzed Keratin, Bambusa Vulgaris Shoot Extract, Vitis Vinifera Seed Oil, Arginine, Aspartic Acid, Threonine, Proline, Serine, Phenylalanine, Isoleucine, Valine, PCA, Histidine, Alanine, Glycine, Citric Acid, Propylene Glycol, Cetrimonium Chloride, Behentrimonium Chloride, Sodium PCA, Trideceth-12, Butylene Glycol, Disodium Edta, Amodimethicone, Dehydroacetic Acid, Sodium Lactate, Isopropyl Alcohol, Cyclopentasiloxane, Cyclohexasiloxane, Phenoxyethanol, Benzoic Acid, Sodium Hydroxide, Caramel, Fragrance.",
    "flair_text": "Help needed",
    "flair_template_id": "fb6ae90e-af6c-11ed-b65a-9ae950aefbfe",
    "comments": [
      {
        "author": "kirritoki",
        "body": "doesn’t look too bad, but that’s a lot of ingredients. i personally also avoid shea butter and coconut oil. and there’s alot of protein in it also so keep that in mind depending on your hair type. and  there’s dimithicone in both",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "10o7hcx",
    "title": "[Product Request] Please help me pick a new moisturizer",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/10o7hcx/product_request_please_help_me_pick_a_new/",
    "score": 2,
    "num_comments": 2,
    "created": "2023-01-29T13:19:56+00:00",
    "body": "Skin type: combination, sensitive\n\nSkin concerns: type 1 rosacea - redness mostly on cheeks and chin, sometimes get acne (whiteheads) on chin or around nose\n\n&amp;#x200B;\n\nI've been using Avene Tolerance Extreme Cream for the past 2 years and it's been my HG moisturizer. It's not the most hydrating but provides me with occlusion and never caused any breakouts or irritation. Unfortunately it has been discontinued and I desperately need to find a new moisturizer because I'm almost out of the Avene one. I've been considering buying the Etude House Soon Jung 2x Barrier Intensive Cream and three from a Polish brand BasicLab (ingredient lists are below).  Do you think that any of these moisturizers would be appropriate for my skin. Does any of the ingredients strike you as irritating or acne triggering?\n\nIf you think that none of these are suitable for me, can you recommend something that might be? I try to  avoid hyaluronic acid and niacinamide because they sometimes make my skin flare up so any product without them I would greatly appreciate. I live in Europe so I may not have access to some American or Korean products.\n\nHere are the ingredient lists of the moisturizers that I mentioned:\n\nEtude House Soon Jung 2x Barrier Intensive Cream:\n\n *Water, Propanediol, Pentaerythrityl Tetraethylhexanoate, Caprylic/Capric Triglyceride, Glycerin, Helianthus Annuus (Sunflower) Seed Oil, Polyglyceryl-3 Methylglucose Distearate, Butyrospermum Parkii (Shea) Butter, Cetearyl Alcohol, Panthenol, Madecassoside, Camellia Sinensis Leaf Extract, 1,2-Hexanediol, Potassium Carbomer, Xanthan Gum, Butylene Glycol, Disodium EDTA* \n\nBasicLab Calming Moisturizer with 5% prebiotics and 1% Centella Asiatica\n\n *Aqua, Tripelargonin, Dicaprylyl Ether, Cetearyl Glucoside, Inulin,  Glyceryl Stearate, Propanediol, Shea Butter Ethyl Esters, Pentylene  Glycol, Sorbitan Olivate, Trehalose, Jojoba Oil/Macadamia Seed Oil  Esters, Alpha-Glucan Oligosaccharide, Madecassoside, Asiaticoside,  Phytosphingosine, Ceramide NP, Ceramide AP, Linolenic Acid, Linoleic  Acid, Oleic Acid, Palmitic Acid, Centella Asiatica Leaf Extract, Ectoin,  Resveratrol, Phytosteryl Macadamiate, Stearic Acid, Hydrolyzed  Hyaluronic Acid, Phytosterols, Tocopherol, Cetearyl Alcohol, Potassium  Cetyl Phosphate, Helianthus Annus Seed Oil, Squalene, Carrageenan,  Hydroxyacetophenone, Citric Acid* \n\nBasicLab Moisturizer with Trehalose (&gt;5%)\n\n *Aqua, Dibutyl Adipate, Shea Butter Ethyl Esters, Gluconolactone,  Saccharide Isomerate, Trehalose,  Glycerin, Pentylene Glycol,  Propylheptyl Caprylate, Potassium Cetyl Phosphate, Cetearyl Alcohol,   Acetyl Octapeptide-3, Allantoin, Arginine, Borago Officinalis Seed Oil,  Persea Gratissima Seed Oil, Cannabis Sativa Seed Oil, Vitis Vinifera  Seed Oil, Glucose, Tocopherol, Caprylyl Glycol, Cetearyl Glucoside,  Sorbitan Oleate, Sorbitan Palmitate, Cetyl Palmitate, Citric Acid,  Sodium Citrate, Xanthan Gum, Hydroxyacetophenone* \n\nBasicLab Ceramide Moisturizer with 5% prebiotics and 3% Panthenol\n\n *Aqua, Squalane, Tripelargonin, Inulin, Panthenol, Cetearyl Alcohol,  Caprylic/Capric Triglyceride, Pentylene Glycol, Alpha- Glucan  Oligosaccharide, Ceramide NP, Ceramide AP, Phytosphingosine, Sodium  Lactate, Sodium PCA, Arginine, Glycine, Fructose, Urea, Niacinamide,  Saccharide Isomerate, Borago Officinalis Seed Oil, Persea Gratissima  Oil, Vitis Vinifera Seed Oil, Allantoin, Cannabis Sativa Seed Oil,  Tocopherol, Inositol, Glucose, Lactic Acid, Potassium Cetyl Phosphate,  Cetearyl Glucoside, Xanthan Gum, Hydroxyacetophenone, Sodium Citrate,  Citric Acid, Sodium Benzoate* \n\n&amp;#x200B;\n\nI've noticed a lot of oils in the BasicLab ones. Are they the kind of oils that are comedogenic or irritating?\n\n&amp;#x200B;\n\nAny help would be greatly appreciated. Thank you!",
    "flair_text": "Product Request",
    "flair_template_id": "8beab48a-f016-11ec-b297-8206d914d459",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Hi everyone and welcome to SkincareAddiction!\n\nNeed skincare guides? [Check out our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Hi there,\n\nIt seems like you may be looking for information about rosacea. Have you read our [rosacea wiki](https://www.reddit.com/r/SkincareAddiction/wiki/rosacea)?\n\n*If you see that I am replying to something out of context (eg. listed in a routine), please report this comment so my handlers can remove it. Cheers!*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "46ztxq",
    "title": "[Product Question] Can someone review ingredients in new SheaMositure mud mask and face moisturizer?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/46ztxq/product_question_can_someone_review_ingredients/",
    "score": 2,
    "num_comments": 5,
    "created": "2016-02-22T07:48:27+00:00",
    "body": "I was hoping to have someone review the ingredients in the new SheaMoisture skin care items at target. I got both the mud mask and the moisturizer. They both smell amazing and have a smooth creamy consistency.\n\n\n**Peace Rose Oil Complex Sensitive Skin Mud Mask**, $15/6oz\n\n\nIngredients: Water, Kaolin, Bentonite, Glycerin (Vegetable), Glyceryl Stearate, Butyrospermum Parkii (Shea) Butter, Glyceryl Caprylate, Calophyllum Tacamahaca Seed Oil, Vitis Vinifera Seed Oil, Allantoin, Panthenol, Balanites Aegyptiaca Seed Oil, Rosa Damascena Flower Oil, Rhododendron Ferrugineum Leaf Cell Culture Extract, Rosa Canina Flower Extract, Rosa Centifolia Flower Wax, Rosa Damascena Flower Wax, Camellia Sinensis (Green Tea) Leaf Extract, Rosa Centifolia Flower Water, Selaginella Lepidophylla (Jericho) Extract, Glyceryl Undecylenate, Fragrance (Essential Oil Blend)\n\n**Peace Rose Oil Complex Sensitive Skin Facial Moisturizer**, $12/2oz\n\n\nIngredients: Water, Capric/Caprylic Triglycerides, Glyceryl Stearate, Glycerin (Vegetable), Parkii (Shea) Butter, Cetearyl Alcohol, Cetyl Alcohol, Fragrance (Essential Oil Blend), Glyceryl Caprylate, Rosa Damascena Flower Oil, Rosa Centifolia Flower Water, Rose Centifolia Flower Wax, Damascena Flower Wax, Rosa Canina Flower Extract, Selaginella Lepidophylla (Jericho) Extract, Rhododendron Ferrugineum Leaf Cell Culture Extract, Camellia Japonica Flower Extract, Aloe Barbadensis Leaf Juice,Balanites Aegyptiaca Seed Oil, Melaleuca Alternifolia (Tea Tree) Leaf Oil, Cocos Nucifera (Coconut) Oil, Persea Gratissima (Avocado) Oil, Melia Azadirachta Leaf Extract, Melia Azadirachta Flower Extract, Bisabolol, Glyceryl Undecylenate, Amino Esters-1, Betaine, Coccina Indica Fruit Extract, Pearl Powder (Margarita Powder), Sodium Phytate\n\n\n1) Are these ingredients likely to break out cystic-acne prone skin?\n\n\n2) Are these ingredients worth the price?\n\n\nI've been using both for about 2 weeks and haven't noticed any extra outbreaks. I have a normally oily T-zone, I've had some hormonal acne this week that should clear soon, and dry patches by my ear/outer cheekbone area that I'm trying to rehydrate. I'm a big fan of the SheaMoisture shampoo/conditioner, so I thought I'd give the skincare a try.\n\n\nThanks for any input!",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Jadefury",
        "body": "You can also plug the ingredients list into Cosdna.com and it has a scale to tell you how \"safe\" (i.e. likelihood of acne and/or irritation) each ingredient is :) \n\nHere's the direct link: http://cosdna.com/eng/ingredients.php",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Mood-light",
        "body": "I personally don't use masks as they're not on the skin long enough to do anything. The moisturizer contains a huge amount of fragrance and irritating plant oils. I'd skip both.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "FancyFollicles",
    "post_id": "d2owr3",
    "title": "Washing curly hair with shampoo bar - does it get better?",
    "url": "https://www.reddit.com/r/FancyFollicles/comments/d2owr3/washing_curly_hair_with_shampoo_bar_does_it_get/",
    "score": 2,
    "num_comments": 5,
    "created": "2019-09-11T11:53:18+00:00",
    "body": "Lately I’ve been trying to make my routine more environment-friendly (and dry hair-friendly!) by switching to solid shampoo. So I’ve purchased the first one that was available to me locally, which was Balade en Provence brand. On paper it seemed great - 100% vegan, ethically made in France, no harsh ingredients (list included below) and all that jazz.\n\nBut after few tries the effects are... underwhelming to say the least. Granted, I’m aware that after years of using regular shampoos, it takes some getting used to for the hair and scalp to work with milder cleaning agents and that I shouldn’t give up just yet, but I’d really love an opinion from curlies who have more experience with shampoo bars than I do. Is it my technique that’s wrong or is this shampoo just not suited for my hair?\n\nMy complaints/questions are as follows:\n\n-I can’t get the bar to lather well. I’ve tried both rubbing it against my hair and lathering it in my hands first and then putting it in my hair but in either case the foam disappears very quickly and I don’t feel like I’ve actually washed my hair clean.\n\n-I’m rinsing A LOT, way more than with regular shampoo, but this one seems to make a gummy layer in my hair that doesn’t wash out with water. When it’s soaked, my hair feels nice and soft, but once it dries even a little bit, the gummy feeling returns.\n\n-My hair takes much longer to air dry, but once it finally does, the length and ends are nice enough, with good definition but my roots still feel a little gummy and look stringy and flat. Not a great look, overall. I can tell that the shampoo is still there, because I can smell it when I run my hands through my hair. How the hell do I get it to rinse?\n\n-Can I still put oil in my hair before washing it with a shampoo bar? I feel like it makes all of the above effects worse.\n\n-Should I cut down on styling products? So far I can’t imagine a shampoo bar could deal with product buildup well.\n\nAny advice is much appreciated!\n\nFor reference, I have long, fine (but lots of it) 2c/3a type, medium porosity hair and the products I normally use are:\n\n- Garnier Fructis Hair Food Aloe Multi-Purpose Mask\n\n- Boots Essentials Curl Creme\n\n- Umberto Giannini scrunching jelly\n\n- Umberto Giannini Weather Proof Curls finishing cream\n\n- Coconut Water, Hydration Oil, for the ends\n\n- walnut oil before washing\n\nAnd the shampoo bar ingredient list: Cocos nucifera oil, Vitis vinifera seed oil, Aqua, Sodium hydroxyde, Butyrospermum parkii butter, Brassica campestris seed oil, Limonene, Citrus nobilis peel oil, Citrus paradisi peel oil, Citrus sinensis peel oil expressed, Illite, Eugenia caryophyllus bud oil, Pinus sylvestris oil, Eugenol.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jaimieeimiaj",
        "body": "So I was in the exact same boat as you were! From what I’ve read, the issue with most shampoo bars is they’re highly alkaline due to the saponifying process for the oils, which throws off the pH of your hair and causes the weird feeling you’re experiencing. This is made even worse if the area you live in has hard water. \n\nTo combat this you can either rinse with apple cider vinegar to try and restore the pH balance of your hair, get a water softener/rinse your hair with filtered water, or you can find a pH-balanced shampoo bar. \n\nI know Ethique’s bars are pH-balanced, but I can’t attest to their quality as I’ve never tried them. I’m currently using HiBAR’s moisturizing shampoo and conditioner bars and am in love with them. \n\nSource: wanted to be environmentally conscious while following the curly girl method. Hated the gross feeling shampoo bars caused, so I did a ton of research\n\nETA the ingredients for the shampoo I use:\n\nSodium Cocoyl Isethionate (Coconut Oil*), BTMS (Behentrimonium Methosulfate, Cetyl Alcohol, Butylene Glycol (Vegetable Based*)), Cocos Nucifera (Coconut) Oil, Cetyl Alcohol (Coconut Oil*), Glycerin Stearate (Vegetable Based*), Panthenol (Vitamin B5), Stearic Acid (Vegetable Based*), Cocamidopropyl Betaine (Coconut Oil*), Polyquaternium 7, Hydrolyzed Rice Protein, Natural Fragrance (derived from essential oils and plant extracts), Natural Pigments. (*Derived Source)",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "7sw42x",
    "title": "How does alcohol affect the other ingredients in skin care products?",
    "url": "https://www.reddit.com/r/chemistry/comments/7sw42x/how_does_alcohol_affect_the_other_ingredients_in/",
    "score": 2,
    "num_comments": 5,
    "created": "2018-01-25T13:40:05+00:00",
    "body": "I know alcohol is used to dissolve ingredients and/or as a preservative in some skin care products. I was just wondering, does it also decrease the effectiveness of other ingredients. I might be making a wrong connection here but alcohol kills bacteria, is a good cleanser when I have oil on my skin and stuff. Which makes me wonder if especially it's listed high on the ingredients, it might kill/decrease the other ingredients' beneficial effects for skin, too.\n\nAs an example, this is the ingredients list of an eye moisturizer:  Aqua, Cetearyl Alcohol, Macademia Integrifolia Seed Oil, Glycerin, Butylene Glycol, Helianthus Annuus Seed Oil, Decyl Oleate, Butyrospermum Parkii Butter, Cetearyl Glucoside, Tocopheryl Acetate, Vitis Vinifera Seed Oil, Phenoxyethanol Panthenol, Magnesium Aluminum Silicate, Sodium Ceterayl Sulfate, Ethylhexylglycerin, Potassium Sorbate, Xanthan Gum, Citric Acid, Disodium EDTA, Sodium Hyaluronate, Ubiquinone, Pantolactone.\n\nAlcohol listed as second on the list so in large amount. Does it not intervene other ingredients because the ingredients list is long? Or if it would decrease their effectiveness, how much you would think?",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "LordMorio",
        "body": "There are different types of alcohol. What you are referring to in the beginning of your post is ethyl alcohol (i.e. what people drink). The alcohol in the product is cetearyl alcohol which is a mixture of stearyl alcohol and cetyl alcohol. Both of these are alcohols with a long hydrocarbon chain, and are very different from ethyl alcohol. They act as emulsifiers and foaming agents.\n\nGlycerin, butylene glycol, phenoxyethanol, pahthenol, ethylhexylglycerin, cetearyl glucoside and sodium hyaluronate could also be classified as alcohols.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "NoPoo",
    "post_id": "hm0f1m",
    "title": "Will this work as a reset shampoo?",
    "url": "https://www.reddit.com/r/NoPoo/comments/hm0f1m/will_this_work_as_a_reset_shampoo/",
    "score": 2,
    "num_comments": 3,
    "created": "2020-07-06T03:48:12+00:00",
    "body": "Hi, I bought [this](https://www.amazon.ca/Live-Clean-Restorative-Shampoo-Conditioner/dp/B07121T2GR) intending it to be a reset shampoo but now I'm unsure because '[isitcg.com](https://isitcg.com/)' is telling me it's Curly Girl approved. It has no silicone, and has Sodium Lauryl Sulfoacetate and Sodium Methyl 2-Sulfolaurate which the site lists not as sulfates but as a cleansing agent (to be used with caution) and a gentle cleanser.\n\nHere's the full list of ingredients:  \nAqua, Sodium Lauryl Sulfoacetate, Cocamidopropyl Betain, Sodium Methyl 2-Sulfolaurate, Argaania Spinosa Kernel, Vitis Vinifera Seed Oil, Olea Europaea Fruit Oil, Vitis Vinifera Seed Extract, Olea Europaea leaf extract, Argania Glycol Distearate, Glycerin, Glyceryl Oleate, Coco Glucoside, Glyceryl Stearate, Phenoxyethanol, Ethylhexylglycerin, Potassium Sorbate, Sodium Benzoate, Benzoic Acid, Benzyl Benzoate, Hexyl Cinnamal, Parfum, Citric acid, soduim hydroxide.\n\nThe product is Live Clean Exotic Nectar Argan Oil Restorative Shampoo.  \nIf it's not qualified for reset, could I use this as a low-poo? (My hair is type 2 wavy.)",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "NonoVirus",
        "body": "It is low poo. That’s why it’s cg method approved. You want sulphates to clear out silicone from old products.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "hlwedo",
    "title": "I can't tell if this will work as a reset shampoo?",
    "url": "https://www.reddit.com/r/curlyhair/comments/hlwedo/i_cant_tell_if_this_will_work_as_a_reset_shampoo/",
    "score": 2,
    "num_comments": 1,
    "created": "2020-07-05T23:14:17+00:00",
    "body": "Hi, I bought this intending it to be a reset shampoo but now I'm unsure because '[isitcg.com](https://isitcg.com)' is telling me it's CG approved. It has no silicone, and has Sodium Lauryl Sulfoacetate and Sodium Methyl 2-Sulfolaurate which the site lists as a cleansing agent (to be used with caution) and a gentle cleanser. \n\nHere's the full list of ingredients:  \nAqua, Sodium Lauryl Sulfoacetate, Cocamidopropyl Betain, Sodium Methyl 2-Sulfolaurate, Argaania Spinosa Kernel, Vitis Vinifera Seed Oil, Olea Europaea Fruit Oil, Vitis Vinifera Seed Extract, Olea Europaea leaf extract, Argania Glycol Distearate, Glycerin, Glyceryl Oleate, Coco Glucoside, Glyceryl Stearate, Phenoxyethanol, Ethylhexylglycerin, Potassium Sorbate, Sodium Benzoate, Benzoic Acid, Benzyl Benzoate, Hexyl Cinnamal, Parfum, Citric acid, soduim hydroxide.  \nThe product is Live Clean Exotic Nectar Argan Oil Restorative Shampoo.   \nIf it's not qualified for reset, could I use this as a low-poo? (My hair is type 2 wavy.)",
    "flair_text": "help",
    "flair_template_id": "762e5196-21dd-11e6-90ce-0ebfe7658481",
    "comments": [
      {
        "author": "Manarelle",
        "body": "If you haven't used a lot of silicones in the past, it will probably be alright. The point of the sulfates is to get rid of silicone buildup. Sulfoacetate is a milder form of sulfate, which will wash away the silicones, but if you have lots of buildup, it may take more than one wash. If you feel like your hair is pretty ok (mine was limp and felt slick from the buildup), then you should be fine. If you're not sure, then give it two or three washes.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Rosacea",
    "post_id": "1jckz3o",
    "title": "How to oil cleanse with broken skin barrier",
    "url": "https://www.reddit.com/r/Rosacea/comments/1jckz3o/how_to_oil_cleanse_with_broken_skin_barrier/",
    "score": 1,
    "num_comments": 4,
    "created": "2025-03-16T13:03:26+00:00",
    "body": "It was recommended to me that I try oil cleansing because of my broken skin barrier. My skin has a really hard time when I clean with just water or gentle cleansers.\n\n\n\nI used [Sensitiv Reinigungsöl with Chamomille](https://www.dm.de/alverde-naturkosmetik-sensitiv-reinigungsoel-kamille-traubenkernoel-p4066447759143.html) . Ingredients list: Helianthus Annuus Hybrid Oil, Polyglyceryl-2 Sesquioleate, Simmondsia Chinensis Seed Oil, Tocopherol, Bisabolol, Chamomilla Recutita Flower Extract, Vitis Vinifera Seed Oil, Caprylic/Capric Triglyceride, Helianthus Annuus Seed Oil\n\n\n\nAfter massaging the oil into the skin, using a warm kitchen paper towel to wipe it off and few splashes of lukewarm water I can still feel my skin to be different than before washing - as If I didn't get it off completely. The package says I should rinse it thoroughly. Am I missing something? I know that I can use a water based cleanser, but the whole point here is to avoid it.\n\n\n\nWhat is the correct way to do oil cleansing if your barrier is broken and have a really hard time with cleansing in general? Is it okay to leave some oil cleanser on the skin?",
    "flair_text": "Skincare",
    "flair_template_id": "813d3ee8-1c99-11ea-b357-0e52aca8cc5d",
    "comments": [
      {
        "author": "stillmyself980",
        "body": "Try to massage the oil, wet your hands and massage adding a bit of water at time until a milky emulsion appears then rinse",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "mushycorn",
        "body": "Should always do a double cleanse. Oil cleanser first and water based after",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "EuroSkincare",
    "post_id": "nwe2ze",
    "title": "Looking for a lip balm to replace the old Isana Intensive formula",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/nwe2ze/looking_for_a_lip_balm_to_replace_the_old_isana/",
    "score": 1,
    "num_comments": 0,
    "created": "2021-06-10T03:36:21+00:00",
    "body": "I used to really love the Isana Intensive lip balm, but the last time I went to the store to buy more, they'd changed the formula. The new formula kind of makes my lips tingle a bit and feel, if anything, even more dry. Can anyone help me find a replacement or recommend new lip balms I could try?\n\nHere's the ingredient list of the OLD formula\n\n> Ricinus Communis Seed Oil, Ethylhexyl Stearate, Octyldodecanol, Hydrogenated Palm Oil, C12-15 Alkyl Benzoate, Cera Alba, Candelilla Cera, Ethylhexyl Salicylate, Diethylamino Hydroxybenzoyl Hexyl Benzoate, Ethylhexyl Triazone, Stearic Acid, Butyrospermum Parkii Butter, Vitis Vinifera Seed Oil, Zinc Oxide, Tocopheryl Acetate, Aroma, Bisabolol, Panthenol, Aqua\n\nHere's an ingredient list for the NEW formula\n\n> Ricinus Communis Seed Oil, Caprylic/Capric Triglyceride, Isostearyl Isosteareate, Hydrogenated Castor Oil, Helianthus Annuus Seed Cera, Oryza Sativa Cera, Butyrospermum Parkii Butter, Macadamia Integrifolia / Tetraphylla Seed Oil, Parfum, Tocopheryl Acetate, Glycine Soja Oil, Citral, Citronellol, Limonene, Geraniol",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Pomade",
    "post_id": "1e52a52",
    "title": "How good is this formula?",
    "url": "https://www.reddit.com/r/Pomade/comments/1e52a52/how_good_is_this_formula/",
    "score": 1,
    "num_comments": 5,
    "created": "2024-07-16T22:48:00+00:00",
    "body": "I bought an \"all natural pomade\" and ive read PEGs are bad for the hair, so here is a list if anyome knows if its good\n\nAqua, White Beeswax, Euphorbia Cerifer Cera (Candelilla Wax), Cocos Nucifera Oil (Coconut Oil), PEG-40 Hidrogenated Castor Oil, Butyrospermum Parkii Butter (Shea Butter), Stearic Acid, Vitis Vinifera Seed Oil (Grape Seed Oil), Olea Europea Fruit Oil (Olive Oil), Organic Lecithin, Ricinus Communis Seed Oil (Castor Oil), Simmondsia Chinensis Seed Oil (Jojoba Oil), Argania Spinosa Kernel Oil (Argan Oil),  Glycine Soja (Soybean Oil)  , Prunus Amygdalus Dulcis Oil (Almond Oli), Tocopheryl Acetate (Vitamin E), Phenoxyethanol, Ethylhexylglycerin, Parfume\n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "TWICEsPetGerbil",
        "body": "PEG-40 Hydrogenated Castor Oil is just an emulsifier that allows the oils in the products to mix with water so they can be washed out easier. There's nothing wrong with them.\n\nAnd scalp irritation can be caused by completely natural ingredients like plant oils and fragrances if you have allergies.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "yeetskeetleet",
        "body": "What brand is it?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "49z1b2",
    "title": "[Product Question] Will it be best to dilute Tea Tree Oil with jojoba by myself, or is buying 10% TTO from a store better? (Ingridients from the TTO from the store inside)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/49z1b2/product_question_will_it_be_best_to_dilute_tea/",
    "score": 1,
    "num_comments": 1,
    "created": "2016-03-11T14:37:14+00:00",
    "body": "Vitis Vinifera Seed Oil, Hydrogenated Polydecene, Melaleuca Alternifolia Leaf Oil(Tea Tree Oil: 10%), Tocopheryl Acetate, Parfum (from Tea Tree Oil), Limonene, Linalool.\n\nSo, will it be better to buy this 10% TTO, or will it be better to mix it up myself?",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "Purple-Leopard",
        "body": "I would do it yourself. Grapeseed oil is drying also. And Tocopheryl Acetate is vitamin e which can potentially break you out. I don't know the other ingredients but they seem unnecessary especially when you can mix yourself.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "k566er",
    "title": "[Product Question] What facial moisturizers have a similar ingredients list to this one?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/k566er/product_question_what_facial_moisturizers_have_a/",
    "score": 1,
    "num_comments": 12,
    "created": "2020-12-02T09:26:55+00:00",
    "body": "Ingredients:  \n*Aqua, Aloe Barbadensis, Helianthus Annuus Seed Oil, Glycerin , Glyceryl Stearate, PEG-100 Stearate, Vitis Vinifera Seed Oil, Panthenol, Sodium PCA, Lactic Acid, Prunus Armeniaca Kernel Oil, Dimethicone, Tocopheryl Acetate, Phenoxyethanol, Caprylyl Glycol, Hyaluronic Acid, Fragrance*\n\nWhat can you tell me about this list? Are there any particularly good ingredients that is usually not included in other moisturizers, or can something similar to this be recommended?\n\nThanks in advance!",
    "flair_text": "Product Question",
    "flair_template_id": "ab4607b0-d014-11e3-a60e-12313d18e464",
    "comments": [
      {
        "author": "DazzlingCrema",
        "body": "I think it’s a good moisturizer— it has humectants, occlusives, and should have some emollients. The main problem is the fragrance.\n\nThis moisturizer isn’t *that* special, so I think it might be better to get a moisturizer w/o fragrance. What moisturizer is this?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/k51v3w/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Accutane",
    "post_id": "aqc745",
    "title": "Double cleansing advice",
    "url": "https://www.reddit.com/r/Accutane/comments/aqc745/double_cleansing_advice/",
    "score": 1,
    "num_comments": 6,
    "created": "2019-02-13T22:07:28+00:00",
    "body": "I'm new to reddit so hi! Hoping to start accutane next month. I'm in Amsterdam. I have a question about double cleansing which I currently do with the following products\n\n1) Simple cleansing oil. Ingredients: Vitis Vinifera Seed Oil, Isopropyl Palmitate, Sorbeth-30 Tetraoleate, Phenoxyethanol, BHT, Helianthus Annuus Seed Oil, Isopropyl Myristate, Retinyl Palmitate, Tocopheryl Acetate\n\n[https://www.simple.co.uk/products/face-cleansers-and-toners/kind-to-skin-hydrating-cleansing-oil.html](https://www.simple.co.uk/products/face-cleansers-and-toners/kind-to-skin-hydrating-cleansing-oil.html)\n\n2) Simple foaming cleanser. Ingredients: Aqua, Potassium Cocoyl Glycinate, Glycerin, Propylene Glycol, Sodium Lauroamphoacetate, Panthenol, Allantoin, Sodium Ascorbyl Phosphate, Sodium Chloride, Disodium EDTA, Sodium Glycolate, Phenoxyethanol, Caprylyl Glycol, Citric Acid.\n\n[https://www.simple.co.uk/products/face-cleansers-and-toners/kind-to-skin-vital-vitamin-foaming-cleanser.html](https://www.simple.co.uk/products/face-cleansers-and-toners/kind-to-skin-vital-vitamin-foaming-cleanser.html)\n\n&#x200B;\n\nDo these seem OK to use on accutane, or should we avoid double cleansing at all? (not even sure if its helped my skin lol just got sucked in by asian beauty trend)\n\n&#x200B;\n\nThanks in advance!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "jmlinv",
        "body": "The simple oil cleanser made me break out *bad*. Isopropyl palmitate can be really comedogenic for many people so I’d be wary of using that, especially if you want to establish a routine you know won’t cause you any issues before you start the medication.\n\n Personally I have found the best results just choosing one oil, like rosehip seed or grape seed, and using that for removing makeup before following up with a second cleanse.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "oftheseafoam",
        "body": "I double cleansed pre-accutane but found the foaming cleanser too stripping. I’ve stuck with micellar water for dry and sensitive skin to cleanse and it’s worked well!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "2fncqb",
    "title": "Suddenly... a rash! (after 4 weeks of using the same cream daily!?)",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/2fncqb/suddenly_a_rash_after_4_weeks_of_using_the_same/",
    "score": 1,
    "num_comments": 3,
    "created": "2014-09-06T16:52:20+00:00",
    "body": "Heya! I would like to hear someone's opinion on a rash that occurred on my bf's face today after having used the same cream for four weeks now. How is that even possible? Can anyone explain?\n\nI bought him the \"alva body lotion\" he has been using for his face and some parts of his body for appr. 4 weeks now.\nThe list of ingredients reads:\nAqua, simmondsia chinensis oil*, theobroma grandiflorum², polyglyceryl-3 methylglucose disterarate', vitis vinifera seed oil*, butyrospermum (tihi, sperm) parkii butter*, carapa guaianensis², fragrance, tocopheryl acetate', algin', galactoarabinan', helianthus annuus seed oil', lactic acid', xanthan gum, sodium phytate', potassium sorbate\n\n*ingredient from organic farming\n' from natural origin\n² wild harvest\n\nI'm pretty baffled as to how this could happen, he had red streaks all over his face just 5 minutes after application. After washing it off, things went back to normal in the next 30 minutes. I hope someone has the expertise to clear it up. \nThanks!",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "1asx8ec",
    "title": "Vitamin C Cream + Routine HELP (I'm new to all this) !",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/1asx8ec/vitamin_c_cream_routine_help_im_new_to_all_this/",
    "score": 1,
    "num_comments": 3,
    "created": "2024-02-17T08:30:30+00:00",
    "body": "Skincare newbie here, and advice is so appreciated!!\n\nAfter years of smoking, tanning beds and the occasional make-up wipe (if I even remembered), I've just started to take skin care seriously in the last year (I'm now 30). Better late than never. I feel so bad for how I treated my body in my teens/20s, and my skin is now definitely aging prematurely because of it.\n\nMy main focus has been to help reduce my melasma/hyperpigmentation and reduce a lot of fine lines around my eyes. \n\nI'm building a solid skincare routine and have just started using a Vitamin C cream (not serum) prescribed by a dermatologist. I've never used a cream before (only previously heard of it in serum-form), and I'm not sure how I should incorporate it into my routine... Should I use it after my other actives? It simply says \"use morning and evening on clean, dry skin\". Because it's a cream consistency and not a serum, it makes me think it should come after my serums and before moisturiser, but that would make it one of the last steps in my routine which doesn't feel quite right (and contradicts what it says about applying straight onto clean dry skin).\n\nIt's expensive stuff (the brand is PH Formula) and I'd really like to be getting the best out of the product, so I wondered if anyone could help advise on this. \n\nThe ingredients of the product:\n\n*Aqua (Water), Glyceryl Stearate, Diethylhexyl Adipate, Magnesium Ascorbyl Phosphate, Isohexadecane, Vitis Vinifera Seed Oil, Glycerin, Cetyl Alcohol, Dimethicone, Hydroxyethyl Acrylate/Sodium Acryloyldimethyl Taurate Copolymer, PEG-30 Stearate, Potassium Cetyl Phosphate, Steareth-10, Triethanolamine, Phenoxyethanol, Palmitic Acid, Stearic Acid, Pentylene Glycol, Citric Acid, Fructose, Sodium Hydroxide, Tocopheryl Acetate, Urea, Disodium EDTA, Ethylhexylglycerin, Allantoin, Maltose, Sodium Chloride, Sodium Lactate, Sodium PCA, PEG-8, Trehalose Tocopherol, Glucose, Sodium Hyaluronate, Ascorbyl Palmitate, Ascorbic Acid.*\n\nBecause my main focus has been on reducing my melasma and hyperpigmentation caused by sun damage, most of the skincare range I am using is the \"MELA\" one, again by PH Formula. It's not cheap, but since I've never done any skincare, I thought investing in something really top notch to get me started was a good idea. I also use a factor 50spf (La Rouche Possay) every day now.\n\nI'd appreciate any tips or advice at all, and thank you in advance! ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "fashionaddict89",
        "body": "Fellow melasma sufferer and medical aesthetician here 🙋🏼‍♀️\nI know how you feel, it’s so confusing when you first start building a good routine. \nThe products you use are definitely good but they are probably not enough to get rid of the melasma. Melasma should be treated from the inside and managed from the outside. A combination of procedures and at home skincare (btw the homecare products don’t have to be expensive and always keep in mind that dermatologists and estheticians will try to sell you their expensive products)\nA positive upside in treating your hyperpigmentation is that you will automatically minimize wrinkles and your skin will age slower because of all the sunscreen you’ll hopefully use from now on.\nIf you have any questions feel free to reach out.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "49xhhb",
    "title": "[Product Question] I wanna buy distilated Tea Tree oil. - Vitis Vinifera Seed Oil, Hydrogenated Polydecene, Melaleuca Alternifolia Leaf Oil (10%), Tocopheryl Acetate, Parfum (from Tea Tree Oil), Limonene, Linalool. These are the ingridents in a mix I found online. Does the mix look good?",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/49xhhb/product_question_i_wanna_buy_distilated_tea_tree/",
    "score": 1,
    "num_comments": 1,
    "created": "2016-03-11T06:13:30+00:00",
    "body": "",
    "flair_text": "Product Question",
    "flair_template_id": null,
    "comments": [
      {
        "author": "trainsarelove",
        "body": "Or would it be better to just mix 100% TTO with like jojoba oil by myself, or does the alredy mixed TTO look better?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "u_cautran99",
    "post_id": "jss1jd",
    "title": "[REVIEW] 5 Loại dầu dưỡng da Kiara Argan Oil và nơi mua uy tín",
    "url": "https://www.reddit.com/r/u_cautran99/comments/jss1jd/review_5_loại_dầu_dưỡng_da_kiara_argan_oil_và_nơi/",
    "score": 1,
    "num_comments": 0,
    "created": "2020-11-12T09:54:50+00:00",
    "body": "Chắc hẳn dầu dưỡng da không còn xa lạ gì với các bạn nữa. ***Dầu dưỡng da*** được xem là một trong những bước đệm quan trọng giúp tối ưu hiệu quả của bước dưỡng da, và là một bước rất cần thiết trong quy trình chăm sóc da hoàn hảo. ***Dầu dưỡng da Kiara Argan oil*** đang là một trong những loại dầu dưỡng da được mọi người ưa chuộng nhất hiện nay. Vậy tại sao nó là một loại dầu được ưa chuộng nhất hiện nay?\n\nĐầu tiên chúng ta hãy tìm hiểu về nguồn gốc xuất xứ của dầu dưỡng da **Kiara Argan Oil nhé**\n\n**NGUỒN GỐC XUẤT XỨ DẦU DƯỠNG DA KIARA ARGAN OIL**\n\nDầu dưỡng da Kiara Argan Oil là dòng sản phẩm thuộc thương hiệu mỹ phẩm Kiara – có nguồn ốc từ xứ sở “chuột túi”. Sản phẩm của Kiara nhiều bạn có thể chưa nghe đến nhưng tại Úc được rất nhiều người tiêu dùng ưa chuộng và tin tưởng vì chúng thường được phân phối tại các clinic và [website chính hãng](https://ohgood.vn/kiara)\n\nhttps://preview.redd.it/qd34qq4t6sy51.png?width=1200&format=png&auto=webp&s=b7f17f8ed821eec410122e0099e19194117b5737\n\nCác loại dầu dưỡng của Kiara luôn được mọi người chào đón và khen ngợi được nằm trong danh sách các loại dầu chất lượng nhất nước Úc:\n\n&#x200B;\n\n* [**Dầu Dưỡng Kiara Argan Oil 30ml**](https://ohgood.vn/san-pham/cham-soc-sac-dep/dau-duong-kiara-argan-oil-30ml-502.html)\n* [**Dầu Dưỡng Kiara Maracuja Oil Hạt Chanh Dây 30ml**](https://ohgood.vn/san-pham/dep-da/dau-duong-kiara-maracuja-oil-hat-chanh-day-30ml-503.html)\n* [**Dầu Dưỡng Kiara Grapeseed Oil Hạt Nho 30ml**](https://ohgood.vn/san-pham/tuan-le-doc-than-thang-11/dau-duong-kiara-grapeseed-oil-hat-nho-30ml-504.html)\n* [**Tinh Dầu Kiara Tea Tree Oil Tràm Trà Giảm Mụn 10ml**](https://ohgood.vn/san-pham/tuan-le-doc-than-thang-11/tinh-dau-kiara-tea-tree-oil-tram-tra-giam-mun-10ml-506.html)\n* [**Dầu Dưỡng Da Phục Hồi Và Làm Dịu Kích Ứng Kiara Evening Primrose Oil 30ml**](https://ohgood.vn/san-pham/tuan-le-doc-than-thang-11/dau-duong-da-phuc-hoi-va-lam-diu-kich-ung-kiara-evening-primrose-oil-30ml-583.html)\n\nNhững dòng sản phẩm này được cam kết với thành phần của sản phẩm 100% từ thiên nhiên, thuần khiết ,không chứa chất bảo quản,  không chứa paraben, đảm bảo an toàn trên mọi loại da.\n\n**DẦU DƯỠNG DA KIARA ARGAN OIL CÓ THẬT SỰ TỐT?**\n\nĐâu dưỡng da Kiara Argan Oil thật sự tốt và gây ấn tượng khá tốt đối với mình. Từ thành phần, công dụng, đến sự đảm bảo về chất lượng sản phẩm và đặc biệt là 100% từ organic thì mình tin chắc rằng đây là một sản phẩm không thể nào từ chối.\n\n**#1  Kiara Argan Oil (Dầu Argan)**\n\n**Với thành phần  100% Argania Spinosa Kernel Oil**\n\nLà một loại tinh dầu có chứa nhiều vitamin E và acid béo với những thành phần này làn da chúng ta sẽ được làm dịu và dưỡng ẩm cực kì tốt. Làn da sẽ được nuôi dưỡng từ bên trong để chống lại sự lão hóa da và nếp nhăn được cải thiện. Ngoài ra, chúng còn giúp tăng độ đàn hồi cho da và collagen được tái sản sinh nhiều hơn giúp làn da căng và đẹp\n\n[Kiara Argan Oil \\(Dầu Argan\\)](https://preview.redd.it/zpldsjkw6sy51.jpg?width=802&format=pjpg&auto=webp&s=76f0f14cdc9827e5d738893b4aabcb41a8271603)\n\n**Công dụng Kiara Argan oil**\n\n* Giúp da mềm mịn, cấp ẩm cho da\n* Giảm sự xuất hiện nếp nhăn và mụn\n* Giúp tóc và móng bóng khỏe, mượt mà\n\nLoại da phù hợp để sử dụng: **da khô, da hỗn hợp**\n\nGiá bán chính hãng: **700.000 VND**\n\n[**Đặt mua ngay**](https://ohgood.vn/san-pham/cham-soc-sac-dep/dau-duong-kiara-argan-oil-30ml-502.html)\n\n**#2 Dầu Dưỡng Kiara Maracuja Oil Hạt Chanh Dây 30ml**\n\n**Thành phần 100% Passiflora Edulis Seed Oil**\n\nĐây là sản phẩm chứa rất nhiều  Linolenic Acid, ngoài ra sản phẩm còn cung cấp rất nhiều axit béo và các loại vitamin thiết yếu như: Vitamin A, Kali mà cơ thể không thể tự tôngr hợp được theo thời gian. Linolenic Acid sẽ cân bằng được lượng bã nhờn có trên da, khiến gia giống như bị bít lỗ chân lông, ngăn ngừa sự hình thành mụn. Dầu hạt chanh leo cũng là gốc chống oxi hóa cao. Giúp loại bỏ các tác nhân có hại bên ngoài ngăn ngừa hình thành thâm, sạm da.\n\n[Dầu Dưỡng Kiara Maracuja Oil Hạt Chanh Dây 30ml](https://preview.redd.it/ebgtl6l07sy51.jpg?width=1000&format=pjpg&auto=webp&s=43482e760e203a0952cbb495038c6209fda37503)\n\n**Công dụng Kiara Maracuja Oil**\n\n* Giúp làm giảm mụn trứng cá\n* Giúp da luôn căng bóng và mịn màng\n* Chống oxy hóa làn da\n\nLoại da phù hợp để sử dụng: Da mụn và sử dụng trên toàn mặt.\n\nGiá bán chính hãng: **740.000 VND**\n\n[**Đặt hàng ngay**](https://ohgood.vn/dau-duong-kiara-maracuja-oil-hat-chanh-day-30ml-503.html)\n\n**#3  Dầu hạt nho Kiara Grapeseed Oil**\n\n**Thành phần: 100% Vitis Vinifera Seed Oil**\n\nDầu hạt nho chứa rất nhiều axit linoleic và vitamin E, là một loại thành phần rất phổ biến trong các loại kem cao cấp, đắt tiền. Bằng cách cung cấp độ ẩm cho da với các axit béo tự nhiên trong hạt nho có chứa chất chống oxi hóa cực mạnh PTOs giúp tăng cường sản xuất collagen. Vì thế dầu hạt nho được áp dụng hiệu quả trong việc xóa tan quần thâm mắt, giảm vết nhăn, vết rạn.\n\n[Dầu hạt nho Kiara Grapeseed Oil](https://preview.redd.it/68jacjf37sy51.jpg?width=745&format=pjpg&auto=webp&s=8b34f6391649ca36976aaafc7419b7543087073a)\n\n**Công dụng Dầu hạt nho Kiara Grapeseed Oil**\n\n* Giảm vết thâm do mụn và thâm quầng trên mắt\n* Giảm nếp nhăn trên da\n* Cấp ẩm do da, làm cho da mềm mịn\n\n**Phù hợp: Cho mọi loại da**\n\n**Giá bán chính hãng: 600.000 VND**\n\n[**Đặt hàng ngay**](https://ohgood.vn/dau-duong-kiara-grapeseed-oil-hat-nho-30ml-504.html)\n\n**#4 Tinh dầu hoa anh thảo Kiara Evening Primrose Oil 30ml**\n\n**Thành phần: 100% Oenothera Biennis Oil**\n\nCác axit béo trong tinh dầu hoa anh thảo có thể cải thiện tình trạng mụn trứng cá, đóng vai trò cấu trúc lại tế bào, giúp cải thiện chức năng hệ thần kinh và thúc đẩy độ đàn hồi của da.\n\n[Tinh dầu hoa anh thảo Kiara Evening Primrose Oil 30ml](https://preview.redd.it/ee7xd6597sy51.jpg?width=2200&format=pjpg&auto=webp&s=ff9184de498745f9e411adf3283c499ae3030a7a)\n\n**Công dụng Kiara Evening Primrose Oil**\n\n* Cấp ẩm cho da, giúp da trở nên căng bóng, mịn màng\n* Cấp dưỡng chất cho tóc giúp tóc trở nên mềm mượt\n\nLoại da phù hợp:\n\n## Loại da phù hợp sử dụng: Da khô và da nhạy cảm\n\n**Giá bán: 700.000 VND**\n\n[**Đặt hàng ngay**](https://ohgood.vn/dau-duong-da-phuc-hoi-va-lam-diu-kich-ung-kiara-evening-primrose-oil-30ml-583.html)\n\n**#5 Tinh dầu tràm trà**\n\n**Thành phần: 100% Melaleuca Alternifolia Leaf Oil**\n\n[Tinh dầu tràm trà](https://preview.redd.it/841kqbtb7sy51.jpg?width=800&format=pjpg&auto=webp&s=c1117d246305b76f7802ac4a10544813aa678ae3)\n\n**Công dụng:**\n\n* Kháng khuẩn, kháng nấm\n* Điều trị mụn\n* Giảm triệu chứng chàm\n\nLoại da phù hợp:  Chấm mụn, chấm da đầu bị gàu.\n\n**Giá bán chính hãng: 479.000 VND**\n\n[**Đặt hàng ngay**](https://ohgood.vn/san-pham/tuan-le-doc-than-thang-11/tinh-dau-kiara-tea-tree-oil-tram-tra-giam-mun-10ml-506.html)\n\n**Trên đây là những gì mình hiểu biết về các sản phẩm của Kiara. Cảm ơn các bạn đã theo dõi bài viết này. Nếu cảm thấy hay và hữu ích bạn có thể chia sẻ bài viết này cho bạn bè cùng biết.**\n\nNếu có nhu cầu mua sản phẩm bạn vui lòng truy cập website: [**https://ohgood.vn**](https://ohgood.vn) để đặt hàng tìm hiểu thêm về giá sản phẩm và các chương trình ưu đãi.",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "curlyhair",
    "post_id": "1xg85b",
    "title": "Falling in Love with L'Oreal EverCurl Hydracharge Conditioner !!",
    "url": "https://www.reddit.com/r/curlyhair/comments/1xg85b/falling_in_love_with_loreal_evercurl_hydracharge/",
    "score": 3,
    "num_comments": 0,
    "created": "2014-02-09T18:51:17+00:00",
    "body": "Hi! I'm new to Reddit and so psyched I found the curlyhair group on my first day. I wanted to just share my two cents with the group. I read an article recently about the benefits of using \"sulfate-free\" products on your hair and I'm here to preach! My hair has felt not only softer, but healthier over the weeks using this product. \n \n**The Basics**\nEverCurl is Sulfate-Free Curl Care system. Key word ladies, \"SULFATE-FREE!!\"\n\nThe Ingredients (as listed on product): \nAQUA / WATER / EAU • CETEARYL ALCOHOL • GLYCERIN • BEHENTRIMONIUM CHLORIDE • CETYL ESTERS • ISOPROPYL MYRISTATE • QUATERNIUM-80 • POLYSORBATE 20 • PARFUM / FRAGRANCE • PHENOXYETHANOL • ISOPROPYL ALCOHOL • BENZYL BENZOATE • BENZYL ALCOHOL • POLYQUATERNIUM-37 • PARAFFINUM LIQUIDUM / MINERAL OIL / HUILE MINERALE • COCOS NUCIFERA OIL / COCONUT OIL • VITIS VINIFERA SEED OIL / GRAPE SEED OIL • CHLORHEXIDINE DIHYDROCHLORIDE • LINALOOL • HEXYL CINNAMAL • BUTYLPHENYL METHYLPROPIONAL • PPG-1 TRIDECETH-6 • COUMARIN • AMINOMETHYL PROPANOL • HIBISCUS ESCULENTUS / HIBISCUS ESCULENTUS SEED EXTRACT • CITRUS AURANTIUM DULCIS OIL / ORANGE PEEL OIL\n\n**Price**\nFound this miracle formula for a steal - only $6.99!\n\n\n**Where to Buy**\nI found this gem at a local grocery store. I bet you can pick it up at most CVSs or Walgreens as well. \n\n**How to Use**\nSimple. Apply like any other conditioner and leave in for 2 minutes. Then, Rinse. \n\n**Pros**\nTo put it simply, I have fallen in love with this product! It leaves my curls feeling well nourished and FRIZZ-FREE for most of the day. Since I don't put any gels or creams in my hair after showering(yup, I leave my curls naked), this product does the trick for keeping my hair looking fresh and healthy for the day. \n\n**Cons**\nUnlike the other conditioners I've tried, I noticed my hair is pretty tangled when getting out of the shower with this product. It leaves me dreading the combing routine after the shower a bit more. \n",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "1l4qrf5",
    "title": "[Routine Help] Can I use these ingredients on my face",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/1l4qrf5/routine_help_can_i_use_these_ingredients_on_my/",
    "score": 0,
    "num_comments": 3,
    "created": "2025-06-06T12:08:12+00:00",
    "body": "Hi, these are products I use for my body with sensitive skin and eczema. I tried them on my face a few times and liked the results. Im starting a strong retinol soon and thought maybe they would be a good combo.\n\nIm super thankful for help.\n\n  \n**Cream I would use as daycream** \\- Aqua, Glycerin, Helianthus Annuus Seed Oil, Butyrospermum Parkii Butter, Caprylic/Capric Triglyceride, Vitis Vinifera Seed Oil, Cetearyl Alcohol, Glyceryl Stearate Citrate, Hydroxypropyl Starch Phosphate, Hydrogenated Coco-Glycerides, Oenothera Biennis Oil, Glycyrrhiza Inflata Root Extract, Decylene Glycol, Menthoxypropanediol, Ceramide NP, Phytosphingosine, Oleic Acid, Glycine, Sodium PCA, Tocopherol, Ascorbyl Palmitate, Xanthan Gum, Sodium Hydroxide, Sodium Citrate, Citric Acid, 1 , 2 - H e x a n e d i o l , P h e n o x y e t h a n o l , Ethylhexylglycerin, Hydroxyacetophenone.\n\n  \n**'Cleanser' -** Glycine SOJA Oil\", \" Ricinus Communis Seed Oil\", \" Laureth-4\", \" MIPA Laureth Sulfate\", \" Poloxamer 101\", \" Laureth-9\", \" Propylene Glycol\", \" Aqua\", \" BHT\", \" Propyl Gallate\n\n  \n**Cream I would use at night -** Aqua, Glycerin, Paraffinum Liquidum, Vitis Vinifera Seed Oil, Oenothera Biennis Oil, Octyldodecanol, PEG-7 Hydrogenated Castor Oil, Dimethicone, Glycyrrhiza Inflata Root Extract, Ceramide NP, Tocopherol, Ozokerite, Sorbitan Isostearate, Methoxy PEG-22/Dodecyl Glycol Copolymer, PEG-45/Dodecyl Glycol Copolymer, PEG-2 Hydrogenated Castor Oil, Hydrogenated Castor Oil, Ascorbyl Palmitate, Citric Acid, Sodium Citrate, Magnesium Sulfate, BHT, 1,2-Hexanediol, Phenoxyethanol, Potassium Sorbate.",
    "flair_text": "Routine Help",
    "flair_template_id": "cfac5f32-d014-11e3-89fd-12313b073d11",
    "comments": [
      {
        "author": "kerodon",
        "body": "These look fine except for the day cream that has menthoxypropanidiol which is a menthol derivative. That could trigger eczema.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Are you brand new to skincare? Don't know how to build a skincare routine? The best place to start is our [ScA Routine](https://www.reddit.com/r/SkincareAddiction/wiki/sca_routine/)! \n\nYou can find even more skincare guides [in our wiki!](https://www.reddit.com/r/SkincareAddiction/wiki/index). Your answer might already be in there (and if it is, we might remove your post).\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "macbook",
    "post_id": "1e6qrlp",
    "title": "Spilled Acetone on Macbook Air M2",
    "url": "https://www.reddit.com/r/macbook/comments/1e6qrlp/spilled_acetone_on_macbook_air_m2/",
    "score": 0,
    "num_comments": 10,
    "created": "2024-07-19T00:35:59+00:00",
    "body": "Hi all! I want to start off by saying I made a major mistake and was reckless, I understand that so please be nice! \n\nThis happened about half an hour ago, I had my macbook air m2 open on my desk and accidentally knocked over a bottle of professional nail polish soak-off (ingredients: Acetone, Tocopheryl Acetate, Vitis Vinifera Seed Oil, Denatonium Benzoate Fragrance, CI 61565 (D&C Green No. 6), CI 47000 (D&C Yellow No. 11)). It poured out about 2-4 fl oz (this is a very rough estimate) all over the key board, gap between the keyboard and screen, and a bit of the bottom of the screen.\n\nI immediately tipped it over to drain the excess liquid and wiped it down with paper towels for a good couple of minutes. I had to keep shutting it off because wiping down the keyboards kept booting the laptop up again.\nI know that acetone is extremely corrosive for plastics and other materials, and a good portion of my keyboard’s plastics are damaged. There is also a good amount of damage (about 1/3) in the screen. \n\nWhen I was cleaning it off, it seemed to be working, but I know there could be a delay in damage as the acetone could have still been seeping through my computer. \n\nI am setting it aside for the night and in the morning I’ll check it over, and I’ll try to take it to Apple or a third party to evaluate the damage and possibility of repair.\n\nI wanted to see your guys’ opinions on what the possibility of repair might be, though I understand it can’t be known until I have it checked over by professionals. Does it seem like there is a possibility of repair? I am fine with outside damage as I am mostly concerned with the functionality of the inner-workings. \n\nThanks in advance, I am really devastated.\n\n[Edit]: Hi everyone, thank you for the replies! I got it checked out and decided to just buy a new laptop and transfer the data over! ",
    "flair_text": null,
    "flair_template_id": null,
    "comments": [
      {
        "author": "Darkage-7",
        "body": "I mean without posting any pictures of the extent of the damage, you really don’t give much for anyone to give an honest opinion",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Pro_Ana_Online",
        "body": "Between the screen itself and the probable damage to the logic board you're likely screwed. Keep it off for 48 hours. Don't turn it on again.\n\n The absolute best you can hope for is that the Mac still turns on and seems normal aside from the screen being damaged in which case you can use an external monitor. This is the only modest/moderate hope at this point. Don't turn it on in 48 hours again or this glimmer of hope will be at huge risk.\n\nThe logic board is not worth replacing as it's almost the whole cost of the Mac (As is the screen almost the whole cost of the Mac. If everything \"seems\" fine minus the screen the temptation would be to replace the screen, but this would be a mistake since now that the logic board has been exposed to liquid it can take months for things to corrode. If things seem to work fine for 3-6 months with the logic board you could theoretically consider replacing the screen, but unless you have a highly souped up model (more ram, more storage) than the base model it's not worth it.\n\nGetting a baseline M1 MacBook Air from the Apple Refurbished store and selling this on Ebay to a technician is likely your best option unless the Mac still works minus the screen damage and you're OK with using a cheap external monitor turning this into a \"desktop\" computer.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SeaRefractor",
        "body": "Yikes.\n\nAcetone will etch some of the fine graphite lines that might be exposed in the keyboard contacts as well as the connectors for various connections on the mainboard.\n\nThe oils are also not good as a residue that can contribute to shorting will remain and dust will eventually make carbon bridges.\n\nAppleCare+?\n\nIf not, let it sit for far more that 48 hours and then even if it works expect it's duty life to be cut significantly short.   I'd start the savings for the M3 MBA your subconscious apparently wanted.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddiction",
    "post_id": "iaml9t",
    "title": "[Misc] retinol in daily cleansing oil??? Confused!!!",
    "url": "https://www.reddit.com/r/SkincareAddiction/comments/iaml9t/misc_retinol_in_daily_cleansing_oil_confused/",
    "score": 0,
    "num_comments": 3,
    "created": "2020-08-16T04:56:39+00:00",
    "body": "I’ve noticed that the Simple cleansing oil has retinyl palmitate in it which is an active ingredient. I have been using it every single night as a first cleanse. Should I stop??? These are the ingredients:\n\nVitis Vinifera Seed Oil, Isopropyl Palmitate, Sorbeth-30 Tetraoleate, Phenoxyethanol, BHT, Helianthus Annuus Seed Oil, Isopropyl Myristate, Retinyl Palmitate, Tocopheryl Acetate",
    "flair_text": "Miscellaneous",
    "flair_template_id": "56f33ba0-35e0-11e5-9715-0ee61c357d3b",
    "comments": [
      {
        "author": "ReaLitTea",
        "body": "It should be fine, it's used as an antioxidant. \n\n[https://www.paulaschoice.com/ingredient-dictionary/antioxidants/retinyl-palmitate.html](https://www.paulaschoice.com/ingredient-dictionary/antioxidants/retinyl-palmitate.html)",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SkincareAddiction is a friendly community of skincare enthusiasts.**\n\nIn search of your own skincare advice?\n\n* Read our resources in [the sidebar](https://www.reddit.com/r/skincareaddiction/wiki/config/sidebar) or the extensive [wiki](https://www.reddit.com/r/SkincareAddiction/wiki/index)\n* Get advice in the [Daily Help Thread](https://www.reddit.com/r/SkincareAddiction/comments/ialydj/new_or_need_help_ask_here_sca_daily_help_thread/)\n\nSee something that breaks [our rules](https://www.reddit.com/r/SkincareAddiction/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SkincareAddiction/wiki/how_to/report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SkincareAddiction/wiki/about); remember to be kind and assume good faith :)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SkincareAddiction) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "anticoriander",
        "body": "Thats just vitamin a. Retinol is derived from vit a, but not the same thing.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "tressless",
    "post_id": "1lw2fwh",
    "title": "Any validity to this product being sold by a social media influencer?",
    "url": "https://www.reddit.com/r/tressless/comments/1lw2fwh/any_validity_to_this_product_being_sold_by_a/",
    "score": 0,
    "num_comments": 4,
    "created": "2025-07-10T03:19:52+00:00",
    "body": "I have been in and out of this subreddit over the last couple of years, so I have been losing track of developments or any hair loss prevention updates. I'll be going through the beginner's guide after this post, but I thought I would ask about this since I didn't see anywhere using the search feature.\n\n\"prsprwellness Root revive hair growth oil\" is the product. He claims this mix of ingredients is what reversed his hair loss so he decided to put it all into one bottle.\n\n**INGREDIENTS:**  \n  \nRicinus communis Seed Oil (Castor Oil), Cucurbita Pepo Oil (Pumpkin Seed Oil), Prunus Armeniaca Oil (Apricot Kernel Oil), Vitis Vinifera Seed Oil (Grapeseed Oil), Persea Gratissima Oil (Avocado Oil), Olea europaea Fruit Oil (Olive Oil), Nigella Sativa Seed Oil (Black Seed Oil), Emblica Officinalis Fruit Extract (Amla), Bacopa Monnieri Leaf Extract (Brahmi), Trigonella Foenum Graecum Seed Extract (Fenugreek), Mentha Piperita Leaf Oil (Peppermint), Rosmarinus Officinalis Leaf Oil (Rosemary), Lavandula Angustifolia Flower Oil (Lavender)\n\nI never trust products I see on social media, but I really wanted to ask about it to get a definitive answer, and maybe so others can run into this post later when they search it up :)",
    "flair_text": "Product",
    "flair_template_id": "406d510a-4ba1-11ea-8492-0e4320351cb3",
    "comments": [
      {
        "author": "Ok-Neighborhood4798",
        "body": "Just another snake oil.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "crunchevo2",
        "body": "It's just oil. \n\nShort answer no. It is not a scientifically backed study and if he actually used this to cure his hairloss then he also used min/fin/dut or had a transplant and is also using the drugs lmao.\n\nhttps://youtu.be/SW2NCv_vF2Q?si=Z8nH8hw8l7VjCLB_\n\nJust dropping this here in case anyone hasn't seen it.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "It looks like this post is about general **products**.\n\nBefore asking any questions,\n\n1. Learn about [different hair loss products](https://tressless.com/learn).\n\n2. [Search for products](https://tressless.com/products)\n\n3. Try posting in the private community for deeper conversations: [https://community.tressless.com/](https://community.tressless.com/)\n\nIf this post is not about hair loss products, please downvote and report.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tressless) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "veekizy",
        "body": "Lol bruh.. it's a social media influencer. Chances are he got a transplant and then started pushing this snake oil to capitalize on his followers. All those people think about is how they can make a buck off the mindless people that believe anything they spew.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 4,
      "top_level": 4,
      "nested_replies": 0
    }
  }
]