[
  {
    "subreddit": "EuroSkincare",
    "post_id": "1lpvk8i",
    "title": "My personal tierlist of salicylic acid cleansers",
    "url": "https://www.reddit.com/r/EuroSkincare/comments/1lpvk8i/my_personal_tierlist_of_salicylic_acid_cleansers/",
    "score": 97,
    "num_comments": 32,
    "created": "2025-07-02T13:14:44+00:00",
    "body": "Over the last 3 years I've tested plenty of cleansers dedicated to helping with acne. Most of them contain around 2% salicylic acid (only Nivea and Garnier are undisclosed, and CeraVe SA has [0.45% salicylic acid](http://kosac.or.kr/bbs.html?bid=paper&sk=&kc=0&kt[]=&ks=&pop=&kh=0&act=hitfile&fileno=1&bno=1417)).\n\nI rated them overall for their ability to actually do something for acne, their price, feel, how they dry skin or not, etc.\n\nHere is an explanation for every placement:\n\n# S Tier:\n\n**Neutrogena Clear&Defend (here in Germany it's Anti Pickel)** \\- it's dirt cheap, effective, lathers well but doesn't dry out skin and has a divine fragrance. It has the lowest pH of all cleansers (4) and I suspect that's why it works so well.\n\n# A Tier:\n\n**Bioderma Sebium Actif** \\-  if Bioderma put it in a bigger bottle with a pump I'd kill for it. This cleanser has a unique cleansing feeling to it. Very interesting lather and feeling. Non-drying and also very effective (it has a pH of 4.5). The only bad point is the packaging and how liquid it is. Whoever decided to put that product into this kind of packaging has to go to jail.\n\n**La Roche-Posay Effaclar Micropeeling** \\- very good, cost-effective cleanser, proven to work with research, very thick, rich lather. I'm not liking it more only because of the menthol addition. I just don't like the cooling feeling.\n\n# B Tier:\n\n**Neutrogena Clear&Defend+ (Anti Pickel+)** \\- newer cleanser from Neutrogena, until recently it had 2% PHA, 2% AHA and 1% BHA, but they removed the 2% AHA from it. Probably most deserving of the \"pimple eraser\" title, but at the same time it's quite strong if you are not an experienced skincare user. I love that it's not fragranced. What I hate about this cleanser is its terrible lather. I know that scientifically you don't need foam to cleanse well, but my brain is not letting me accept that.\n\n**CeraVe Blemish Control** \\- best-selling acne cleanser in Europe and I kind of get why. It's a super safe option, with additions like ceramides, niacinamide and a pH of 5.5. It's nice, but it isn't special, hence B tier. I also didn't find it the most effective and honestly it was kind of more stripping than some other cleansers, like for example Bioderma, which is ironic considering it has much more barrier-restoring ingredients. \n\n**L'Oreal Men Expert Derma Control** \\- Same formula as La Roche-Posay Micropeeling Cleanser but with a strong fragrance. No need to explain further.\n\n# C Tier:\n\n**Nivea Derma Skin Clear** \\- small 150ml packaging, very minimalistic formula, undisclosed percentages. It's nice, but I don't find it particularly interesting or effective. Funny how it's one of the few Nivea's fragrance-free products.\n\n**Eucerin DermoPure Triple Effect**  \\- expensive, strong fragrance, but effective at getting rid of acne, hence no D tier. Do not recommend buying, though.\n\n# D Tier:\n\n**CeraVe SA** \\-  okay cleanser. I'd never call it a \"Smoothing Cleanser\" because except for cleansing it doesn't do much for acne. Do not waste your money.\n\n**Garnier PureActive** \\- this feels like a product from 2005 with awful packaging, terrible black liquid inside, strong fragrance and menthol all together. If you see your crush using it, it's a red flag.",
    "comments": [
      {
        "author": "No-Layer3215",
        "body": "EDIT: Wait, did you just reply to yourself with \"This \\^\" from another account? Both accounts post in the same subreddits, have almost identical writing styles, and focus on the same products. That's kind of lame, to be honest.\n\nI did remove the post after reading more research papers on benzalkonium chloride, including safety assessments from the EU. It's permitted at a maximum concentration of 0.1%, and at that level, it doesn’t pose any significant risk regarding antibiotic resistance. That’s why I chose to delete my original post to avoid spreading misinformation. I'm not afraid to admit when I'm wrong.\n\nNeutrogena is still an American brand, and I continue to avoid U.S.-based products when possible. However, I currently use Neutrogena for both my facial cleanser and body lotion, and L'Oréal Men Expert for body acne, simply because I haven’t found suitable alternatives yet. On the plus side, these particular products are manufactured in Italy, so at least a portion of what I spend stays within Europe. It's not ideal, but it's something.",
        "score": 14,
        "is_top_level": false
      },
      {
        "author": "No-Layer3215",
        "body": "I have very oily skin and tend to sweat a lot. Especially in the summer, I get breakouts on my forehead, cheeks, and chin. I also get them on my back and the backs of my arms. I've been using salicylic acid cleansers to decrease oil production and to exfoliate, making sure sebum doesn't get stuck in my pores.\n\nI've used salicylic acid serums in the past, but I'm terrible at sticking to more extensive routines than the one I have right now, so I just chose to use a salicylic acid cleanser to still get the benefits without having to use a separate product. Also, most BHA serums are too oily or sticky, and I dislike that sensation.\n\n**Morning:** Neutrogena cleanser → Garnier Ambre Solaire sunscreen with niacinamide  \n**Evening:** Bioderma micellar water (if I'm wearing heavier makeup) → Neutrogena cleanser → Neutrogena Deep Moisture body lotion (it's light, so I use it on my face).  \n**Occasionally:** 30% AHA + BHA peel from The Ordinary.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "OriginalCap4508",
        "body": "Do you think bioderma one will work for dry skin? Also does it remove sunscreen in one step? Great post btw",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "No-Layer3215",
        "body": "I think it mostly depends on how often you're going to use it. I wouldn't trust it to remove sunscreen in one step, though, since it only has two very mild surfactants.\n\n\n\nFrom this list, I'd only trust Neutrogena Clear & Defend, La Roche-Posay, and L'Oréal Men Expert to remove sunscreen in one go. They emulsify residual skincare at the end of the day most effectively for me.",
        "score": 6,
        "is_top_level": false
      },
      {
        "author": "Kind-Profession7376",
        "body": "Can I please ask how exactly these cleansers have helped with your acne? To what extent do you think a salicylic acid cleanser has helped specifically over other ingredients/products?\n\nAnd what is the rest of your routine please?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "xLavena",
        "body": "Did you check pH levels yourself, get them from companies, or are there resources on the internet that list them? I would love to check pH levels of some of my cosmetics, but I loathe messaging brands about every little bit of info about them.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "cardboardbox_ofcards",
        "body": "Off-topic question: where does the letter grading come from? I mean, why S, A, B, C, D?\n\nEDIT: also, the colours... Does S mean the best? But then why red...",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "No-Layer3215",
        "body": "I have pH measuring strips, but they're kind of trash and very imprecise. A better pH meter is more expensive, and I wasn't interested enough to buy one. Neutrogena discloses their pH on the product packaging, and for the rest, I had to do a lot of Googling to find the exact values.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "sphericalhors",
        "body": "It seems like we never meant to date.\n\nI'm going to use the Garnier one, because it is cheaper than dirt.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Creamy-Creme",
        "body": "Same thoughts. I know that red S-tier is meant to be the best of the best, but my brain automatically interprets it as \"sucks - avoid at all costs\"",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "saif6333",
        "body": "I have oily skin and I'm also a dude so keep that in mind but it's also very sensitive and easily irritated by some products and it didn't feel stripping at all. It also does remove water resistant sunscreens pretty well without the need for a different cleanser. It removes acne pretty well but i never repurchased it since the tube is a bit of a hassle to use. Also doesn't help that it's very liquidy, almost like water so dispensing it was always a challenge 😅  shouldn't discourage you from trying though, I'm just very lazy and always in a hurry so i prefer pump dispenser packaging.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "OriginalCap4508",
        "body": "Thank you",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Kind-Profession7376",
        "body": "Thank you very much! I struggle with hormonal acne myself, so I'm trying to see how much a salicylic acid cleanser will help.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "xLavena",
        "body": "Great, thanks!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "No-Layer3215",
        "body": "I mean, I am a bit dramatic. It's not bad, but it just gives me a bad vibe 😄. The formula itself is very similar to the LRP one and has a similar feel, but they changed a lot more, so I'm not sure if it's exactly the same base with 2% salicylic acid.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "attilio_",
        "body": "I've read more than once that LRP and L'Oreal share the same formula, is that not actually true or why are they in different tiers?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Lyracarina",
        "body": "I only tried Nivea one last summer. It didn't dry out the skin and cleansed nicely, but it didn't feel much effective either. This summer, I went with Nø cosmetics toner instead of a cleanser. I have been using it for 2 months, and it seems to be working better for me.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "FreePossession9590",
        "body": "I agree with Neutrogena being on top. That cleanser is insanely good",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "saif6333",
        "body": "Agree with this whole chart. I've used pretty much all of these cleansers. Neutrogena wins all day. Has known, disclosed 2% salicylic acid and actually clears blemishes in a single day for me and as the op has stated, doesn't dry out my skin at all. It goes by a different name here in Asia and i believe also in the US and elsewhere (oil free acne wash) but i believe they all have pretty much the same formula. That green Bioderma tube is a very close second and has glycolic acid as an added bonus.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "saif6333",
        "body": "Your welcome 🤗",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 9,
      "nested_replies": 11
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1krm0f8",
    "title": "Day 2 salicylic acid post cryo",
    "url": "https://www.reddit.com/r/Warts/comments/1krm0f8/day_2_salicylic_acid_post_cryo/",
    "score": 94,
    "num_comments": 13,
    "created": "2025-05-21T01:37:07+00:00",
    "body": "",
    "comments": [
      {
        "author": "peppercornau",
        "body": "Dear God, it’s beautiful 🤩",
        "score": 16,
        "is_top_level": true
      },
      {
        "author": "Successful_Advice45",
        "body": "Keep going!",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "Kittymeow123",
        "body": "Oh my gaaawwwwdddddddd",
        "score": 9,
        "is_top_level": true
      },
      {
        "author": "Vatreno",
        "body": "You need help!",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "KeyElk2391",
        "body": "Continue to share evolution with us. Nice case",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Separate_Leading6235",
        "body": "Looks like the inside of a dragon fruit",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "MikeSP5659",
        "body": "That does look awesome lol",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "madeline-madeline",
        "body": "Ugh I want to slice it away so bad",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Henryr97",
        "body": "debride",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Wilsoh10",
        "body": "Woah.  \nPlease wear gloves!!!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Impossible_Honey3553",
        "body": "That hits the spot",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "MikeSP5659",
        "body": "Had one like this on same spot for 20 years had it burned freezes n always came back n couple years ago I picked at it n cut out all of the blood vessels idk what I did differently but it looked weird for a couple days n vanished. I don’t miss it but I miss cutting n picking it lol",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Different_Scratch_74",
        "body": "Did you start SA after it blistered and popped from post cryo? Or started SA right away?",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 13,
      "top_level": 10,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "indianbeautyhauls",
    "post_id": "1l36tzu",
    "title": "Got the cosrx salicylic acid facewash for just 326rs",
    "url": "https://www.reddit.com/r/indianbeautyhauls/comments/1l36tzu/got_the_cosrx_salicylic_acid_facewash_for_just/",
    "score": 24,
    "num_comments": 11,
    "created": "2025-06-04T14:22:22+00:00",
    "body": "I got this COSRX Salicylic Acid Cleanser from Myntra. The deal seemed good, but I’m a bit skeptical about the authenticity. Can someone guide me on how to check if it’s original?",
    "comments": [
      {
        "author": "funssake",
        "body": "It's original.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "okiedokiee000",
        "body": "How do you know?🥺",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "funssake",
        "body": "Importer label and just by the packaging itself.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "thepluralofu",
        "body": "how'd get the deal?",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "okiedokiee000",
        "body": "I’ve heard it works well for oily and combination skin. I’m also trying it for the first time, so let’s see how it goes",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "heyitsvicx",
        "body": "is this good for oily skin?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "heyitsvicx",
        "body": "okayy please give a review if you can after using :)",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "LunaSnowflakes",
        "body": "You can go on their website and check the authorised resellers list; it might help.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "Dear okiedokiee000, Thank you for your post! &#128522;\n\nWe appreciate your contribution to the sub. To ensure that your post stands out and provides valuable information, please remember to include relevant details about your haul.\n\nMake it informative and exciting by mentioning the purchase site/app, product brand name, sale name, purchase value, as well as the order and delivery dates.\n\nLet's make your post a hit! &#128588;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/indianbeautyhauls) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Hrick111",
        "body": "I ordered from Ajio it came without this box but it had plastic wrap and limese sticker on that. Now I am scared.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Old-Conclusion-1495",
        "body": "I got one from ajio too , it is authentic",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 11,
      "top_level": 6,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "chemistry",
    "post_id": "1l87w2i",
    "title": "Salicylic Acid solution might have gone wrong 🫣",
    "url": "https://www.reddit.com/r/chemistry/comments/1l87w2i/salicylic_acid_solution_might_have_gone_wrong/",
    "score": 21,
    "num_comments": 27,
    "created": "2025-06-10T19:27:50+00:00",
    "body": "What you see in the picture is a solution of 20% Salicylic Acid and 80% Propylene Glycol... Left overnight it turned to a light pink color + some recrystallization on the sides of the beaker... can you help me with what might have gone wrong ?",
    "comments": [
      {
        "author": "wylii",
        "body": "You’re right on the cusp of max solubility for SA in PG. You can dissolve 8g into about 40mL without heating. Add a little more PG or just heat the solution.",
        "score": 18,
        "is_top_level": true
      },
      {
        "author": "RuthlessCritic1sm",
        "body": "Pretty common to see that color when ASS degrades in the presence of water. Might be the salicylic acid - Fe3+ complex. I would have said that's it for surey but it apparently only got that color in the fridge, yes? In that case, I don't know for sure. But from working with ASS, yeah, I see exactly that color a lot from decomposition.",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "TBSchemer",
        "body": "Most poisons can't be felt as they're doing their damage.",
        "score": 9,
        "is_top_level": false
      },
      {
        "author": "RuthlessCritic1sm",
        "body": "My experience with that exact color comes from ASS. When it degrades to SA in the presence of water and traces of iron (I think we have around 100 ppm in our raw material), I see that color.\n\nI always attributed it to iron + SA, but now I not sure. The reaction should be fast. Maybe it is slow in PEG, or a different reaction causes that.\n\nEither way, the color seems very familliar, whatever it is, it's not a lot.",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "HerpetologyPupil",
        "body": "You know what else is wrong? Not wearing gloves",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Infernalpain92",
        "body": "Hello hello fellow cosmetic chemist. \n\nIt is probably iron contamination from the stirrer you used. \n\nGreeting",
        "score": 5,
        "is_top_level": false
      },
      {
        "author": "Dangerous-Billy",
        "body": "The pink is likely from iron leached from the glass or settling dust, which forms a red complex with salicylic acid.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "thelowbrassmaster",
        "body": "That strictness exists for a reason, a lot of people have gotten injured and killed over the years with that lax attitude. I got into an argument over the phone with my cousin in Germany when she said gloves aren't required for chemistry, it is just such a weird cultural difference to ignore safety because it isn't strictly necessary.",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "inlovewithtimo",
        "body": "This answer makes the most sense, it never crossed my mind !!!\nThank you fellow cosmetic chemist",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "inlovewithtimo",
        "body": "It actually wasn't left in the fridge, it was left in room temperature over night, do you believe temperature could be the issue here?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "inlovewithtimo",
        "body": "I'm a cosmetic chemist, I don't own or work with phenolphthalein so it sure isn't the case here , I'm very intrigued by the pink color 🫣",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Czitrom",
        "body": "If the salicylic acid and the propylene glycol can be trusted to be pure (from chemicals vendor / reagent grade / etc.) and the beaker and spatule were washed properly, then I don't know",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "ratchet_thunderstud0",
        "body": "Salt acid reacts with steel to turn pink.  Did you leave that pick in it overnight?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Nyeep",
        "body": "The whole point of PPE is that you don't need it until you do. If you're not wearing it when you need it, and you don't always know when you'll need it, you're not doing lab work safely.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Czitrom",
        "body": "Check the pH, this looks like when beaker was not washed properly and phenolphthalein was left in it, and somehow received base or turned basic due to precipitation of the acid. Probably this is not the case but who knows. Salicylic acid may also form complexes with some metals, it complexes with Fe3+, but that has a very distinct and intensive purple colour",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Kitchen-Ice2114",
        "body": "Might be that it decarboxylated to phenol. Check the smell",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "numahu",
        "body": "Thst give you some headache?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "BloodFartTheQueefer",
        "body": "Mine also went pink went setting up a classic ester synthesis with I forget what (some small alcohol) but I assumed it was leached from the bug that fell into it. Good to know it was probably something else, I guess",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "HeisenbergZeroPointE",
        "body": "it's strawberry flavor",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Logical-Following525",
        "body": "Don't focus too much on colour",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 11,
      "nested_replies": 9
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kslttz",
    "title": "Hello guys i need help does this looks healing? I've been putting salicylic acid and patching it with duct tape. There's the before and after pic",
    "url": "https://www.reddit.com/r/Warts/comments/1kslttz/hello_guys_i_need_help_does_this_looks_healing/",
    "score": 22,
    "num_comments": 13,
    "created": "2025-05-22T08:44:59+00:00",
    "body": "",
    "comments": [
      {
        "author": "Admirable_Gas_863",
        "body": "Brother, that is a hospital visit or a emergency department. Dr. Dear god  go to the doctor. You need to go to the doctor right now. You've literally burned your finger off",
        "score": 22,
        "is_top_level": true
      },
      {
        "author": "AlmightyPush-up",
        "body": "Is it under your nail? How did you get through the nail? D:",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "Putrid-Calendar-1429",
        "body": "Yeah go see somebody…that doesnt look right your wart shouldn’t be oozing pus probably infected",
        "score": 13,
        "is_top_level": true
      },
      {
        "author": "crap_thrower",
        "body": "That's what I came to ask!!! Holy 😱🫣",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "Little_Huckleberry96",
        "body": "Black puss got out is that not enough? Ye really painful. Dermatologist said just put on some salicylic just a waste of time they don't give out really helpfull advices",
        "score": 8,
        "is_top_level": false
      },
      {
        "author": "terrantaryn",
        "body": "I don’t think this looks infected, I just think it looks really bad to people because you had to go through the actual nail itself. If this was somewhere else on your hand people wouldn’t think it looks as bad. \n\nAgree with the other commenter that it’s still there, those black dots are still wart tissue. Continue treatment and trimming, don’t stop now when you’ve already made so much progress! \n\nCan’t imagine how painful this must be, but keep up the good work with your treatments and you’ll hopefully reach the end soon. If you do start to get a red ring or red lines coming from the area, or fluid puss (not just white tissue), consult urgent care or a minute clinic and get treatment for a potential infection.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "happendividual",
        "body": "Black dots means it's still there. Im afraid this must hurt a lot if you go any deeper, is consulting dermatologist an option for you?",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "MuffinCloud24",
        "body": "You’re going to hate my advice. As someone that’s dealt with verruca warts before on the underside of the big toe, you have to keep going and apply more salicylic acid. When my warts were like this, super exposed, partially bleeding after a good debriding session, I applied gobs of SA right back on top. You’re exposing the roots of the wart right at the base of your capillaries where it feeds. Kill it now while it’s weak and vulnerable. People that say “give it a day or two to heal” would also letting the wart heal and re-entrench itself in your newly healed skin. I battled on and off for 3 years and when I thought I got it all (similar to what you’re showing in your picture), it came right back and it was like starting from square 1 a month later. Go a little further as well with the treatment on the left side of your finger where you see the brown dried blood spot.",
        "score": 7,
        "is_top_level": true
      },
      {
        "author": "Little_Huckleberry96",
        "body": "Thankyou so much i have someone with the same experience i just wanna get this over with it's so much painful but can i ask did your nail grew back after?",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "MuffinCloud24",
        "body": "Sorry I should clarify, it wasn’t underneath my nail but rather the underside of my toe where I walk and apply direct pressure. My mom has had some of her nails pulled before though where they were removed 100% and they grew back.\n\nHere’s what mine looked like - \n\nhttps://www.reddit.com/r/Warts/s/BW5Mu4qxUI\n\nhttps://www.reddit.com/u/MuffinCloud24/s/E7axRTOOBj",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Little_Huckleberry96",
        "body": "How did you know when to stop? Or how long should i keep this up can you give me some advice or the stages of the wart thank you so much",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "MuffinCloud24",
        "body": "When you debride, you’re removing the top layer of dead skin. You keep going deeper into the layers of your skin and eventually you get to a point where the layer of your skin looks like smooth grooves again with your normal ridges (I’d imagine under the fingernail it would be smooth rather than a fingerprint looking texture). Take for example what you have now - it’s bumpy and it looks like there are a bunch of craters. That’s wart tissue that needs to go. Marie Kondo that sucker because it’s not bringing you joy.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Lpac0987",
        "body": "This kinda looks like this thing I had at the same exact spot on my finger, ended up getting an xray and my fingertip was broken and my bone was like healing and tryna grow out of my finger lmao",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 13,
      "top_level": 7,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1l9aohl",
    "title": "Wart progress… a week using salicylic acid",
    "url": "https://www.reddit.com/r/Warts/comments/1l9aohl/wart_progress_a_week_using_salicylic_acid/",
    "score": 22,
    "num_comments": 0,
    "created": "2025-06-12T02:01:16+00:00",
    "body": "",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1liv8wb",
    "title": "Salicylic acid, Lazer treatment and prayers",
    "url": "https://www.reddit.com/r/Warts/comments/1liv8wb/salicylic_acid_lazer_treatment_and_prayers/",
    "score": 19,
    "num_comments": 0,
    "created": "2025-06-23T23:00:11+00:00",
    "body": "",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1l6chzc",
    "title": "Salicylic acid skin peel",
    "url": "https://www.reddit.com/r/Warts/comments/1l6chzc/salicylic_acid_skin_peel/",
    "score": 14,
    "num_comments": 2,
    "created": "2025-06-08T13:44:42+00:00",
    "body": "I have a small plantars wart on the bottom of my foot. I wore a 40% salicylic acid patch, per doctor, for 48 hours and a large layer of skin peeled off. What do you all do to treat the skin area? ",
    "comments": [
      {
        "author": "cave_ad_sum",
        "body": "My advice is to stop using large band-aids since there's absolutely no point in damaging this much healthy tissue for such a small wart. If I were you I would switch to salicylic or formic acid, and only apply it on the wart itself.",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "SomedayTodayMe",
        "body": "You might want to show this photo to your doctor and ask how did it go. I would treat the peeled area with zinc oxide cream, cover with gauze and let the wart stay dry for now.",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kzob8z",
    "title": "Wart on finger – treated with salicylic acid, now it looks like this. What should I do next?",
    "url": "https://www.reddit.com/r/Warts/comments/1kzob8z/wart_on_finger_treated_with_salicylic_acid_now_it/",
    "score": 14,
    "num_comments": 3,
    "created": "2025-05-31T04:19:18+00:00",
    "body": "Hey everyone,\n\nI've been treating this wart on my finger using 30% salicylic acid for about 5 days. A thick white layer formed, and I carefully removed it after soaking in warm water. Now the core looks red, raw, and exposed – kind of like small blood vessels or a wound.\n\nI'm a bit unsure how to proceed. Should I continue applying salicylic acid even though the middle looks raw and sensitive? Or should I stop and let it heal?\n\nIt's not bleeding or extremely painful, just tender with some puss going on.\n\nAny advice?\n\n",
    "comments": [
      {
        "author": "Henryr97",
        "body": "if it was me i’d carry on because water tissue is still there and now that it’s exposed is the best time to strike it with acid",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "happendividual",
        "body": "Since it's watering I'd let it dry out first for a few hours to a day, then apply acid again",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Mikao542",
        "body": "Wait at least 24 hrs , if you apply the acid now it will be far too painful. It’s a slow and frustrating process that can take up to 8 weeks to fully get rid of. Apply the acid, wait until the skin turns white, cut off the dead skin carefully and repeat!",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1l44lug",
    "title": "Accidentally been applying monochloroacetic acid thinking it was salicylic acid",
    "url": "https://www.reddit.com/r/Warts/comments/1l44lug/accidentally_been_applying_monochloroacetic_acid/",
    "score": 12,
    "num_comments": 9,
    "created": "2025-06-05T17:07:28+00:00",
    "body": "Hello, I bought a new wart treatment (dr yglo) in a different country and thought it was salicylic acid not monochloroactic acid (which is highly more toxic) \nI have been applying it every day for over a week (since translating the instructions I realise I only should be applying it once a week) \nI’m worried now that I have consumed too much acid, does anyone have any experience with monochloroacetic acid ,\nHave I poisoned myself? Should I keep applying? Is the wart gone? \nI am very anxious and upset with myself\n\n",
    "comments": [
      {
        "author": "PM_ME_FLOUR_TITTIES",
        "body": "If you are located in the US, I would contact poison control and explain your situation in as much detail as possible. They have trained staff available 24/7 to provide you with help exactly like this for absolutely no cost. I don't want to worry you, but the effects I found from my quick search, in my opinion, puts this out of the scope of knowledge I would take to heart from anyone on Reddit. If you're not in the US, see if your country has an equivalent, if not I will see what I can do to help you by calling ours but you're going to have to wait because I have to go drive a bus in a little bit.",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "Right_Freedom8775",
        "body": "Hi, thank you for reaching out\nHere’s a photo of the wound healing\n\nhttps://imgur.com/a/1HAc8si\n\nI wasn’t able to contact any poisons hotline as I am in a different country that doesn’t speak English and my national hotline wasn’t answering \n\nHowever, a friend at home was visiting the doctor and I asked them if they could show the doc a photo and see what they said. Doc said to leave it and keep it covered (didn’t give any advice as to the affects of monochloric acid which seems worrying given the comments on this thread) \nIf anyone knows anything more please enlighten me, but at this point I don’t know what I can do other than stop treating it with acid",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Right_Freedom8775",
        "body": "No pain thankfully, it was hurting in previous days of applying (sort of like a throbbing which makes sense as I was applying a strong acid to an open wound - thinking it was salicylic acid I thought the burn meant it was doing its job 🥲) \n\nI’ll try to see a pharmacist over the next few days and ask their opinion \n\nThank you again for reaching out, your kindness is appreciated",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "PM_ME_FLOUR_TITTIES",
        "body": "Also came back to check in. Just want to throw out there that your intuition/logic is not incorrect. When you begin putting SA on it, it will definitely still throb and burn.\n\n So I can actually get help from the US poison control center online without even placing a call, but when I tried they ask about your age and sex and maybe a few other details that I'd imagine are important. If this is something you're willing to share, feel free to pm me. If not, that's entirely fine as well. Either way I hope the best for you, warts suck but who knows, maybe the scorched earth technique will be in your favor lol.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Henryr97",
        "body": "Definitely contact some sort of medical expert, no one hear or atleast i seriously doubt anyone here will be able to provide you with any valuable information",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "velvetskilett",
        "body": "That is not good. That shit can cause some nasty damage. Not to mention what it may have done to your eyes already.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "schlucks",
        "body": "OP really going nuclear on this wart",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SomedayTodayMe",
        "body": "I really want to know that you and your finger are ok. Were you able to contact anywhere?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "SomedayTodayMe",
        "body": "Thank you so much for replying, so good to hear you are ok. I'm not a doctor, but I don't see anything alarming in the photo. However, if monochloric acid is nearly as strong as formic acid, it continues to effect many days after applying. It might be that you will be ok just by stopping the use of acid for now, but if you can get any further information how to proceed from someone in medical field or so, it would be really good. Does it hurt, are you in any pain?",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 9,
      "top_level": 5,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "skincareaddictsindia",
    "post_id": "1lsuzt7",
    "title": "Salicylic acid facewash suggestions?",
    "url": "https://www.reddit.com/r/skincareaddictsindia/comments/1lsuzt7/salicylic_acid_facewash_suggestions/",
    "score": 11,
    "num_comments": 25,
    "created": "2025-07-06T07:00:13+00:00",
    "body": "I",
    "comments": [
      {
        "author": "Popular-Natural-4448",
        "body": "Am i the only one who doesnt like derma co and dot n key ?",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "Spirited_Inflation40",
        "body": "Dot & key is the best if you have oily and sensitive skin. Based on recommendation from my personal use and couple of friends I know.\nYou can also try D’Acne salicylic foaming face wash. that’s also good but expensive than dot & key.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "pagluhabibi",
        "body": "i love dermaco, u can try the foaming one",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Intelligent-Bread474",
        "body": "https://preview.redd.it/qaqbl9h5k7bf1.jpeg?width=1080&format=pjpg&auto=webp&s=825363ff8743159e72e35b060d0bf8e6e825dd7f",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Atharvpatil27",
        "body": "for me, the Minimalist cleanser worked, just make to use a moisturizer after any salicylic acid facewash",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "_Masala_dosa_",
        "body": "I've been using minimalist since 4 years. Wanted to try something else this time.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "ValksIsChill",
        "body": "I’m using that too. It’s soo good!!",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "_Masala_dosa_",
        "body": "Thanks. I liked cica calming gel moisturiser. So I wanted to try their facewash too. This is a one time thing. I use minimalist, just wanted to try something else this time.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "ohlalalal0711",
        "body": "Me too! 🙋‍♀️",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Popular-Natural-4448",
        "body": "I got down voted",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Organic_Customer7069",
        "body": "Not at all. I dont like them either :))",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Organic_Customer7069",
        "body": "Nothing beats neutrogena salicylic acid face wash. Imo.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Atharvpatil27",
        "body": "may i ask, if it worked, why do you wanna change and try a new product?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "_Masala_dosa_",
        "body": "Idk if minimalist changed the formulation or what but it don't lather well anymore.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Odd-Scallion-1365",
        "body": "do you use it twice daily?  the facewash  and does it reduces the oily skin",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Atharvpatil27",
        "body": "Yes and Yes",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Popular-Natural-4448",
        "body": "Hai na, it doesnt work.. feels nothing",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Odd-Juice735",
        "body": "does it work for sensitive skin(with blackheads)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": ">Namaste!\n\nWelcome to r/skincareaddictsindia! Thanks for your submission. We hope you get the best skincare advice, tailored to your needs. This is an actively moderated subreddit, so make sure that you follow the Reddit Content Policy (RCP) and the subreddit guidelines.\n\n**Contact us (modmail) to improve this subreddit and/or our wiki!** Thank you in advance!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/skincareaddictsindia) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Odd-Plan9283",
        "body": "just get aziclear",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 8,
      "nested_replies": 12
    }
  },
  {
    "subreddit": "CanSkincare",
    "post_id": "1lfaqm3",
    "title": "Drugstore salicylic acid recommendedations",
    "url": "https://www.reddit.com/r/CanSkincare/comments/1lfaqm3/drugstore_salicylic_acid_recommendedations/",
    "score": 11,
    "num_comments": 20,
    "created": "2025-06-19T13:24:08+00:00",
    "body": "Hi! I'm looking for a BHA/salicylic acid product that has the right pH and is available in stores here in Canada. I used to love the Life Brand 2% salicylic acid pads at Shoppers but they disappeared 2 years ago and I just ran out of my last jar :( \n\nAny recommendations would be appreciated! Thanks :)",
    "comments": [
      {
        "author": "Bambii2020",
        "body": "Both available at shoppers, naturium BHA and Panoxyl BHA. My fave remains paulas choice BHA which is available at sephora.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Longjumping-Jaguar-1",
        "body": "Naturium BHA liquid exfoliant 2%",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "kimc5555",
        "body": "Cosrx BHA power liquid - its in walmart and Winners often has it. Shoppers has a product from my IN.gredients - salicylic acid solution",
        "score": 5,
        "is_top_level": true
      },
      {
        "author": "NoodleNeedles",
        "body": "I think T&T has the Cosrx, too.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "AppropriateMention6",
        "body": "Paula's Choice 2% BHA Liquid or Pads - available at Sephora.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "ResponsiblePack4734",
        "body": "Reversa acnex cleansing gel",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "luna_nuova",
        "body": "I really like the Naturium BHA!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "kimc5555",
        "body": "it does for sure. walmart or winners is the cheapest. i personally think the bha power liquid is the best on the market",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "skipper1533",
        "body": "The ordinary. There's two salicylic acids. One for more sensitive skin than the other. Plus the salicylic charcoal mask. At Sephora or order directly from the deciem website. Ships out from Mississauga I believe, at least for those of us in ontario",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "MechanicUnhappy1865",
        "body": "I get the life brand from our local  Real Canadian Superstore! I also love it and find it’s tough to beat for the price!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "offtrailrunning",
        "body": "Second this!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Responsible_Tree3027",
        "body": "Yes, I think it does ship from Mississauga even when I order from QC. It’s fast, though!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Reasonable_Phase_169",
        "body": "I ordered from The Ordinary recently and it was delivered less than 24hrs.  I was really impressed.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "mw-98",
        "body": "I like the inkey list serum!",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "mynugzz",
        "body": "I use the Clean & Clear Essentials Acne Toner (pink label) as a cheap all-purpose SA treatment. It’s cheap (like $8.99 on sale), widely available, and the toner format makes it easy to use on the face, body, or scalp as needed. \n\nI don’t know if it has the “correct” pH or not, but it works for me.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Pernopolis",
        "body": "Revolution 2% at shoppers",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "gladtobbrown",
        "body": "the website what’s in my jar has been helpful for me !",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "gelzira",
        "body": "Marcelle Clari-T line. I use the Salycilic Acid toner. They also have gel-cream and facial wash with Salycilic Acid. Currently on sale at Shoppers",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "msmcmuffin",
        "body": "PanOxyl is a staple and available at Shoppers. Good review here https://www.nytimes.com/wirecutter/reviews/best-exfoliants/",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Future_Usual_8698",
        "body": "Oxy pads, regular or sensitive",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 14,
      "nested_replies": 6
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kqgprj",
    "title": "Wart changed colours after salicylic acid",
    "url": "https://www.reddit.com/r/Warts/comments/1kqgprj/wart_changed_colours_after_salicylic_acid/",
    "score": 8,
    "num_comments": 3,
    "created": "2025-05-19T16:53:46+00:00",
    "body": "Did the salicylic acid worsen my wart? It used to be the same colour as my skin. Now it has blood vessels. Is this wrong? Should I stop? Should I go to the doctor?",
    "comments": [
      {
        "author": "No_Feed_4012",
        "body": "Oh that’s great. It’s my first time using SA so I was worried. I didn’t have a good experience seeing the doctor before because it cost me 130usd every other week for months to receive cryotherapy",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Left_Diver5804",
        "body": "You’re getting closer to the wart, but if you’re able I would see a doctor to make sure you’re treating appropriately",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "No_Feed_4012",
        "body": "Thanks for the advice",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 1,
      "nested_replies": 2
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kkbhn6",
    "title": "salicylic acid spread",
    "url": "https://www.reddit.com/r/Warts/comments/1kkbhn6/salicylic_acid_spread/",
    "score": 9,
    "num_comments": 2,
    "created": "2025-05-11T21:11:10+00:00",
    "body": "I did the band aid like treatment with the salicylic acid dots that go over the plantar wart. I think I did it too many days in a row and some of the salicylic acid clearly got elsewhere and now I have this. I put aquaphor and a bandage- anything else you think I should do? (Besides never this again) ",
    "comments": [
      {
        "author": "Henryr97",
        "body": "cut off all dead skin, this is normal",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Henryr97",
        "body": "maybe not as much skin as you but definitely a lot of dead skin is to be expected with plantar warts",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 1,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "IndianPanPorn",
    "post_id": "1lsx505",
    "title": "Emptied Salicylic acid serum",
    "url": "https://www.reddit.com/r/IndianPanPorn/comments/1lsx505/emptied_salicylic_acid_serum/",
    "score": 7,
    "num_comments": 0,
    "created": "2025-07-06T09:26:35+00:00",
    "body": "Finally emptied The Derma co Salicylic acid serum after a long time. I have used The Ordinary, Plum before this. \nThe Ordinary Salicylic acid serum >> Plum Salicylic acid serum >> The Derma co Salicylic acid serum.",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "1kn91hu",
    "title": "Salicylic acid makes things worse?",
    "url": "https://www.reddit.com/r/SebDerm/comments/1kn91hu/salicylic_acid_makes_things_worse/",
    "score": 9,
    "num_comments": 12,
    "created": "2025-05-15T14:04:28+00:00",
    "body": "I tried a shampoo for dandruff that had salicylic acid as one of the ingredients. It made my scalp extremely dry and irritated. It also made my hair feel like straw. Anyone else experience this?",
    "comments": [
      {
        "author": "Niaaal",
        "body": "Yes that's how it is.The only moment you'd want to use Salicylic acid shampoos is when you're trying to exfoliate out the flakes of your scalp. It's not something you want to do often. And when you do you want to moisturize after. \n\nHere is a better way to go about it. Get a bottle of Selsun Blue Medicated 2in1 Shampoo and Conditioner (it works great for Sebderm and doesn't dry out your skin and hair). And second, after you're done washing, you want to moisturize with a few drops of MCT oil everywhere where you have symptoms. And leave it in until next wash. And repeat this routine. In about 2 weeks you will be symptoms free and not even need the Salicilyc Acid because you won't have any flakes to remove",
        "score": 10,
        "is_top_level": true
      },
      {
        "author": "Superb_Usual9138",
        "body": "Yeah, I had this first time I tried SA on my scalp, it helped clear the flakes up but ended up getting so dry it felt like it was worse after a day or two. I later realised how important moisturising is. I think SA is good for getting rid of build up but you'd have to make sure you help your skin barrier out by using some sort of moisturiser after. I use glycerin or squalane oil which works well for me. Good luck!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "CrissBliss",
        "body": "Thank you!!! 🙏",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "CrissBliss",
        "body": "You rock! Thank you 😊",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "CrissBliss",
        "body": "It was my Kamadis shampoo. I stopped using it a few months ago, and tried it again today. It just irritated my scalp for some reason.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "E-ality",
        "body": "Can I ask what shampoo?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "zeeshan2223",
        "body": "No way i dont even use it. Totally messes me up",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "CrissBliss",
        "body": "So bizarre because it’s supposed to help seb derm. I don’t know why it makes things more irritated for me (and others). Maybe we’re all allergic?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "zeeshan2223",
        "body": "i'm pretty sure i have some systemic fungal issue, and i think it triggers a mycotoxin response.\n\nlately i've had luck with vitamin c shampoo and lotion, also chewing up and eating raw garlic before i have breakfast. quercetin once a week helps immune system and energy.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "CrissBliss",
        "body": "Ohh what vitamin c shampoo?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "zeeshan2223",
        "body": "alberto vo5 strawberry. ive read the vitamin c can do well with hard water.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 12,
      "top_level": 5,
      "nested_replies": 7
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "1lbt5h4",
    "title": "Salicylic Acid Cleanser not working!!",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1lbt5h4/salicylic_acid_cleanser_not_working/",
    "score": 7,
    "num_comments": 22,
    "created": "2025-06-15T05:56:24+00:00",
    "body": "So I started using minimalist's salicylic acid cleanser for 2-3 weeks now but it's not doing anything significant. It cures my whiteheads and decreases some marks but then again some bumps or whiteheads come back then again same cycle repeats what to do.\n\nI don't have any pimples just whiteheads and their aftermarks. I get whiteheads very frequently in the region below my lips and above my chin.\n\nI use the cleanser both am and pm.",
    "comments": [
      {
        "author": "akdakd1102",
        "body": "If it’s removing some whiteheads and some marks then it’s doing what it’s supposed to, but it only offers external solutions - which is why you could be getting more whiteheads/pimples. It does depend on weather, diet, other products you are using - a number of other things. It’s also possible that using it twice a day is drying out your skin, so it is producing more oil and whiteheads. Can you tell us your full routine?",
        "score": 12,
        "is_top_level": true
      },
      {
        "author": "introverted_otaku",
        "body": "You might want to try saslic dc wash by Cipla 2% variant .its a strong face wash so use it like two times a week \nCerave sa cleanser is also okay but expensive \n\nAnd for these cleanser keep the face wash for 1min before rinsing out it usually helps with smoothen skin",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Brave_Gold_5051",
        "body": "Same , minimalist products don't work for me. Try using sebosal",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "TaylorWaldorf",
        "body": "when using actives like salicylic acid, instead of using a wash of product which doesnt get much time to work, try using salicylic acid serum by minimalist. it has worked wonders for me",
        "score": 4,
        "is_top_level": true
      },
      {
        "author": "akdakd1102",
        "body": "Everybody’s skin is different, but often when our skin over-produces oil or whiteheads it means it’s dehydrated. Salicylic acid cleanser twice a day is quite harsh, I would use it only at night. In the morning you can wash with only water, or a gentle cleanser. If you don’t feel burning or stinging skin after Vit C and Niacinamide, then they should be okay for your skin (I react very badly to Niacinamide, but that’s me personally). \n\nSkin needs two things to have a strong barrier - humectants (like hyaluronic acid) and moisturizers/emollients (like ceramides). Zitmoist has hyaluronic acid (which pulls water into the skin), but not an emollient. I would suggest looking for a cream that has both ingredients. If your skin barrier is not strong, then any active (Vit C, Salicylic acid, Niacinamide) can cause breakouts. Even if you have oily skin, a good moisturizer is something that will overall reduce oil in the long run.\n\nEdit: personally (and this is entirely up to you), I would cut down on the Niacinamide until you get a good moisturization routine. And I would consider adding a hydrating toner like Tony Moly hyaluronic acid to put on a damp face after washing. I’m in my late 30s, and using a light hydrating toner immediately after washing my face is something I’ve done for 10+ years, and I can see a difference in my skin strength and with dryness and fine lines.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Majestic_Avocado_735",
        "body": "Hello I have same problem can you tell me what's wrong with my skincare routine . Skin type oily and acne prone. Am routine - salicylic acid cleanser , vitamin c serum minimalist,  sunscreen re'equil blue one . Night routine -   salicylic acid cleanser, minimalist niacinamide serum , zitmoist moisturizer.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "akdakd1102",
        "body": "Try to reduce the cleanser to once a day, I’ve used it and it was too harsh to use morning and night. Also, maybe you need to look into another brand ceramide moisturizer.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Mayank_j",
        "body": "Sebogel for spot treatment.      \n\n\nUse facewash for a resting period of 1 minute. And continue with sunscreen as skin might get damaged due to sun exposure on top of exfoliation. \n\n\n\nHonestly get a dermat prescription for some Tretnoin, the quicker u cure ur acne the lesser chance of scarring. Acne scars are tougher to remove and will require lasers / ablation etc, not to mention expensive. Better to prevent scars than treat.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Alone-Ad-8518",
        "body": "i use SEBOZIT 2% (look on amazon), it works for me.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Navigatin-4973",
        "body": "Try to also take in some supplements like glutathione (you get them in oral spray format now) to support your journey here- long term benefits",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "unavot",
        "body": "I feel it's always best to keep your cleanser gentle and incorporate actives in other ways like serums/toners. My hunch is that the SA cleanser is drying you out, and is probably not as effective as SA should be because it's only on your skin for half a minute.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Competitive_Bar8654",
        "body": "I am using minimalist salicylic serum and facing the exact same problem. It's like a never ending cycle. When I apply serum, it reduces my whiteheads but then bumps again come up pretty fast.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AutoModerator",
        "body": "**Please read fully, /u/shadow000027**: **If your post doesn't appear live immediately**: Reddit's sitewide settings, filters and algorithms may flag certain posts for manual moderation. **This has nothing to do with this sub's settings. We have no control over this.** If this happens to your post, wait patiently till we manually resolve the issue. If your post is not attended to after 24 hours, you can modmail us then.\n\n#Rule Violations + Ban Policy: \n[This sub is currently experimenting with user curated moderation](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Your fellow members are enforcing Posting Rules 4,5,7,8. Reported posts will be removed and will not be manually re-approved.\n\n**Ensure you're adhering to [all other sub rules](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Violations will result in a ban. Using this sub for medical advice (Rule 9 and 10) will result in a ban.**\n\n#**Spoiler policy**: Automod automatically spoilers all images. You may remove this ONLY IF you are posting non-human pictures (eg. Products, shelfies,) \n\n**Do not remove spoilers if your image shows any part of a human (skin, hair, etc).** Even for Progress Pics, Before/After and Journey posts. Not all members consent to viewing images/close up images of strangers. \n\n*Removing the spoiler in an attempt to get more views for your post, will result in a permanent ban. Be considerate.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Majestic_Avocado_735",
        "body": "thank you for detailed reply 😺",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Jolly_Rancher25",
        "body": "Double cleanse when you use silicone based spf . It makes a huge difference",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Majestic_Avocado_735",
        "body": "How to double cleanes ?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "shadow000027",
        "body": "In the morning I first cleanser my face then use aqualogica 5 ceramides  moisturizer that's it and sunscreen if I am going out, at night also the same.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "Hi there! Tretinoin is Schedule H drug in India and must be used with doctor's prescription only. Side Effects may include but not be limited to Dry skin, Peeling, Skin redness, Burning, Itching, Stinging sensation. Tretinoin is a Category C drug and IS CONSIDERED UNSAFE DURING PREGNANCY. Lactating or breastfeeding women will have to consult their doctors.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "shadow000027",
        "body": "To make sure that I am not being impatient I am gonna use this till the bottle ends then I am gonna see a dermat.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "#Warnings and Reminders\n\n**To /u/shadow000027**\n\n# Posting Rules + Ban Policy: \n[Posting rules 4, 5, 7 and 8 are currently being enforced by members, not mods](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Please report posts if you feel a need. \n\n**All other sub rules are in effect. Refer sidebar, or [view in full here](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Please report rulebreaking comments. Offenders will be banned.**\n\n\n**To the Members**\n\n#Rx/medical advice policy is STRICTLY ENFORCED:\nYour peers will interpret your comments as expert recommendations. \n\nTherefore, ALL comments mentioning Rx products, giving opinions on a doctor's treatment plan, speculating visual diagnoses from photos, or any other borderline medical scope  **MUST INCLUDE EXPLICIT DISCLAIMERS.  If in doubt, include disclaimer. If sharing anecdotal experience, include disclaimers.** \n\n**ERR ON THE SIDE OF CAUTION. BE MINDFUL OF THE SAFETY AND WELLBEING OF YOUR PEERS. BANS WILL BE ENFORCED FOR RECKLESS/POOR ADVICE.**\n\n#Spoilers:\nAll image posts are automatically spoilered, out of consideration for fellow members. If spoiler is removed, use the trigger phrase \"!spoilerthis \" to respoiler the post yourself. \n\nReport posts with images unspoiled that show any part of a human (skin, hair, etc). \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 11,
      "nested_replies": 9
    }
  },
  {
    "subreddit": "BoycottIsrael",
    "post_id": "1lirm9i",
    "title": "Salicylic acid shampoo",
    "url": "https://www.reddit.com/r/BoycottIsrael/comments/1lirm9i/salicylic_acid_shampoo/",
    "score": 7,
    "num_comments": 0,
    "created": "2025-06-23T20:33:37+00:00",
    "body": "Wondering if anyone can recommend a shampoo that has salicylic acid in it. (Or a brand that I can buy salicylic acid from to add to a shampoo). I have thin straight oily hair and dry ends!\nThanks (:",
    "comments": [],
    "comment_breakdown": {
      "total_collected": 0,
      "top_level": 0,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "adultsnew",
    "post_id": "1ldoa74",
    "title": "are yall team salicylic acid or team benzyl perxodie",
    "url": "https://www.reddit.com/r/adultsnew/comments/1ldoa74/are_yall_team_salicylic_acid_or_team_benzyl/",
    "score": 7,
    "num_comments": 1,
    "created": "2025-06-17T14:16:17+00:00",
    "body": "",
    "comments": [
      {
        "author": "hdhgsgsfafshshsnn",
        "body": "salicylic",
        "score": 2,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "IndianBeautyDeals",
    "post_id": "1lrcxen",
    "title": "Ordinary salicylic acid serum for 384 rupees",
    "url": "https://www.reddit.com/r/IndianBeautyDeals/comments/1lrcxen/ordinary_salicylic_acid_serum_for_384_rupees/",
    "score": 7,
    "num_comments": 26,
    "created": "2025-07-04T07:43:20+00:00",
    "body": "As the title suggests (on tira). Also, is this a good deal??? ",
    "comments": [
      {
        "author": "Ok_Reflection_8072",
        "body": "Go to paytm and search for \"cashback and offers\" .Scroll down and look for tira beauty .Buy the coupon for 10 points. You should have enough points to purchase a coupon .You can only purchase 3 coupon so don't share with anyone.\nUse them to buy ordinary or plum products in this sale.\nYou are getting ordinary serums for half the price .You will not get any better deals.",
        "score": 7,
        "is_top_level": false
      },
      {
        "author": "tarzenstolemytiara",
        "body": "Tira coupon from paytm (30% on 1000)",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "Ok_Reflection_8072",
        "body": "If you order 3 salicylic serum you should be able to get them for ₹918 .Which means each serum will cost you ₹306.\nHow you getting for ₹384 ?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Such-Case-3603",
        "body": "Thanks",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "tarzenstolemytiara",
        "body": "Somebody has replied very nicely to one of the comments in this post. Please check that.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "throawayNo-Soft4795",
        "body": "How did you avail it? I have paytm but don't know where to get the coupon",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "tarzenstolemytiara",
        "body": "I used all :((",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "TheMinimalist4933",
        "body": "You can buy one for 1 rupee on Paytm",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "TheMinimalist4933",
        "body": "No need for an active wallet. If you have app, then you can buy from cashback and offers",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "tarzenstolemytiara",
        "body": "This is the first time I've ordered anything from ordinary. Have heard good reviews though",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Such-Case-3603",
        "body": "How ?? What coupon did you use ?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "dontreadmynamee",
        "body": "hey how will i get my paytm coupon?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "TheMinimalist4933",
        "body": "You need to have an account. You can set up your account and buy the coupon. As someone stated in the above comments you can buy max of 3 coupons.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "aryan_nukala",
        "body": "Bro i bought the coupon but it's not working",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Rude-Opportunity4599",
        "body": "what coupon u used?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "tarzenstolemytiara",
        "body": "Tira coupon from paytm (30% on 1000)",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "throawayNo-Soft4795",
        "body": "Tysm",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "glitz235",
        "body": "Hey! Thanks for the guidance.. did the same but it shows items already at best price!! So I’m only getting 10% of now",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "unknowncheckin",
        "body": "Can you DM paytm tira coupon if you have one?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "unknowncheckin",
        "body": "I don’t use Paytm wallet.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 20,
      "top_level": 4,
      "nested_replies": 16
    }
  },
  {
    "subreddit": "skincareaddictsindia",
    "post_id": "1lbt29f",
    "title": "Salicylic acid face wash mini reviews",
    "url": "https://www.reddit.com/r/skincareaddictsindia/comments/1lbt29f/salicylic_acid_face_wash_mini_reviews/",
    "score": 5,
    "num_comments": 3,
    "created": "2025-06-15T05:50:31+00:00",
    "body": "I have combination acne prone skin with no acne. My first ever SA based face wash was Cipla Saslic one which I picked up during COVID second wave. I bought it from Apollo pharmacy and the girl there suggested me to use 1% face wash (orange pack) before getting the 2% face wash (blue pack). My expected were set high after using Saslic face wash so I tried using the popular brands on Instagram only to be disappointed 😞. I don't use SA based face washes daily, I may use them alternative days.\n\n**Cipla Saslic Foaming Face Wash** - Love it, HG. Will Repurchase. Experience: I like the brightening effect this face wash gives while gently exfoliating the skin. It contains 1% salicylic acid which noticeably reduces whiteheads too. I have used this face wash for a long period of time and never noticed any tightness, drying or flaking of my skin. While using this face wash I didn't experience a single acne. The efficacy, affordable price of Cipla Saslic Face Wash is worth it! You just have to apply the foam directly onto the skin and wait, no rubbing or working of foam is needed.\n\n**Plum Salicylic Acid Foaming Face Wash** - Love it, HG. Will Repurchase. Experience: I like the extra exfoliating effect of this face wash. It noticeably reduces whiteheads with regular use of alternative days when you don't use any other actives sans heavy creams. The only thing that bother is fragrance, very annoying and lingering fragrance. Apart from that I like this face wash. Oh yes, quantity is too much! You just have to apply the foam directly onto the skin and wait, no rubbing or working of foam is needed.\n\n**Deconstruct Salicylic Acid Face Wash** - Good enough but Will Not Repurchase. Experience: this face wash has 0.5% SA and that's why it is mild enough to be used daily I feel. I sometimes used it as a second cleanser in double cleansing and didn't experience any dryness or zits. This doesn't tame away any acne so I might just skip this one.\n\n**Derma Co AHA BHA foaming cleanser** - Okayish but WNRP. Experience: I didn't find any noticeable difference in my acne while using this face wash other than the fact that whenever I used it alternate days I got small zits at random places on my skin. You just have to apply the foam directly onto the skin and wait, no rubbing or working of foam is needed. I used this as a body wash more than a face wash. I wasn't too regular with this one 🤣 I don't know why. The excitement of using a new face wash wasn't there when I bought this.\n\n**Dr Sheth’s Neem & Salicylic Acid Face Wash** - Fail. WNRP. Experience: I ended up getting small zit at random places whenever I tried this face wash. The brand claims this one to be suitable for sensitive skin, bit don't get by it. It was too stripping for my combination skin and I tried many ways to make it work with normal water, soft water, lukewarm water but nothing works. To my surprise this works good on back acne and I ended up using it as a body wash.\n\n**Dot and Key Cica & Green Tea Face Wash With Salicylic** - Fail. WNRP. Experience: It doesn’t cleanse the skin as one would expect a SA based face wash. The skin doesn't feel squeaky clean after using this one and I ended up using extra quantity for each use. With regular use, I didn't find any noticeable difference in my whiteheads as well as I noticed with Plum and Saslic one.\n\nHow was your experience with SA based face wash?",
    "comments": [
      {
        "author": "bumchickawaowao",
        "body": "Saslic Ds was my HG when I had overly oily acne prone skin, Im thinking of getting it again",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "skinamide",
        "body": "It's my all time favourite.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": ">Namaste!\n\nWelcome to r/skincareaddictsindia! Thanks for your submission. We hope you get the best skincare advice, tailored to your needs. This is an actively moderated subreddit, so make sure that you follow the Reddit Content Policy (RCP) and the subreddit guidelines.\n\n**Contact us (modmail) to improve this subreddit and/or our wiki!** Thank you in advance!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/skincareaddictsindia) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 2,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1lfwh7k",
    "title": "been using fluorouracil 2% + salicylic acid 17% + bandaid for 7ish days",
    "url": "https://www.reddit.com/r/Warts/comments/1lfwh7k/been_using_fluorouracil_2_salicylic_acid_17/",
    "score": 6,
    "num_comments": 1,
    "created": "2025-06-20T05:55:42+00:00",
    "body": "it is in such a horrid spot right where my finger bends! it hurts :( \n\nshould i stop treatment for a few days or keep on truckin? ",
    "comments": [
      {
        "author": "maggiegreene-",
        "body": "do i need to debride this???",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 1,
      "top_level": 1,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "AusSkincare",
    "post_id": "1lrbxz2",
    "title": "Favourite BHA/salicylic acid product/s?",
    "url": "https://www.reddit.com/r/AusSkincare/comments/1lrbxz2/favourite_bhasalicylic_acid_products/",
    "score": 7,
    "num_comments": 3,
    "created": "2025-07-04T06:38:38+00:00",
    "body": "I use Paula's Choice CALM\n1% BHA Sensitive Skin Exfoliant, as it's gentle enough for my sensitive skin but still keeps my blemishes at bay. Full price it's $49, though they often have 20% off specials. I've never found anything else less expensive that's effective but gentle. Do people have other BHA/salicylic acid favourites? ",
    "comments": [
      {
        "author": "slowermineral",
        "body": "I use Clear Skincare's 2% Salicylic Acid. It's often 20% off at Priceline. I can't say whether it's good for sensitive skin, but it has no fragrance if that matters to you. For reference, I've used a range of super cheap to super expensive BHAs (Essence, Revolution Beauty, The Ordinary, Skin Physics, Paula's Choice, Medik8). The cheaper the product, the more likely it tends to contain fragrance. I like that the Clear Skincare is effective without any added fragrance.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "LadyLevrette",
        "body": "I really like the MooGoo one, it’s like a powder that you mix with a bit of water and massage into your face. Very gentle and leaves my skin feeling smooth and nice :)",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "rmhc123",
        "body": "K beauty products! \nI love this one https://lilabeauty.com.au/products/cosrx-salicylic-acid-daily-gentle-cleanser-150ml?srsltid=AfmBOorsPBAk-i3SdBWElq4icUCGWUD8CVlKcISoAK6eM89gv6WeQpHz",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "30PlusSkinCare",
    "post_id": "1lclbk1",
    "title": "Starting Tret- what to do with Salicylic Acid?",
    "url": "https://www.reddit.com/r/30PlusSkinCare/comments/1lclbk1/starting_tret_what_to_do_with_salicylic_acid/",
    "score": 6,
    "num_comments": 8,
    "created": "2025-06-16T05:59:40+00:00",
    "body": "Current routine-\n\nMorning\n\nGentle cleanser or rinse with water\n\nCurel Deep Moisture Spray\n\nCerave Moisturiser \n\nGarnier Hydrating Fluid SPF50\n\n\nEvening\n\nThe Ordinary Squalene Cleanser\n\nV55 Max Salicylic Acid Soap \n\nCurel Deep Moisture Spray\n\nCerave Moisturiser (on no Retinol nights)\n\n\n\nOn alternate nights after the deep moisture spray I use:\n\nByoma Hydrating Toner\n\nInkey List Retinol Serum\n\nAvenue Cicalfate +\n\n\n\nI’m relatively happy with my routine, but my skin could be better so I’m starting Tret 0.025% which will increase to 0.05%. \n\nI had absolutely no irritation when starting the Inkey List Retinol Serum but I understand prescription strength is a whole different ball game. \n\nI’ve been seeing conflicting things online whether to continue using it, or only use it on the nights I don’t use retinol, or only use it in the morning. \n\nThe thing is, I’m very attached to my V55 soap. I had bad acne until my late 20s, I wouldn’t leave the house without make up on, and as soon as I started using this 5+ years ago it completely cleared up and hasn’t returned. I tried to stop using it in favour of something more gentle a couple of months ago and got a few spots so quickly started using it again. \n\nAny advice?",
    "comments": [
      {
        "author": "ryhaltswhiskey",
        "body": "?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "akdakd1102",
        "body": "Honestly, dial it back for the first several weeks. Maybe 1-2 times a week in the morning. I’ve used retinoids for 7 years (Tret, then Taz) and the thing is they change your skin. It’s hard to ascertain in the first weeks what your skin is going to be like/react to after the change. I stopped all actives on Tret for a while, and now can’t use any at all with Taz. While on a low % of Tret, I did have a salicylic face wash I used a few times a week, but that was only after my skin retinized and settled. As with any retinoid, it can possibly get worse for a bit before it gets better.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "HoldOriginal3112",
        "body": "I've not started tret yet, but I've eased into higher strength retinal (medik8 1 and medik8 3). My skin has struggled with upgrading to retinal. \n\nIf you are going to use tret, I would consider starting twice a week at first and monitoring your skin for a couple of weeks before increasing the frequency. Could you use the salicylic acid on days you aren't using it?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Ill_Drummer_1569",
        "body": "My plan is to do a small patch test and see how I react and then start once/twice a week. \n\nBut I totally blanked on the fact that I’ll be using it less regularly to start with so I can hang on to my soap for a little while longer!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "SpinXO700",
        "body": "⚠️ Marketing",
        "score": -1,
        "is_top_level": false
      },
      {
        "author": "SpinXO700",
        "body": "Commenter has now edited the post but it's one of those designed to drop in the name of the vendor, usually highstreetpharma or skinorac. This one was astroturfing for highstreetpharma. Creepy way to handle marketing.",
        "score": -6,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 2,
      "nested_replies": 4
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "1lqj5kk",
    "title": "Minimalist salicylic acid face wash good for tan reducing?",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1lqj5kk/minimalist_salicylic_acid_face_wash_good_for_tan/",
    "score": 6,
    "num_comments": 12,
    "created": "2025-07-03T07:08:37+00:00",
    "body": "Is the Minimalist salicylic acid face wash good for tan reducing? This was the recommendation from ChatGPT for tan-reducing face wash. \n\n\n\nI consulted a dermatologist near me for a solution for a skin issue on my feet, and after seeing my tan, he just gave a sunscreen from his clinic itself. But some of my friends suggested using a detanning face wash with the sunscreen for faster detanning. Then I asked ChatGPT for a suggestion, and it gave me this. But while I was reading the product description, it mainly promotes acne and oil control and not for tan reduction. So is it good to use this for me?",
    "comments": [
      {
        "author": "learning_barn",
        "body": "It is not for tan ... actually no facewash is specially for targeting tans...there are exfoliaters toners which target the tan like glycolic acid ...\n\nSalicylic is mainly for acnes",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "bluewinters199",
        "body": "Advice for tanning is usually applying aloe vera gels or cream - they will naturally fade after some time usually, if not can wait for a bit then try glycolic acid",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "desihappilyunmrried",
        "body": "[re posting here what I have in another threads where in people are looking to solve acne scars, dark spots, tanning and hyperpigmentation... basically wanting their natural skin tone back... hopefully you find this helpful]\n\nHey hi....let me tell you what has worked for me...I am 35M...had acne scars on my cheeks...had tanning on my forehead...and pigmentation on my jawline... initially I never got bothered about these issues...but lately since my wife kept pestering to take care of these things so that at least my skin becomes naturally tone... I thought that that is not possible....but I started reading up the science and biology behind acne scars, skin inflammation leading to dark spots, tanning, and hyperpigmentation...root causes and how can this be handled...here are my learnings (readings from about last 8 months...and thereafter using products in a disciplined manner from last 3 months ---> progress is very satisfying...hence now I wanna help ppl)\n\nTwo things I Iearnt:\n(1) No single product can help you get rid of acne scars/tanning/dark spots/ hyperpigmentation. Sad but true because that's how natural skin biology functions. You will have to use different products for different biological functions to cure the scars.\n\n(2) Say you start using all relevant products for those targeted biological functions --> result will NOT come in 7/15/30/50 days..why because natural skin biology takes time to heal even when you use the products. Using products accelerates the process (specially when you are above 30 years old).\n\nSo you need right products for right function and you need discipline of usage.\n\nWhat I use:\n(1) You need to remove the dead skin (that has the scar)on the surface (called exfoliation)...everyone knows that...but for effective removal you need atleast 8% glycolic acid serum. And then use cermaide moisturizer to keep the skin barrier intact. I do this every Tuesday and Sunday nights.\n\nThis step also clears the pathway for effective penetration of other actives that help get rid of scars. Without effect penetration to the right layer of the skin --> product will NOT work.\n\n(2) One you remove the dead skin, you need to bring fresh skin from the lowest part of the skin to the surface...imagine replacing the old scarred skin with freshly baked new skin tht has your natural tone.\n\nThis renewal (called cell turnover) happens naturally..but the process slows down as you age due to various factors.  You use products that can penetrate to the lowest part of skin and safely accelerate this renewal process.\n\nSo for this I use 0.5% retinol serum (and then again ceramide moisturizer to keep the skin barrier intact). This I do every Monday and Thursday nights.\n\n(3) Now that you have taken care of the removal and renewal, you gotta control the new excess melanin production (those dark spots/scars are nothing but melanin deposits)...there are multiple biological pathways to control this excess production. \n\nI use 3% tranexamic acid serum then apply 10% azelaic acid suspension and then again my good cermaide moisturizer. I do this every Wednesday and Friday nights.\n\n(4) Saturday nights I just use my ceramide moisturizer.\n\n(5) VERY VERY VERY IMPORTANT: using above night routines makes your skin sensitive and hence you gotta protect it from the sun. If you fail at this step - you will activate fresh darkening. Hence, I use sunscreen - a good one - every day. Reapply 2/3 times in the day.\n\nPlz remember if you don't do this....you will see issue becoming a lot worse.\n\nSo i have been following above day and night routine daily...meaning daily...and let me tell you...my skin has become super soft, pores have become minimal...and I now see that my scars are slowly fading and natural skin tone is coming...\n\nI would request people here to critique my learning and find gaps...so that if there is anything I can improve upon...and I will be super grateful.\n\nTLDR: (1) no single products can help. use right products for the right skin biological function. (2) Follow the routine strictly (3) use sunscreen daily.\n\nHope this helps people here.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Typical-Store-170",
        "body": "This is a really well structured reply ! Altho idk if i can follow this as im still a teen😅but this was really helpful in understanding the whole process, thank u!",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "desihappilyunmrried",
        "body": "Adapalene - a retinoid - is DIFFERENT FROM retinol - in the way it adds value. Adapalene (retinoid) is useful when you are dealing with pimple issues specially in age group between 16-23 years old.\n\nFor solving dark spots, tanning, hyperpigmentation - specially after 30 years age - you gotta choose retinol.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "**Please read fully, /u/OwnVariation3103**: **If your post doesn't appear live immediately**: Reddit's sitewide settings, filters and algorithms may flag certain posts for manual moderation. **This has nothing to do with this sub's settings. We have no control over this.** If this happens to your post, wait patiently till we manually resolve the issue. If your post is not attended to after 24 hours, you can modmail us then.\n\n#Rule Violations + Ban Policy: \n[This sub is currently experimenting with user curated moderation](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Your fellow members are enforcing Posting Rules 4,5,7,8. Reported posts will be removed and will not be manually re-approved.\n\n**Ensure you're adhering to [all other sub rules](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Violations will result in a ban. Using this sub for medical advice (Rule 9 and 10) will result in a ban.**\n\n#**Spoiler policy**: Automod automatically spoilers all images. You may remove this ONLY IF you are posting non-human pictures (eg. Products, shelfies,) \n\n**Do not remove spoilers if your image shows any part of a human (skin, hair, etc).** Even for Progress Pics, Before/After and Journey posts. Not all members consent to viewing images/close up images of strangers. \n\n*Removing the spoiler in an attempt to get more views for your post, will result in a permanent ban. Be considerate.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "desihappilyunmrried",
        "body": "if you are someone who is under 25 years old, you don't need retinol in your routine. Because at your age, your cell renewal rate is appropriate via the natural biology process.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Typical-Store-170",
        "body": "I see...but adapalene counts as retinoid right. I was prescribed that 😶‍🌫️",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Typical-Store-170",
        "body": "Ohh oki tysm",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "#Warnings and Reminders\n\n**To /u/OwnVariation3103**\n\n# Posting Rules + Ban Policy: \n[Posting rules 4, 5, 7 and 8 are currently being enforced by members, not mods](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Please report posts if you feel a need. \n\n**All other sub rules are in effect. Refer sidebar, or [view in full here](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Please report rulebreaking comments. Offenders will be banned.**\n\n\n**To the Members**\n\n#Rx/medical advice policy is STRICTLY ENFORCED:\nYour peers will interpret your comments as expert recommendations. \n\nTherefore, ALL comments mentioning Rx products, giving opinions on a doctor's treatment plan, speculating visual diagnoses from photos, or any other borderline medical scope  **MUST INCLUDE EXPLICIT DISCLAIMERS.  If in doubt, include disclaimer. If sharing anecdotal experience, include disclaimers.** \n\n**ERR ON THE SIDE OF CAUTION. BE MINDFUL OF THE SAFETY AND WELLBEING OF YOUR PEERS. BANS WILL BE ENFORCED FOR RECKLESS/POOR ADVICE.**\n\n#Spoilers:\nAll image posts are automatically spoilered, out of consideration for fellow members. If spoiler is removed, use the trigger phrase \"!spoilerthis \" to respoiler the post yourself. \n\nReport posts with images unspoiled that show any part of a human (skin, hair, etc). \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 10,
      "top_level": 5,
      "nested_replies": 5
    }
  },
  {
    "subreddit": "Minoxbeards",
    "post_id": "1lbg8fk",
    "title": "Salicylic Acid Body Wash slows progress? (Using below neck)",
    "url": "https://www.reddit.com/r/Minoxbeards/comments/1lbg8fk/salicylic_acid_body_wash_slows_progress_using/",
    "score": 5,
    "num_comments": 6,
    "created": "2025-06-14T18:59:05+00:00",
    "body": "As per the title, my dermatologist suggested me to use this Cerave salicylic acid wash daily to combat my horrible body acne, plus a glycolic acid spray and this sub’s favorite cerave lotion to finish off. Which worked wonderful!\n\nI started using this wash on month 4 of my minox journey and I’ve seen no improvements in beard count from month 6 to 8 (now). Please note I do not use salicylic acid products on my face at all, and I’m already on tretinoin since month 4 thanks to the same derma.\n\nAny chance salicylic body washes hampers minox response as much as face washes? \n",
    "comments": [
      {
        "author": "who_wait_what",
        "body": "why would it do anything with the hair on your face if you aren't using it there? if you put sunscreen on your toes is your face protected?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "cheeseaddict8100",
        "body": "Wasn’t sure if salicylic acid can get systemic like minox? Biology isn’t my strong suit lol",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "who_wait_what",
        "body": "topical medications are designed to restrict the drugs effects to the local area it is applied to. the small amount that goes systemic is not enough for it to have any significant effect on areas outside where it was applied. this is a truth of any topical medication\n\nthe small amount of minoxidil that goes systemic is not going to cause a significant amount of hair to grow on the rest of your body. the same is true of salicylic acid, the small amount of it that goes systemic is not going to fix acne on other parts of your body. if it's not going to fix the acne on your face it also won't interfere with the minoxidil you put on your face\n\nthe amount of concern regarding systemic absorption from a topical medication on this sub is imo overblown. that's like saying athletes foot fungal cream on the feet will cure the dandruff (which is caused by a fungus) on your scalp, that's just not how topical medications work",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "cheeseaddict8100",
        "body": "I see, thanks for the detailed explanation",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "whizkey7",
        "body": "Youre supposed to apply minox on a clean face, I dont see how this would diminish minox effects even if you use it as a face wash before applying, it is the standard way to use minox.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "HistoricalShower159",
        "body": "Actually I use the CeraVe acne blemish control cleanser with foam and I still see gains. You must be in shedding phase",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 3,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kx4v6x",
    "title": "20 days of treatment with Salicylic Acid. Is it gone?",
    "url": "https://www.reddit.com/r/Warts/comments/1kx4v6x/20_days_of_treatment_with_salicylic_acid_is_it/",
    "score": 4,
    "num_comments": 5,
    "created": "2025-05-28T01:38:14+00:00",
    "body": "Is it gone? Is this healthy skin or is it still there? Should I continue or stop treatment? It hurts when I press directly on it.",
    "comments": [
      {
        "author": "Miserable-State9593",
        "body": "Looks like it might be! Congrats!!!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "AvailableDrop8275",
        "body": "THANK YOU!!!! FINALLY!!",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "hispex",
        "body": "What was your treatment process? Did you see the black dots before? How long did have it?  \nIt seems, I'll have to go through SA process myself. Got a corn-like bump for 3 month, didn't touch it. But now it \"opened\" after a shower, guess it's time to clean and work on it to avoid spreading.",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "AvailableDrop8275",
        "body": "Yes, there was black dot. I started by filing down the thick skin. When it's filed down enough, I put the SA patch (Dr. Scholl plantar wart 40% salicylic acid) on it. The product comes with a tiny SA patch and a bigger cover, but I don't use the cover because it keeps falling off. Rather, I used an XL size bandage and covered my entire toe. \n\nI replaced the bandage every 24 or 48 hours. Every time I take it off, I file the wart down which removed the dead skin. Eventually the black dots started surfacing. Started with one small dot, then many dots. \n\nkept going for 20 days and the last time I filed it, that pink skin exposed. I hope it's gone for good.",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AvailableDrop8275",
        "body": "I had it for years. it hurt slightly but I never really paid attention. I walked funny, which caused me back pain. When I went to the dr. to diagnose my backpain, then I know because of the way I walked caused my back pain, and the fucking wart was the culprit.",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 5,
      "top_level": 2,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "SebDerm",
    "post_id": "1lahujl",
    "title": "salicylic acid seems to work. Gold bond brand",
    "url": "https://www.reddit.com/r/SebDerm/comments/1lahujl/salicylic_acid_seems_to_work_gold_bond_brand/",
    "score": 5,
    "num_comments": 3,
    "created": "2025-06-13T14:48:41+00:00",
    "body": "My dandruff in my scalp was getting worse this past year that I had to use Nizoral on top of regular head and shoulders.  Then my eye brows were getting flaky.  But these past few months my forehead and upper cheeks wer getting really flaky and itchy.  \n\nI used all types of moisturizers, like CeraVe, dove, Neutrogena, Cetaphil.... Nothing worked or my forehead.   I walked down the isle at the store and saw Gold Bond medicated for psoriasis and seborrheic dermatitis.   It has salicylic acid with moisturizer.  That fixed it.  Burns but it's working.  I feel pretty confident now that I don't have to worry about flakes on my face.  ",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "**Hi everyone! SebDerm is a friendly community about seborrheic dermatitis and all related topics.**\n\nLooking for some advice?\n\n* Check the [What works for you? threads](https://www.reddit.com/r/SebDerm/search?q=flair_name%3A%22WWFY%22&restrict_sr=1)\n\nSee something you are not comfortable with or that breaks [our rules](https://www.reddit.com/r/SebDerm/wiki/rule_overview)? Please [report it](https://www.reddit.com/r/SebDerm/wiki/how_to_report)!\n\nEveryone is welcome in [this community](https://www.reddit.com/r/SebDerm/wiki/about); remember to be kind and assume good faith!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/SebDerm) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "S11my",
        "body": "Did it fix redness too?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Norwegian02",
        "body": "Same, but I use salicylic acid 2% from the inkey. What I like about this, is that it washes out nice in the shower. So your hair do not feel greasy.",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 3,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "SkincareAddictionLux",
    "post_id": "1lrs69g",
    "title": "How do I know that if lactic acid and salicylic acid are not for exfoliating  in the product ?",
    "url": "https://www.reddit.com/r/SkincareAddictionLux/comments/1lrs69g/how_do_i_know_that_if_lactic_acid_and_salicylic/",
    "score": 4,
    "num_comments": 6,
    "created": "2025-07-04T20:09:55+00:00",
    "body": "I'm currently using Regiment Lab wave serum and cream mostly for hydrating and barrier care; I want to incorporate Vitamin C and P-Tiox from SC for anti-oxidant and anti-aging; it says that not using with strong acid. however, P-Tiox contains salicylic acid and Regiment Lab contains lactic acid. But SC says you can use Vitamine C and P-Tiox together?",
    "comments": [
      {
        "author": "Silver_Sherbert_2040",
        "body": "You can usually tell by where they are listed in the ingredients. Lactic acid is the last ingredient and is used as a buffering agent in Wave Serum.",
        "score": 8,
        "is_top_level": true
      },
      {
        "author": "Accomplished-Bill-45",
        "body": "can I assume that if an AHB BHB ingredient is not listed in active ingredients, it's concentration low enough to consider as a buffering  etc?  \nfor example, P-Tiox contains salicylic acid (but the active ingredients says PHA); so I guess salicylic acid is used for buffering ?",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "Unfair_Finger5531",
        "body": "I was just reading Chemist’s Corner the other day, and there’s an article on there about what you can’t learn from reading skincare ingredients. One of those things is percentage of ingredients. It is nearly impossible to know how much lactic or salicylic acid is in a product. \n\nThe best you can do is guesstimate by looking at where they are on the ingredients list. If they are near the end, they are probably in smaller amounts. If they are near the top, probably larger amounts. You can also look at the marketing claims to see if they refer to the products as an exfoliant.",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Silver_Sherbert_2040",
        "body": "Most likely. Also check out INCIdecoder or SkinSort to break down the ingredient function.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "Chaptera",
        "body": "You absolutely can use vitamin C and p-tiox together. P-tiox is super gentle!",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Accomplished-Bill-45",
        "body": "I heard it’s like micro needles. Recently recover from the barrier damaged and rashes from Skinceutical HA intensifier :( \n\nFeel very cautious when trying SC products, but already purchased it’s Vimtamin 10 and P-Tiox",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 6,
      "top_level": 3,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "IndianBeautyBazaar",
    "post_id": "1kk205j",
    "title": "Cosrx salicylic acid gentle cleanser new and sealed",
    "url": "https://www.reddit.com/r/IndianBeautyBazaar/comments/1kk205j/cosrx_salicylic_acid_gentle_cleanser_new_and/",
    "score": 5,
    "num_comments": 3,
    "created": "2025-05-11T14:15:05+00:00",
    "body": "Cosrx salicylic acid gentle cleanser\n\nNew and sealed\n\nBest before : 11/26\n\nMrp: 850, selling it for 450+shipping\n\nReason: I used the sample version of it which I got it as a freebie and it's meant for oily to normal skin and I have dry skin so",
    "comments": [
      {
        "author": "AutoModerator",
        "body": "Thank you for your submission to r/IndianBeautyBazaar . Your post is currently under observation and will be manually approved by the Mod Team. Please ensure all the rules have been followed and all images are attached. If your post is removed then check the removal reason applied on your post and make changes as suggested. If you are using alt account mention it in the post and send modmail with your post link and main account username\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianBeautyBazaar) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Shreshth-",
        "body": "Location?",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "anjali2711",
        "body": "Gujarat",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 3,
      "top_level": 2,
      "nested_replies": 1
    }
  },
  {
    "subreddit": "IndianSkincareAddicts",
    "post_id": "1kkm1yo",
    "title": "Is this a normal amount of hair to lose? Im 17, facing receding hairline. Im using Lintar ( coal tar and salicylic acid solution) twice a week, taking follihair everyday and shampooing with trigaine shampoo.",
    "url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1kkm1yo/is_this_a_normal_amount_of_hair_to_lose_im_17/",
    "score": 6,
    "num_comments": 10,
    "created": "2025-05-12T06:51:06+00:00",
    "body": "",
    "comments": [
      {
        "author": "Ritashadev",
        "body": "I am not a Dermatologist. But i don’t think its Normal for a 17 year Old . Please visit your dermatologist also I am not Advising you but can we see people using DERMAROLLER And MINOXIDIL for hair growth . I have seen people Do this and Their hair grows back but with patience.",
        "score": 6,
        "is_top_level": true
      },
      {
        "author": "Heavy_Jury_973",
        "body": "Dermat said I'm kinda young for minoxidil and she said dermaroller isn't that much useful.",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "MansiA706",
        "body": "Is it heredity ?? how about your family? have you checked for fungal infection?",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Heavy_Jury_973",
        "body": "Yeah it's in my genetics. My dad is on stage 4 male baldness, his hairline almost touches the top bald area, but my grandfather has lots of hair left. No fungal function or anything",
        "score": 2,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "**Please read fully, /u/Heavy_Jury_973**: **If your post doesn't appear live immediately**: Reddit's sitewide settings, filters and algorithms may flag certain posts for manual moderation. **This has nothing to do with this sub's settings. We have no control over this.** If this happens to your post, wait patiently till we manually resolve the issue. If your post is not attended to after 24 hours, you can modmail us then.\n\n#Rule Violations + Ban Policy: \n[This sub is currently experimenting with user curated moderation](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Your fellow members are enforcing Posting Rules 4,5,7,8. Reported posts will be removed and will not be manually re-approved.\n\n**Ensure you're adhering to [all other sub rules](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Violations will result in a ban. Using this sub for medical advice (Rule 9 and 10) will result in a ban.**\n\n#**Spoiler policy**: Automod automatically spoilers all images. You may remove this ONLY IF you are posting non-human pictures (eg. Products, shelfies,) \n\n**Do not remove spoilers if your image shows any part of a human (skin, hair, etc).** Even for Progress Pics, Before/After and Journey posts. Not all members consent to viewing images/close up images of strangers. \n\n*Removing the spoiler in an attempt to get more views for your post, will result in a permanent ban. Be considerate.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "DedlySnek",
        "body": "You need a new derm bro",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "AutoModerator",
        "body": "#Warnings and Reminders\n\n**To /u/Heavy_Jury_973**\n\n# Posting Rules + Ban Policy: \n[Posting rules 4, 5, 7 and 8 are currently being enforced by members, not mods](https://www.reddit.com/r/IndianSkincareAddicts/comments/1e5km1h/manual_moderation_is_suspended_your_feed_is/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button). Please report posts if you feel a need. \n\n**All other sub rules are in effect. Refer sidebar, or [view in full here](https://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=sharehttps://reddit.com/r/IndianSkincareAddicts/w/index/subredditrules?utm_medium=android_app&utm_source=share). Please report rulebreaking comments. Offenders will be banned.**\n\n\n**To the Members**\n\n#Rx/medical advice policy is STRICTLY ENFORCED:\nYour peers will interpret your comments as expert recommendations. \n\nTherefore, ALL comments mentioning Rx products, giving opinions on a doctor's treatment plan, speculating visual diagnoses from photos, or any other borderline medical scope  **MUST INCLUDE EXPLICIT DISCLAIMERS.  If in doubt, include disclaimer. If sharing anecdotal experience, include disclaimers.** \n\n**ERR ON THE SIDE OF CAUTION. BE MINDFUL OF THE SAFETY AND WELLBEING OF YOUR PEERS. BANS WILL BE ENFORCED FOR RECKLESS/POOR ADVICE.**\n\n#Spoilers:\nAll image posts are automatically spoilered, out of consideration for fellow members. If spoiler is removed, use the trigger phrase \"!spoilerthis \" to respoiler the post yourself. \n\nReport posts with images unspoiled that show any part of a human (skin, hair, etc). \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/IndianSkincareAddicts) if you have any questions or concerns.*",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 7,
      "top_level": 4,
      "nested_replies": 3
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1kv0k50",
    "title": "Removing dead skin after applying salicylic acid",
    "url": "https://www.reddit.com/r/Warts/comments/1kv0k50/removing_dead_skin_after_applying_salicylic_acid/",
    "score": 5,
    "num_comments": 2,
    "created": "2025-05-25T11:42:44+00:00",
    "body": "i applied SA for 1 week until today i tried to remove the white skin (which hurts me ig) after i removed the skin couples of black dots in it wjat should i do next ? Kept applying salicylic or remove the black dots (it hurts ngl)",
    "comments": [
      {
        "author": "Admirable_Gas_863",
        "body": "Same boat I reckon it's the dead wart root, I'm talking zinc and vitamin D13 and mixing betadine and tea tree oil/willow wart gel. Before and after work when I sleep. The black dots have lessened",
        "score": 1,
        "is_top_level": true
      },
      {
        "author": "Frankie47-47",
        "body": "Cover it up for now resume tmw",
        "score": 1,
        "is_top_level": true
      }
    ],
    "comment_breakdown": {
      "total_collected": 2,
      "top_level": 2,
      "nested_replies": 0
    }
  },
  {
    "subreddit": "Warts",
    "post_id": "1lkpqae",
    "title": "Is it done? I put salicylic acid and it’s very painful.",
    "url": "https://www.reddit.com/r/Warts/comments/1lkpqae/is_it_done_i_put_salicylic_acid_and_its_very/",
    "score": 5,
    "num_comments": 8,
    "created": "2025-06-26T03:20:44+00:00",
    "body": "After debriding, it was too tender so I let it heal for 12 hours and put salicylic acid. Now it’s very painful. I didn’t see signs of wart but scared of it coming back. Is the wart gone??? Should I stop?",
    "comments": [
      {
        "author": "dworkin18",
        "body": "This looks incredibly promising. Now you need to let it heal! Time will tell.",
        "score": 14,
        "is_top_level": true
      },
      {
        "author": "SomedayTodayMe",
        "body": "I cannot and that's why I wrote that let it heal for now.",
        "score": 4,
        "is_top_level": false
      },
      {
        "author": "Pure-Piano-7290",
        "body": "I already put salicylic acid in it. Super painful. Been at it for almost 2 months. I just can’t tell if there is any wart anymore.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "SomedayTodayMe",
        "body": "Stop. Let it heal for now!",
        "score": 3,
        "is_top_level": true
      },
      {
        "author": "Pure-Piano-7290",
        "body": "Thanks I will let it heal after debriding the current treatment.",
        "score": 3,
        "is_top_level": false
      },
      {
        "author": "kawnii",
        "body": "Looks gone to me.",
        "score": 2,
        "is_top_level": true
      },
      {
        "author": "Pure-Piano-7290",
        "body": "Too late. Already put the salicylic acid . It very painful. I can’t see any wart anymore. Can you see a wart?",
        "score": 1,
        "is_top_level": false
      },
      {
        "author": "Pure-Piano-7290",
        "body": "Thanks. Will stop and let it heal after debriding t",
        "score": 1,
        "is_top_level": false
      }
    ],
    "comment_breakdown": {
      "total_collected": 8,
      "top_level": 3,
      "nested_replies": 5
    }
  }
]