{
  "ingredient": "Cetrimonium Chloride",
  "search_results": [
    {
      "identifier": "5527",
      "inci_name": "CETRIMONIUM CHLORIDE"
    }
  ],
  "detailed_info": [
    {
      "id": 5527,
      "inci_name": "CETRIMONIUM CHLORIDE",
      "name": "Cetrimonium Chloride",
      "description": "Cetrimonium chloride is a quaternary ammonium used in cosmetics for its antistatic properties. As it is a cationic surfactant, it disperses water and oil, and thus promote soft and pleasant consistencies. This ingredient is often used in hair care instead and sometimes with silicones. It can also be used as a preservative.\r\n\r\n In 2010, in a report of opinions, the Scientific Committee for Consumer Safety (CSSC) concluded that \"In addition to the fact that quaternary ammonium derivative formulations have an irritating potential, especially when combinations of the compounds concerned The SCCS states that the use of CETRIMONIUM CHLORIDE, STEARTRIMONIUM CHLORIDE and BEHENTRIMONIUM CHLORIDE does not pose a risk to consumer health \"when used within the regulated concentration limits (see below).",
      "regulation": "The restrictions are dependent on the use of the ingredient in:\r\na) Rinsing products for hair and facial hair\r\nb) Non-rinsing products for hair and facial hair\r\nc) Products without rinsing for the face\r\n\r\nThe maximum permitted concentrations are:\r\n(a) 2.5% for individual concentrations or the sum of the individual concentrations of cetrimonium chloride and steartrimonium chloride.\r\n(b) 1.0% for individual concentrations or the sum of the individual concentrations of cetrimonium chloride and steartrimonium chloride.\r\n(c) 0.5% for individual concentrations or the sum of the individual concentrations of cetrimonium chloride and steartrimonium chloride.\r\n\r\nFor purposes other than inhibiting the development of microorganisms in the product. This purpose must be apparent from the presentation of the product",
      "reference": "SCCS - OPINION ON ALKYL (C16, C18, C22) TRIMETHYLAMMONIUM CHLORIDE For other uses than as a preservative - (2010) http://ec.europa.eu/health/scientific_committees/consumer_safety/docs/sccs_o_012.pdf",
      "cheminical_iupac_name": "",
      "cas": "112-02-7",
      "einecs_elincs": "203-928-6",
      "cosmetic_restriction": "V/44",
      "percentage": 4.89,
      "category_percentage": [
        {
          "category_name": "Hair conditioner",
          "percentage": "42.44",
          "count": 4673
        },
        {
          "category_name": "Hair mask",
          "percentage": "47.25",
          "count": 3286
        },
        {
          "category_name": "Hair colouring",
          "percentage": "30.86",
          "count": 2228
        },
        {
          "category_name": "Specific hair care",
          "percentage": "25.53",
          "count": 1612
        },
        {
          "category_name": "Classic shampoo",
          "percentage": "5.23",
          "count": 1221
        }
      ],
      "score": 5,
      "origin": [
        {
          "name": "Synthetic"
        }
      ],
      "families": [
        {
          "id": 7,
          "name": "Quaternary ammonium cation",
          "score": 5
        },
        {
          "id": 17,
          "name": "Regulated",
          "score": 2
        },
        {
          "id": 35,
          "name": "Preservative",
          "score": 0
        },
        {
          "id": 38,
          "name": "Cationic surfactant",
          "score": 0
        }
      ],
      "functions": [
        {
          "name": "Antimicrobial",
          "description": "Helps slowing the growth of micro-organisms on the skin and counteracts the development of microbes"
        },
        {
          "name": "Antistatic",
          "description": "Reduces static electricity by neutralizing electrical charge on a surface"
        },
        {
          "name": "Emulsifying",
          "description": "Promotes the formation of intimate mixtures between immiscible liquids by modifying the interfacial tension (water and oil)"
        },
        {
          "name": "Preservative",
          "description": "Inhibits the development of microorganisms in cosmetic products."
        }
      ],
      "dangers": [
        {
          "value": 5,
          "label": "\"Medium penalty\" in all categories."
        }
      ]
    }
  ]
}