{
  "ingredient": "Tetrasodium EDTA",
  "search_results": [
    {
      "identifier": "16962",
      "inci_name": "TETRASODIUM EDTA"
    }
  ],
  "detailed_info": [
    {
      "id": 16962,
      "inci_name": "TETRASODIUM EDTA",
      "name": "Tetrasodium EDTA",
      "description": "EDTA (EDTA and its main salts used in Disodium EDTA cosmetics, Tetrasodium EDTA, Trisodium EDTA) is a chelating agent that has been used since the 1930s and for which industrialists have complete control of processing and use. Its main property is to complex heavy metals. That is to say, it will somehow neutralize them by forming with them a complex, then serve them as carriers and evacuate them. It is therefore quite logically used in medicine to fight against heavy metal poisoning (lead for example).\r\nIt is often used as a sequestrant (calcium, limestone ...) in soaps or shower gels, this allows to manage the \"hard\" water.\r\n\r\nThe ingredient does not pose a problem for human health but its impact on the environment is disastrous: it is not biodegradable and is extremely harmful to nature. The sewage treatment plants do not hold him back and let him run into our rivers! Charcoal filters in our drinking water are not more effective at stopping it (so we are re-treating EDTA / Iron complexes). The problem is finally that he carries with him heavy metals, whose final destination is unknown.\r\n\r\nEDTA and its salts are banned in organic.",
      "regulation": "",
      "reference": "",
      "cheminical_iupac_name": "",
      "cas": "64-02-8",
      "einecs_elincs": "200-573-9",
      "cosmetic_restriction": "",
      "percentage": 6.4,
      "category_percentage": [
        {
          "category_name": "Classic shampoo",
          "percentage": "14",
          "count": 3268
        },
        {
          "category_name": "Shower gel",
          "percentage": "14.27",
          "count": 2549
        },
        {
          "category_name": "Hair colouring",
          "percentage": "35.14",
          "count": 2537
        },
        {
          "category_name": "Solid soap",
          "percentage": "27.65",
          "count": 2384
        },
        {
          "category_name": "Liquid soap",
          "percentage": "19.37",
          "count": 1139
        }
      ],
      "score": 5,
      "origin": [
        {
          "name": "Synthetic"
        }
      ],
      "families": [
        {
          "id": 5,
          "name": "EDTA",
          "score": 5
        }
      ],
      "functions": [
        {
          "name": "Chelating",
          "description": "Reacts and forms complexes with metal ions that could affect the stability and / or appearance of cosmetic products"
        }
      ],
      "dangers": [
        {
          "value": 5,
          "label": "\"Medium penalty\" in all categories."
        }
      ]
    }
  ]
}